var denver_events = [{"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Angel Chantel ", "ArtistImage": "https://photos.bandsintown.com/thumb/11283730.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "11:00 AM", "Venue": "RockyGrass Band Competition ", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "15200 W. 6th Ave Frontage Rd., Golden, CO 80401", "Artist": "Impostores de nuevo leon ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7217606, -105.1705332], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Jefferson County Fairgrounds", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "Bark Ranch, CO", "Artist": "Abigail Washburn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8282477.jpeg", "Coordinates": [40.1175, -105.43889], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie, World & Chamber Music., Blues, Folk, Pop", "Time": "12:00 PM", "Venue": "Béla Fleck & Abigail Washburn @ Rockygrass Festival", "moreBioInfo": "\"A daring, definite talent, whose feel for the folk idiom results in moving material. Soulful is the word\"-- Wall Street Journal \"Washburn stomped and skipped through fiery Appalachian takes on the local songs of Sichuan. Her bilingualism's no gimmick; she nails the dips and peaks of pitch while leading her band in scorching variations on simple, repetitive traditional melodies…” – L.A. Times “{Abigail Washburn is} an artist who best embodies the notion of Americana as a worldwide musical language\" – The Tennessean Beijing. A smoke-filled club bustling with people, clanging of bottles, chatter. There is a woman on stage with her banjo. She begins to sing old-time Appalachian music in Chinese. The effect produced is entirely original, a cultural mash-up between two distant yet not so different worlds. The crowd quiets down to listen. Abigail Washburn never set out to be a songwriter, recording artist or a producer. Her performance at that smoke-filled Beijing club would prove to be an important step toward international acclaim and attention from discerning critics. Abigail has created a new sound – a sound that challenges traditional notions of culture and countries. Abigail planned to move to China after a road trip up the east coast, but instead she stumbled upon a professional music career. This east coast trip included a stop at the International Bluegrass Music Association conference in Louisville, KY where she intended to learn a few banjo tunes but walked away with a demo session for a record deal in Nashville, TN. She canceled her one-way ticket to China and moved to Nashville. Shortly thereafter in 2004 she joined Uncle Earl. The \"all G'earl\" group released two records on the Rounder label, She Waits for Night (2005) and Waterloo, TN, (2007) the latter of which was produced by John Paul Jones of Led Zeppelin. In the midst of touring with Uncle Earl, Washburn released her first solo debut, and bilingual album, Song of the Traveling Daughter, (Nettwerk). At that point, Abigail joined cellist, Ben Sollee, in performing her music around the globe. In 2005 Abigail, Ben and a few talented friends (Béla Fleck on banjo and Casey Driessen on fiddle) formed the Sparrow Quartet and toured China. In 2006, the US State Department and the American Center for Educational Exchange requested that the group come back to lead the first official tour of a US band in Tibet. In May 2008, the Sparrow Quartet released Abigail Washburn & the Sparrow Quartet (Nettwerk) which was praised by critics and appeared on several “best of” lists from prominent publications. Produced by Béla Fleck and composed/arranged by the unconventional foursome, Abigail Washburn & The Sparrow Quartet became an \"intimate exploration of crossing global and cultural lines,\" says Abigail, who feels a reverence for both American and Chinese cultures. The unprecedented combination of two banjos (clawhammer and three-finger-style), cello and five-string fiddle unfolds -live and on record- in a dreamlike chamber suite. From the flawless ‘Overture\" and harrowing revival, \"Strange Things,\" to the interplanetary, Puccini-inspired old-time fairy tale, \"Great Big Wall in China,\" this record highlights the brilliant musicianship of each individual, but is at the same time much larger than the sum of its parts. In 2008 and 2009, Abigail Washburn and the Sparrow Quartet toured extensively throughout the US and Canada with appearances at festivals including New Orleans Jazz & Heritage, Merlefest, Bonnaroo Music and Arts Festival, Vancouver Folk Festival and many more. They were invited by the US State Department to play in China including several performances in Beijing during the 2008 Olympic games. In addition, the were filmed on National Geographic Live in Washington, DC and were invited to be a part of the Clearwater Concert, a benefit concert in celebration of Pete Seeger's 90th birthday along with a line-up of some of the most prominent, established musicians in the world. For Abigail and the Sparrow Quartet, 2008 was a year full of accomplishments and successes. But Abigail does not stop. She is a force of nature that continually attracts others to become a part of her art. Enter The Shanghai Restoration Project (SRP) producer Dave Liang. Abigail and Dave first collaborated to produce two electronic remixes of Sparrow Quartet songs released in April 2009. In December 2008, Abigail served as a resident teacher at the Sichuan University Art School teaching traditional US music. In the hours after school was finished, she volunteered for Sichuan Quake Relief performing at earthquake relocation schools. The experience with the students and teachers after the performances left her wanting to do something to help. In early March, 2009, Abigail had the idea to create Afterquake, a benefit EP in memory of the May 12, 2008 Sichuan Earthquake which left more than 5 million people homeless and hundreds of thousands dead. Abigail and The Shanghai Restoration Project united again to go to Sichuan Province, to the relocation schools and into the disaster zone to capture the voices of those affected by the earthquake and sample sounds from the schools and the disaster zone. They sampled, recorded and produced Afterquake in two and a half weeks in Sichuan province. The final result is a beautiful, timeless, intelligent and accessible musical document that blends folk and electronic sounds with post-earthquake samples. A portion of all proceeds will go to the Sichuan Quake Relief organization. Whether playing her banjo, or producing an electronic album, there is an undeniable element of Abigail Washburn in every project she embraces. Abigail's spirit and philosophy translate from language to language and bind countries, cultures and genres. \"As more and more people engage in this struggle for a new direction for the human spirit, we'll recognize that we're morphing into a global species.\" ---Abigail Washburn", "otherInfo": "No event info available"}, {"Address": "15200 W. 6th Ave Frontage Rd., Golden, CO 80401", "Artist": "Luis Alfonso Partida El YAKI ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7217606, -105.1705332], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Jefferson County Fairgrounds", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Michael Cleveland & Flamekeeper ", "ArtistImage": "https://photos.bandsintown.com/thumb/10390406.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk, Americana, Bluegrass", "Time": "12:45 PM", "Venue": "RockyGrass", "moreBioInfo": "Michael Cleveland Bio Award-winning fiddler Michael Cleveland brings dynamic traditional bluegrass to the stage with his award-winning band, Flamekeeper, in a show that will leave the audience talking. A 2020 GRAMMY winner and 12-time winner of the International Bluegrass Music Association's Fiddle Performer of the Year award, Mike and his talented band present a program of tight vocal trios and duos, blistering instrumentals, and fiddle-and-banjo duets that echo the first-generation stars of bluegrass. The show is rounded out with Mike's dry wit and the band's sense of fun. Considered one of the premier bluegrass fiddlers of his generation, Mike picked up a fiddle at age four, and his talent was recognized early. In 1993 he was chosen to be part of the Bluegrass Youth All Stars. Later that year Mike made his Grand Ole Opry debut as a guest of Alison Krauss. His list of guest appearances over the years is a who's who of bluegrass legends including Bill Monroe, Jim and Jesse, and Ralph Stanley. After high school Mike toured with Dale Ann Bradley and Coon Creek before joining Rhonda Vincent and The Rage in 2000. At the 2001 IBMA awards, Mike took his first Fiddle Performer of the Year award, and shared the title of Entertainer of the Year with Rhonda Vincent and the Rage. In 2002 Mike rejoined The Dale Ann Bradley Band. That year he won the Fiddle Performer of the Year award and again in 2004. Since 2006, Mike has swept the Fiddle Performer of the Year award, and now has 12 to his credit. Mike's first solo project as a Rounder recording artist, Flame Keeper, was re-leased in February 2002 and was chosen the IBMA's Instrumental Album of the Year. In 2004, Mike shared the Instrumental Album of the Year award with Tom Adams for Tom Adams and Michael Cleveland Live at the Ragged Edge, an album of fiddle and banjo duets. That was followed in 2006 by a second solo project, the award-winning Let 'Er Go, Boys! and in 2008 by the first Michael Cleveland and Flamekeeper CD, Leavin' Town. The band’s second CD, Fired Up, was released in March 2011 and reached #1 on Sirius XM Bluegrass Junction’s Most Played Albums chart. As a Compass Records recoding artist since 2014, Cleveland has received two GRAMMY nominations and won Best Bluegrass Album for Tall Fiddler in 2020.", "otherInfo": "No event info available"}, {"Address": "623 N Denver Ave, Loveland, CO 80537", "Artist": "Reid Tynan ", "ArtistImage": "https://photos.bandsintown.com/thumb/9071944.jpeg", "Coordinates": [40.3967058, -105.0469349], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Cover Band, Acoustic", "Time": "1:00 PM", "Venue": "Grimm Brothers Brewhouse", "moreBioInfo": "Live musician specializing in acoustic cover songs. 2+ years performing in Colorado's legendary Vail & Beaver Creek ski resorts. Late nights, happy hours, weddings, parties, & corporate events.", "otherInfo": "No event info available"}, {"Address": "17999 W Colfax Ave, Golden, CO 80401", "Artist": "Ryan Chrys & The Rough Cuts ", "ArtistImage": "https://photos.bandsintown.com/thumb/8775413.jpeg", "Coordinates": [39.7200863, -105.2028471], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Outlaw, Americana, Red Dirt, Country, Outlaw Country, Alt-country, Ameripolitan", "Time": "1:00 PM", "Venue": "Dirty Dogs Roadhouse", "moreBioInfo": "Ryan Chrys & The Rough Cuts bring forth new energy to music fans who love the heroes and outlaws of old. Influenced by the songs and personalities of legends like Waylon and Willie, they drive their sound with blazing guitars and a rock n roll attitude. The band pays respect to classic styles, but anyone can tell from their overdriven sound that they’re far from traditionalists. Recommended for lovers of both classic country and 70’s rock n roll.", "otherInfo": "free"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Decadon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9062495.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bass Music", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Decadon is an accomplished musician from Denver, Colorado. His upbringing and musical inception is rooted in rock music. He is a self-taught musician with natural talent and impressive skills on piano, drums, and bass, in addition to his well-known guitar abilities. With an intense interest in technology, combined with his love for writing and performing, he joined the world of Electronic Dance Music. Decadon shows are a fusion of a hard hitting DJ set and unique live guitar performance. His electric performances fuse the best elements of both Rock n’ Roll and EDM, seamlessly blended into a hybrid of what can only be defined as Rockstep. The year 2019 and beyond is set to be epic for all Decadon fans and an awakening to those who haven't yet been exposed to his music or shows.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Getter ", "ArtistImage": "https://photos.bandsintown.com/thumb/8358702.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bass Music, Dubstep, Electronic", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "North America, South America, Australia and Asia: LAnderson@paradigmagency.com EU / UK: Mike@codaagency.com Mgmt: sp@slvyvll.com Press: Press@slvyvll.com", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Ston3 ", "ArtistImage": "https://photos.bandsintown.com/thumb/8938750.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Heavy Trance & Progressive from a Mile High", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "GRYFFIN ", "ArtistImage": "https://photos.bandsintown.com/thumb/9277980.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "R&b/soul, Rnb-soul, Electronic, Dance, Soul", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "www.soundcloud.com/gryffinofficial http://www.twitter.com/gryffinofficial http://instagram.com/gryffinofficial Soundcloud/Instagram/Twitter - @gryffinofficial", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Excision ", "ArtistImage": "https://photos.bandsintown.com/thumb/9713536.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bass Music", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Excision shows are like no other. A virtual apocalypse of twisting and morphing sounds turn massive crowds into a frenzy. Earth-shattering walls of bass relentlessly smash upon the bodies of headbanging fans around the world. Hailing from Kelowna, British Columbia, Excision’s diverse skills as a DJ and producer constantly test the limits of electronic music with vastly different sets that encompass a full range of genres. The things you see and hear during the precious time you are engaged by Excision’s sounds will eclipse your mind for a lifetime. With 10+ years of constant touring under his belt, two major music festivals to call his own in Bass Canyon (August – Washington) and Lost Lands (September – Ohio), multiple chart-topping hits and millions of screaming fans around the world, Excision has proven himself as the true champion of Bass Music. Excision’s fourth full-length studio album Apex (2018) adds another groundbreaking achievement to his already staggering collection of original music, following up from Virus (2016), Codename X (2015) and X Rated (2011), plus countless singles, collabs, mixes, and EPs over the last decade.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Deorro ", "ArtistImage": "https://photos.bandsintown.com/thumb/11083840.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bass Music, Sound Art, Electronic, Latin Pop, Edm", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "After more than a decade of developing his genre-blurring musical style, Los Angeles-born producer Deorro, née Erick Orrosquieta, has become known as a worldwide-touring DJ, reputable songwriter and bona fide superstar producer. Deorro officially crossed over into the mainstream milieu in April 2014 with the release of “Five Hours,” which is just one of his many globally certified, chart-topping, platinum-selling releases and viral hit singles. A proud Mexican-American, Deorro is also breaking ground in the worldwide Latin music market on the strength of his megahit “Bailar,” a Latin/EDM hybrid featuring Grammy Award-winning/Latin Grammy Award-winning international merengue star Elvis Crespo. For now, Deorro is working on his next album, bringing inspiration from his roots along with some of his favorite latin artists who might be featured.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Zen Freeman ", "ArtistImage": "https://photos.bandsintown.com/thumb/6358961.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Nu-disco, House", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Since age 13, Zen Freeman has been behind a pair of decks. After a lifetime of record spinning, knob turning, passion pursuing and perfecting the lost art of genuine music mixing, Zen has become a DJ and curator for some of the world’s top publications and fashion giants including Gucci, Prada, Vogue, Vanity Fair, Giorgio Armani, Chanel and Tommy Hilfiger. He’s served as music supervisor for global luxury brands like Cartier, Louis XIII and Soho House and has become the go-to DJ for some of the world’s most exclusive clientele, including Sundance, the Academy Awards, and Cannes Film Festival, as well as Leonardo DiCaprio, Elton John and Elon Musk. Zen’s work extends far beyond closed-door private events. Zen landed a two-year residency at Hakkasan & Wet Republic in 2015. In 2017, Freeman joined the ranks of the residents at the prestigious XS Nightclub and Encore Beach Club at the Wynn Resort in Vegas alongside some of the biggest DJ’s in the dance music scene today: Skrillex, Major Lazer, DJ Snake, David Guetta, Diplo, the Chainsmokers, RL Grime and more. As a producer, Zen releases on some of electronic music’s top labels including Calvin Harris’ Fly Eye Recordings, Armada Music, Rising Music, Magik Musik and his productions have seen support from DJ giants like David Guetta, Afrojack, Fedde Le Grand, Bob Sinclair and superstar Calvin Harris. This year, Zen has scheduled an arsenal of amazing collaborations with some of the best dance music has to offer. The first single, Stars ft. Macy Gray, came out on UK’s dance label Defected Records to great critical acclaim. In Summer 2017, Zen Freeman co-founded a brand new luxury festival, RHA, on the beautiful Riviera Nyatt in the stunning Punta Mita Resort. Along with his co-founders, Zen built a festival from the ground up, booking international superstar DJs like Green Velvet, Claptone, Purple Disco Machine and Dimitri from Paris among others, garnering acclaim from MixMag, Thump, Cool Hunting and Dancing Astronaut. Official Zen Freeman URL’s http://www.soundcloud.com/zenfreeman http://www.instagram.com/zenfreeman http://www.youtube.com/zenfreeman http://www.twitter.com/zenfreeman http://www.zenfreeman.com bookings@zenfreeman.com http://www.twitter.com/zenfreeman http://www.soundcloud.com/zenfreemanmusic http://www.zenfreeman.com", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Abelation ", "ArtistImage": "https://photos.bandsintown.com/thumb/8939202.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bass", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Birthed from raw emotion, Abelation is the lovechild of cathartic expression and malevolence. A misunderstood soul living in a world fractured by hopelessness and despair. His silhouette has been seen at times and is always accompanied by an echo of his being. The echo has been described as a cacophony of low-end sounds, but others understand it for what it is.. the esoteric embodiment of a beautifully dark emotion that carries the same name as its creator.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Tsuruda ", "ArtistImage": "https://photos.bandsintown.com/thumb/10306829.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Experimental, Bass, Beats", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "A leader in the Los Angeles bass scene, producer/DJ Tsuruda is a classically trained musician who commands a distinctive sound that blends elements of experimental hip-hop with avant-garde electronics. First debuting in 2014, Tsuruda has captivated wide-eyed audiences with his dynamic sound and hypnotizing live sets, which have taken him to marquee festivals like Shambhala Music Festival and EDC Las Vegas, in addition to his own solo tours throughout North America and beyond. His expansive discography—which comprises six full-length projects, two compilations, the breakout FUBAR EP, and numerous releases on tastemaker labels like Team Supreme, Darker Than Wax, 1985 Music (Alix Perez) and Division Recordings (Noisia)—is one of the most impressive bodies of work in independent electronic music. Tsuruda today stands at the upper echelon of bass music culture as an in-demand producer and internationally touring act. A prolific artist from the jump, Tsuruda has self-released four full-length projects—drumsand (August 2014), madness (March 2015), rawflavor (July 2015) and RIP (February 2016)—in addition to his two-part compilation series, Internet Slaps Vol. 1 (November 2017) and Internet Slaps Vol. 2 (January 2019). His discography also includes numerous singles on labels like Team Supreme and Darker Than Wax, a gang of bootlegs, and official remixes for Noisia, The Glitch Mob, Crooked Colours, graves and Project Paradise (Mr. Carmack and Promnite). In December 2017, Tsuruda’s original track, “Pack Heat,” was featured on Edition 1, the first compilation on Alix Perez’s label, 1985 Music. In June 2017, Tsuruda released Move, his official debut artist album, on Division Recordings, the trendsetting label from legendary drum & bass trio, Noisia. Featuring breakout tracks “Peanut Butter” and “Brrrap!!,” Move traverses through trap-leaning percussions, hip-hop beats and expertly curated samples. He followed up with Unlimited Data (October 2018), his second artist album, released on Courteous Family, the influential Los Angeles artist collective and independent boutique record label he co-founded in 2014. Featuring collaborations with fellow bass beat-makers Alix Perez and Woolymammoth, Unlimited Data is stacked with live instrumentation, inventive samples, complex percussions and rhythms, and deep lo-fi bass and halftime beats. On his FUBAR EP (October 2019)—independently released and distributed in partnership with cutting-edge Los Angeles imprint, Alpha Pup—Tsuruda expands his sound into the outer limits of bass music. FUBAR, an acronym for Fucked Up Beyond All Recognition, sees the producer synthesizing and mutating his sound into all shades of bass music—halftime, dubstep, garage and everything in between—while still retaining his signature L.A. beat scene style. Created with the high-intensity energy of a club and festival setting, FUBAR features nine hard-hitting tracks, including standout singles “Dragon of the Darkness Flame” and “Kimchi Crisis,” plus “Little Mac,” a collaboration with Mr. Carmack. With FUBAR, Tsuruda enters his next creative chapter, one marked by a deeper sense of bass experimentalism and open-minded creativity. Widely known for his idiosyncratic, third-eye-opening sets, Tsuruda is unmatched on the live front. In addition to headlining and high-profile sets at Infrasound Music Festival and Daybreak Festival, he’s delivered mind-bending performances at some of the world’s leading festivals and marquee events. In 2015, he joined G Jones and Slow Magic side by side for a legendary sunrise set at Emissions Music Festival. In 2017, he performed at the Oregon Eclipse Festival, a once-in-a-lifetime honor for the producer, followed by a supporting slot for dubstep icon Bassnectar at his Bass Center arena show. One year later, in 2018, Tsuruda was handpicked as one of the select artists to close out Low End Theory, the influential weekly series that birthed the Los Angeles beat scene. That same year, he unloaded unforgettable performances at premier events Shambhala Music Festival in Canada, where he dropped two sets, and Electric Forest, where an intimate crowd of 50 festival-goers mushroomed to 3,000 within minutes during his set. Elsewhere, Tsuruda has toured with the biggest beat-masters in the scene, including Mr. Carmack and Shades (EPROM and Alix Perez). Most recently in 2019, he made his debut at the internationally celebrated EDC Las Vegas, joined G Jones on his Ineffable Truth Tour, supported Amon Tobin across a number of US dates, and headlined his own solo tour in the fall in support of his latest release, FUBAR. Tsuruda now enters 2020 with a stacked schedule of upcoming tour dates and new music on the horizon. Tsuruda’s musical trajectory has been marked by a swift push into the bleeding edge of underground music and culture. Now laser-focused on making more music than ever, Tsuruda today expands his ever-evolving sound to new dimensions.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Last Heroes ", "ArtistImage": "https://photos.bandsintown.com/thumb/10042617.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Dubstep", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Last Heroes was formed in Colorado in 2016 with the hopes of creating a platform that would bring people together and remind everyone of their purpose in life. Big or small, visible or not, everyone has an impact that ripples. It’s about harnessing the good, embracing your powers and setting out to be the best person you can be. The mission is soundtracked by emotional, melodic and cinematic music — inspired by the likes of Seven Lions, Hans Zimmer and more. 2019 served as a pivotal point in our journey. It represented a new chapter for Last Heroes, filled with shows and original music including our debut EP ‘Moments’. The best is yet to come. Follow us on our journey ⛰ -Garrett & Brian", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Zomboy ", "ArtistImage": "https://photos.bandsintown.com/thumb/7837185.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Zomboy came crashing head first into 2016 with the game changing single ‘Like A B*tch'. Taken from his hotly anticipated Neon Grave EP, the track became the go-to set opener for the likes of Skrillex, DJ Snake and almost every bass DJ at Ultra 2016. While the EP Crushed the charts, the 'Neon Grave' tour saw Zomboy sell out venues all over North America and has set the tone for an incredible 2016 for the producer. Never one for slowing down, he's since remixed the Chainsmokers' huge crossover hit ‘Don’t Let Me Down’, and has embarked on his annual festival run, destroying crowds one by one with his inimitable energy and stage presence", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Ecotek ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "No artist bio available", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Claptone ", "ArtistImage": "https://photos.bandsintown.com/thumb/9008297.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "House", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "In a now long forgotten world, many generations ago, a bird like shape emerged from wooded darkness, floating and fluttering, drifting and dreaming. Backlit by a bright glow of iridescent light, the undecipherable form wore a dazzling golden mask. Its long beak swooped down like an inverted horn and since then, people have referred to the mythical being simply as Claptone. Years spending wandering medieval landscapes have informed Claptone’s view of the world, experiencing both magical mystery and muted melancholy he enchanted onlookers with occult instruments and beguiling sounds. Forever surrounded by a sense of intrigue, the world soon cottoned on to the elusive yet enchanting musical powers of this otherworldly beast. The results are that today his shamanistic sonic powers take him all around the world.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Born Dirty ", "ArtistImage": "https://photos.bandsintown.com/thumb/11001664.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Dance", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "No artist bio available", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "2721 Larimer St, Denver, CO 80205", "Artist": "Wes Watkins ", "ArtistImage": "https://photos.bandsintown.com/thumb/8314064.jpeg", "Coordinates": [39.7599499, -104.9838489], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Larimer Lounge", "moreBioInfo": "Band Leader of the Other Black and trumpet player from Nathaniel Rateliff & The Night Sweats, Band Leader of the Other Black and trumpet player from Nathaniel Rateliff & The Night Sweats,", "otherInfo": "No event info available"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Carnage ", "ArtistImage": "https://photos.bandsintown.com/thumb/9620410.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "No artist bio available", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Green Velvet ", "ArtistImage": "https://photos.bandsintown.com/thumb/8665533.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Techno, Electronic", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "During the early days before he became a house musician, he earned a degree in chemical engineering from the University of California, Berkeley. Up until this point music had been a hobby fueled by cobbling together tracks on his \"sixty buck keyboard, a cheap four-track and a cheap drum machine\" while still an undergraduate at the University of Illinois. This DIY method of production was never taken seriously and when childhood plans to become a doctor were shelved Jones was firmly committed to a career as a chemical engineer, His dad was an occasional DJ and eventually became budding musician. As time went on Jones discovered what was his innate love and understanding for house music, a sound that had grown throughout the mid-80s out of Chicago's deep-rooted disco scene. As a child he was into sci-fi movies and time travel TV shows like Doctor Who and would spend hours pondering over the possibilities this would open up. He played the saxophone at school and had a talent for trying to play with a keyboard but remained largely un-interested in what he saw as his father's passion. It was this cut-up, tacky, production style of the early house sound that Jones absorbed and translated into the 'Underground Goodies EP', his first release as Cajmere (that's CAJ as in Curtis A. Jones) put out in 1991 on his own recently started Cajual label. A year later he had his first massive hit as Cajmere with the brilliant house tune 'Coffeepot (It's Time For The Percolator)' also out on Cajual. He then teamed up with Chicago-based vocalist Dajae for 'Brighter Days' (he entered #2 on the Hot Dance Music/Club Play), a high impact, more mellow house tune that came out on Emotive. from: http://en.wikipedia.org/wiki/Green_Velvet", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "4B ", "ArtistImage": "https://photos.bandsintown.com/thumb/9373024.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Trap, Jersey Club", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Bobby McKeon, better known as 4B, may only be 26 years old, but he’s already been honing his musical skills for nearly half of his life. The American DJ and producer has relentlessly pursued his signature sound and vision over the last 11 years, garnering support from some of the industry’s legends like Skrillex, DJ Snake, Diplo and Tiesto for his unique sound and meticulous production style. The support bleeds deep; it is a special moment when world icon DJ Snake looks over to his peer Diplo and states that 4B is “the next big thing with the hottest s**t in the streets.” In 2015, 4B created “Pop Dat,” with Aazar, the booty-shaking banger that would become his trademark single; the track became one of the most played songs of 2016 and topped over 9 million streams, putting 4B firmly on the map as one to be watched in the dance music scene. In addition to his original productions, 4B’s penchant for forward-thinking production style translates into winning remixes; he has put his signature touch on the likes of Fetty Wap’s “My Way” with Flosstradamus and DJ Snake’s “Middle,” earning 6 and 8 million total streams respectively. In 2018, 4B was the leading artist on DJ Snake’s label Premiere Classe with his track “Whistle,” which was played by everyone from Dog Blood to Diplo and Yellowclaw as one of the year’s hottest festival anthems. 4B has also earned himself somewhat of a cult following from his electric live performances, stemming from hallmark shows at major festivals including HARD Summer, Coachella, ULTRA Miami, and a residency at Drai’s Las Vegas. All of those pale in comparison to his wildly popular set at EDC Las Vegas right before ZEDD, where he brought out Soulja Boy as a special guest. Most recently he embarked on the BLACKOUT tour with Flosstradamus, following their release of the track of the same name on Ultra Records, hitting major cities across the US and Canada this summer. Bobby has come a long way from mapping out beats at a school lunch table in Westfield, NJ. As he continues to evolve and mature as an artist, the next wave of his career is bound to make him bigger and better than ever.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Midnight Tyrannosaurus ", "ArtistImage": "https://photos.bandsintown.com/thumb/9016611.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Dubstep", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Management: Pitch Black Management - Steve Blakley - steve@pitchblackmanagement.comd", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "Brondo ", "ArtistImage": "https://photos.bandsintown.com/thumb/10410865.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Dubstep", "Time": "3:00 PM", "Venue": "Empower Field at Mile High", "moreBioInfo": "Hello. My name is Brondo. Welcome to my Bass Jungle.", "otherInfo": "VIP -Separate expedited festival entry on the south side of the festival. Off of Old West Colfax Avenue. -Private viewing area in front of Global Summit Stage -Commemorative VIP laminate & lanyard -Access to Global VIP Village (private bars, private bathrooms, lounge seating areas) -Plus more! SATURDAY LINEUP: 4B • ABELATION • BORN DIRTY • BRONDO • CARNAGE • CLAPTONE • DECADON • DEORRO • ECOTEK • EXCISION • GETTER • GREEN VELVET • GRYFFIN (DJ SET) • KHIVA • LAST HEROES • MIDNIGHT TYRANNOSAURUS • OF THE TREES • SACHA ROBOTTI • SMOAKLAND • SPENCER BROWN • STON3 • TIËSTO • TSURUDA • TWO COMMAS • YHETI • ZEN FREEMAN"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Sierra Hull ", "ArtistImage": "https://photos.bandsintown.com/thumb/11155213.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Folk, Bluegrass", "Time": "3:30 PM", "Venue": "RockyGrass Festival 2021 - Sierra Hull & Justin Moses", "moreBioInfo": "Sierra Hull’s positively stellar career started early.  That is, if you consider a Grand Ole Opry debut at age 10, called back to the famed stage a few months later at age 11 to perform with her hero and mentor Alison Krauss to be early.  She played Carnegie Hall at 12; at 13 signed with Rounder Records and later issued her debut, Secrets, and garnered the first of many nominations for Mandolin Player of the Year. She eventually made history by becoming the first female to win the prestigious title.  She played the Kennedy Center at 16 and the next year became the first bluegrass musician to receive a Presidential Scholarship from Berklee College of Music.  As a 20-year-old, Hull played the White House and would later be invited back for a second time. Now in her late 20s, Sierra has received GRAMMY nominations for her last two solo albums and continues to push the musical boundaries with her continued love of exploration in music. She remains deeply rooted in the Bluegrass community but is also inspired and excited by the ever-evolving roots scene. When not working on solo projects, her ability to span multiple genres has led to collaborations with friends and icons such as the Indigo Girls, Garth Brooks, Béla Fleck, Gillian Welch, Brandi Carlile, Dierks Bentley, Cory Wong, Steve Martin, Bobby McFerrin, Jewel, Edgar Meyer and Sturgill Simpson.", "otherInfo": "No event info available"}, {"Address": "450 Main St, Lyons, CO 80540", "Artist": "Kingdom Jasmine ", "ArtistImage": "https://photos.bandsintown.com/thumb/9145869.jpeg", "Coordinates": [40.2248924, -105.271254], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Folk Rock", "Time": "4:00 PM", "Venue": "A Cool Old Buildings 140th  2021", "moreBioInfo": "\"Armed & Dangerous\" out April 30th.", "otherInfo": "No event info available"}, {"Address": "2276 Manatt Ct Unit B9, Castle Rock, CO 80104", "Artist": "Bunny Blake Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11485856.jpeg", "Coordinates": [39.3505884, -104.8683805], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "R&b, Pop", "Time": "4:00 PM", "Venue": "Honnibrook Craft Meadery", "moreBioInfo": "Bunny Blake is a public figure, an old soul trapped in the body of a 20 something. Influenced by the vocals of Mariah Carey and Mary J Blige with the guitar styling of James Taylor and John Mayer, Bunny’s genre can be best described as pop/r&b with soulful, finger style guitar. Her name is inspired by The Twilight Zone, mirroring her many dimensions as an artist. One can learn the most about Bunny through her songwriting. Striking a balance between Cutesy and Sexy, Sweet and Sassy, each song expresses a different dimension of femininity. Bunny leaves little to the imagination. Her song “$$$” speaks candidly to the reality of being a full time musician while “Pisces” and “Dominos” appeal to her more playful side. “Good Intentions” is perhaps her most emotionally honest work about the value of transparency in a relationship. In a past life, Bunny has traveled the world with her music as Lindsey Saunders. From receiving a Gibson Les Paul from a kind stranger at the Pinetop Music festival in Arizona, to meeting one of the infamous members of the Beach Boys in the Airport after playing the Copenhagen Songwriters Festival, she’s always sure to travel with a bit of whimsy in her back pocket. When attending Bunny’s live show, it doesn’t take long to see why she claims it was the guitar that chose her - not the other way around. Bunny’s unconventional chord crafting has earned her a Taylor Guitar Artist Partnership with notable performances at events such as the Sundance Film Festival, Boulder International Film Festival, Durango Songwriters Expo, SXSW and CMJ Music Marathon. Bunny has received many accolades for her work being noted as a musician whose artistry and poise as a songwriter, guitarist, and vocalist demands to be both seen and heard.", "otherInfo": "Oh Mead, How I Need Thee"}, {"Address": "1701 Bryant St, Denver, CO 80204", "Artist": "000KB000 ", "ArtistImage": "https://photos.bandsintown.com/thumb/11348701.jpeg", "Coordinates": [39.7441196, -105.0203951], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Mixed Media", "Time": "4:00 PM", "Venue": "GLOBAL DANCE festival ", "moreBioInfo": "I'm KB I have Been A Tik Tok Video Maker since 2012 and This is a way to Reach out to my Fans and Friends!", "otherInfo": "I will be at tundra stage"}, {"Address": "16728 E Smoky Hill Rd Suite 11C, Centennial, CO 80015", "Artist": "Eric Golden ", "ArtistImage": "https://photos.bandsintown.com/thumb/9243173.jpeg", "Coordinates": [39.6260412, -104.79444], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Honky Tonk, Americana", "Time": "5:00 PM", "Venue": "Toley’s on the Creek", "moreBioInfo": "Eric Golden is a Denver native singer/guitarist with music in his blood. As the son of a musician Eric grew up surrounded by live music. With a passion for country music, Eric performs covers by Merle Haggard, Waylon Jennings, Dwight Yoakam, Tim McGraw, George Strait, Johnny Cash, and many others. Eric is a reliable, professional, and engaging artist; who preforms solo as well as part of several duos, and is able to customize a playlist for the specific need of your event. Eric has preformed local in Bars, Restaurants, corporate parties, festivals, charity events and many more. Eric was awarded the Artist New Comer in 2019 by the Colorado Country Music Hall of Fame.", "otherInfo": "No event info available"}, {"Address": "Denver, CO", "Artist": "Krayzie Bone ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619828.jpeg", "Coordinates": [39.7392358, -104.990251], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Hip-hop, Rap, Hip Hop", "Time": "5:00 PM", "Venue": "Hermans Hideaway", "moreBioInfo": "Krayzie Bone (born Anthony Henderson on June 17, 1974) also known as Leather Face or Leatha Face, and Sawed Off Gangsta, is a member of the rap group, Bone Thugs-N-Harmony. He, like his other group members, is known for his tongue-twisting rapid pace of delivery and his ability to create harmonic hooks within songs. He is the most laid back, versatile, and soft spoken member of Bone Thugs-N-Harmony letting his work show for itself.", "otherInfo": "No event info available"}, {"Address": "1025 Delaware Ave, Longmont, CO 80501", "Artist": "Tony Crank ", "ArtistImage": "https://photos.bandsintown.com/thumb/11339861.jpeg", "Coordinates": [40.1544152, -105.1092344], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz Pop Classical World, Contemporary Folk, Classical", "Time": "5:00 PM", "Venue": "Grossen Bart Brewery", "moreBioInfo": "Music Artist - Guitarist They say that music is the language of the soul, and nothing could be truer for Tony Crank. An inspirational artist, Tony has earned his reputation as a talented musician and skillful performer. From live gigs to studio sessions and more, Tony Crank continues to touch fans around the world with his distinct and enjoyable musical style.", "otherInfo": "Los Cheesies and CRANK"}, {"Address": "25997 Conifer Rd, Conifer, CO 80433", "Artist": "James Carothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9982745.jpeg", "Coordinates": [39.5418246, -105.2972495], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Country, Hillbilly, Honky-tonk", "Time": "6:00 PM", "Venue": "James Carothers - Elevation Celebration", "moreBioInfo": "Nashville honky-tonk crooner, James Carothers, is known best for his stone-country originals and spot-on impressions of several of country music's greatest icons. James released a new album called Songs and Stories on November 22, 2019. Previous releases include Still Country, Still King: A Tribute to George Jones (September 2018), his first full-length original album Relapse (May 2017), and an EP Honky Tonk Land (June 2014). In 2015, James left a technician job at the Los Alamos National Laboratory in New Mexico and returned to his native state of Tennessee to pursue a country music career. George Jones' own widow, Nancy, personally hired James for his first steady gig at the George Jones Museum in Nashville, allowing him to make a living playing music and to hone his hobby-turned-profession in an accelerated fashion. Since then, James has played several shows each week in downtown Nashville at places like The George Jones and AJ's Good Time Bar when he's not on the road, having played over 1500 public, corporate, and private events since January 2015. In addition to supporting his young family and connecting with other musicians and songwriters, performing downtown has helped James build a large fan base of folks drawn through the doors by the booming voice echoing down Broadway and 2nd Avenue. Playing so many shows in a relatively short time-frame in a city with an excess of raw talent forced him to sharpen his stage show quickly and continue to refine the thing he's always enjoyed most — entertaining and interacting with his audiences in a way that leaves most people feeling like they've made a new friend. James was the 2018 WSM Road Show Winner, resulting in the opportunity to make his Grand Ole Opry debut opening for Alan Jackson at the Ryman Auditorium on January 17, 2020. He was also selected by Jackson from the crop of rising artists who play at AJ’s Good Time Bar, Jackson’s self-owned honky-tonk on downtown Nashville’s famed “Lower Broadway,” to open select dates on Jackson’s 2019 “Honky Tonk Highway” tour. Over the past few years, James has enjoyed playing several opening slots, festivals, fairs, and private events in locations all across the United States and has even had the opportunity to travel to Canada, Japan, Scotland, and Norway for shows.", "otherInfo": "No event info available"}, {"Address": "3091 7th St, Boulder, CO 80304", "Artist": "Antonio Lopez ", "ArtistImage": "https://photos.bandsintown.com/thumb/11484244.jpeg", "Coordinates": [40.0308828, -105.2882638], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Modern Folk Rock", "Time": "6:00 PM", "Venue": "Stone Cottage Studios Summer Concert Series: Duo w/ Jonathan Sadler", "moreBioInfo": "Antonio Lopez is a musician, composer, and the executive director of the nonprofit, Sound Bridge Music. He is a quiet man who has something to say. His music is like an onion. It has many layers, each one revealing something more. At the core, Lopez is a singer-songwriter in service to the song. His adept guitar work and composition skills are never used in a showy way, but rather like the spices in a delectable home cooked meal. The result is a feast of emotions that is a delight to the listener. Lopez was born and raised in Alamosa, CO, growing up steeped in the Chicano culture of northern New Mexico and southern Colorado. Since 2012 Lopez has been living in Longmont, CO. Speaking of the move he says “ I was green as they come when I first arrived on The Front Range, full of that naive small-town optimism. The first job I had was as a night janitor in the public schools, trying to hustle my first gigs in a new music scene.” That hustle ethic has paid off as evidenced by Antonio’s newest album, Roots and Wings, which was crowdfunded through a wildly successful Kickstarter campaign. The album is set for release on 01.01.2021.", "otherInfo": "NOTE: The show time has been changed. Doors are now at 5 pm and the music starts at 6pm. \n\nJoin us on Saturday, July 24th, as we present a special, hybrid acoustic show featuring Antonio Lopez and Jonathan Sadler. Doors open at 5:00 PM and show begins at 6:00 PM, rain or shine. Ticket buyers are welcome to bring seating (lawn chairs, blankets, pillows), drinks, and a picnic.\n\nAbout Antonio Lopez \n\nAntonio Lopez is a quiet man who has something to say. His music is like an onion. It has many layers, each one revealing something more. His adept guitar work and composition skills are never used in a showy way but rather like the spices in a delectable home-cooked meal. The result is a feast of emotions that is a delight to the listener. His acoustic soul and modern folk sound garners comparison to artists such as Amos Lee and Paul Simon. \n\nLopez was born and raised in Alamosa, CO, growing up steeped in the Chicano culture of northern New Mexico and southern Colorado. Since 2012 Lopez has been living in Longmont, CO. Speaking of the move, he says, “I was green as they come when I first arrived on The Front Range, full of that naïve, small-town optimism. The first job I had was as a night janitor in the public schools, trying to hustle my first gigs in a new music scene.” That hustle ethic has paid off, as evidenced by Antonio’s newest album, Roots and Wings, which was crowdfunded through a wildly successful Kickstarter campaign.\n\nJoining Antonio is longtime collaborator Jonathan Sadler. Being a multi-instrumentalist, Jonathan employs the tools that best fit the job at hand, though he specializes now in Tabla and Marimba. Growing up in a family of musicians, pursuing music was written in the stars for Jonathan."}, {"Address": "17th and Meade St., Denver, CO 80204", "Artist": "Rico Jones Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8806064.jpeg", "Coordinates": [39.7439571, -105.0357843], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Gospel, Rock, Blues, Pop, Be-bop, Funk, Fusion, Jazz", "Time": "6:00 PM", "Venue": "Jazz At Sloans Lake", "moreBioInfo": "Rico attended Denver School of the Arts. In High School he was a part of the Telluride Jazz Festival all Star ensemble for five consecutive years. He took part in the 2015 Grammy Band Jazz session workshop in L.A. In 2016 he was chosen take part in the prestigious Jazz Band of America. He has Collaborated with notable artists such as Ari Hoenig, Lage Lund, Dave Kikoski, Colin Stranahan, Alex Claffy, Rich Perry, Adam Larson, Chad Lefkowitz-Brown, Brad Goode, Greg Gisbert and Gabriel Mervine. Rico has performed with artists such as Candido, Joe Lovano, Greg Osby, Johnathan Kreisberg, Matt Chohesy, Benny Benack III, Bobby Sanabria, Javon Jackson, Donald Harrison, Howard Levy, Jeff Coffin, Ernie Watts, Hubert Laws, Gabriel Mervine, Terrell Stafford and, Earl Klugh. Rico Jones lives in New York City where he pursues a professional career in music. Rico has also recently released his first album The Search: Live at Dazzle under the Synergy Music record label through the pathways to jazz grant. Attachments area", "otherInfo": "No event info available"}, {"Address": "14697 Delaware St, Westminster, CO 80023", "Artist": "Phat Daddy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8626696.jpeg", "Coordinates": [39.9627835, -104.9914927], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Orchard Town Center Summer Concert Series", "moreBioInfo": "Phat Daddy is Denver's HOTTEST band! www.phatdaddy.biz", "otherInfo": "No event info available"}, {"Address": "5616 Olde Wadsworth Blvd, Arvada, CO 80002", "Artist": "Tony Medina Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11489606.jpeg", "Coordinates": [39.7995234, -105.0812921], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Acoustic Blues, Alternative, Classic Rock, Rock", "Time": "6:00 PM", "Venue": "Tony Medina at Urban Beets", "moreBioInfo": "Tony Medina is a soulful, smokey-blues Singer/Songwriter with a powerful presence, a playful style attitude, and passionate approach to music. Performing professionally since '97, he has been on many stages, running Open Mics, and performing solo or as a duo with friends. Tony works diligently as a live performer with Producer/Songwriter/Guitarist Shon Howard. \"Music Is Everything. If You Listen, You'll find it.\" -TM", "otherInfo": "Back in the STREET! Urban Beets world class service staff, flavors, and street patio have become a center piece of Old Town Arvada. And with Tony Medina bringing some of his friends will top the night with great songs and heart."}, {"Address": "450 Main St, Lyons, CO 80540", "Artist": "Foxfeather Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8965627.jpeg", "Coordinates": [40.2248924, -105.271254], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Sultry, Blues, Keyboard Instruments, Acoustic Guitar Driven., Americana, Drums, Pop, Electric Guitar, New Folk-rock, Upright Bass, Female Fronted, Alternafolkrock", "Time": "6:00 PM", "Venue": "MainStage Brewing Company", "moreBioInfo": "Foxfeather is a sultry alt-americana band founded in Boulder, CO in 2013. Beginning with a lyrical base, and bolstered by strong blues-rock instrumentals, Foxfeather’s unique sound captivates their audience. The band consists of Carly Ricks Smith (lead vocals), Laura Paige Stratton (acoustic/electric guitars, keys, vocals), and is often supported by various instrumentalists for a full rock sound. Foxfeather is a local staple in the Colorado Front Range, and also tours nationally. The band released their EP, Foul Moon, in 2014. In response to this release The Marquee stated that “the group is overflowing with talent” and “Carly Ricks Smith has a spectacular voice which lies somewhere between the folky soprano of a young Joni Mitchell and the jazz-heavy range of Lake Street Dive’s Rachel Price. It’s powerful as well as delicate.” Andy Eppler of The Prairie Scholars said “it’s sexy. It’s original. These women have crafted something very special and instantly likeable on this album.” The band released their first full length, self titled album in October of 2016, which Rooster magazine described as \"time warping...it's an emotional ride into the forest of folk with low-hanging country branches slapping you in the face without apology... its got a good thing going\" (Rooster Magazine).", "otherInfo": "No event info available"}, {"Address": "6255 W Quincy Ave, Denver, CO 80235", "Artist": "Seekarlplay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8863471.jpeg", "Coordinates": [39.64105110000001, -105.068071], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Pinehurst Country Club", "moreBioInfo": "Karl was born and raised in Grand Rapids, Michigan where he started playing guitar at the age of 8. His interest in guitar playing led him to Chicago where he studied classical guitar as a performance major at Roosevelt University in the early 1990's. In 1996 Karl migrated west to the Rocky Mountains of Colorado. There, he's been working his craft playing in Bars, Restaurants, Theaters, Breweries, and Coffee shops. Karl's current program consists of straight forward, energetic interpretations of classic rock favorites and danceable adult alternative tunes. Karl's sets also feature selections from a varied and refreshing repertoire of original material. His easy going, fun style engages, uplifts and moves. Enjoy.", "otherInfo": "Private show for club members and their guests"}, {"Address": "55 Indian Peaks Dr., Nederland, CO 80466", "Artist": "Tenth Mountain Division ", "ArtistImage": "https://photos.bandsintown.com/thumb/9115127.jpeg", "Coordinates": [39.9723015, -105.5139003], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock & Roll, Ski Rock", "Time": "6:00 PM", "Venue": "The Caribou Room", "moreBioInfo": "Born in the fertile breeding grounds of the mountains of Colorado, Tenth Mountain Division is continuing the musical legacy set down by their forefathers in Colorado. Like those that came before, Tenth Mountain Division is pushing the sound found in the mountains into bold, new directions with their exploratory take on Americana that dips freely in the well of all their diverse influences, classic Southern Rock, the progressive bluegrass that was born in their backyard in Colorado, the adventurous spirit of sixties psychedelic blues, and straight ahead driving rock ‘n’ roll. Much like their Colorado predecessors, Leftover Salmon, String Cheese Incident, and Yonder Mountain String Band, they defy simple categorization; instead they reference their musical history with their high-energy shows as they blaze new musical paths every night. As they do so they have become the new voice of the Colorado music scene, taking their Ski-party sound around the country and making every show feel like a night in the mountains. Tenth Mountain Division was first born in 2010 when high-school classmates, Winston Heuga (mandolin) and MJ Ouimette (guitar) first met when they discovered a shared musical interest. The two young musicians started penning songs together that were inspired by the lore of the 10th Mountain Division military infantry and the natural beauty that surrounded their hometown in the Rocky Mountains. They ended up at the University Colorado Boulder where they briefly played as an acoustic trio with upright bassist, Connor Dunn before meeting drummer Tyler Gwynn and keyboardist Campbell Thomas. The addition of drums and keys to Heuga and Ouimette’s deep musical bond, widened their musical palette, taking the band in new directions and pointing to bold, uncharted, musical horizons. They released their first album, Cracks in the Sky, in 2016 and followed it up with a national tour that saw them packing shows across the country. The band’s lineup was solidified soon after with the addition of Andrew Cooney and immediate success followed. Since then they have become a regular presence on the festival circuit including stops at Summer Camp, Aiken Bluegrass Festival, Winter Wondergrass, Yarmony, ARISE, and Leftover Salmon’s Boogie at the Broadmoor. They released their second album, In Good Company, in 2018. It was an album that Live for Live Music declared was, “chock full of raw rock and roll, with a savory listening experience guaranteed for all.” The band is currently in the studio with Railroad Earth’s Tim Carbone working on their next album and continuing their non-stop touring. - Tim Newby: Author of 'Bluegrass in Baltimore' & 'Leftover Salmon: Thirty Years of Festival'", "otherInfo": "Tenth Mountain Division - Indoor / Outdoor Show \nThe Caribou Room \nSaturday, July 24"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "Chrome Sparks ", "ArtistImage": "https://photos.bandsintown.com/thumb/8472987.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Live Electronic, Dance, Techno", "Time": "6:00 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "Chrome Sparks is the solo project of Jeremy Malvin, a Brooklyn transplant from Pittsburgh by way of Ann Arbor. In 2014, after having self released a small handful of singles and two EPs on Bandcamp, Malvin signed to the taste making Sydney based label Future Classic. Under the new label, he rereleased Sparks EP and released the Goddess EP. His next EP, Parallelism is slated to be released with Future Classic on November 6. Inspired by a background in classical percussion and an obsession with synthesizers, Malvin creates dazed, melodic beat-centric tunes that loosely hang between down-tempo head nodders and up-tempo club bangers. FADER has described his music as ‘form-shifting beats [that] seem to resonate with spaced-out chillers and hyperactive party kids alike’. In 2012, while on Warped Tour as the drummer for Stepdad, Malvin released the slow burning, bass heavy single “Marijuana” on a Bandcamp compilation highlighting music from he and his friends in Ann Arbor. It quickly rocketed to #1 on Hype Machine and has since become an internet-stoner anthem. It has subsequently been rereleased by Future Classic and Kitsuné. Malvin's next EP, 'Parallelism', will be released with Future Classic on 11/13. It was made using three synthesizers, vocal samples from friends, and a tambourine.", "otherInfo": "STS9 7/24"}, {"Address": "321 Mountain Ave, Berthoud, CO 80513", "Artist": "Taylor Shae ", "ArtistImage": "https://photos.bandsintown.com/thumb/11225976.jpeg", "Coordinates": [40.3048654, -105.0789858], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blue-eyed Soul, Americana, Acoustic, Acoustic Blues", "Time": "6:00 PM", "Venue": "Taylor Shae Duo LIVE at City Star Brewing", "moreBioInfo": "Taylor Shae is an award-winning singer-songwriter born and raised in Colorado, credited for her carefree edge, old-soul lyrics, and velvety-toned vocals. Taylor performs around Colorado venues and festivals with RD, together bringing a high energy blues feel to the Americana genre.", "otherInfo": "Join Taylor Shae & RD for a summer evening of lively, bluesy-Americana music outside in the City Star beer garden! Show starts at 6:30pm ✨"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "STS9 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9296661.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Funk, Space, Jam Rock, Rock, Instrumental, Electronic, Jam Bands", "Time": "6:00 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "Sound Tribe Sector 9, or STS9 for short, is a 5 piece band that originally hails from Snellville, Georgia and after much success in Athens, GA and Atlanta, moved out west in late 2000 and currently reside in the San Francisco Bay Area of California. The band is known for frequent and explosive live performances with a friendly atmosphere and lots of dancing. Their music combines a special blend of the Atlanta influenced hip-hop side while combining it with a electronica-jam feel. The band is also known for their affinity for the Maya calendar, or \"13 moon calendar\". Onstage, the band blends live instrumentation using Ableton Live via Apple powerbooks.", "otherInfo": "No event info available"}, {"Address": "1611 Raleigh St, Denver, CO 80204", "Artist": "Daniella Katzir Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9025669.jpeg", "Coordinates": [39.7427448, -105.041673], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Indie Stuff, Folk", "Time": "6:00 PM", "Venue": "Sloan's Lake Night Bazaar with Austin Zaletel", "moreBioInfo": "", "otherInfo": "This little sassy, songwriter swing duo will be there to help you tap your feet through all the lovely vendors!\n\nShop, Sip & Mingle all summer long at Saturday Night BAZAAR! This weekly market will feature 50+ local vendors, pop-up bars, food trucks, live music and more!"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "Tycho ", "ArtistImage": "https://photos.bandsintown.com/thumb/11047241.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Psychedelic & Stuff., Post Rock, Electronic, Ambient", "Time": "6:00 PM", "Venue": "Red Rocks – Tycho DJ Set w/ STS9", "moreBioInfo": "As Tycho, Scott Hansen blends swirling melodies into vaguely triumphant arcs that crisscross between stuttering beats and vocal samples, creating rolling sonic landscapes that extend into the horizon. Hansen began releasing music over 15 years ago with The Science of Patterns EP. His first full-length, Sunrise Projector, came out in 2004, and the critical acclaim continued in 2006 with the release of Past Is Prologue. In 2011, his meticulous process saw the release of Dive, the first record in a trilogy that was followed by Awake in 2014 and the GRAMMY-Nominated Epoch in 2016. Hansen expanded the scope of his project with the addition of vocalist Saint Sinner on 2019’s Weather, his second GRAMMY-Nominated album that was quickly followed by its instrumental companion record Simulcast in early 2020 and a full Weather Remixes album in December 2020. Over the course of the last fifteen years, Hansen has developed from a delicate solo performer into the iconic frontman of a powerful five-piece live band that brings his compositions to life. Tycho has evolved from a singular to a plural, and from an electronic, ambient experiment to a live audio-visual experience that fans travel the world over to see.", "otherInfo": "No event info available"}, {"Address": "3459 Ringsby Ct, Denver, CO 80216", "Artist": "Covenhoven ", "ArtistImage": "https://photos.bandsintown.com/thumb/8823117.jpeg", "Coordinates": [39.7726808, -104.9831985], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie Folk, Indie Rock, Folk", "Time": "7:00 PM", "Venue": "Live and (( In Person ))", "moreBioInfo": "Colorado native Joel Van Horne, aka Covenhoven, has dubbed his new critically acclaimed album the ocean record, because he wrote the songs while touring and exploring the west coast over the past 2 years. Chapter 3 in the Covenhoven story, “A Kind of Revelation” continues his over-arching theme of immersion in a place, and letting that place become the centerpiece of the music. Big Sur, Olympic National Park, and the Oregon coast served as his geographical muse this time around. The resulting 9 songs are a captivating journey that transport the listener to the remote corners of the windswept coastal wildernesses from which they were born.", "otherInfo": "Very intimate 2 night run in Denver - outdoors!"}, {"Address": "608 E 13th Ave., Denver, CO 80203", "Artist": "S  ngular  ty ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523767.jpeg", "Coordinates": [39.7367329, -104.9794787], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Your Mom's House", "moreBioInfo": "No artist bio available", "otherInfo": "7:00pm-10:00pm Doors: 6:30pm 21+ Tickets are available at www.YourMomsHouseDenver.com Artists: Soohan https://www.facebook.com/soohanbeats https://www.soundcloud.com/soohan To know the music of SOOHAN is to be flooded with a rush of the vague and familiar as he deftly weaves worldwide influences into dance floor and festival-ready settings. To the unfamiliar, SOOHAN is the key holder to a catalogue which dives into and celebrates what all too often lies in the periphery. Drawing from the traditional and popular music of countless cultures, SOOHAN’s signature interpretation of dance music ignores borders, favoring a shared community dance floor experience that enthusiastically exposes audiences to new musical territory with every performance. s ngular ty https://www.facebook.com/sngularty https://s-ngular-ty.bandcamp.com/ Born in the Bay Area, now based in Denver, s ngular ty is a lover of sounds from the edges. Bringing a melting pot style with sounds from every corner of the universe, s ngular ty aims to make your body dance while your mind wanders. Street Profit https://www.facebook.com/streetprofitmusic https://streetprofit.bandcamp.com/ Seeing the reaction of the crowds and feeling their energy while he plays is what drives Street Profit to stay ahead of his peers, always looking for new sounds and different ways to get the crowd hyped; focusing on new mixes, dropping custom edits, original music, and tailoring his sets to each crowd specifically, while staying true to his roots in turntablism. Presented by Boogie Groove Entertainment"}, {"Address": "1451 Cortez St, Denver, CO 80221", "Artist": "Enuff Z'Nuff ", "ArtistImage": "https://photos.bandsintown.com/thumb/8635770.jpeg", "Coordinates": [39.8310474, -105.0041956], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "70s", "Time": "7:00 PM", "Venue": "Enuff Z'nuff with Faster Pussycat", "moreBioInfo": "Enuff Z'nuff is an American melodic rock band from Blue Island, Illinois. Founded by singer Donnie Vie and bassist Chip Z’Nuff, this Chicago area band is best known for their charting singles “Fly High Michelle” and “New Thing.” Enuff Z’nuff has continually recorded and toured throughout their career of more than 20 years, releasing 12 studio albums and a total of 19 CDs to date. The band's first single, \"Fingers On It,\" received some minor recognition when it was featured in the 1986 cult movie Henry: Portrait of a Serial Killer. Their songs have been recorded by several other musicians, some of which include Paul Gilbert, The Wildhearts, and Nelson. The band has a cult fan-base around the world which includes radio personality Howard Stern. Read the full Bio here.. http://www.enuffznuff.com/bio", "otherInfo": "Faster Pussycat and Enuff ZNuff"}, {"Address": "4747 Pearl St Ste V3A, Boulder, CO 80301", "Artist": "Spencer LaJoye ", "ArtistImage": "https://photos.bandsintown.com/thumb/11042660.jpeg", "Coordinates": [40.0259992, -105.2416888], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk, Pop", "Time": "7:00 PM", "Venue": "Roots Warehouse", "moreBioInfo": "Spencer LaJoye is a folk/pop singer songwriter, violinist, and vocal loop artist in Denver, CO who believes everyone is made of the good stuff. They make music to remember what it means to be human, to find connection in a time of disconnection, and to feel something in a world gone numb. Spencer's first EP, “We’ve Been That Way Before,” was recorded in Nashville, TN and released in 2014, winning the WYCE Jammie Award for Listener’s Choice: Album of the Year. They released their first solo acoustic album, \"Vapor,\" in 2015 with and for their friends and community in Grand Rapids, MI.  LaJoye's most recent album, “Altars,\" was released in Denver, CO in February 2018. Theologically bent, \"Altars\" features full-band arrangements of songs Spencer performs with a vocal looper. Spencer is currently living, writing, and performing in Denver, trying to longboard, and probably talking about their cat, Montgomery. They spend the rest of their time curating a small live music listening room for local and touring songwriters in Lakewood, CO called “The Chimney Place.” ", "otherInfo": "No event info available"}, {"Address": "~43rd St, Boulder, CO 80305", "Artist": "Black Market Translation ", "ArtistImage": "https://photos.bandsintown.com/thumb/9076350.jpeg", "Coordinates": [39.98532360000001, -105.2445356], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Rad-ish Collective", "moreBioInfo": "Quantum rock&roll : the simultaneous discovery and expression of flow.", "otherInfo": "No event info available"}, {"Address": "10360 Colorado Blvd, Thornton, CO 80229", "Artist": "WarCrown ", "ArtistImage": "https://photos.bandsintown.com/thumb/11556089.jpeg", "Coordinates": [39.8833031, -104.9395242], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Doom Metal, Metal, Progressive Metal", "Time": "7:00 PM", "Venue": "Swinging Noose Productions presents: Conquer Everest release: The Sonder Ledge 2.0 with Leveler, War Crown, Darconigan and Bone Creature.", "moreBioInfo": "Rising from the ashes of previous musical projects, Guitarist Caleb Byars, and Bassist Sin Scott were determined to make something great. After spending a few months together writing music and figuring out what would eventually be the WarCrown sound, they enlisted the talents of singer “Grisly” Evan Chance, and thus, WarCrown was officially born. While on the search for a drummer, the pandemic hit, and WC was on a temporary hiatus during the quarantine. As the 2020 social and political climate deteriorated, WC performed sans drummer in the ‘Death in my Metal, not in my Streets’ Livestream fundraiser with other well-known Denver-based metal acts. The band finally found exactly what they were looking for, in legendary Drummer Angel Odinsson. After several months of further writing and recording, WarCrown exploded onto the Denver metal scene in the later winter of 2021.", "otherInfo": "No event info available"}, {"Address": "1451 Cortez St, Denver, CO 80221", "Artist": "Faster Pussycat ", "ArtistImage": "https://photos.bandsintown.com/thumb/7526072.jpeg", "Coordinates": [39.8310474, -105.0041956], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Metal, Rock, Punk, Glam Metal, Sleaze Metal, Rock And Roll, Hard Rock", "Time": "7:00 PM", "Venue": "The Venue", "moreBioInfo": "Faster Pussycat is a hard rock band formed in the mid 80's often associated with the glam metal scene, and belonging to the sleaze subgenre along side other late 80's bands like Guns N' Roses, L.A. Guns, and Dangerous Toys. The name Faster Pussycat was taken from a 1965 film called \"Faster, Pussycat! Kill! Kill!\" The name was originally meant for Tracii Guns' new band after leaving Guns N' Roses. After getting financial backing if he used the L.A. Guns name again, Tracii's friend Taime Downe took the name and formed Faster Pussycat with lead guitarist Brent Muscat, the only member to perform on all Faster Pussycat releases besides Taime. They released their self titled debut in 1987, as well as their follow up \"Wake Me When It's Over\" in 1989, during the last years of glam metal's commercial viability. They reached their commercial plateau with their hit ballad \"House of Pain\" off of their second album, which managed to go gold. With the rise of grunge in the early 90's, Faster Pussycat's style of music fell out of favor, despite having little in common with the chart topping glam bands at the time, such as Warrant and Slaughter. They released their third album \"Whipped!\" to little success in 1992. Sensing the change in musicial tastes, they disbanded and went on to various other projects, with frontman Taime Downe going onto form an industrial rock band called Newlydeads. In 2001, Taime released \"Between the Valley of the Ultra Pussy\" with some former members of Faster Pussycat under the moniker, which contained newer versions of older songs. The band has since reformed and has recorded a new album, \"The Power and the Gloryhole,\" which was released in 2006. The band's style of music has shifted from the Aerosmith influenced rock to a more industrial one, much like Taime's Newlydeads.", "otherInfo": "With Local support One Track Mind and Conaxx"}, {"Address": "918 W 1st Ave, Denver, CO 80223", "Artist": "Shakedown Street ", "ArtistImage": "https://photos.bandsintown.com/thumb/7542998.jpeg", "Coordinates": [39.7176452, -104.9992656], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock", "Time": "7:30 PM", "Venue": "So Many Roads Museum and Brewery", "moreBioInfo": "One of the longest running Grateful Dead tribute bands in the world, Shakedown Street, makes its home in and around the Rocky Mountain region of North America. Spawned from jam sessions at the Ancient Mariner bar in Manitou Springs, Colorado in 1987, Shakedown Street quickly grew in popularity, and garnered a legion of loyal fans who refer to themselves as \"Shakeheads\". In a few short years, throngs of \"Shakeheads\" could be found on the highways and byways of the Rocky Mountains, making their way to another Shakedown Street show. In the live music venues of the Rocky Mountains, there are only a few bands that are able to consistantly draw large audiences. Shakedown Street accomplishes this year after year by embodying the Grateful Dead ethos of improvisation and discovery, while maintaining an intimacy and open repoire with its audience. A whole new generation of \"Shakeheads\" has discovered the positive and collaborative energy found at a Shakedown Street concert. Longtime fans are thrilled to find the band sounding hotter than ever, and having the time of their lives! The band's personnel is comprised of some of the most creative musicians from some of the finest Colorado bands: Josh Rosen (Lead Guitar and Vocals) from Fort Collins; Smokey Joe Weisiger (Keyboards/Organ and Vocals) from Arvada; Edwin Hurwitz (Bass) from Boulder; Scott Swartz (Rhythm Guitar and Vocals) from Moffat; and Christian Teele (Drums and Percussion) from Boulder. Throughout the years, Shakedown Street has had the privilege of sharing the stage with many iconic musicians. Some of these include former Grateful Dead members Vince Welnick and Tom Constanten, as well as Melvin Seals of the Jerry Garcia Band, and Grateful Dead technician and keyboard wizard Bob Bralove. Others include Los Lobos' David Hidalgo, The JGB Band, Hot Tuna, The David Nelson Band, NRPS, Big Head Todd and the Monsters, Merl Saunders, Mitch Ryder, Spirit, Jerry Jeff Walker, The Fabulous Thunderbirds, and Big Brother and the Holding Company. With a working repertoire of over two hundred songs, Shakedown Street is able to perform multi night runs without repetition, drawing equally from early and modern Grateful Dead songs, and weave together unique and unforgettable performances. Believing that it is good to give back to the planet, Shakedown Street performs charity and benefit engagements on an ongoing basis to help their local and global communities. With 2012 marking the beginning of Shakedown Street’s year-long 25th Anniversary Party, big plans are in the making. The band will be performing special celebratory shows throughout the year, that will feature guest appearances of many well known Colorado and national artists. Don’t be surprised to find Shakedown Street in your neighborhood soon!!! Colorado's Gathering Place For Deadheads Since 1987", "otherInfo": "No event info available"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Charley Crockett ", "ArtistImage": "https://photos.bandsintown.com/thumb/8278403.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz, Honky Tonk, Zydeco, Country", "Time": "8:00 PM", "Venue": "Globe Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "11160 Pikes Peak Drive, Parker, CO 80138", "Artist": "Immortal Sÿnn ", "ArtistImage": "https://photos.bandsintown.com/thumb/11113841.jpeg", "Coordinates": [39.51359799999999, -104.762604], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Tommy Vext of Bad Wolves w/ Immortal Sÿnn, Beyond Influence, The Conflict Between", "moreBioInfo": "Immortal Sÿnn is a 5-piece heavy metal band from Denver, CO. In a sea of modern cookie-cutter acts, the band tries to retain a more familiar and old school sound that propelled bands of the 70s and 80s to superstardom. Taking their cue from thrashers such as Exodus and Megadeth, as well as NWOBHM legends like Judas Priest and Motörhead, Immortal Sÿnn creates a perfect mixture of speed and grit, but can also knock you out with mid-tempo riffs from hell. Immortal Sÿnn was formed in 2004 by guitarist and sole original member Tony Z. After constant line-up changes and poorly-recorded demos, Tony decided to put the band on hiatus after joining Denver rock band, Phoenix Rising (later called Wild Angelz and, finally, Devoutcast), in May 2007. Tony revived Immortal Sÿnn in July 2012 with the looming collapse of Devoutcast. He recruited Devoutcast singer Alex Giebler to record the band’s first single, “Whiskey”, in March 2013. It was an instant hit on online radio shows such as The Friday Night Feature, and received airplay on terrestrial stations such as KILO 94.3 in Colorado Springs as well as KRCX 93.9 and 107X in Denver. A completely new line-up emerged in 2015 when the band released their first EP, Barfly, with new singer, Chase McClellan. The EP contained the aforementioned single, “Whiskey”, as well as their first recorded cover, Pantera’s “We’ll Meet Again”. The next year, a minor success came for the band when they released their cover of The Chainsmoker’s “Don’t Let Me Down” on youtube and itunes. August 2017 saw the band’s first full-length album, Machine Men, which departs from the group's early hard rock style and delves more into the territory of thrash and traditional metal. That month also saw an explosion of recognition for the band after founder and guitarist, Tony Z, was featured prominently in many local, national, and international news outlets while he attended the Taylor Swift trial in Denver, CO. Immortal Sÿnn’s goal is to bring metal to the masses, and to show the world that the sounds of yesteryear are still alive and well.", "otherInfo": "TOMMY VEXT OF ' BAD WOLVES ' HITS DENVER at The Hottest new venue in town.\n\nWith over 500 Million combines hits on youtube. Multi Platinum Artists Tommy Vext hit #3 on the Metal Charts with this amazing Tribute song. Plus many more.\n\nThe Wild Goose Event Center:\n-TOMMY VEXT OF BAD WOLVES\nPERFORMING ALL OF THE BAD WOLVES HITS AND ORIGINAL !\nSaturday, July. 24th, 2021\n18+ w/ I.D,\n7:00 PM doors!\n\nLimited $25 advance tickets are available now:\n* With tour support from\n- Beyond Influence\n- Immortal Synn\n- The Conflict Between\n\n18+ with I.D | 7:00 PM DOORS | 8:00 PM Show.\nLocation: The Wild Goose Event Center\n11160 Pikes Peak Drive\n\nA Bands 4 Bands Entertainment Production\nwww.facebook.com/b4bentertainment\n\n-Table Packages Include:-\n* General Admission\n* Wait staff\n* Table for 4 or 6\n(Limited front row tables are available so do not wait!!)\n\nSee you on the stage!!!"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Jenny Don't And The Spurs ", "ArtistImage": "https://photos.bandsintown.com/thumb/11464708.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Honky Tonk, Cowpunk, Ameripolitan, Outlaw Country, Western Outlaw", "Time": "8:00 PM", "Venue": "Globe Hall ", "moreBioInfo": "\"You've already got a couple of Spurs' past bands in your collection anyway, with rodeo rider turned musical revivalist Jenny Don't fronting a band featuring ex-members of the Wipers and Pierced Arrows. Together, they keep shattering misconceptions country folks have about punk rockers and vice versa.\" -Bobby More // Stomp and Stammer \"Jenny Don't and The Spurs are a fantastic independent country and western quartet who sing heart wrenching songs about emotional turmoil wit passion and honesty. The quartet's albums will make classic country western fans extremely proud.\" - Jersey Beat Since their inception in 2012, the Spurs have kept a relentless schedule of recording, playing locally, and touring. After nearly 500 live appearances in almost a dozen countries, and with a slew of albums and singles to their name, Jenny Don’t And The Spurs are just getting warmed up. The Spurs were founded one cold, winter’s evening by Jenny and Kelly. Jenny had been fronting her own band, DON’T, for some time, as well as playing the occasional solo acoustic set here and there. Kelly, who had been in a slew of Portland punk bands since the 80’s, and who had spent the previous several years balancing a grueling touring schedule playing drums with the garage rock trio PIERCED ARROWS and bass with Portland punk-rock destroyers P.R.O.B.L.E.M.S., and wanted to switch gears a bit. After the concept of forming a raw, real, and back-to-the-roots country band had taken hold, it wasn’t long before the couple was rehearsing a seminal set of standards by such influential early country crooners and outlaws like Patsy Cline, Loretta Lynn, Ernest Tubb, and Hank Sr., as well as a sprinkling of originals. It was only a few weeks later that Kelly’s bandmates Fred and Toody Cole got wind of the developing musical project that was taking form in Jenny and Kelly’s kitchen and decided to call their bluff by giving them an unsolicited support slot on an upcoming show featuring the Cole’s own solo two-piece act. Not having anticipated such a high-profile live appearance as a first live outing, and feeling like the guitar-and-bass-only lineup that the band had started life as was lacking something on the rhythm end of things, they decided to ask their friend Sam Henry to join them on drums. Sam, who in addition to being Jenny’s bandmate in DON’T and sometimes solo-set-collaborator, had already had a long, well respected career as one of Portland’s best drummers, having played with such first-generation punk bands as the Wipers, The Rats and Napalm Beach. After a couple of weeks of practice, the debut live appearance of the band went off without a hitch and the core lineup of Jenny Don’t And The Spurs was born. The trio of Jenny, Kelly, and Sam existed in this form for the first year-an-a-half or so of the band’s existence, playing whatever local venue would take them – bars, clubs, porches, basements, backyards, and even a bookstore. This worked well for a while, and occasionally the Spurs would enlist talent from a pool of several friends to sit in on lead guitar or lap steel. The addition of a second guitar rounded out the sound of the band to the point where Jenny and Co. decided to make it a permanent part of the band’s lineup. After a couple of false starts and a bit of difficulty finding a fourth member who could commit to the Spur’s sometimes grueling touring schedule, the incredible Christopher March became a member of the family in early 2017. Christopher brought with him a wealth of talent and live gig experience, having spent years playing on the Northwest Country, Rockabilly, and Honky-Tonk circuit. Now, with several West Coast and North American tours, as well as three European tours and hundreds of local shows under their tooled-leather Western belts, the Spurs are gearing up for the release of their third full-length studio album. The Spurs are a musical force to be reckoned with, the intensity and energy of their live set, and dazzling Western outfits handmade by Jenny herself, the band is a must-see for anyone who enjoys spirited garage-infused country music played with sincerity and raw conviction.", "otherInfo": "Just announced Charley Crockett and Jenny Don't and the Spurs perform two nights at Globe Hall \ncheck the Globe Hall site for tickets and updates https://globehall.com"}, {"Address": "Parker, Parker, CO 80138", "Artist": "Tommy Vext ", "ArtistImage": "https://photos.bandsintown.com/thumb/11495436.jpeg", "Coordinates": [39.5186002, -104.7613633], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Wild Goose Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "2032 14th St, Boulder, CO 80302", "Artist": "Hunter Burnette ", "ArtistImage": "https://photos.bandsintown.com/thumb/9326272.jpeg", "Coordinates": [40.0191723, -105.2773556], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Boulder Theater", "moreBioInfo": "Hi everyone, my name is Hunter Burnette, a singer/songwriter out of Denver, Colorado. Give my music a listen and my page a like to keep up with my latest.", "otherInfo": "Cole Scheifele with Hunter Burnette"}, {"Address": "60 S Broadway, Denver, CO 80209", "Artist": "Anything Box ", "ArtistImage": "https://photos.bandsintown.com/thumb/8119855.jpeg", "Coordinates": [39.715383, -104.9871239], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Synthwave, Alternative, Retrowave, Synth Pop, Indie Electronic, New Wave, Dance-pop, Indie Pop, Electronic, Idm, Electro-pop", "Time": "8:00 PM", "Venue": "HQ", "moreBioInfo": "El nombre \"Anything Box\" se puede traducir como \"La caja que contiene cualquier cosa\". El nombre viene de un libro de ciencia ficción que fue encontrado en la librería. En la novela, una niña tiene el poder de cambiar su mundo simplemente mirando al espacio entre sus manos. Ese concepto es la misma inspiración de el grupo que adopto esa frase. Surrealismo total. Estás teniendo un sueño. En el podes estar en cualquier lugar. Podes llegar a ser quien quieras ser. Puedes ir de viaje por el tiempo. Puedes sentirte en el amor unido con todo. Y hay esta música que toca bien fuerte en tu sueño. Esta música te hace sentir cosas nuevas. Te sorprende. Estamos ahí con vos en ese sueño. Esa música es Anything Box.", "otherInfo": "w/ Eloquent + Guests"}, {"Address": "4164 Clydesdale Pkwy, Loveland, CO 80538", "Artist": "Twenty Hands High ", "ArtistImage": "https://photos.bandsintown.com/thumb/8865119.jpeg", "Coordinates": [40.4353569, -104.9875803], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Southern Rock, Red Dirt, Country", "Time": "8:00 PM", "Venue": "The Boot Grill", "moreBioInfo": "A modern country & southern rock band with a tip of the hat to classic country and TX/OK red dirt.", "otherInfo": "LIVE MUSIC - country & southern rock. NO COVER"}, {"Address": "14715 W 64th Ave Units A&B, Arvada, CO 80004", "Artist": "Many Mountains ", "ArtistImage": "https://photos.bandsintown.com/thumb/11475830.jpeg", "Coordinates": [39.8147888, -105.1637115], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie, Americana, Folk Rock, Alternative Folk, Indie Rock", "Time": "8:00 PM", "Venue": "LUKI Brewing 1 year anniversary celebration! ", "moreBioInfo": "Many Mountains is a Folk-Rock Duo from Colorado. Forming in 2013, KR Nelson and Dustin Moran bring a genre-bending sound to folk-rock through their unique song arrangements and writing styles. From Gillian Welch to The Rolling Stones, the range of musical influences trickle through their music to create something fresh yet familiar. A kaleidoscope of sound, songs are interlaced with vocal harmonies and leads that alternate between the two songwriters. Each with perspectives on the relationships we have with ourselves and with others - bringing truths to the table, facing who we are, and the constant state of becoming. Dustin adds textured and ambient electric guitar, often improvising with jazzy temperance, over KR’s rhythmic acoustic. Having shared the bill with acts like Valley Queen, Michigan Rattlers, Liz Cooper & The Stampede, Paul Cauthen, and Dylan LeBlanc, their sound transcends ordinary genre limitations. Supported by the sonic landscape they create, you’ll be on a journey with Many Mountains.", "otherInfo": "There's gonna be some good times and celebrations at LUKI Brewing in Arvada for their 1-year anniversary party! We'll be capping the night off with our performance :)"}, {"Address": "11160 Pikes Peak Drive, Parker, CO 80138", "Artist": "Beyond Influence ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.51359799999999, -104.762604], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Hard Rock", "Time": "8:00 PM", "Venue": "The Wild Goose Event Center", "moreBioInfo": "No artist bio available", "otherInfo": "TOMMY VEXT OF ' BAD WOLVES ' HITS DENVER at The Hottest new venue in town.\nThe Wild Goose!"}, {"Address": "2032 14th St, Boulder, CO 80302", "Artist": "Cole Scheifele ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [40.0191723, -105.2773556], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Boulder Theater", "moreBioInfo": "No artist bio available", "otherInfo": "Cole Scheifele with Hunter Burnette"}, {"Address": "11160 Pikes Peak Drive, Parker, CO 80138", "Artist": "The Conflict Between ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.51359799999999, -104.762604], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Wild Goose Event Center", "moreBioInfo": "No artist bio available", "otherInfo": "TOMMY VEXT OF ' BAD WOLVES ' HITS DENVER at The Hottest new venue in town.\nThe Wild Goose!"}, {"Address": "3559 Larimer St, Denver, CO 80205", "Artist": "Sam Tallent ", "ArtistImage": "https://photos.bandsintown.com/thumb/6343652.jpeg", "Coordinates": [39.767909, -104.973746], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Denver Comedy Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Known for whip-quick wit and rollicking improvisations, Sam Tallent is one of the sharpest, most original rising talents in comedy today. For the last 10 years, he has performed at least 45 weekends annually across America, Canada and France. Called the absurd voice of a surreal generation by the Denver Post, Sam is beloved by fans of contemporary comedy. He was a New Face at the 2019 Just for Laughs Montreal Comedy Festival, he won his battle on Comedy Centrals Roast Battle, hosted the Denver episode of VICELANDs Flophouse and appeared on the Chris Gerhard Show to impress a girl.His critically acclaimed debut novel Running the Light - heralded as the definitive novel about stand up comedy (Marc Maron, WTF) - was published by Too Big to Fail Press in 2020 and his short fiction has been published on VICE.com and in BIRDY magazine. He lives in Colorado with his wife and his dog.*the price per ticket $17 - $20, must buy quantities of 2 - 6 tickets due to social distancing guidelines so bring your friends and split the tab!Shows are indoors in the back of Colorado Sake. Full service dining from Denver Sushi House- Sushi, Fried Rice & Dumplings, and of course Colorado Sake!"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Béla Fleck ", "ArtistImage": "https://photos.bandsintown.com/thumb/8671933.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Bluegrass, Jazz", "Time": "8:00 PM", "Venue": "Béla Felck & Abigail Washburn at RockyGrass Festival 2021", "moreBioInfo": "Béla Fleck (born July 10, 1958 in New York City, New York) is an American virtuoso banjo player. He is most well known for his work with the band Béla Fleck and the Flecktones, which he has described as \"a mixture of acoustic and electronic music with a lot of roots in folk and bluegrass as well as funk and jazz.\" Fleck, who is named after famous Hungarian composer Béla Bartók, was drawn to the banjo when he first heard Earl Scruggs play the theme song for the television show Beverly Hillbillies. He received his first banjo at age fifteen from his grandfather (1973). Later, Fleck would enroll in New York City's High School of Music and Art where he studied French horn. Almost immediately after high school, Fleck traveled to Boston to play with Jack Tottle and Mark Schatz in Tasty Licks. It is with Tasty Licks that Fleck played on his first major album. During this period, Fleck released his first solo album (1979) \"Crossing the Tracks\". It was Fleck's first foray into progressive bluegrass composition. Fleck would play on the streets of Boston with bassist Mark Schatz until the two formed Spectrum: the Band in 1981. Fleck toured with Spectrum until 1981. That year, Fleck was asked by Sam Bush and company to join New Grass Revival. Fleck performed with New Grass Revival for nine years. During this time, Fleck recorded another solo album, \"Drive.\" It was nominated for a Grammy Award in the then first-time category of Best Bluegrass Album (1988). After a 1988 phone call with bassist Victor Wooten, Fleck and Wooten formed Béla Fleck and the Flecktones, rounded out with harmonica player Howard Levy and Wooten's percussionist brother Roy \"Future Man\" Wooten, who plays synthesizer-based percussion. Saxophonist Jeff Coffin joined the group with the album \"Left of Cool\". With the Flecktones, Fleck has been nominated for and won several Grammy awards. Fleck has shared Grammy wins with Asleep at the Wheel, Alison Brown, and Edgar Meyer. He has been nominated in more categories than any other musician, namely country, pop, jazz, bluegrass, classical, folk, and spoken word, as well as composition and arranging.", "otherInfo": "No event info available"}, {"Address": "124 E 4th St #5502, Loveland, CO 80537", "Artist": "Jay_Martin ", "ArtistImage": "https://photos.bandsintown.com/thumb/11403490.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Blues, Pop, Reggae", "Time": "8:30 PM", "Venue": "Pourhouse", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "Neon  Brown ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "No artist bio available", "otherInfo": "The Healing Tree and Hi-Dive presents, Pantones!\nDenver's only all-vinyl, boogie, funk, disco, house, and soul party."}, {"Address": "2009 Larimer St, Denver, CO 80205", "Artist": "Control Freak ", "ArtistImage": "https://photos.bandsintown.com/thumb/8555172.jpeg", "Coordinates": [39.7533249, -104.9925328], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Marquis Theater", "moreBioInfo": "Control Freak is a party rock band from Orlando that knows how to have a good time and makes sure their audience does too. By covering a wide variety of music including Top 40, 80's, Classic and new rock, the \"Freaks\" have quickly become a crowd pleaser. Armed with incredible guitarists, Tom Coyle & Frank Leyenaar can execute technically challenging songs and change the musical mood in an instant. On lead vocals, Gene Henry can belt out a power ballad one minute and tear into some straight forward rock the next. Backed by Kimberly Leyenaar on bass, keyboards & vocals, and Gene Knapp on drums/vocals, they are a favorite band at many local clubs in the greater Orlando area. Control Freak's style always leaves their audience wanting more and their drive for musical perfection means there is no lack of rock virtuoso here! Control Freak has built a huge following in Central Florida as the innovative band not only to watch, but to be! So catch us if you can...... WE CARE ABOUT YOUR ROCK NEEDS!!!", "otherInfo": "Please Note: Every Saturday in July, Amplitude Presents ROAD TO BASS OPS at the Marquis Theatre, the official countdown parties to the return of BASS OPS at Club Vinyl Basement, relaunching in August 2021. SATURDAY JULY 24TH 2021 @ Marquis Theatre CONTROL FREAK Doors: 9:00 PM Show: 9:00 PM THIS SHOW IS: 16+ All support acts and times subject to change"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "Neon Brown ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "No artist bio available", "otherInfo": "The Healing Tree and Hi-Dive presents, Pantones!\nDenver's only all-vinyl, boogie, funk, disco, house, and soul party."}, {"Address": "1201 S Pearl St, Denver, CO 80210", "Artist": "The Tuffenuffs ", "ArtistImage": "https://photos.bandsintown.com/thumb/11348535.jpeg", "Coordinates": [39.69461940000001, -104.9808251], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Linda Ronstadt, Soul, Blues, Originals, Rock", "Time": "9:00 PM", "Venue": "The Tuffenuffs @ Lincoln's Roadhouse", "moreBioInfo": "The combination of Stacey’s beautiful vocals, Danny’s skills on the keys, Carleton's excellence on the drums, and their perfect harmonies allow for their performance to operate in utter peace; every single soul who witnesses this trio are in awe and know that the bar has been set.", "otherInfo": "No event info available"}, {"Address": "25690 E Quincy Ave, Aurora, CO 80016", "Artist": "Buckstein ", "ArtistImage": "https://photos.bandsintown.com/thumb/8543737.jpeg", "Coordinates": [39.6339352, -104.6921712], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "9:00 PM", "Venue": "Arapahoe County Fairgrounds Event Center", "moreBioInfo": "“I don’t like country music but I like you.” He gets that a lot. Randomly. He can’t really tell you why. Maybe it’s that “no-fear-of-the-edge” mentality that hooks the non-country-lovin’ folk while he manages to maintain a balance of traditional vibes that will remind you of a modern day John Wayne. He's a 6’4” bass-baritone powerhouse who once hit 200 million television sets worldwide as a contestant on “American Idol.” With each performance he fights to create something electric, something that grabs you and makes you look up. Maybe that’s it. Maybe that’s why some people don’t like country and yet... they like him. The most common question a singer will be asked is, “When did you start singing?” Buckstein has always had the same answer: “When I found out that the chicks dig it.” Sounds like a punchline but it’s actually the truth. He was 13, at summer camp, trying to figure out how to meet girls like everyone else. A couple of girls were singing “Amazing Grace” and he shyly scooted up next to them and started singing along. “When they found out I could sing they immediately introduced me to all the other girls in the camp,” he grins. “I’ve been singing ever since.” His love of country music is thanks to his father who played it all the time when he was young even though he hated the genre. “It takes one good country song to hook ya!” Buckstein warns. “Mine was probably ‘Thunder Rolls’ by Garth Brooks or ‘This Ain’t No Thinking Thing’ by Trace Adkins. I heard those tunes when I was about 11 or 12 and something just clicked—I was hooked.” He continued to grow up a country boy at heart often retreating to the Rocky Mountains of Colorado. However, since he always lived in the city, the rest of his musical tastes fall outside of the expected box, running a gamut that includes blues, rock, rap, classics from the ’50s, and whatever was on Top 40 radio at any given time. Buckstein studied theater in college, earning his BA from California State University, Fullerton. Prior to “American Idol” he had moved to LA to pursue a career as an actor. “Big surprise, it wasn’t going anywhere,” he confides. “One day a few friends of mine went to the ‘American Idol’ auditions, which was the hottest show on TV at the time. They wanted some company so I went along. I got through and they didn’t. It was Idol that set me on a different path.” After appearing on the finale of “American Idol” in Season 5, he returned to Denver with music on the brain. He started singing with whomever would back him up, growing along the way, learning his craft, year after year, little by little, making friends, music, mistakes, and big moves, all leading him to today. “Those years were invaluable,” he says. “They call it ‘paying your dues.’ It always sounded like a bad thing. But I found out paying your dues can be some of the most fun you’ll ever have.” Over the past few years Buckstein has traveled all over Colorado and the Midwest region performing for soon-to-be-lifelong fans. He admits to laughing to himself when other performers come to Colorado and complain about how hard it is to sing at such a high altitude. Buckstein, being a true native of the 5280 state, has never had a problem. With the help of his band, “The Heard” (his rotating roster of professionals), he has rocked crowds opening for Charlie Daniels, Dustin Lynch, Old Dominion, Eli Young, John Michael Montgomery, Mark Chesnutt, Vanilla Ice, and many, many others. He’s gained local fame as a regular guest star on Denver’s hottest country station 98.5 KYGO and also as the writer and performer of “The Grizzly Rose,” which is a popular song about the famous Denver nightclub, and he produced a music video for the track. Buckstein wrote the song about his personal experiences after his first week playing at the legendary venue. He began, as most do, singing covers of all of the artists he was most influenced by. Buckstein embraces covers and thinks that no matter what, “there should always be room in your set to pay homage to the artists and songs that have touched your life. Even when you’re selling out arenas with your own stuff you can do that. I have a saying: ‘Today we play the songs that others have written… so that someday we may play the songs that we have written… so that someday others may play the songs that we have written.’ You gotta put those pauses in there for dramatic effect,” he laughs. Buckstein is currently embarking on his next chapter with his newest EP, Country Side. “There’s a lot of heart in these five tunes,” Buckstein says. “Making them has been a very valuable experience. It has shown me not only where I am but where I want to go from here.” Buckstein’s goal is to bring soul to everything he does. “What people seem to respond most to in my live performances is my passion, so I worked hard to bring that passion to the record. My sound gets compared a lot to the great bass-baritones of my time: Trace Adkins, Toby Keith, Josh Turner, and Chris Young. But I personally hate comparisons. I don’t think Josh Turner wants to hear he sounds like Don Williams,” he laughs. “I just wanna sound like me. If my sound were a drink, I'd like to think it would come in a bottle with a cork instead of a twist cap. And I'd like to say it's got a crisp bite with a smooth finish.” He gives all the thanks in the world to his fans and his crew: “Without the people who support me, on stage and off, this would all be for nothing. I try to always surround myself with good people who want to make good music for other good people.” And if you’re still wondering, it’s pronounced “Buck-steen.” www.bucksteinmusic.com", "otherInfo": "No event info available"}, {"Address": "2637 Welton St, Denver, CO 80205", "Artist": "Of the Trees ", "ArtistImage": "https://photos.bandsintown.com/thumb/11565133.jpeg", "Coordinates": [39.75453640000001, -104.9788397], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Ambient, Other, Trip Hop, Dubstep", "Time": "9:00 PM", "Venue": "Official Global Dance After Party feat. Yheti b2b Of The Trees", "moreBioInfo": "No artist bio available", "otherInfo": "📣 LAST MINUTE NEW SHOW! On sale NOW. THIS Saturday 7/24!\n\nOfficial Global Dance Fest After Show ft\nYheti b2b Of The Trees (Ballroom) | Smoakland w/ Kyral x Banko (Other Side)."}, {"Address": "2430 S Havana St, Aurora, CO 80014", "Artist": "conjunto azabache ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.67226429999999, -104.8652551], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Regional Mexican Music, Latin", "Time": "9:00 PM", "Venue": "Stampede", "moreBioInfo": "No artist bio available", "otherInfo": "Tierra Cali, Conjunto Azabache, Viry Sandoval y mucho más!"}, {"Address": "3602 E Colfax Ave, Denver, CO 80206", "Artist": "Nolen ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7399564, -104.944749], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Lost Lake Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "2430 S Havana St, Aurora, CO 80014", "Artist": "Tierra Cali ", "ArtistImage": "https://photos.bandsintown.com/thumb/8624114.jpeg", "Coordinates": [39.67226429999999, -104.8652551], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Regional Mexicano", "Time": "9:00 PM", "Venue": "Stampede", "moreBioInfo": "Síguenos en nuestras redes sociales: TWITTER: @tierracalireal INSTAGRAM: tierracali_oficial Fue el año de 1998 el que marcó la vida de cinco hermanos oriundos del rancho “Las Juntas de Poturo”, municipio de Churumuco, Michoacán, pues con la idea de hacer música que quedara grabada para siempre en el gusto de la gente y con grandes esfuerzos iniciaron un sueño; Dos años después es decir en el 2000, en Uruapan, Michoacán nacería la agrupación que hoy es conocida como TIERRA CALI, agrupación formada por los hermanos Plancarte Farfán, quienes han logrado conquistar con su talento y carisma a un público que sabe reconocer cuando un artista se entrega en el escenario tal como lo hacen ellos. Hay que mencionar que la originalidad de la música de TIERRA CALI representa el resurgimiento de la música grupera que estuviera representada por grandes agrupaciones. La música de TIERRA CALI es un movimiento de música que no representa el sentimiento de una sola región, sino que en todo el país es bien aceptado. No es como el “norteño” de Monterrey , Chihuahua o Sonora, no es como “la banda” de Guadalajara, Sinaloa o Sonora, no es como el “tropical” o “sierreño”; Es simple y llanamente GRUPERO. TIERRA CALI está conformado por; Arcadio y Armando Farfán en los teclados, José Cruz en la segunda voz, Humberto en la primera voz, Efraín en la batería y Rafael en el bajo. El nombre TIERRA CALI lo adoptan por el orgullo de sus raíces calentanas ya que hacen referencia a su querida “Tierra Caliente” conformada por una parte de Michoacán y Guerrero. Entre las innovaciones del grupo se puede destacar la creación del “baile del sacadito” y la confección del sombrero huetameño. Buscando oportunidades e iniciando sus presentaciones en lugares cercanos a Michoacán, fue hasta el 2001 cuando ingresan a la compañía disquera, Discos Cuidad, sello con el que realizan siete producciones discográficas. Fue con temas como “La Milpa”, “El Pescado nadador” y “No pares no…” que TIERRA CALI se empezó a dar a conocer en su estado; pero cuando hay calidad se traspasan fronteras, logrando su consagración a nivel nacional e internacional, convirtiéndose en uno de los máximos y más reconocidos exponentes de la música grupera logrando colocar sus temas en los primeros lugares de popularidad en la radio de México y E.U.A. y entre los que se encuentran “Amor te amo”, “Lloraras” y “Vuelve conmigo”, de la inspiración de Humberto Plancarte. Aunque ya el grupo era reconocido, fue en el 2005 cuando TIERRA CALI alcanzó un gran éxito con su álbum “Amor te amo”, el cual los llevó a ser nominados al premio Billboard de la Música Latina en la categoría de Mejor Álbum Regional Mexicano del Año Nueva Generación. En el 2006 nuevamente Billboard los nominó como “Mejor Agrupación Nueva” del género regional mexicano por el material “Amor te amo” con el que vendieron más de 200 mil discos, con el cual además se hicieron acreedores a un Disco de Platino y permaneciendo desde entonces en todos en los charts radiales. Para el 2007, ya en pleno crecimiento musical, TIERRA CALI lanza a la venta uno de sus discos más exitosos en su corta pero fructífera carrera, “Enamorado de ti” del que se desprenden los sencillos “Donde quiera que estés” y “Enamorado de ti” con los cuales lograron el reconocimiento de la industria musical. Con “Enamorado de ti”, su quinto álbum, les dio la continuidad necesaria para seguir en el gusto de la gente habiendo estado en las listas de Billboard y Monitor Latino dentro de los Hot Latin Tracks más sonados del 2007 con tres de sus temas (“Donde quiera que estés”, “Enamorado de ti”, y “Lloraras”). Lo cual, también les permitió hacer una extensa gira promocional y de conciertos durante las cuales visitaron las ciudades más importantes de EE.UU., cosechando éxitos en taquilla y a nivel radial. En el año 2008, TIERRA CALI logra consolidar su carrera al posicionar tres de sus discos entre los Top 100 en la lista de ventas de Soundscan y el Hot Latin Albums de la revista Billboard, consiguiendo así lo que muy pocos artistas han logrado a lo largo de toda su carrera. En ese momento, su compañía disquera Vene Music, el sello discográfico de Venevision International (una compañía global de entretenimiento de la Organización Cisneros), les hicieron entrega de un Disco de Platino por la ventas de “Enamorado de ti”, con el que sobrepasaron las cifra de 100,000 unidades vendidas en EE.UU.; además de dos Discos de Oro por las ventas obtenidas por el disco “Más allá de la distancia” y la compilación “Grandes éxitos de Tierra Cali”. Fue también en el 2008 cuando TIERRA CALI logra el premio de “Mejor Agrupación de Tierra Caliente”, otorgado por Los Promotores Unidos USA. En Julio del 2009 hacen el lanzamiento de su séptima producción titulada “Si tú te vas”, logrando posicionar dentro de los Top 20 de Billboard con el tema homónimo del CD, el cual logra vender más de 60,000 copias, por lo que el grupo se hace acreedor a Disco de Oro y certificaciones de la RIAA por sus altas ventas, lo cual sin duda cada vez es más complicado por la situación que existe en estos días con la industria discográfica y la piratería. Para el 2010 TIERRA CALI realiza una exitosa gira por Estados Unidos y México, la cual sirve para promocionar su álbum “Maldito amor” del que se desprendió “En cambio tu” como primer sencillo, y con el que también se presentan en los principales programas de radio y televisión en Estados Unidos, resaltando la entrevista que les hicieron en el show de Don Francisco que salió al aire en abril del 2010 y en el que se mostró el lado humano de TIERRA CALI, tocando las fibras sentimentales de todos los televidentes al ver lo difícil que ha resultado al grupo llegar hasta donde están hoy. Para TIERRA CALI, “Maldito Amor” fue la octava producción de su carrera, el cual constó de 10 temas en el que incorporaron baladas, rancheras, pero sin dejar el corrido y su baile clásico de “El sacadito”. Nueve de los temas fueron autoría del mismo Humberto Plancarte y el ritmo y sabor que les imprimen a la música Efraín, Arcadio, Rafael, José Cruz y Armando Farfán. “Maldito Amor” debutó en su primera semana de lanzamiento en 3er Lugar Nacional de ventas (Estados Unidos y Puerto Rico), manteniéndose por varias semanas en los \"Charts de Ventas\" dentro de los top 40 de Soundscan. El primer sencillo en USA titulado al igual que el disco \"Maldito Amor\", se posicionó en los top 20 de Billboard dentro de las 4 semanas siguientes a su lanzamiento, permaneciendo en los charts de música hasta finales de julio del 2010; fecha en que se lanzó el segundo sencillo \"En cambio Tu\", el cual igualmente se colocó en los top 50. Con una carrera en pleno ascenso, TIERRA CALI lanzó también en el 2010 un DVD de colección con el título \"En Vivo desde la Tierra que los vio nacer\" el cual es un show que realizaron en Las Juntas de Poturo, Michoacán, de donde es originario el grupo y en el que el público puede disfrutar y recordar una noche inolvidable en la que TIERRA CALI interpretó sus mejores éxitos entregándose en cuerpo y alma al público que ese día los acompañaron. \"En Vivo desde la Tierra que los vio Nacer\" es un DVD de colección para todos los seguidores de TIERRA CALI, el cual además incluía una novedosa presentación de su caja, saliendo de los tamaños que normalmente se manejan en los empaques de este tipo de discos. Un gran logro más en la carrera de TIERRA CALI, fue sin duda en el 2010 su nominación a “Mejor Artista Grupero” en “Premios Lo Nuestro”, terna en la que compitieron con artistas de la talla de Joan Sebastian y Marco Antonio Solis, comprobando el gran momento que ha vivido el grupo y el éxito que tiene con el público. EL 2011 ES “UN SIGLO DE AMOR” PARA TIERRA CALI Bajo el título “Un Siglo de Amor”, TIERRA CALI lanzó su nuevo disco, el cual es su novena producción y al igual que sus anteriores materiales ha tenido grandes éxitos al colocarse como el disco más vendido del género regional mexicano según informaron las listas de Soundscan (el cual es el índice de Ventas de Nielsen y de Billboard Magazine), además de que su primer sencillo \"Adiós\", se colocó en los primeros lugares de popularidad. No se puede dejar de mencionar que “En un Siglo de Amor” es notoria la evolución musical del grupo, pues aunque se conserva ese estilo de \"Tierra Caliente\" y de su tan gustado \"Baile del Sacadito\", se decidieron incluir armonías e instrumentos vivos como la trompetas, acordeón y guitarras (acústicas y eléctricas) dando un sonido más fresco y abundante que sin duda ha sido del gusto de todos sus seguidores. Como un agradecimiento de los hermanos Plancarte a su público por ese gran apoyo que recibieron con su nuevo disco, que no dudaron en darle un plus al público y hacerlos participes en la selección del tema que lanzaron como segundo sencillo. Fue así que se invitó a todos los seguidores que adquirieron el nuevo cd de TIERRA CALI, para que a través del sitio oficial en Facebook del grupo, los ayudaran a escoger el tema que quería escuchar en la radio como segundo corte, resultando el ganador \"400 mil veinte años\" que sin duda fue la canción favorita del público con más del 80% de la votación. \"400 mil veinte años\", tema autoría de Humberto Plancarte, líder y vocalista del grupo y en el cual podemos disfrutar de una gran canción en la que se pide perdón por haber fallado y que dice que no le importa llorar 400 mil veinte años con tal de obtener el perdón de la mujer a la que se ama, por lo que sin duda se convertirá en la consentida de todo el público por ser un tema de despecho que refleja la situación real de muchas parejas. Hay que mencionar que ésta es la segunda producción que TIERRA CALI lanza bajo su propio sello discográfico llamado \"Victoria Music\", pues después del éxito que obtuvieron con la distribución y venta de su anterior producción \"Maldito Amor\", decidieron repetir la fórmula ahora con \"Un Siglo de Amor\". Una de las características particulares de los hermanos Plancarte es que tienen bien claro que sus canciones son la máxima expresión de su compromiso con la música de ‘Tierra Caliente’, esa música les ha servido a su vez para dar nombre a las raíces de sus sueños. Sus trabajos discográficos manifiestan el amor de la agrupación hacia su gente, su cultura y folklore. A pesar de su éxito actual, el humilde comienzo de los hermanos Plancarte sigue siendo, hoy por hoy, su mejor escuela y su mayor aliciente para continuar su lucha por consagrarse como los preferidos en el gusto de la gente, por esa razón su gira de conciertos semana a semana son un éxito. Cabe mencionar que TIERRA CALI recientemente recibió un Disco de Oro por más de 50,000!!! copias vendidas, de su más reciente producción algo que sin duda en estos momentos es todo un logro debido a la situación que la industria musical vive con la piratería, pero gracias a la calidad de la música de TIERRA CALI, el público no duda en comprar los discos originales del grupo. A pesar de que la carrera de TIERRA CALI apenas inició en 1998, eso no ha sido impedimento para que el grupo sea ya todo un sinónimo de éxito, pues cada uno de sus discos siempre han recibido por lo menos un disco de oro por sus altas ventas, por lo que en sus 12 años de trayectoria ya tienen más de un millón de discos vendidos!! los cuales se certifican con los reconocimientos de oro y platino que TIERRA CALI ha recibido y que aquí se enumeran. \"Alegría Calentana\" (2007) - Disco Multiplatino por más de 200,000 copias vendidas. \"Grandes Éxitos\" (2007) - Disco de Oro \"Enamorado de Ti\" (2007) - Disco de Oro por 50,000 copias y Disco de Platino certificado por la RIAA por ventas de más de 100,000 discos en Estados Unidos. \"Más Allá de la Distancia\" (2008) - Disco de Oro \"Si Tú Te Vas\" (2009) - Disco de Oro \"Maldito amor\" (2010) - Disco de Oro No se puede dejar de mencionar que es tal el éxito que el grupo tiene en la Unión Americana, que mientras algunos grupos se quejan de que no tienen presentaciones, TIERRA CALI consigue abarrotar los lugares donde se presenta e incluso hay ocasiones que hacen hasta 2 shows por noche, esto avalado por el premio PROMUSA que TIERRA CALI recibió como “Mejor Grupo en su Género 2009” por Los Promotores Unidos USA certificándolos como uno de los grupos más taquilleros del Momento, lo que los avala por los especialistas como un grupo verdaderamente exitoso. Las producciones de TIERRA CALI son: No pares no… El Arroyito El Pescador Nadador Alegría Calentana 12 Alegres y Calentanos éxitos Enamorado de Ti Si tú te Vas Maldito Amor UN SIGLO DE AMOR Además de 5 DVD en vivo: EN VIVO DESDE EL CARNAVAL DE HOUSTON, TX EN VIVO DESDE LA MONUMENTAL DE MORELIA, MICH. EN VIVO DESDE LA TIERRA QUE LOS VIO NACER. ÍNTIMO EN VIVO DESDE VALLE DE BRAVO. Actualmente se encuentran en la promoción de \"románticos del momento\"de donde se desprenden sencillos como \"amor real\" y actualmente se encuentran en la promoción de su más reciente éxito llamado \"El último ni el primero\".", "otherInfo": "Tierra Cali, Conjunto Azabache, Viry Sandoval y mucho más!"}, {"Address": "608 E 13th Ave., Denver, CO 80203", "Artist": "Comisar ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523774.jpeg", "Coordinates": [39.7367329, -104.9794787], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "11:00 PM", "Venue": "Your Mom's House", "moreBioInfo": "No artist bio available", "otherInfo": "11:00pm-2:00am Doors: 10:30pm 21+ Tickets are available at www.YourMomsHouseDenver.com Artists: Soohan https://www.facebook.com/soohanbeats https://www.soundcloud.com/soohan To know the music of SOOHAN is to be flooded with a rush of the vague and familiar as he deftly weaves worldwide influences into dance floor and festival-ready settings. To the unfamiliar, SOOHAN is the key holder to a catalogue which dives into and celebrates what all too often lies in the periphery. Drawing from the traditional and popular music of countless cultures, SOOHAN’s signature interpretation of dance music ignores borders, favoring a shared community dance floor experience that enthusiastically exposes audiences to new musical territory with every performance. Comisar https://www.facebook.com/ComisarMusic http://soundcloud.com/comisar Layering psychedelic bass over euphoric synths and spellbinding rhythms, Comisar often incorporates field recordings, synthesized nature sounds, and lush vocal layers into his masterful productions. Presented by Boogie Groove Entertainment"}, {"Address": "2637 Welton St, Denver, CO 80205", "Artist": "Cnopes ", "ArtistImage": "https://photos.bandsintown.com/thumb/11569363.jpeg", "Coordinates": [39.75453640000001, -104.9788397], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "11:00 PM", "Venue": "Cervantes Masterpiece Ballroom", "moreBioInfo": "soundcloud.com/cnopes", "otherInfo": "No event info available"}, {"Address": "2246 Larimer St, Denver, CO 80205", "Artist": "Sarah Christine ", "ArtistImage": "https://photos.bandsintown.com/thumb/11165529.jpeg", "Coordinates": [39.7552262, -104.989155], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Indie Folk, Indie, Pop, Folk, Indie Pop", "Time": "11:30 AM", "Venue": "Attimo Wine Presents An Exclusive Brunch Concert Ft. Sarah Christine! ", "moreBioInfo": "Colorado based up and coming singer-songwriter with proud Minneapolis roots, Sarah Christine draws influence from pop, indie, folk and electronic sounds to create a unique blend of original compositions! With a strong passion for writing, composing, producing and looping, Sarah creates music you'll find yourself playing on repeat and adding to your Spotify Playlists. Her voice and tone are alike no other and are undeniably rare! Propelled by an innate desire to base her entire musical adventure and journey on the sole theme of “In It Together”, it is the humble sense of coming together to follow dreams as a community alongside extremely hard work that will help us all achieve our goals. Sarah’s core story brings light into a stories of strength and perseverance alongside a sense of bravery to let go which is intensified through so many of her lyrics. Sarah was recently acknowledged as one of the most anticipated up and coming singer songwriters with a tour to be revealed soon for 2020! #followyourdreams #inittogether", "otherInfo": "Attimo Wine Presents An Exclusive Brunch Concert Ft. Sarah Christine! Join us for an amazing summer concert experience as you sip mimosas and enjoy a fabulous brunch with all of your friends! If you know Attimo Wine, you know you'll get the best foodie experience in all of Denver while enjoying Sarah's beautiful voice! We can't wait to see you, Sunday, July 25!"}, {"Address": "200 Columbine St #110, Denver, CO 80206", "Artist": "Neil Z ", "ArtistImage": "https://photos.bandsintown.com/thumb/11509479.jpeg", "Coordinates": [39.7552262, -104.989155], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "SOL Mexican Cocina | Cherry Creek", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "28075 CO-74, Evergreen, CO 80439", "Artist": "Grant Livingston ", "ArtistImage": "https://photos.bandsintown.com/thumb/11497288.jpeg", "Coordinates": [39.6332145, -105.318721], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Little Bear Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "Grant Livingston at Little Bear Saloon in Evergreen, CO.\n\nNoon - 4 PM"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Twisted Pine ", "ArtistImage": "https://photos.bandsintown.com/thumb/11468071.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "String Bands, Americana, Bluegrass, Pop, Indie, Acoustic, Folk, Jam Bands, Indie Pop", "Time": "12:00 PM", "Venue": "RockyGrass Festival 2021", "moreBioInfo": "Praised by NPR for their “upbeat, poppy vibe; energetic, driving rhythms\" and \"virtuosic solos,” Twisted Pine has quickly become one of the most acclaimed young string bands in the Northeast. Audiences across the US and UK have been drawn to their forthright songwriting, lush harmonies, musical daring, and charismatic appeal.\nSteeped in traditional music, these musicians are also fearless, tuneful improvisers and passionate lovers of pop. Fiddler Kathleen Parks' command of the vocal mic is as charming as it is gutsy. On her instrument, Parks is an insatiable risk-taker, seeking out exciting new musical territories. Mandolinist Dan Bui is a master of melody and drive, celebrated widely for his dexterous, tasteful picking. And bassist Chris Sartori holds down the low end and a lot more, introducing creative, funk-inflected cadences that never overwhelm the beat.\nBut while it’s easy to celebrate each of the band members individually, Twisted Pine is more than a collection of talented musicians - it’s a unit that grooves together. Their intricate arrangements of swelling, syncopated rhythm and precise instrumental interplay bring the enveloping sound and hooks of indie pop to an acoustic instrumental setting.\nYou’ll find Twisted Pine on stages large and small, entertaining festivals of thousands and intimate rooms alike. Winners of the 2018 Boston Music Award's Americana Artist of the Year and selected as one of Improper Bostonian's 2018 \"Top 10 Local Acts on the Rise,\" Twisted Pine has played major events from Grey Fox to DelFest to Glasgow’s Celtic Connections and beyond. “They absolutely rule their musical world with humor and relish,” says legendary fiddler Darol Anger.\nTwisted Pine released its debut, self-titled album of original music in 2017, followed in 2018 by Dreams, an EP of “wildly innovative covers… full of spark, light, and irresistible force” according to PopMatters. Check out Twisted Pine on tour and see why the Boston Globe calls them “a wider version of stringband, boundary jumpers akin to outfits like Punch Brothers, Nickel Creek, and Crooked Still.”", "otherInfo": "No event info available"}, {"Address": "3560 Chestnut Pl, Denver, CO 80216", "Artist": "Shady Oaks - music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11387804.jpeg", "Coordinates": [39.7722073, -104.9793189], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Psychedelic Rock, Blues Rock, Rock", "Time": "1:00 PM", "Venue": "RiNo Music And Arts Showcase 2021", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "321 E 45th Ave, Denver, CO 80216", "Artist": "Andy Immerman ", "ArtistImage": "https://photos.bandsintown.com/thumb/11548776.jpeg", "Coordinates": [39.7784556, -104.9831301], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Electronic, Other, R&b/soul, Rnb-soul, Ambient, Funky, Soul, House", "Time": "2:00 PM", "Venue": "Soundgroundis - Throughtheveil", "moreBioInfo": "Andy Immerman is a Denver based veteran engineer, producer, photographer and graphic artist originally hailing from Eau Claire, Wisconsin. Blending organic and synthesized sounds, he creates vivid, emotionally drenched compositions that both echo and influence chillwave and house music. Andy began composing and recording original music at age 12, and has since refined and evolved his style into the electronic dreamscapes that dominate his sound. Utilizing a mix of digital audio workstations, electric and acoustic guitars, and foley-style recorded sounds, he morphs ordinary noise into ethereal, otherworldly beats. While living in Wisconsin, he was the Assistant Engineer for Bon Iver’s self titled record “Bon Iver” which won two Grammys in 2012 for best new artist and best alternative album.", "otherInfo": "JULY 25th, 2021\n1-9PM\n🛤\n@_devonjames\n@aimmerman\n@beatsbydrippin\n🛤\nsoundgroundis:\nTHROUGHTHEVEIL\n🛤\nIt is thinner than you think. As unseen as it is in play. A mystical construct beholden to the realm we inhabit but loyal to what lies beyond.\nThe veil plays an incredible role in our interactions as the living. Simple shifts discard a scenario and create an entire other reality. Perspectives mold moments.\n🛤\n@ftgreenebar\n321 E. 45th Ave Denver, CO\n🛤\nDM @sound.ground for tickets.\n🛤\n@tractionsound by @conjure_pro"}, {"Address": "60750 US Hwy 285, Bailey, CO 80421", "Artist": "Mike Ippolito ", "ArtistImage": "https://photos.bandsintown.com/thumb/11459658.jpeg", "Coordinates": [39.405184, -105.4744305], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Jazz Fusion, Blues, Folk, Psychedelic Soul, Jamband, Funky Bluesy Rockin Grooving Tunes", "Time": "2:00 PM", "Venue": "Mike Ippolito Live at Aspen Peak Cellars", "moreBioInfo": "Mike Ippolito is a guitarist and singer/songwriter based in Fort Collins, CO. Mike has been playing the guitar and performing for over 20 years. Through an array of influences ranging from jam, rock, jazz, funk, R&B, blues, and folk...Mike has formulated a rhythmic, percussive-picking style that is all his own. Hailing from Upstate NY, Mike was the lead songwriter and guitarist in his former jam fusion project, Liquid Lounge Band, based out of Syracuse. LLB recorded the LP \"Ellipsis\" in 2014, and was nominated in the \"Best Jam Band\" category for the 2015 Syracuse Area Music Awards.", "otherInfo": "Mike makes his debut at Aspen Peak Cellars in beautiful Bailey, Colorado, as he brings his psychedelic blend of blues, jazz, soul, funk and folk to this wonderful mountain town. Come out and enjoy some live music and a robust selection of fine wine.\n\nFree show! 2-5pm"}, {"Address": "608 E 13th Ave., Denver, CO 80203", "Artist": "The Slacks ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523476.jpeg", "Coordinates": [39.7367329, -104.9794787], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Psychedelic Rock, Fuzzed-out Hardcore Post Blues, Psychadelic, Blues, Rock", "Time": "2:30 PM", "Venue": "Your Mom's House", "moreBioInfo": "“We make the impossible really hard.” ~Jonathan Hutchings We are The Slacks we play hard-hitting blues rock music with a modern edge. Fuzzed-out hardcore post blues is pretty much the most accurate description of what we play. The Slacks are built on friendship and faith first, then on music. A truly collaborative project, each member has added a unique and irreplaceable aspect to The Slacks’ music. For about two-and-a-half years, The Slacks were a basement band that got together to jam and eat on Friday nights. They enjoyed each other’s company and tossed around musical ideas, learning how to play together. During this time, zero songs were brought to completion. In summer of 2018, they decided to take a break and consider other pursuits. By late November, they missed each other and their music. It was at this point that they began writing and rehearsing furiously. In January, they spent a week recording their six-song EP, “HOTELS · MOTELS · HEALTHCARE FACILITIES” in David’s home studio, and spent the next week mixing the project. In February 2019, The Slacks finally released music to the world. The EP was well received within the local music scene, and they began what they hope will be a long journey. Since the release of their debut EP, The Slacks have been playing live shows, writing, and recording relentlessly. Very quickly, they established themselves within the Denver music scene as one of the best live acts, always pushing the limits of what they can do. Since May, the Slacks have had a commitment to release a single a month to push themselves to write more, improve their recording technique, and grow their audience. They look forward to the years ahead, developing both craft and friendship.", "otherInfo": "2:30pm-5:30pm Doors: 2:00pm 21+ Tickets available for purchase at www.yourmomshousedenver.com Artists: Takipnik https://takipnik.com/ Takipnik is an electronic indie synth rock duo based in Denver, Colorado. The Slacks https://www.slacksmusic.band/ Josh Walker https://www.walkthejosh.com/ Josh Walker combines the emotions of every day life with the musical spirit of his native Virginia. Presented by Boogie Groove Entertainment"}, {"Address": "3602 E Colfax Ave, Denver, CO 80206", "Artist": "Sam Paul ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7399564, -104.944749], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Lost Lake Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "3602 E Colfax Ave, Denver, CO 80206", "Artist": "M'Lady ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.7399564, -104.944749], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Lost Lake Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "3560 Chestnut Pl, Denver, CO 80216", "Artist": "Bunny Blake Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11485859.jpeg", "Coordinates": [39.7722073, -104.9793189], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "R&b, Pop", "Time": "3:30 PM", "Venue": "RiNo Showcase - Music & Arts Festival", "moreBioInfo": "Bunny Blake is a public figure, an old soul trapped in the body of a 20 something. Influenced by the vocals of Mariah Carey and Mary J Blige with the guitar styling of James Taylor and John Mayer, Bunny’s genre can be best described as pop/r&b with soulful, finger style guitar. Her name is inspired by The Twilight Zone, mirroring her many dimensions as an artist. One can learn the most about Bunny through her songwriting. Striking a balance between Cutesy and Sexy, Sweet and Sassy, each song expresses a different dimension of femininity. Bunny leaves little to the imagination. Her song “$$$” speaks candidly to the reality of being a full time musician while “Pisces” and “Dominos” appeal to her more playful side. “Good Intentions” is perhaps her most emotionally honest work about the value of transparency in a relationship. In a past life, Bunny has traveled the world with her music as Lindsey Saunders. From receiving a Gibson Les Paul from a kind stranger at the Pinetop Music festival in Arizona, to meeting one of the infamous members of the Beach Boys in the Airport after playing the Copenhagen Songwriters Festival, she’s always sure to travel with a bit of whimsy in her back pocket. When attending Bunny’s live show, it doesn’t take long to see why she claims it was the guitar that chose her - not the other way around. Bunny’s unconventional chord crafting has earned her a Taylor Guitar Artist Partnership with notable performances at events such as the Sundance Film Festival, Boulder International Film Festival, Durango Songwriters Expo, SXSW and CMJ Music Marathon. Bunny has received many accolades for her work being noted as a musician whose artistry and poise as a songwriter, guitarist, and vocalist demands to be both seen and heard.", "otherInfo": "The RiNo Showcase is a one of a kind music & arts festival that features the best Colorado's musical acts, visual artists, and so much more!"}, {"Address": "12363 W 64th Ave, Arvada, CO 80004", "Artist": "Cash'd Out ", "ArtistImage": "https://photos.bandsintown.com/thumb/11460902.jpeg", "Coordinates": [39.8127856, -105.1365773], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Folk, Country, Americana, Roots, Red Dirt, Rockabilly, Blues", "Time": "4:00 PM", "Venue": "Rockabillies", "moreBioInfo": "Over the past couple of decades, tribute bands have become big business in the world of concert promotion. And, not surprisingly, the more popular ones are the acts that are most authentic. Such is the case with Cash’d Out, a San Diego based band, that channels Johnny Cash in about as close a manner to the real thing as it gets. How can you tell? Well, beyond critics having anointed Cash’d Out the “Next Best Thing to Johnny Cash,” and the group having won six San Diego Music Awards for Best Tribute Band, the real proof lies in what members of Cash’s inner circle have said. “Cindy Cash came to a show, we made her cry and she gave me a necklace with Johnny's hair in a glass locket,” explains front man and Cash impersonator Douglas Benson. Benson added that Cash producer Lou Robin has also been to several Cash’d Out shows, and claimed that if he closed it eyes it was like “going back in time.” Once the only tribute band endorsed by the official Johnny Cash web page, JohnnyCash.com, Cash’d Out has played to over 1.2 million fans since forming in 2005. And those fans continually tell the group how grateful they are that Cash’d Out continues to bring back memories of loved ones who once raised them on the music of Johnny Cash. W.S. Holland, Cash’s longtime drummer, even sat in with Cash’d Out at a birthday celebration for Johnny Cash hosted by Bill and Shannon Miller of JohnnyCash.com at the Fender Museum in Corona, California. “And (noted Cash historian) Bill Miller let me play Johnny’s cherry sunburst Guild guitar,” added Benson. Cash'd Out has over 150 of JC's songs in their repertoire, and can deliver up to four hours of non-stop entertainment, including the June Carter Cash duets brought back to fame in the Oscar winning film, Walk the Line. Cash'd Out also tailors performances to suit any venue or function -- from clubs, theaters, fairs and casinos to museums and corporate events The band’s live shows respectfully reference the late, great Man in Black's Sun Records and early Columbia era sound, combined with the energy of the classic multi-platinum live recordings from Folsom Prison and San Quentin to recent American Recordings Rusty Cage and Hurt. The group's genuine love (and authentic recreation) of Johnny Cash’s music and its universal appeal fans of all ages and of virtually all musical genres makes each Cash’d Out show a must-see event. For more information, please visit www.cashdout.com", "otherInfo": "Tickets $15-$85\n\n“Some people are impressionists. These guys leave an impression”. Says Bill Miller, owner of Johnny Cash.com about Cash’d Out, a San Diego based band that channels Johnny Cash in about as close a manner to the real thing as it gets.\n\nAfter thirteen years, traveling hundreds of thousands of miles on the road and winning over as many fans, fans who still continually tell the group how grateful they are that Cash’d Out so righteously carries the torch of the Johnny Cash Show.\n\nBesides music critics anointing Cash’d Out as “the next best thing to Johnny Cash”, their highlights have been many:\n\nW.S. Holland, Johnny Cash’s longtime drummer, has sat in with Cash’d Out; front man, Douglas Benson, has played Johnny’s cherry sunburst Guild guitar (courtesy of Mr. Miller); “Cindy Cash came to a show and was moved to give me a glass locket that was her father’s,” explains Benson; Longtime Johnny Cash manager Lou Robin has also been to several Cash’d Out shows and claimed that if he closed his eyes it was as if “going back in time.”; And most recently, an unforgettable evening performing the music of Johnny Cash with the San Diego Symphony as a special event for their Summer Pops Series.\n\nThe band’s live shows respectfully reference the late, great Man in Black’s Sun Records and early Columbia era sound, combined with the energy of the classic multi-platinum live recordings from Folsom Prison and San Quentin. The group’s genuine love (and authentic recreation) of Johnny Cash’s music and its universal appeal fans of all ages and of virtually all musical genres makes each Cash’d Out show a must-see event.\n\nOr as Bill Miller says, “Some people are impressionists. These guys leave an impression.”\n\nhttps://www.cashdout.com/"}, {"Address": "101 2nd Ave Suite B, Niwot, CO 80544", "Artist": "Tony Crank ", "ArtistImage": "https://photos.bandsintown.com/thumb/11543471.jpeg", "Coordinates": [40.1032048, -105.17291], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Jazz Pop Classical World, Contemporary Folk, Classical", "Time": "4:00 PM", "Venue": "The Wheel House", "moreBioInfo": "Music Artist - Guitarist They say that music is the language of the soul, and nothing could be truer for Tony Crank. An inspirational artist, Tony has earned his reputation as a talented musician and skillful performer. From live gigs to studio sessions and more, Tony Crank continues to touch fans around the world with his distinct and enjoyable musical style.", "otherInfo": "No event info available"}, {"Address": "1380 W Florida Ave, Denver, CO 80219", "Artist": "STS9 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9296661.jpeg", "Coordinates": [39.6893833, -105.0036687], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Funk, Space, Jam Rock, Rock, Instrumental, Electronic, Jam Bands", "Time": "4:00 PM", "Venue": "Levitt Pavilion Denver", "moreBioInfo": "Sound Tribe Sector 9, or STS9 for short, is a 5 piece band that originally hails from Snellville, Georgia and after much success in Athens, GA and Atlanta, moved out west in late 2000 and currently reside in the San Francisco Bay Area of California. The band is known for frequent and explosive live performances with a friendly atmosphere and lots of dancing. Their music combines a special blend of the Atlanta influenced hip-hop side while combining it with a electronica-jam feel. The band is also known for their affinity for the Maya calendar, or \"13 moon calendar\". Onstage, the band blends live instrumentation using Ableton Live via Apple powerbooks.", "otherInfo": "This is an all GA event. DOORS OPEN AT 3PM / 4 PM SHOW This is a rescheduled event from The Summit Music Hall 7/22/2021. If you already have tickets for the Summit show, they will be honored at Levitt Pavilion on 7/25/2021."}, {"Address": "2920 Brewery Ln, Littleton, CO 80120", "Artist": "Fox Royale ", "ArtistImage": "https://photos.bandsintown.com/thumb/11320729.jpeg", "Coordinates": [39.5937136, -105.0232324], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alternative, Rock, Indie", "Time": "5:00 PM", "Venue": "Breckenridge Brewery", "moreBioInfo": "Fox Royale make anthemic, jangly indie-rock that sparkles with the same energy as acts like Cold War Kids, Cage the Elephant and Vampire Weekend. Their debut single, “Don’t Call Me When You’re Lonely,” is about a seemingly isolating phenomenon: loneliness, particularly the kind that affects traveling musicians (or traveling workers of any kind) and their partners. So why does the song sound so big, so full? Because Fox Royale have the ability to make music about things like emotional insecurities, breakups and family breakdowns sound almost joyful. “We're trying to tackle [millennial anxieties] in such a way that doesn't sound naive, which is hard because we're as young as the people listening,” Nathan says. “It's bright sounding. A lot of it sounds happy. It's not just one line that's super catchy. We want every line to get stuck in your head.” Similarly, Fox Royale are painting a brightly colored picture with every song they write. Maybe they don’t have it all figured out, but they’ll continue to be consistent. Sticking to their guns—and their goals—is a big priority for the band.", "otherInfo": "No event info available"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Michael Cleveland ", "ArtistImage": "https://photos.bandsintown.com/thumb/11179142.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Acoustic, Jazz, Americana, Bluegrass, Country, Western Swing, Folk", "Time": "5:00 PM", "Venue": "Michael Cleveland with Bela Fleck's \"My Bluegrass Heart\"", "moreBioInfo": "The world tends to look at accomplishments in the form of accolades and although only in his mid-30’s, 2020 GRAMMY Winner Michael Cleveland, has plenty to his credit. After picking up the fiddle at age 4, Michael’s musical momentum began to propel him forward towards early success. “When I started taking lessons at age 4,” he remembers, “I told the teacher right up front that I wanted to learn how to play bluegrass and I wanted to play ‘Orange Blossom Special.'” Reluctant as they were, his teachers quickly found reason to his rhyme, helping him progress to the point when, at age 9, Michael was invited to sit in with the legendary Bill Monroe at the Bean Blossom Bluegrass Festival. Soon after, he brought his virtuosic style to the Grand Ole Opry as a guest of Alison Kraus, and was hand picked for the International Bluegrass Music Association’s (IBMA) Bluegrass Youth Allstars before he was 14. His blistering prowess and technical fluency have since marked him as a sought-after musician, leading to performances with Vince Gill, Marty Stuart, Tim O’Brien, J.D. Crowe and the New South, Andy Statman, and The Kruger Brothers in recent years. However, it wasn’t until 2006, when Michael formed his own band Michael Cleveland & Flamekeeper, that he found the right vehicle for his musical vision, and he hasn’t rested since, constantly looking for new ways to push himself and his music forward. “He plays fearless and it’s intoxicating to play with him because he makes you play fearless,” says Country Music Hall of Famer Vince Gill. “He takes no prisoners but he plays with a restraint and a soul. He plays without abandon.” Clearly, the IBMA agrees as he’s their most awarded Fiddle Player of the Year with 12 wins, has won Instrumental Recorded Performance of the Year six times, and fronts their 6-Time Instrumental Group of the Year. And, Cleveland is a 2018 Inductee to the National Fiddler Hall of Fame. Cleveland makes his way around the country performing festivals, clubs, and performing arts centers, delighting audiences, leaving them with jaws dropped in complete amazement. “It’s wicked to see how much music he pulls out of a bow,” continues Vince. “He’s untouchable.”", "otherInfo": "No event info available"}, {"Address": "450 Main St, Lyons, CO 80540", "Artist": "Barbaro ", "ArtistImage": "https://photos.bandsintown.com/thumb/8881524.jpeg", "Coordinates": [40.2248924, -105.271254], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Americana, Jazz, Bluegrass, Roots Music", "Time": "5:30 PM", "Venue": "MainStage Brewing Company", "moreBioInfo": "Barbaro’s musical vision explores their collective life experiences through intricate instrumentation, creatively bending traditional music into a style that is all their own. The Minneapolis-Winona based rising stars have created their eclectic sound through original songwriting craft, with inspiration derived from bluegrass, jazz and chamber music. Their new album, Dressed in Roses, released January 2020, “Stands as a true testament to their musical identity and the sound that has launched one of the Midwest’s most in-demand acoustic acts.”", "otherInfo": "No event info available"}, {"Address": "1512 Curtis St, Denver, CO 80202", "Artist": "Ari Hoenig ", "ArtistImage": "https://photos.bandsintown.com/thumb/8224716.jpeg", "Coordinates": [39.746338, -104.995433], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Ben Markley Big Band play the music of Ari Hoenig, Dazzle Jazzclub ", "moreBioInfo": "Ari Hoenig (born on November 13, 1973 in Philadelphia, Pennsylvania), is a New York based jazz drummer, composer and educator known for his unusual and intense approach to drumming emphasizing complex rhythms in direct harmony with other group members. Ari is widely noted particularly for his drumming not being relegated to just keeping tempo, or being a side issue to the music he plays in, but rather for elevating drumming as an indispensable part of the performance.", "otherInfo": "No event info available"}, {"Address": "1119 Washington Ave, Golden, CO 80401", "Artist": "My Blue Sky ", "ArtistImage": "https://photos.bandsintown.com/thumb/11430232.jpeg", "Coordinates": [39.7557315, -105.2212634], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues, Southern Rock, Classic Rock", "Time": "6:00 PM", "Venue": "Lies Or Lullabies Album Release Party (John Gallagher, lead singer at My Blue Sky)", "moreBioInfo": "“Honoring the music of the Allman Brothers family of bands” Award winning My Blue Sky is comprised of 7 experienced Colorado musicians that all share the passion and love of the music of the Allman Brothers Band (and family of bands). The Allman Brothers Band have a unique blend of southern rock, blues, and jazz that have inspired musicians and fans for decades. Their music and performances have created memories for everyone that have stood the test of time. It is in that spirit that we honor their music. And they honor it well including the support and approval of Gregg Allman himself. We are also honored to be the band for Jimmy Hall and Kara Grainger when they are in the region and need a full band. www.jimmyhall.com Www.karagrainger.com Web page: https://mybluesky.co/", "otherInfo": "LIES OR LULLABIES\nCome help us celebrate the release of Lies or Lullabies debut album “If a Tree Falls”. Engineered and produced by Marshall Gallagher (Teenage Wrist/Epitaph Records/Swing Hero)\nEmotionally charged music based on real events rooted in rock, blues and beyond!\nJohn Gallagher -Vocals/Guitars (Lead singer for My Blue Sky)\nPaul Webb – Guitars\nSean Mullen – Bass/Vocals\nJay Meikrantz – Drums\nSpecial for this show only we will be joined by a few talented, great friends who just happen to be featured on the album.\nDavid Brandt (Nick of Time/ My Blue Sky)\nTim Kestle (My Blue Sky)\nKelly Walker (LA Dude)\n\nMOJOMAMA\nMojomama combines Old School Rhythm and Blues and Funk influences from Aretha Franklin to Susan Tedeschi to Steely Dan leaving you with a new yet familiar sound.\nThey were a semi Finalist at the International Blues Challenge in Memphis for 2018 and 2019 representing the Colorado Blues Society.\nIn 2015 Mojomama won best self produced Cd and favorite female vocalist for 2015 and 2018 from the Colorado Blues Society.\nMojomama Wins Best Band from Colorado Blues Society Members Choice Awards February 2019. The music is a mix of Funk,Rock,Blues and Soul. The band has been recording new songs during this pandemic and the result has been regular airplay on the radio.\nShowtimes\n6:00 pm Doors\n7:00 pm MojoMama\n8:50 pm Lies or Lullabies See Less"}, {"Address": "2430 S Havana St, Aurora, CO 80014", "Artist": "Sunday Funday ", "ArtistImage": "https://photos.bandsintown.com/thumb/283438.jpeg", "Coordinates": [39.67226429999999, -104.8652551], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Stampede", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "Guster ", "ArtistImage": "https://photos.bandsintown.com/thumb/11303318.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Alternative, Indie", "Time": "6:30 PM", "Venue": "Guster On The Rocks", "moreBioInfo": "Guster, an American rock band, was formed at Tufts University, near Boston, Massachusetts, in 1992. The band consists of Adam Gardner and Ryan Miller on guitar and vocals, Brian Rosenworcel on percussion, and multi-instrumentalist, Joe Pisapia, a recent addition to the band. The band is noted for their catchy, poppy melodies, and the distinctive hand-drumming on percussion. The band has released five studio albums which are, in chronological order, Parachute, Goldfly, Lost and Gone Forever, Keep It Together, and their most recent release in June 2006, entitled Ganging Up on the Sun. In addition, a live album was released in 2004, Guster On Ice, recorded live in Portland, Maine. On April 10th, 2007, the Satellite: EP was released and included a remix of Satellite from their previous album Ganging Up on the Sun.", "otherInfo": "More event details at gusterontherocks.com\n\nPresale Monday, May 24th at 10AM MT with code: ONTHEROCKS\n\nLivestream and concert tickets available for purchase on Thursday, May 27th @ 10AM MT\n\nLivestream for purchase at: https://boxoffice.mandolin.com/collections/guster\n\nDoors 6:30PM MT / Show + Livestream: 7:30PM MT"}, {"Address": "900 Baseline Rd, Boulder, CO 80302", "Artist": "Colorado Music Festival ", "ArtistImage": "https://photos.bandsintown.com/thumb/8259556.jpeg", "Coordinates": [40.000023, -105.2819456], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classical", "Time": "6:30 PM", "Venue": "Chautauqua Auditorium", "moreBioInfo": "Under the artistic vision of Maestro Peter Oundjian, the Colorado Music Festival thrills audiences of more than 20,000 each season with programming that embraces the most beloved classical music repertoire, while integrating world music and the works of exciting modern composers. Balanced programming performed by exceptional musicians has earned CMF ten ASCAP awards for \"Adventuresome Programming of Contemporary Music,\" and the kudos of the press and public alike. Sunday evenings feature the CMF Chamber Orchestra, Saturday bring chamber music ensembles, and Thursday and Friday evenings showcase the full CMF Festival Orchestra. Throughout the season, emerging talent from Europe, Asia, South America and the U.S. join CMF musicians in performances that inspire and engage concertgoers of all ages. \"A night like this makes one truly appreciate the value of an organization like the CMF to the community. It is indeed a summer gem.\" ~The Daily Camera~ Located in a 10,000 sq. ft. former church building at 200 E. Baseline Rd. in Lafayette, Colorado, the Center for Musical Arts (CMA) employs over 40 professional teaching artists, serving approximately 500 students weekly, and thousands of annual concert audience members. A full member of the National Guild for Community Arts Education, the CMA turns no one away, with its Heartstrings Program of tuition assistance and musical instrument bank. CMA students primarily come from Lafayette, Louisville, Erie, Broomfield, Superior, Boulder, Niwot, Longmont, Brighton, Thornton, Northglenn, and Arvada. Key CMA beliefs: • The significant power of music to enrich human existence and create community. • The value of all kinds of music. • The creative potential of every individual. • Access to music for all members of the community. • Excellent and inspiring musical mentorship. • The value of trust, integrity, and respect, within a heart-centered environment.within a heart-centered environment. The Colorado Music Festival and Center for Musical Arts merged in 2009. CMF presents a six-week summer concert season at the historic Chautauqua Auditorium in Boulder, CO. The organization, a non-profit 501(c)(3), raises approximately 50% of its operating budget from grants, individual donations, business partners, and special events. Donations are tax-deductible.", "otherInfo": "No event info available"}, {"Address": "608 E 13th Ave., Denver, CO 80203", "Artist": "Fun Machine ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523835.jpeg", "Coordinates": [39.7367329, -104.9794787], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Psychedelic Rock, Rock", "Time": "7:00 PM", "Venue": "Your Mom's House", "moreBioInfo": "Fun Machine is a swaggering rock n roll quatro, bringing brand new songs and semi obscure covers to caress your blunted eardrums", "otherInfo": "7:00pm-2:00am Doors: 6:30pm 21+ Tickets are available at www.YourMomsHouseDenver.com Artists: Lily Nova https://linktr.ee/LILYNOVA Waxcat https://linktr.ee/waxcat Moon.roof https://linktr.ee/moonroof Transit https://linktr.ee/Transiit Monizz https://linktr.ee/monizzflama Fun Machine https://linktr.ee/FunMachineofficial Locomotive https://linktr.ee/vicandtraingoloco KCY https://linktr.ee/kcy Presented by Boogie Groove Entertainment"}, {"Address": "5675 Field St, Arvada, CO 80002", "Artist": "Mark Schultz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9006277.jpeg", "Coordinates": [39.79890100000001, -105.0987392], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Christian", "Time": "7:00 PM", "Venue": "Peace Lutheran Church", "moreBioInfo": "Listeners have come to expect inspiring and remarkable stories in songs from Mark Schultz, a 14-time Dove Award nominee and platinum-selling artist who touches hearts whether he sings about parents praying for a sick child (“He’s My Son”), or writes in honor of his great-grandmother’s sons who fought in World War II (“Letters From War”). And with his latest effort, All Things Possible, Schultz continues to tackle matters of the heart and spirit with uncommon craftsmanship–though the past five years have impacted this artist in ways he could’ve never predicted or expected. He’s lived in Europe, started the Remember Me Mission with his wife to help orphans (Schultz himself is adopted), and became a father in 2012 to a boy, Ryan Samuel Schultz. Produced by Seth Mosley (Newsboys) and Pete Kipley (MercyMe/Phil Wickham), All Things Possible has a joyous, infectious pop-rock feel that shows Schultz’ soulful tenor and tuneful melodies at their peak. Yet there’s added depth that comes as this compassionate storyteller dives deeper into using music as a vehicle for better things. Here, he quotes no less a source than theologian Frederick Buechner: “The place God calls you to is the place where your deep gladness and the world’s deep hunger meet.” “All Things Possible means something different than when I was first starting out as a musician,” Schultz says. “When I first got signed, I thought that if 10 people bought my record, that would be ‘all things possible.’ But today, using this platform for myself to sell more records is not as inspiring to me. I can only accomplish good things if God is in them, and God shows up. I want to pray those prayers.” As Schultz describes it, the road to All Things Possible began, quite literally, on the road. In 2007, he dipped his toe in the Pacific Ocean and began a punishing 3,500-mile bike ride across the U.S. to raise money for orphans and widows via the James Fund. Here’s how Schultz recalls that bipedal leap of faith that kicked off a 14-date concert tour: “We took off from the Pacific and I thought, ‘God is in this.’ Forty miles into it, I’m out of shape, but I’m thinking, ‘God is still into this.’ And then I got to the first mountain and I thought, ‘I’m not sure God is into this anymore!’” But if his muscles ached and doubts nagged, Schultz got over it at his first stop, a church outside Palm Springs, Calif. There he played for only 400 people, a modest crowd by Mark Schultz standards. Yet unexpected inspiration carried him up a mountain of another sort. “I did a set list I’d never done before; I told stories I’d never told before,” Schultz says. “The minister took an offering and afterwards he said, ‘I don’t know what you’re used to, but for his little church, it’s really good.’ They had raised more than $20,000.” While Schultz has always been a powerful encourager through his music, experiences like that took him to new places he wanted to express through new songs. Yet the Colby, Kansas native crafted many compositions for All Things Possible the way he’s always done it–at a chapel piano in Nashville where he’s written since his pre-recording artist days as a youth group leader. “It’s right around the corner from my house,” Schultz says. “I go to the little chapel where I’ve written almost every one of my songs, and I just repeat a line, and usually tears are running down my face. My best songs are written when I don’t plan them out.” Take “Haven’t Even Met You Yet,” a driving slice of organ-and-piano fueled country rock Schultz crafted for his then-unborn son: “This is where your story starts/ You’ve already stolen my heart … I don’t remember life before you at all, and the funny thing is, I haven’t even met you yet.” “I just get tears in my eyes thinking about him,” Schultz says of little Ryan Samuel–and with poignant reason. “I’ve never met my bloodline in this world; it’s not like I’ve got my biological mom or my dad. I remember my wife saying, ‘He looks just like you,’ and I looked in his eyes, and he smiled. My knees just buckled. He’s the first part of me that I’ve ever seen in someone else. I play that in concert and it gets a standing ovation. The thing that’s so exciting for me is that I can’t wait until he gets older, and he can sing his song for his kids.” Yet other songs for “Possible” took flight across the Atlantic, as Schultz and his wife Kate, an OB-GYN, spent a yearlong sabbatical after she completed her medical residency. Take the snappy tune “I Gave Up,” the first one written for the album: “We’d been in Europe for a while; everything was slower and relationships are pretty prized, while stuff is not prized. And my wife looked at me and said, ‘Everything we own is in a garage in Nashville. So do you miss anything?’ I said, ‘No I don’t miss anything.’ And right there was a shift: We have to pay more attention to the relationships, the things that matter, and less to the things that are gong to crumble in time.” When the tune came, Schultz wasted no time catching it, though it took some late-night finesse. “I jumped out of bed and soon I was on the street in Florence, out in the street singing into a recorder at 3 o’clock in the morning.” Of course, it helps when you’re a songwriter abroad to find a piano, and Schultz (who couldn’t exactly ship one to Europe) found instruments in the most surprising places. “When we got to Florence I was climbing the walls. I had to find a piano somewhere. And Kate said, ‘Don’t worry if we pray about it, we’ll find one.’ So we were eating dinner and there was this very old church across the street, with frescos on the wall.” Schultz went to investigate, and found out that the church not only had a piano, but also was holding a worship service for American college students the next day. The former youth leader stepped up; “I played one song, and then another, and one kid said, ‘Hey, you’re playing an awful lot of Mark Schultz songs.’ And I said, ‘Yeah, I know.’” Schultz eventually became the church’s temporary worship leader, and grew attendance at the youth service from 5 kids to 30 by the time he left four months later. Another unlikely surprise awaited Schultz in Italy: He found out that his wife qualified for Italian citizenship, since her great-grandfather was an Italian citizen. “So she got a dual citizenship in Italy, and because I’m married to her, I was able to get one, too. And my kid is an Italian citizen, and he didn’t do any work at all!” Some kids, though, have a lifetime of struggle ahead. Ask Schultz to sum up the album’s theme in one song, and he points to “One Day,” which got its start while he was on stage singing his hit “I Am.” “I’m looking out in the audience and halfway back, I can see kids in wheelchairs. There’s this one kid in a wheelchair with his fists clenched and his arms thrown up in the air and tears running down his face. And I got choked up. Right at that moment I thought, ‘Kid you’re going to get your own song.’” The refrain, in typical Schultz fashion, spotlights bigger possibilities and hope beyond human limitations. “One day we will touch the healer’s hand/ One day we will be whole again.” “When I sing it, I think of the kid in the wheelchair, and how when he gets to heaven, he gets to kick that wheelchair to the ground and walk away from it,” Schultz says. “No matter what you’re going through—cancer, a disease, or being in a wheelchair—it’s powerful to think there’s an endgame to that.”", "otherInfo": "Tickets are now buy one get one free. This is to encourage everyone to invite a friend. We are especially thinking of our brave men & women in the military and also those first responders who risk so much to keep us safe."}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "000KB000 ", "ArtistImage": "https://photos.bandsintown.com/thumb/11514086.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Mixed Media", "Time": "7:00 PM", "Venue": "Guster", "moreBioInfo": "I'm KB I have Been A Tik Tok Video Maker since 2012 and This is a way to Reach out to my Fans and Friends!", "otherInfo": "No event info available"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "The Del McCoury Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/7856650.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Jam Band, Country, Bluegrass", "Time": "7:00 PM", "Venue": "RockyGrass Festival 2021", "moreBioInfo": "The Del McCoury Band is a Grammy Award-winning bluegrass band. Originally Del McCoury and the Dixie Pals with Del on guitar and his brother Jerry on bass, the band went through a number of changes until the 1980s when the band solidified its line-up, adding McCoury's sons, Ronnie and Robbie on mandolin and banjo, respectively. In 1988, the \"Dixie Pals\" name was dropped in favor of the current name.Fiddler Tad Marks and bass player Mike Brantley joined in the early 1990s while the band became a national touring act. In 2004 they were nominated for the Grammy Award for Best Bluegrass Album for It's Just the Night, and in 2006 they won that category for The Company We Keep. The band recorded with Steve Earle on his 1999 album The Mountain. Contents [hide] 1 Band members 2 Discography 2.1 Albums 2.2 Contributions 3 External links [edit] Band members Del McCoury - guitar (1967 - present) Ronnie McCoury - mandolin (1981 - present) Robbie McCoury - banjo (1987 - present) Jerry McCoury - bass (1967 - 1989) Mike Brantley - bass (1989-1992) Mike Bub - bass (May 1992 - June 2005) Alan Bartram - bass (August 2005 - present) Billy Baker - fiddle (1967) Tad Marks- fiddle (1990-1992) Jason Carter - fiddle (1992 - present) [edit] Discography [edit] Albums Year Album US Bluegrass US Country US Indie US Heat 1992 Blue Side of Town 1993 Deeper Shade of Blue 1996 The Cold Hard Facts 1999 The Mountain (w/ Steve Earle)A 19 The Family 2001 Del & The Boys 11 50 2003 It's Just the Night 4 47 32 48 2005 The Company We Keep 2 59 2006 The Promised LandB 2 61 46 39 2008 Moneyland 1 51 AThe Mountain also peaked at #133 on the Billboard 200 and at #14 on the Canadian Country Albums chart. BThe Promised Land also peaked at #24 on Top Christian Albums. [edit] Contributions Song of America (2007) - \"The Times They Are a-Changin'\" [edit] External links Discography at Discography of Bluegrass Sound Recordings Official website Del McCoury Band collection at the Internet Archive's live music archive Retrieved from \"http://en.wikipedia.org/wiki/Del_McCoury_Band\"", "otherInfo": "No event info available"}, {"Address": "608 E 13th Ave., Denver, CO 80203", "Artist": "A Whole New World ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523835.jpeg", "Coordinates": [39.7367329, -104.9794787], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Your Mom's House", "moreBioInfo": "No artist bio available", "otherInfo": "7:00pm-2:00am Doors: 6:30pm 21+ Tickets are available at www.YourMomsHouseDenver.com Artists: Lily Nova https://linktr.ee/LILYNOVA Waxcat https://linktr.ee/waxcat Moon.roof https://linktr.ee/moonroof Transit https://linktr.ee/Transiit Monizz https://linktr.ee/monizzflama Fun Machine https://linktr.ee/FunMachineofficial Locomotive https://linktr.ee/vicandtraingoloco KCY https://linktr.ee/kcy Presented by Boogie Groove Entertainment"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "Colorado Symphony ", "ArtistImage": "https://photos.bandsintown.com/thumb/6132143.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classical Music, Classical", "Time": "7:30 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "The region’s only full-time professional orchestra, the Colorado Symphony embraces a tradition of musical excellence by presenting a diverse array of symphonic performances throughout the year. Originally established in 1989 as the successor to the Denver Symphony, the Colorado Symphony thrives on a spirit of collaboration among musicians, staff, trustees and the community. The Colorado Symphony performs in Boettcher Concert Hall and On Location throughout the state and region utilizing small ensembles to the full-sized orchestra. Programs include expanded education and outreach initiatives, as well as Masterworks, Pops, Holiday, Family, Inside the Score and Symphony on the Rocks series that have attracted an ever-increasing level of concertgoers. By presenting music that is both timeless and inspiring, while taking risks with new musical collaborations and interactive concerts, the Colorado Symphony is committed to reaching global audiences with the use of state-of-the-art digital media via live streaming and concert downloads. Join the Colorado Symphony Chorus of 180+ volunteer singers and be a part of the music! This outstanding chorus joins the Colorado Symphony for numerous performances to repeat critical acclaim. Learn more about the Chorus and the audition process at coloradosymphony.org/About/The-Chorus For more information about the Colorado Symphony, visit www.coloradosymphony.org. Creating extraordinary musical experiences that transport today’s listener, from the best of the past to the edge of the future.", "otherInfo": "Guster"}, {"Address": "25690 E Quincy Ave, Aurora, CO 80016", "Artist": "Twenty Hands High ", "ArtistImage": "https://photos.bandsintown.com/thumb/11173373.jpeg", "Coordinates": [39.6339352, -104.6921712], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Southern Rock, Red Dirt, Country", "Time": "7:30 PM", "Venue": "Arapahoe County Fairgrounds Event Center", "moreBioInfo": "A modern country & southern rock band with a tip of the hat to classic country and TX/OK red dirt.", "otherInfo": "LIVE MUSIC - country & southern rock"}, {"Address": "6255 W Quincy Ave, Denver, CO 80235", "Artist": "Steve Azar ", "ArtistImage": "https://photos.bandsintown.com/thumb/11100700.jpeg", "Coordinates": [39.64105110000001, -105.068071], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country, Blues, Americana", "Time": "7:30 PM", "Venue": "Golfers Against Cancer Gala", "moreBioInfo": "Steve Azar knew that someday he would leave his Mississippi Delta home to pursue his own life in music. A native of Greenville, MS, Azar is a hit songwriter, recording artist, and music producer whose sound traverses a blend of country, blues, funk, and rock n’ roll, a genre he calls, \"Delta Soul.\" Azar has released seven critically acclaimed studio albums. Waitin’ On Joe features the smash hit \"I Don't Have to Be Me ('til Monday),” which has received 3 BMI Million-Air awards, and is one of radio's top five played songs of the past two decades. Steve Azar & The Kings Men's Down At The Liquor Store, is backed by veteran bandmates of B.B. King, Elvis Presley, and other icons of music. His latest album, My Mississippi Reunion, is a collection of past and new songs inspired by his roots and growing up in Mississippi all coming together on one project. Azar is the official Music & Culture Ambassador of Mississippi. He also hosts his radio show and podcast titled In a Mississippi Minute with Steve Azar, available on all podcast platforms. Learn more at steveazar.com", "otherInfo": "No event info available"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "The Lone Bellow ", "ArtistImage": "https://photos.bandsintown.com/thumb/9543509.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Folk", "Time": "7:30 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "The Lone Bellow burst onto the scene with their self-titled debut in 2013. The Brooklyn-based band quickly became known for their transcendent harmonies, serious musicianship and raucous live performance — a reputation that earned them their rabid fan base. It's been three years since the band's victoriousThen Came The Morning was released. Produced by The National's Aaron Dessner, the album was nominated for an Americana Music Award. The band appeared on \"Jimmy Kimmel Live,\" \"Late Show With David Letterman,\" \"Conan O'Brien,\" \"CBS This Morning,\" \"Later...with Jools Holland,\" and \"The Late Late Show With James Corden\" in support of the album. In the years since the release, the band left their beloved adopted home of Brooklyn and moved to Nashville. Now, The Lone Bellow is back with Walk Into A Storm, which will be released Sept. 15 on Sony Music Masterworks. Walk Into A Storm was produced by legendary music producer Dave Cobb (Chris Stapleton, Sturgill Simpson, and more) and features their lead single \"Time's Always Leaving.\" The trio, featuring Zach Williams (guitar/vocals), Kanene Donehey Pipkin (multi-instrumentalist), and Brian Elmquist (guitar), recorded this album in only seven days. The group’s first two albums graced the Billboard 200.", "otherInfo": "No event info available"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Crystaleyez ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Globe Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "60 S Broadway, Denver, CO 80209", "Artist": "Spellbound ", "ArtistImage": "https://photos.bandsintown.com/thumb/273424.jpeg", "Coordinates": [39.715383, -104.9871239], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Thrash Metal, Metal", "Time": "8:00 PM", "Venue": "HQ", "moreBioInfo": "There are at least six bands with the name \"Spellbound\". 1) When you look at the Psychobilly movement of the 1980’s, Ireland is not a country that springs to mind as having played much of a part. However, in 1986 the bars and clubs of Dublin were quite literally crawling with demented rockabillies and quiffed-up mutants. There were plenty of live bands for them to follow too (for those, at least, who weren’t making the weekly trek to psychobilly ‘Mecca’ The KLUBFOOT at London’s Hammersmith Clarendon), The Klingonz (who quickly moved to London to save on bus fares!), Sharkbait (who disbanded at their peak when lead singer Dave Finnegan landed a leading role in Alan Parker’s motion picture ‘The Commitments’),there were Punky and ‘Cramp-ish’ bands like The Gorehounds, Kill-Devil Hill and the Boneshakers, while The Kroozers, Those Handsome Devils and The Crazy Wolves stayed closer to a ‘traditional’ 1950’s sound. Spellbound history - original line-up The Spells original line-up, circa 1984.You can view lots more old pics in our pictures section or on our message forums Spellbound was formed in 1986 by brothers Frankie and Adrian Hayes, who came from Bray, Co Wicklow, 15 miles south of Dublin City. Unlike other Irish bands of their time, Spellbound decided to head directly to mainland Europe, where their 1988 debut album ‘Mystical Madness’ was very well received and notched up many thousands in sales (amazingly, that album was never released in their home country). The boys blazed a brief trail across the rockabilly and psychobilly festivals of Germany and Scandanavia before, it seemed, vanishing back into the ‘Hellfire’ woods of County Wicklow. Spellbound history - new line-up Spellbound as they appear now...lots more pics in our pictures section or on our message forums Tentative moves toward a re-union were made in 2003 when guitarist friend Doyley (Klingonz, Demented are Go) contacted the Hayes brothers to inform them that copies of ‘Mystical Madness’ appeared to be changing hands on the internet for astronomical sums and to suggest he sit in on some gigs, if they could find a bass player. They drafted in Simon Farrell (ex- Sharkbait) and this was the line-up that appeared at Die-In-Style’s ‘Kings of Psychobilly 3’ At Speyer, Germany in November 2003. Unfortunately, both Doyley and Adrian were forced to drop out soon after due to existing commitments, and were replaced by Dave Mc Donald (ex- Kroozers) and Brian O Higgins (a drummer Simon worked alongside while touring with American rockabillies The Blue Moon Boys) Their most recent album, ‘A Fistful of Spells’ is the result of ever-increasing calls from fans for that long-awaited follow-up to ‘Mystical Madness’. The 2005 Spellbound line-up, while remaining true to the style and spirit of the original, brings the band bang-up-to-date with a new batch of original songs, alongside some (previously unrecorded) versions of old-school, rockin’-psycho classics. Original text – The Thing In The Attic, Feb 2005 SPELLBOUND ARE: Frankie Hayes Front Vocals/Backup Guitar Dave Mc Donald Plug-In Guitar/Backup Vocals Simon Farrell Big-Ass Bass/Backup Vocals Brian O Higgins Traps and Snares 2) Spellbound is also a German Thrash Metal band. This Spellbound are: Dave Maier Vocals, Guitar Daniel Tschoepe Guitar Hannes Jäger Bass Andy Flache Drums 3) Spellbound was a mid to late 1970s touring rock band popular on the West Coast, especially the Pacific Northwest and the west coast of Canada. Personnel included Ron Dobbins (vocals, guitars), Lance Fuqua (drums, vox), Brent Anderson (vox, guitars), Terri Anderson (vocals, bass). Members later went on to form Chameleon. 4) A Brazilian NSBM band. 5) A Swedish hard rock/metal band. 6) Spellbound was Lithuanian progressive metal band. Split up in 2000. 7) A german folk/worldmusic/medieval group.", "otherInfo": "A Goth + Darkwave DJ Night Featuring Rotating DJs"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Drawn ", "ArtistImage": "https://photos.bandsintown.com/thumb/6304318.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Other, Garage Band, Instrumental", "Time": "8:00 PM", "Venue": "Globe Hall", "moreBioInfo": "There is more than one artist with this name: 1) DRAWN was an exceptionally obscure Metal-tingled Psychedelic Progressive group, founded by Atle Dørum and Per K, . The group’s line-up consisted of Atle Dørum (vocals, guitars), Christer Cederberg ( known for his work with the Psychedelic Metal legends IN THE WOODS and ANIMAL ALPHA)…, in Kristiansand, Norway, (guitars, vocals), Per K(bass guitar) and Thomaz (drums). The collective was signed to Prophecy Production, for which they recorded two albums – an EP titled “Plan Be”, released in 1998, which was made of four tracks and was more like a warm-up before the debut album than anything; and the follow-up, called “A New World?” – a full-length album, which was released in 1999 under the same Label, after which the group ended their activity for no apparent reason. The group did not receive any proper advertising and consequently has not achieved any success in the underground circles and finding any information about them is almost impossible nowadays. Much like later era IN THE WOODS…, DRAWN explored an intriguing kind of music, that blends the tendencies and moods of Metal with psychedelic, progressive and ambient music, albeit Christer Cederberg, who was not the key figure behind ITW’s songwriting, has his own vision of composing music in this style. The group’s only full-length is impressively futuristic and forward-thinking, fusing contradicting elements to conceive a conceptual, spontaneous creation and can very well be considered one of the most innovative Norwegian projects. Their sombre, dark, atmospheric and eerie sound is unique and can not be compared to anything else, however, fans of IN THE WOODS… and OPETH, as light as the similarity between DRAWN and these band is, will find the engaging music of this group to be fascinating enough. Highly recommended to listeners of atmospheric Prog-Metal and heavier modern Psychedelic in general.", "otherInfo": "No event info available"}, {"Address": "918 W 1st Ave, Denver, CO 80223", "Artist": "Orca ", "ArtistImage": "https://photos.bandsintown.com/thumb/6029149.jpeg", "Coordinates": [39.7176452, -104.9992656], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Metal, Progressive Rock, Alternative", "Time": "8:00 PM", "Venue": "So Many Roads Museum and Brewery", "moreBioInfo": "With an instrumental lineup that includes the Hydro Harp, Acid Jug, Grindstone, Bottle Organ, Hammer & Nails, Broom, Bow & Saw, Axe, and Cement Mixer, ORCA (which means “power” in Faroese) has the most original band concept seen. Headed by Jens Thomsen, a staple in the Faroese music scene for years and former bassist of the influential band Clickhaze, ORCA makes primal, Nordic-saturated music on entirely homemade instruments.� ORCA got its beginning over Christmas 2005 when Thomsen, along with family and friends, built all the band's instruments out of scrap material and power tools salvaged from the family farm. After the instruments were finished, the group composed music for five days. The flurry of creativity culminated in recording their debut album “Livandi oyða”, and a live concert that remains the stuff of legend for young people here. (“You got invited to the ORCA concert? So cool.”) One criticism heard repeatedly of ORCA is that their lyrics are highly cryptic, and that the postmodern Faroese flow detracts from the quality of the musicianship. Fortunately for ORCA’s future plans for touring internationally, foreigners can blissfully ignore this fact, and focus their attention on the awesome sounds the instruments make at a live show, despite the challenge of transporting them and keeping everything tuned. A favorite is the Bottle Organ, which is a series of soda bottle with different levels of water in each, attached to air compressor nozzles. With extensive performing experience, strong musicianship and those crazy instruments, ORCA offers a great live music experience. Hopefully their instruments can just hold together long enough for the world to hear it.", "otherInfo": "No event info available"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Trevor Michael ", "ArtistImage": "https://photos.bandsintown.com/thumb/4668789.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Globe Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "2637 Welton St, Denver, CO 80205", "Artist": "Ramirez. ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.75453640000001, -104.9788397], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Cervantes' Masterpiece Ballroom & Cervantes' Other Side", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "60 S Broadway, Denver, CO 80209", "Artist": "Dj.E.L.I. ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.715383, -104.9871239], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "HQ", "moreBioInfo": "No artist bio available", "otherInfo": "A Goth + Darkwave DJ Night Featuring Rotating DJs"}, {"Address": "2637 Welton St, Denver, CO 80205", "Artist": "Ramirez ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.75453640000001, -104.9788397], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Cervantes' Masterpiece Ballroom & Cervantes' Other Side", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "817 Main St, Louisville, CO 80027", "Artist": "Tim Montana ", "ArtistImage": "https://photos.bandsintown.com/thumb/10410182.jpeg", "Coordinates": [39.9781583, -105.1324512], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country", "Time": "8:00 PM", "Venue": "Waterloo", "moreBioInfo": "It’s easy to see why Montana’s music connects with so many people far and wide. Dubbed as one of Rolling Stone’s “Artists You Need to Know,” his musical influencers range from Merle Haggard to Guns N’ Roses. Montana’s passion for music has not gone unnoticed by his fellow musicians. “Tim is the real deal. He’s a little bit country with lots of hard rocks — or maybe he’s a rocker in touch with some serious country roots,” says ZZ Top’s Billy Gibbons. Tim grew up in Butte, MT in a household that did not support his musical career. He quickly learned if he wanted to make a reality of out his passion to sing and play guitar, he had to escape Big Sky Country. He packed his bags and made his way to the heart of country music, Nashville, TN. Soon after living in Nashville, a rodeo performance caught the attention of David Letterman. David was so impressed by Tim’s music, he personally invited Tim to perform on The Late Show with David Letterman. Montana continued to write and record which earned him a worldwide publishing deal with the Spirit Music Group. This led to an introduction with ZZ Top’s Billy Gibbons. The two of them collaborated on multiple different tracks including, “This Beard Came Here to Party” which was the anthem for the Nashville Predator’s 2017 Stanley Cup Playoffs. Tim followed up with writing on Kid Rock’s current single, “Tennessee Mountain Top” and “Greatest Show On Earth” as well as Mac McAnally’s current hit, “Amarula Sun.” In September 2017, Tim released his single, “Hillbilly Rich.” Rolling Stone called the song an, “an ode to fantasies about telling off your boss, making it rain, and having everything all at once.” Shortly after the song was released, Tim performed the single live on Fox & Friends. Tim Montana is represented by Periscope Music Group and Red 11 Music. Manager Contact: Jake Crownover, jake@periscopemusicgroup.com / 830-237-1505", "otherInfo": "No event info available"}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Béla Fleck ", "ArtistImage": "https://photos.bandsintown.com/thumb/8671933.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country, Bluegrass, Jazz", "Time": "8:00 PM", "Venue": "Béla Fleck \"My Bluegrass Heart\" @ RockyGrass Festival, feat. Michael Cleveland, Sierra Hull, Justin Moses, Mark Schatz, Bryan Sutton", "moreBioInfo": "Béla Fleck (born July 10, 1958 in New York City, New York) is an American virtuoso banjo player. He is most well known for his work with the band Béla Fleck and the Flecktones, which he has described as \"a mixture of acoustic and electronic music with a lot of roots in folk and bluegrass as well as funk and jazz.\" Fleck, who is named after famous Hungarian composer Béla Bartók, was drawn to the banjo when he first heard Earl Scruggs play the theme song for the television show Beverly Hillbillies. He received his first banjo at age fifteen from his grandfather (1973). Later, Fleck would enroll in New York City's High School of Music and Art where he studied French horn. Almost immediately after high school, Fleck traveled to Boston to play with Jack Tottle and Mark Schatz in Tasty Licks. It is with Tasty Licks that Fleck played on his first major album. During this period, Fleck released his first solo album (1979) \"Crossing the Tracks\". It was Fleck's first foray into progressive bluegrass composition. Fleck would play on the streets of Boston with bassist Mark Schatz until the two formed Spectrum: the Band in 1981. Fleck toured with Spectrum until 1981. That year, Fleck was asked by Sam Bush and company to join New Grass Revival. Fleck performed with New Grass Revival for nine years. During this time, Fleck recorded another solo album, \"Drive.\" It was nominated for a Grammy Award in the then first-time category of Best Bluegrass Album (1988). After a 1988 phone call with bassist Victor Wooten, Fleck and Wooten formed Béla Fleck and the Flecktones, rounded out with harmonica player Howard Levy and Wooten's percussionist brother Roy \"Future Man\" Wooten, who plays synthesizer-based percussion. Saxophonist Jeff Coffin joined the group with the album \"Left of Cool\". With the Flecktones, Fleck has been nominated for and won several Grammy awards. Fleck has shared Grammy wins with Asleep at the Wheel, Alison Brown, and Edgar Meyer. He has been nominated in more categories than any other musician, namely country, pop, jazz, bluegrass, classical, folk, and spoken word, as well as composition and arranging.", "otherInfo": "No event info available"}, {"Address": "5450 N Valley Hwy, Denver, CO 80216", "Artist": "Justin Lee Partin ", "ArtistImage": "https://photos.bandsintown.com/thumb/7900806.jpeg", "Coordinates": [39.7951087, -104.9866485], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Grizzly Rose", "moreBioInfo": "No artist bio available", "otherInfo": "Justin Lee Partin will be performing at The Grizzly Rose in Denver, Colorado on July 25th, 2021."}, {"Address": "500 W Main St, Lyons, CO 80540", "Artist": "Sierra Hull ", "ArtistImage": "https://photos.bandsintown.com/thumb/11155213.jpeg", "Coordinates": [40.226863, -105.2733015], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Americana, Folk, Bluegrass", "Time": "8:30 PM", "Venue": "RockyGrass Festival 2021 -  - Béla Fleck's \"My Bluegrass Heart\" feat. Michael Cleveland, Sierra Hull, Justin Moses, Mark Schatz, Bryan Sutton", "moreBioInfo": "Sierra Hull’s positively stellar career started early.  That is, if you consider a Grand Ole Opry debut at age 10, called back to the famed stage a few months later at age 11 to perform with her hero and mentor Alison Krauss to be early.  She played Carnegie Hall at 12; at 13 signed with Rounder Records and later issued her debut, Secrets, and garnered the first of many nominations for Mandolin Player of the Year. She eventually made history by becoming the first female to win the prestigious title.  She played the Kennedy Center at 16 and the next year became the first bluegrass musician to receive a Presidential Scholarship from Berklee College of Music.  As a 20-year-old, Hull played the White House and would later be invited back for a second time. Now in her late 20s, Sierra has received GRAMMY nominations for her last two solo albums and continues to push the musical boundaries with her continued love of exploration in music. She remains deeply rooted in the Bluegrass community but is also inspired and excited by the ever-evolving roots scene. When not working on solo projects, her ability to span multiple genres has led to collaborations with friends and icons such as the Indigo Girls, Garth Brooks, Béla Fleck, Gillian Welch, Brandi Carlile, Dierks Bentley, Cory Wong, Steve Martin, Bobby McFerrin, Jewel, Edgar Meyer and Sturgill Simpson.", "otherInfo": "No event info available"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "Been Stellar ", "ArtistImage": "https://photos.bandsintown.com/thumb/10300154.jpeg", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Indie Rock, Rock, Punk", "Time": "9:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "Been Stellar is originally from Michigan and recently relocated to NYC: home to some of their biggest influences including The Strokes and Interpol. The band’s indie rock charm is infectious. Their upbeat and gritty guitar riffs paired with witty lyrics has the power to radiate a contagious energy throughout a crowd. If you didn’t like moshing before, you won’t be able to help yourself after listening to this band. “Accompanied by garage-y guitars, lo-fi keyboard flourishes, and satisfyingly stripped down bass and drums, Slocum’s voice embodies the youthfulness that makes this band so compelling. Yet, this youthfulness is, perhaps paradoxically, built on a level of maturity far beyond the young bands’ years.” -Melted Magazine", "otherInfo": "Catcher/Been Stellar/ Waiting Room"}, {"Address": "511 Zerex St #103, Fraser, CO 80442", "Artist": "Tara Rose and The Real Deal ", "ArtistImage": "https://photos.bandsintown.com/thumb/9689323.jpeg", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Acoustic, Folk, Jam Bands, Americana, Bluegrass", "Time": "9:00 PM", "Venue": "Tara Rose Solo", "moreBioInfo": "Tara Rose and The Real Deal are a Colorado Rocky Mountain based string band with a kick-drum that are not afraid to step outside of traditional genre boundaries. With an ever growing list of original music and their brand new 5-song EP in hand to sell on the road, they will keep any audience on their toes with their energetic blend of folk, bluegrass, pop, rock and roll covers.", "otherInfo": "No event info available"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "Catcher ", "ArtistImage": "https://photos.bandsintown.com/thumb/135690.jpeg", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "There are 3 artists named Catcher. 1. An alias of the guys behind Transa and Cascade. 2 . The illegitimate love child of Trevor Bennett's many and varied musical interests and influences. A singer and composer from a young age, Trevor has balanced with his love for industrial and hard rock a heavy involvement in classical music, choral and a capella singing, musical theatre, operatic performance, and dabblings in jazz, electronica, and metal. Early studies in piano and trumpet led to the guitars, bass, and eventual forays into programming and sequencing which make up the bulk of catcher's palette. What began as Trevor's solo endeavour has evolved into two separate musical entities - first, the studio construct, still primarily the domain of the vocalist and multi-instrumentalist, where his vocal layering and melodic and textural forays are played out to the fullest. The flip side of the project is the live band, a collective which is only made richer and more immediate by the emotional and musical contributions of all members - each a profound and talented player in his own right. Together, there is a commitment to the material and an attention to detail that make for a dynamic, engaging, and memorable performance. http://catcher.ca 3. An Indie Rock band formed in 1994 and based in Glasgow, Scotland. The band has had numerous lineups but essentially revolves around the songwriting of singer/guitarist Michael Barry. Musically they fall somewhere between the frenetic rush of early Buzzcocks and the considered celtic folkisms of Christy Moore. The band have released 4 albums, most recently 2007's \"Bi Polar Bear Disorder\" and hold the record for most appearances in the city's King Tuts Wah Wah Hut. www.myspace.com/catcherglasgowindieband", "otherInfo": "Catcher/Been Stellar/ Waiting Room"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "Waiting Room ", "ArtistImage": "https://photos.bandsintown.com/thumb/7756135.jpeg", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alternative, Emo, Punk, Rock, Indie", "Time": "9:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "Waiting Room - Buffalo's premier live music venue. Buy tix at online at ticketfly.com, 716.893.2900 ext 2, at 630 Elmwood or at Record Theatre locations", "otherInfo": "Catcher/Been Stellar/ Waiting Room"}, {"Address": "2721 Larimer St, Denver, CO 80205", "Artist": "Branson Anderson ", "ArtistImage": "https://photos.bandsintown.com/thumb/9009804.jpeg", "Coordinates": [39.7599499, -104.9838489], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Blues, Folk, Country, Americana", "Time": "8:00 PM", "Venue": "Larimer Lounge", "moreBioInfo": "Ogden, UT based singer", "otherInfo": "No event info available"}, {"Address": "7 S Broadway, Denver, CO 80209", "Artist": "George Cessna ", "ArtistImage": "https://photos.bandsintown.com/thumb/262086.jpeg", "Coordinates": [39.716333, -104.9877689], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Hi-Dive", "moreBioInfo": "No artist bio available", "otherInfo": "Hunter Hicks / Shawn Hess / Johno Leeroy / George Cessna\nSaturday August 14th\n21+ Doors at 7 PM!"}, {"Address": "2721 Larimer St, Denver, CO 80205", "Artist": "The Backseat Lovers ", "ArtistImage": "https://photos.bandsintown.com/thumb/11135682.jpeg", "Coordinates": [39.7599499, -104.9838489], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Larimer Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "200 Columbine St #110, Denver, CO 80206", "Artist": "Bunny Blake Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11485864.jpeg", "Coordinates": [39.7599499, -104.9838489], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "R&b, Pop", "Time": "5:00 PM", "Venue": "SOL Mexican Cocina | Cherry Creek", "moreBioInfo": "Bunny Blake is a public figure, an old soul trapped in the body of a 20 something. Influenced by the vocals of Mariah Carey and Mary J Blige with the guitar styling of James Taylor and John Mayer, Bunny’s genre can be best described as pop/r&b with soulful, finger style guitar. Her name is inspired by The Twilight Zone, mirroring her many dimensions as an artist. One can learn the most about Bunny through her songwriting. Striking a balance between Cutesy and Sexy, Sweet and Sassy, each song expresses a different dimension of femininity. Bunny leaves little to the imagination. Her song “$$$” speaks candidly to the reality of being a full time musician while “Pisces” and “Dominos” appeal to her more playful side. “Good Intentions” is perhaps her most emotionally honest work about the value of transparency in a relationship. In a past life, Bunny has traveled the world with her music as Lindsey Saunders. From receiving a Gibson Les Paul from a kind stranger at the Pinetop Music festival in Arizona, to meeting one of the infamous members of the Beach Boys in the Airport after playing the Copenhagen Songwriters Festival, she’s always sure to travel with a bit of whimsy in her back pocket. When attending Bunny’s live show, it doesn’t take long to see why she claims it was the guitar that chose her - not the other way around. Bunny’s unconventional chord crafting has earned her a Taylor Guitar Artist Partnership with notable performances at events such as the Sundance Film Festival, Boulder International Film Festival, Durango Songwriters Expo, SXSW and CMJ Music Marathon. Bunny has received many accolades for her work being noted as a musician whose artistry and poise as a songwriter, guitarist, and vocalist demands to be both seen and heard.", "otherInfo": "Taco and Tequila Tuesday for the Good SOL'd People!"}, {"Address": "1578 S Broadway, Denver, CO 80210", "Artist": "MOON FEVER ", "ArtistImage": "https://photos.bandsintown.com/thumb/11324572.jpeg", "Coordinates": [39.6878673, -104.9872152], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Hinder & Moon Fever LIVE", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "1600 Miner St, Idaho Springs, CO 80452", "Artist": "Nordic Daughter ", "ArtistImage": "https://photos.bandsintown.com/thumb/11086448.jpeg", "Coordinates": [39.7421809, -105.5158179], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Rock, Acoustic, Blues, Folk", "Time": "6:00 PM", "Venue": "Miner Street Mischief and Music!", "moreBioInfo": "Nordic Daughter is more than just a musical project it is an experience in variety, acceptance, love and logic. The musical concepts behind the music build a sense of intimacy with the audience that can only be described as genuine and authentic. The vocal stylings of Melissa Lycan are unique yet classic and the songs she delivers are heart felt and blended. The project began in 2014 after years of working in the music business the members chose to write the first versions of the songs ready to be produced in the studio. The first EP “Forgotten” was released in 2017. The second Album \"The Path\" in fall of 2018. The band is working on the 3rd album in 2021 and released three of the featured tracks in Summer of 2020. The band has performed with artists like Jack Russell and Great White, Lost Point and Michael Morrow, selling out venues up to 500. Melissa Lycan was privately instructed in piano for 6 years from the age of 7 when she began to compose her own songs and focused heavily on academics. Though she never stopped writing. She had three vocal instructors including Lance Bendiksen of Bendiksen Productions and has compiled thousands of songs/poems over the last 20 years. In addition to her Bachelor of Music Business at Full Sail University she holds a Masters Degree in Business Intelligence. Jason Lycan has been building unique melodies for 25 years as a self educated musician. Jason has played music in several bands playing stages with artists like TRAPT, THC, FLAW, HED PE, ONE EYED DOLL, SALIVA and more. He is endorsed by Talon Pics in Denver, CO and continues to pursue a wide range of musical endeavors including his Hard Rock band Something For Tomorrow. Haiden Davis is classically trained through Denver School of the Arts for both Middle School and High School. He has performed in venues like Carnegie Hall, Denver CPA and colleges and orchestras across the United States. He is a Junior at CU Denver in Violin Performance. Michael Young is also classically trained through private instruction and participation as 1st Chair in Colorado Youth Orchestra and Concert Master for violin in Western States. He is a Sophomore at Lakewood High School and is already writing the third album with the band. Ahrue Luster the producer of the Album, has been performing stages around the world as the lead guitar for bands like Machine Head in the late 90’s and Ill Nino today. We was the genius behind the Bass and Drum tracking. Several of his songs have made it to the top of the Rock and Metal Charts through out the years. Nordic Daughter’s main focus is to tour the world teaching children how to write music as an outlet for their own voices. Interested in playing large benefit concerts for charities for free, performing our fully Choreographed show for fans all over the world and giving as much of our hearts and minds to the planet as it can handle. Get ready for the fiercest of all warriors, NORDIC DAUGHTER! Instruments Used on the Album Acoustic Guitar: Randy Jackson with DiAddario Strings and Talon Pick. Electric Guitar: Schecter Diamond Series with GHS Strings and Dunlop Pick Violin: Brandon McDougal 5 String Liquid Violin w Vision Solo strings and Minor Bling Fine Tuner w Swarovski Crystals. Drums: Steven Slate Drums \"Forgotten\" Tama Live Drums \"The Path\" Microphone: Neumann TLM 87", "otherInfo": "Come check out the band in a beautiful mountain setting and grab dinner on Miner Street at any of the fabulous local restaurants."}, {"Address": "450 Main St, Lyons, CO 80540", "Artist": "Eric Thorin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9048868.jpeg", "Coordinates": [40.2248924, -105.271254], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "MainStage Brewing Company", "moreBioInfo": "Eric Thorin is a highly regarded musician/bassist living on the front range of the Colorado Rocky Mountains.  He can be found on stage in 2019 with Ross Martin in The Matt Flinner Trio, Danny Barnes’ Space Program with Jeff Sipe and Mike Seal, and various touring luminaries such as Jim Hurst, Darol Anger, Blaine Sprouse, Tony Furtado, Keith Little and more. Eric remains active in the studio as producer and performer, has written more than 150 compositions as a member of The Matt Flinner Trio, orchestrated songs for Elephant Revival with the Colorado Symphony and Colorado Music Festival Orchestras and mixed, mastered and produced the debut recording release of Take Down the Door, Live in Lyons.  Teaching is a big part of his presence in 2018 including The Montana Fiddle Camp, KCBassWorkshop as well as serving as adjunct faculty in the newly formed Folk and Bluegrass program at the University of Northern Colorado.", "otherInfo": "Legendary open bluegrass jam"}, {"Address": "Denver, CO", "Artist": "(hed) p.e. ", "ArtistImage": "https://photos.bandsintown.com/thumb/11463043.jpeg", "Coordinates": [39.7392358, -104.990251], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Rasta, Punk, Rock", "Time": "6:00 PM", "Venue": "Hermans Hideaway", "moreBioInfo": "Legendary SoCal artists (HED) P.E. have revealed details for their upcoming “Sandmine” EP”, set for release on July 23rd, 2021 via Suburban Noize Records. (HED) P.E. will commemorate the new release by hitting the road starting July 23rd in Las Vegas, NV for a month-long headlining tour. The tour will also mark the first time the band performed tracks off their critically acclaimed twelfth-studio, \"Class of 2020\", which was released last year. \"After the success of 'Class of 2020', we wanted to give the fans more of what they wanted! The pandemic, the election, the reaction, the pending birth of my daughter...all these experiences fueled the inspiration for Sandmine. The title itself names a brutal place where only the strong survive and few are able to escape,” comments frontman Jared Gomes. \"On 'Class of 2020' we went back to our roots with the back-to-basics approach; but on this one we mixed all those elements together with our signature G-Punk sound and a pissed off ‘Sandmine’ was born. I cannot wait for the world to hear this one.\" Recorded at Gomes home studio in Idaho, the seeds of \"Sandmine\" were triggered by producer/songwriter Remy Dovianus who co-wrote and co-produced the EP. Dovianus has been a lifelong (HED) P.E. fan and recorded the guitar and bass in The Netherlands with a goal of harnessing the signature sound of the band's biggest albums. Drummer Jeremiah \"Trauma\" Stratton laid down his drums with an emphasis complimenting the deep metallic grooves. Frontman Jared Gomes is at the top of his game and ever defiant on \"Sandmine\", recording vocals that draw inspiration from the raw aggression of Suicidal Tendencies and Rage Against The Machine, mixed with the unfiltered hardcore tones of Hatebreed. \"Sandmine\" encapsulates the old thrashiness and ferocity of early (Hed) P.E albums, weaving together a complex mixture of poignant punk-rock, brutal riffs, and bludgeoning drums that packs a walloping punch. (HED) P.E. are the pioneers of the G-Punk sound, which fuses together punk-rock, metal, hip-hop and reggae. For over two decades, the band has toured the world alongside hard rock chart-toppers like Papa Roach and Linkin Park, hardcore legends Suicidal Tendencies, as well as the iconic Ozzfest Tour. (HED) P.E. experienced a creative resurgence after signing with Suburban Noize Records in the early 2000s and was instrumental in developing the booming underground scene.", "otherInfo": "No event info available"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "EPTIC ", "ArtistImage": "https://photos.bandsintown.com/thumb/8674929.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Electronic, Dubstep", "Time": "7:00 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "No artist bio available", "otherInfo": "SLANDER presents The Eye Strikes Back"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "Michigan Rattlers ", "ArtistImage": "https://photos.bandsintown.com/thumb/11270556.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Alternative Country, Country Alternative, Rock & Roll, Country, Alt Country, Americana, Rock", "Time": "7:00 PM", "Venue": "Globe Hall", "moreBioInfo": "Lifelong friends and deep-north natives, Michigan Rattlers play heavy-hearted folk-rock with an aching dose of Midwestern nice. Graham Young (guitar), Adam Reed (upright bass), Christian Wilder (piano), and Tony Audia (drums) began writing music and performing together in their Northern Michigan high school. They regularly played every bar, cafe, and stage in town, developing a musical chemistry informed by the likes of AC/DC, Creedence Clearwater Revival, Bob Seger, and more. “Petoskey is a small place. Beautiful, but secluded. It’s hard to start a musical career in a place where there are more deer than people.” Still, they regularly played every bar, cafe, and stage in town, developing a musical chemistry informed by the likes of AC/DC, Creedence Clearwater Revival, Bob Seger, and more. After a few years apart, Reed and Young settled down in Los Angeles, recorded a short demo, and began playing locally. The demo found its way into the hands of super-producer Johnny K (Plain White T's, 3 Doors Down), and they cut the bulk of their first EP at NRG Studios in just one day. \"My favorite music is recorded that way,\" continues Reed. \"You get in a room, plug in, and cut songs live. The energy of the recording comes directly from the physical performance, and it puts the listener into that specific time and place.\" This self-titled Michigan Rattlers EP attracted glowing reviews from No Depression, Bluegrass Situation, B3 Science, and Rolling Stone, who named the band one of their “Ten New Country Artists You Need To Know” in 2016. They spent the rest of that year and much of the next touring in support of this release. In September 2017, Pianist Christian Wilder was added to the band’s lineup. Now a trio, the group headed into the studio to record their newest EP, Wasting the Meaning. Comprised of three cover songs, the project was conceived as a way to explore deeper into the recording process and pay homage to some of their favorite songwriters. The bands first full length record, \"Evergreen\", was released in September of 2018. Extensive touring followed in support of the release. January 2019 saw the addition of Tony Audia on drums as a full time member, rounding out the four-piece group. In another year of heavy touring, the band played headlining shows across the country, as well as support dates for artists such as: Bob Seger, Greensky Bluegrass, and Justin Townes Earle.", "otherInfo": "Michigan Rattlers at Globe Hall"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "WAVEDASH ", "ArtistImage": "https://photos.bandsintown.com/thumb/8735547.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Electronic", "Time": "7:00 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "No artist bio available", "otherInfo": "SLANDER presents The Eye Strikes Back"}, {"Address": "18300 W Alameda Pkwy, Morrison, CO 80465", "Artist": "Dylan Matthew ", "ArtistImage": "https://photos.bandsintown.com/thumb/8617556.jpeg", "Coordinates": [39.6664666, -105.2048546], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "R&b/soul, Rnb-soul, Singer-songwriter, R&b, Pop", "Time": "7:00 PM", "Venue": "Red Rocks Amphitheatre", "moreBioInfo": "Singer-Songwriter/Producer/Engineer https://open.spotify.com/artist/6d0ZjIp5L7Ygy2l02HskRX", "otherInfo": "SLANDER presents The Eye Strikes Back"}, {"Address": "900 Baseline Rd, Boulder, CO 80302", "Artist": "Colorado Music Festival ", "ArtistImage": "https://photos.bandsintown.com/thumb/8259556.jpeg", "Coordinates": [40.000023, -105.2819456], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Classical", "Time": "7:30 PM", "Venue": "Chautauqua Auditorium", "moreBioInfo": "Under the artistic vision of Maestro Peter Oundjian, the Colorado Music Festival thrills audiences of more than 20,000 each season with programming that embraces the most beloved classical music repertoire, while integrating world music and the works of exciting modern composers. Balanced programming performed by exceptional musicians has earned CMF ten ASCAP awards for \"Adventuresome Programming of Contemporary Music,\" and the kudos of the press and public alike. Sunday evenings feature the CMF Chamber Orchestra, Saturday bring chamber music ensembles, and Thursday and Friday evenings showcase the full CMF Festival Orchestra. Throughout the season, emerging talent from Europe, Asia, South America and the U.S. join CMF musicians in performances that inspire and engage concertgoers of all ages. \"A night like this makes one truly appreciate the value of an organization like the CMF to the community. It is indeed a summer gem.\" ~The Daily Camera~ Located in a 10,000 sq. ft. former church building at 200 E. Baseline Rd. in Lafayette, Colorado, the Center for Musical Arts (CMA) employs over 40 professional teaching artists, serving approximately 500 students weekly, and thousands of annual concert audience members. A full member of the National Guild for Community Arts Education, the CMA turns no one away, with its Heartstrings Program of tuition assistance and musical instrument bank. CMA students primarily come from Lafayette, Louisville, Erie, Broomfield, Superior, Boulder, Niwot, Longmont, Brighton, Thornton, Northglenn, and Arvada. Key CMA beliefs: • The significant power of music to enrich human existence and create community. • The value of all kinds of music. • The creative potential of every individual. • Access to music for all members of the community. • Excellent and inspiring musical mentorship. • The value of trust, integrity, and respect, within a heart-centered environment.within a heart-centered environment. The Colorado Music Festival and Center for Musical Arts merged in 2009. CMF presents a six-week summer concert season at the historic Chautauqua Auditorium in Boulder, CO. The organization, a non-profit 501(c)(3), raises approximately 50% of its operating budget from grants, individual donations, business partners, and special events. Donations are tax-deductible.", "otherInfo": "No event info available"}, {"Address": "1578 S Broadway, Denver, CO 80210", "Artist": "Hinder ", "ArtistImage": "https://photos.bandsintown.com/thumb/8927413.jpeg", "Coordinates": [39.6878673, -104.9872152], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Rock", "Time": "8:00 PM", "Venue": "Herman's Hideaway", "moreBioInfo": "Multi-platinum American rockers, HINDER, continue to drive a career of longevity that few bands achieve. Their stats resonate just that, selling over 4 million albums and 10 million singles, garnering north of 150 million video views, and passing the 100 million streams mark. Throw on top the endless energy HINDER has brought to over 15 headlining tours and you can see why they are still rocking long since their formation in 2001. August 11th of 2017 brought another career highlight. The release of their 6th Studio album, coincidently titled THE REIGN, on The End Records/BMG. This would be their 3rd release with the New York based record label, preceded by HINDER’s first ever acoustic EP STRIPPED on May 13, 2016. Their 5th full-length studio album When The Smoke Clears entered the Billboard 200 while also claiming four other Top 10 chart positions upon its on May 12, 2015. As one of the few rock bands to grab massive cross-over success, HINDER’s 2005 debut album, Extreme Behavior, climbed to #6 on the Billboard 200 chart and was the 2nd Top Rock Album. Get Stoned would be the album’s first radio single, climbing to a #4 mainstream rock spot. What followed would end up being one of the biggest songs of the year, Lips of an Angel, which peaked within the top 10 across several Billboard singles charts, including #1 at Top 40 and Pop 100. Extreme Behavior has since been certified 3x Platinum. Their hometown inducted them into the Oklahoma Music Hall of Fame in 2007. In 2008 their sophomore effort, Take It To The Limit, surpassed their debut by peaking at #4 on the Billboard 200 and hitting the Mainstream Rock chart at #3 with single Use Me. This solidified HINDER as the biggest new breakout rock act and catapulting them into packed arenas worldwide with the likes of Aerosmith, Mötley Crüe, Nickelback, 3 Doors Down, Papa Roach, and many others. HINDER proved consistent record hit making by following up with a #1 Top Modern Rock/Alternative Album, All American Nightmare (LP 3), and a #3 Top Hard Rock Album, Welcome To The Freakshow (LP 5).", "otherInfo": "HERMAN'S HIDEAWAY PRESENTS: JAZZ ON BROADWAY WITH\nMYRON HENDLEY, TONY EXUM JR.,AND MICHAEL C. WITH THE VINYL REVIVAL"}, {"Address": "4483 Logan St, Denver, CO 80216", "Artist": "The Cerny Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/11506158.jpeg", "Coordinates": [39.778064, -104.9825518], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Heartland Rock, Americana, Rock", "Time": "8:00 PM", "Venue": "Globe Hall", "moreBioInfo": "After several years of living and making music in Los Angeles, the Illinois-raised brothers hit the road for another tour and brought their songs to Nashville, where they now call home. In 2019 Rolling Stone Country named the The Cerny Brothers, \"The Americana Artist You Need To Know\" while they played stages across the country supporting Christone \"Kingfish\" Ingram, Don Felder, Jon Anderson, Blackberry Smoke, Paul Thorn and Justin Townes Earle. They spent last year coming back to the heart of what they do best - writing songs. The brothers' have crafted their own mix of rock and Americana laced with pop-inspired hooks that will keep their songs on repeat in your head all day. \"No fluff, no filler and all heart, these guys are simply the real deal much in the same way Springsteen was in 73 or Petty in 76\" - American Songwriter", "otherInfo": "No event info available"}, {"Address": "5225 W 80th Ave, Arvada, CO 80003", "Artist": "DJ Rockstar Aaron ", "ArtistImage": "https://photos.bandsintown.com/thumb/11008036.jpeg", "Coordinates": [39.8424818, -105.0541488], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Wedding Dj, Open Format, Las Vegas Dj, Edm, Denver Dj", "Time": "8:00 PM", "Venue": "Forbidden Bingo at 'Bout Time Pub & Grub", "moreBioInfo": "Award-winning DJ based in Denver and Las Vegas.", "otherInfo": "Forbidden Bingo Live in person Tuesdays at 'Bout Time Pub & Grub"}, {"Address": "2706 Larimer St, Denver, CO 80205", "Artist": "Josh Machiz ", "ArtistImage": "https://photos.bandsintown.com/thumb/8697860.jpeg", "Coordinates": [39.7594508, -104.9836778], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Stand-up Comedy @ American Bonded", "moreBioInfo": "I am a musician, comedian, and composer that plays with so many bands that I've lost count. It's somewhere between 5 and 15. I play music and do comedy all over North American. Come.", "otherInfo": "No event info available"}, {"Address": "60 S Broadway, Denver, CO 80209", "Artist": "Darkwave ", "ArtistImage": "https://photos.bandsintown.com/thumb/6357213.jpeg", "Coordinates": [39.715383, -104.9871239], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Alternative, Synth Pop, 80s Alternative, Post Punk, Pop, New Wave Punk, Synthpop, Post-punk, Punk, New Wave", "Time": "9:00 PM", "Venue": "HQ", "moreBioInfo": "Darkwave sets itself apart from formulaic Top 40 New Wave tribute bands by including even more classic songs, ranging from the upbeat sounds of Blondie, INXS and Duran Duran to dancefloor hits by Depeche Mode, New Order and A Flock of Seagulls, all the way to the more brooding tones of The Cure, Psychedelic Furs and Joy Division. Darkwave delivers an engaging live show high on energy and audience interaction that is perfect for your club, theme night, or private party. Darkwave delivers an engaging, dance-friendly live show packed with the best of New Wave and 80s Alternative classics.", "otherInfo": "DJ's Niq V and Luci Cobalt"}, {"Address": "60 S Broadway, Denver, CO 80209", "Artist": "goth ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [39.715383, -104.9871239], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "HQ", "moreBioInfo": "No artist bio available", "otherInfo": "DJ's Niq V and Luci Cobalt"}]