var milwaukee_events = [{"Address": "N2062 S Lake Shore Dr, Lake Geneva, WI 53147", "Artist": "Cole Brandt ", "ArtistImage": "https://photos.bandsintown.com/thumb/11104212.jpeg", "Coordinates": [42.565567, -88.4365645], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Pop, Electronic Dance Music, Acoustic Guitar, Classical, Jazz, Spanish, Acoustic Pop, Tropical House", "Time": "1:00 PM", "Venue": "Cole Brandt Live@ The Boat House", "moreBioInfo": "I'm a musician from the Rockford/Chicago/Madison areas. I specialize in pop/rock/jazz/classical acoustic music as well as electronic dance music.", "otherInfo": "Cole Brandt Live"}, {"Address": "899 Main St, Antioch, IL 60002", "Artist": "Lauren Ashley Hall ", "ArtistImage": "https://photos.bandsintown.com/thumb/11239440.jpeg", "Coordinates": [42.4783848, -88.09593389999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Soul, R&b, Pop, Pop-soul", "Time": "1:00 PM", "Venue": "The Lodge of Antioch", "moreBioInfo": "Hailing from the suburbs of Chicago, Lauren Hall, a 27 year old singer songwriter, always had a deep desire to share her voice with the world. In 2016, this former division 1 collegiate soccer player decided to pack up her things and move across the country to Los Angeles to pursue her dreams of singing. Having no plan in mind, she became a part of the rat race: she began to serve and bus tables in various Hollywood restaurants to make ends meet, while gigging as much as she could on the weekends. In 2019, after auditioning for 7 years straight, Lauren finally realized her dream of becoming a contestant on NBC’s “The Voice”, representing Team Kelly and, eventually, Team Blake. After being eliminated in the top 32, she went right back to serving tables, while using the weekends to tour up and down the California coast, organically growing her fanbase and repertoire, while attempting to capitalize on her appearance on the hit reality singing competition, “The Voice”. When COVID-19 hit, the restaurant Lauren worked at was inevitably shutdown and all future shows were indefinitely cancelled. With no means of income and a citywide lockdown, Lauren was eventually forced to move back into her parents’ home in the Midwest. Lauren now works from home, while pursuing and perfecting her craft. She throws concerts every Tuesday on her  Instagram & Facebook pages and plays live shows every weekend, all around the Chicagoland area.", "otherInfo": "Join us for an acoustic lunch saturday from 1-3pm!"}, {"Address": "2417 Silvernail Rd, Pewaukee, WI 53072", "Artist": "Catelyn Picco ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.044997, -88.2668389], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Pop, Country Pop, Acoustic", "Time": "2:00 PM", "Venue": "The Waukesha County Fair -- Family Fun Stage", "moreBioInfo": "Catelyn Picco is a Singer/Songwriter from Waukesha, Wisconsin. She has been singing for as long as she can remember and when she picked up a guitar at age 12, she knew that performing was something she loved. She has a love for country music, superhero movies and meeting new people. Her previous experience includes: Summerfest, The Wisconsin State Fair, The Waukesha County Fair, and more! In addition to that, her EP titled “Strong and Courageous” is available for streaming on Spotify! For more information and updates about Catelyn visit her website at: www.catelynpicco.com as well as follow her on social media.", "otherInfo": "No event info available"}, {"Address": "4510 Raynor Ave, Racine County, WI 53126", "Artist": "Robert Allen Jr. Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11380843.jpeg", "Coordinates": [42.7788623, -88.0716582], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues, Blues-rock", "Time": "2:00 PM", "Venue": "Peppers Pub", "moreBioInfo": "\"BLUES ARTIST OF THE YEAR NOMINEE\" 2019 -WAMI AWARDS \"MILWAUKEE'S BEST WINNER\" 2019 -SHEPHERD EXPRESS METRO \"EXTRAORDINARY GUITAR GURU\" -ONMILWAUKEE.COM \"POWERFUL, GREAT SONGS\" -BLUES REVUE MAGAZINE", "otherInfo": "The Robert Allen Jr. Band"}, {"Address": "White Rock Ave, Waukesha, WI 53186", "Artist": "Jeremy Carlin ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.0186309, -88.2213235], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "TirzahFest 2021", "moreBioInfo": "No artist bio available", "otherInfo": "Dance. Eat. Donate.\nA community event including local entertainers and vendors committing to raise support and awareness for teenage parents."}, {"Address": "White Rock Ave, Waukesha, WI 53186", "Artist": "Wonderstate ", "ArtistImage": "https://photos.bandsintown.com/thumb/9685428.jpeg", "Coordinates": [43.0186309, -88.2213235], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Ccm, Christian Alternative, Folk Dance, Pop, Rock, American Pop", "Time": "3:00 PM", "Venue": "Tirzah Fest 2021", "moreBioInfo": "No artist bio available", "otherInfo": "Tirzah Place's mission is to teach teenage parents to end generational cycles of poverty and abuse by training them in life and parenting skills. Right now, we are in phase one of this massive undertaking. Phase one involves educating the community in the needs of teenage parents. As well as, raising the proper funds for our centers and homes.\n\nAs part of our phase one, we have created a unique, one-of-a-kind fundraiser, TirzahFest. On Saturday, July 24th, from 3:00 to 7:00 p.m. at Frame Park, in Waukesha, Wi, local vendors, performers, and businesses are partnering with us in raising awareness for these young families and celebrating our community."}, {"Address": "N6513 Anderson Dr, Delavan, WI 53115", "Artist": "Claire Kelly Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8631372.jpeg", "Coordinates": [42.7275549, -88.6732238], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Turtle Lake Tap & Grill", "moreBioInfo": "Official music page of Claire Kelly. Stay tuned for recording updates, videos, upcoming events and inspirational quotes.", "otherInfo": "No event info available"}, {"Address": "2417 Silvernail Rd, Pewaukee, WI 53072", "Artist": "Catelyn Picco ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.044997, -88.2668389], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Pop, Country Pop, Acoustic", "Time": "3:00 PM", "Venue": "The Waukesha Country Fair -- Children's Tent", "moreBioInfo": "Catelyn Picco is a Singer/Songwriter from Waukesha, Wisconsin. She has been singing for as long as she can remember and when she picked up a guitar at age 12, she knew that performing was something she loved. She has a love for country music, superhero movies and meeting new people. Her previous experience includes: Summerfest, The Wisconsin State Fair, The Waukesha County Fair, and more! In addition to that, her EP titled “Strong and Courageous” is available for streaming on Spotify! For more information and updates about Catelyn visit her website at: www.catelynpicco.com as well as follow her on social media.", "otherInfo": "No event info available"}, {"Address": "16400 W Al Stigler Pkwy, New Berlin, WI 53151", "Artist": "Lost Orange Cat ", "ArtistImage": "https://photos.bandsintown.com/thumb/11209966.jpeg", "Coordinates": [42.972528, -88.120559], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Component Beer Garden", "moreBioInfo": "Lost Orange Cat is a Milwaukee Folk N' Roll group comprised of four members. Their catalog features original material composed and written by the members of the band. Lost Orange Cat has a unique combination that will rotate between both Josh Konkel on guitar and Daniel Rathmann on Bass as the lead vocalist, while also flipping between their primary instruments. Add a mandolin, played by Joe Royten, into a singer songwriter rock n' roll band along with full drums and percussion provided by Kyle Ciske and you get the individualistic sound that is... Folk N Roll.", "otherInfo": "Lost Orange Cat... LIVE!!!"}, {"Address": "5501 Co Hwy M, West Bend, WI 53095", "Artist": "HuDost ", "ArtistImage": "https://photos.bandsintown.com/thumb/11201514.jpeg", "Coordinates": [43.3893044, -88.08055879999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Neo-folk-world-rock, Country, Eastern Fusion, Rock, Folk", "Time": "5:00 PM", "Venue": "Kirtan Fest Milwaukee Presents", "moreBioInfo": "The music of HuDost weaves a seamless tapestry of Folk, World, and Rock that renders tears and laughter in listeners, cultivating the nameless longing that abides somewhere in all our hearts and invoking total celebration. HuDost’s core musicians are Moksha Sommer, from Montréal, and Jemal Wade Hines from Kentucky. Having toured the U.S., Canada, and Europe constantly since April 2006, HuDost has grown and expanded, travelled rocky and glorious terrain and marveled at all they can learn and explore. Moksha and Jemal Wade in this time have grown as artists, as seekers, as a couple and as a family. Since 2015 they have also been highly engaged activists, doing advocacy work as KY Congressional District Representatives for ONE (a non-profit organization working to end extreme poverty and, specifically, the sexism of poverty). HuDost’s last album 'of Water + Mercy' received rave reviews and as an independent release reached #24 in the BILLBOARD SALES CHARTS for Folk/Americana also winning the 2020 Independent Music Award for Social Action Song. In the last year they also received two of the 'Best of Nashville 2020’ awards. On past albums HuDost has worked with GRAMMY Award-winning producer Malcolm Burn (Bob Dylan, Emmylou Harris, Peter Gabriel) and GRAMMY Award-winning mixers Oz Fritz (Tom Waits, Bill Laswell, Primus) and Vance Powell (Jack White, Chris Stapleton, Pearl Jam, Willie Nelson, Buddy Guy, Beyonce, Beck, Alicia Keys, Melissa Etheridge, Kings of Leon). In November, 2021 HuDost will be releasing a new album, ‘Anthems of Home’ that defines real, honest love and is a lush, breathtaking original collection of compositions that ask important questions. In this time of loss and awakening HuDost’s new album gives powerful voice to this journey in a way that will remain timeless and will prove the resilience that we all share. Special guests on the album include Jars of Clay, The Accidentals, Christie Lenée and others. Their early release from the new album, ‘Our Words Will Be Louder’, included additional music video cameos from Kevin Clash (Elmo), Kevin Hearn (from the Barenaked Ladies), Cy Curning (from The FIXX), GangstaGrass, Alana Bridgewater, Nawal, Hymn for Her, Jai Uttal, and more. HuDost worked with minister/activist William J. Barber II and all proceeds from it went to the Poor People’s Campaign. It received press coverage in over 130 major news publications and radio including CTV News, The Observer, Roots Music Canada, All Access Music, and received the ‘Best Music Video of the Week’ from Blues and Roots Radio. HuDost functions as a duo or as a band, including guest musicians of varying sensibilities and backgrounds, and often including dance in their shows. As a duo their instrumentation includes vocals, harmonium (Indian Pump-Organ), NORD Keys, guitars, Dulcinet, percussion, and a slew of sonic ambient effects. Their music is a rich, eclectic blending of pop and rock with traditional Sufi music, Bulgarian, Croatian, Macedonian and Balkan folk music, Farsi, Turkish, Arabic, and folk. Their sound crosses all borders and barriers, taking the listener on a journey they will never forget. Highlight performances include Bonnaroo, Resident band at FloydFest, BhaktiFest, World Café Live, Blissfest, The ARK, Alex Grey’s CoSM, the Salvador Dali Museum, Shakori Hills Grassroots Festival, headlining The Islands Folk Fest (Vancouver), WMNF’s Tropical Heat Wave Festival, The Levitt Pavilions, WoodSongs at the Kentucky Theater (on PBS), Nashville’s Bluebird Café, Music City Roots, Tim Robbins’ WTF?! Fest, The Montreal Folk Festival, The Stan Rogers Folk Festival, and many more. Highlight collaborations and opening slots for other artists include Ani DiFranco, Philip Glass, Jon Anderson (YES), Snatam Kaur, Steve Kilbey (The Church), Ramy Essam, California Guitar Trio, Bell Orchestre, Neko Case, Jim Lauderdale, Omar Faruk Tekbilek, Mercan Dede, and many more. HuDost's music is a powerful expression of life's journey and discovery. In 2008, Moksha went through a painful process of brain surgery due to a tumor. The healing from this included re-learning language skills, losing and regaining proper sight, and experiencing seizures. This could have been staggering but instead served as learning that has fueled a potent desire to bring healing through sound. In 2013 their amazing son, Kaleb, was brought into the world. It is through music that the losses and gains, pains and triumphs, and excruciating beauty of life can be given a voice of empathy to the synonymous lives of all people. Both critics and fans have said time and time again that the music of HuDost is this very expression. HuDost’s message comes from real experience, real emotion, and real concern for the world - from the birth of a child, to the healing of the body, to the healing of the planet, their words and music echo the human experience.", "otherInfo": "Join us for a two day Sufi inspired, transcendent Kirtan experience featuring Moksha Sommer and Jemal Wade Hines of HuDost with Kaita. This will include music/concerts and retreat sessions! We are limiting the attendance of this gathering to 65 people, please take precautions where necessary to prevent the spread of Covid-19. We will be outside for the duration of the event. Use of the facility is permitted with the exception of the pool one hour before and after performances and workshops. Come enjoy the space, connect to our beautiful community, and journey blissfully inward. Please register in advance to save your spot. Contact Kaita at 414-412-2473.\nYou can also purchase tickets in advance for Saturday, Sunday or BOTH days (it is a better price for both days).\nThe full event- Saturday and Sunday: https://hudost.com/product/665445\nSaturday only- https://hudost.com/product/665442 \nSunday only- https://hudost.com/product/665444"}, {"Address": "N2009 S Lake Shore Dr, Lake Geneva, WI 53147", "Artist": "Cole Brandt ", "ArtistImage": "https://photos.bandsintown.com/thumb/8817912.jpeg", "Coordinates": [42.564379, -88.43929039999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Pop, Electronic Dance Music, Acoustic Guitar, Classical, Jazz, Spanish, Acoustic Pop, Tropical House", "Time": "5:00 PM", "Venue": "Cole Brandt Live @ Geneva Inn", "moreBioInfo": "I'm a musician from the Rockford/Chicago/Madison areas. I specialize in pop/rock/jazz/classical acoustic music as well as electronic dance music.", "otherInfo": "Cole Brandt Live @ Geneva Inn"}, {"Address": "n64w23246 Main St, Sussex, WI 53089", "Artist": "Emmett Mulrooney ", "ArtistImage": "https://photos.bandsintown.com/thumb/11425263.jpeg", "Coordinates": [43.1338679, -88.2092203], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie", "Time": "5:00 PM", "Venue": "Emmett Mulrooney Live at Belfast Station", "moreBioInfo": "Emmett Mulrooney is a 17-year-old artist from Milwaukee, Wisconsin whose indie, bedroom pop sound is one that’s attracting attention from around the globe. Emmett has been in love with music since childhood, and draws inspiration from artists ranging from John Mayer, to Omar Apollo, to Mac Miller, to Mac Demarco, and more. His unique guitar-driven tracks are care-free anthems that only spread the best of energy, something truly special. Emmett’s goal as an artist is to build connection and share his passion with his devoted fanbase, which encompasses his future plans, including singles and an EP slated for a 2021 release. More info on Emmett at www.emmettmulrooney.com", "otherInfo": "No event info available"}, {"Address": "4520 8th Ave, Kenosha, WI 53140", "Artist": "The Westerlees ", "ArtistImage": "https://photos.bandsintown.com/thumb/9649175.jpeg", "Coordinates": [42.5945981, -87.8219302], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz, Jazz And Swing, Swing, Western Swing", "Time": "6:00 PM", "Venue": "Union Park Tavern", "moreBioInfo": "The Westerlees swing band plays both rare and popular tunes from the 1920s, 1930s, and 1940s. Everything from the Light Crust Doughboys to Milton Brown to Bob Wills is performed with levity and humor. Swing-era standards are carefully selected and arranged for maximum danceabilty. They also have many original tunes that capture the drollery of the Western Swing genre. Come show off your dance moves! Listen to Steel Guitar, Clarinet, and Fiddle! You are guaranteed to be entertained!", "otherInfo": "No event info available"}, {"Address": "9614 Northwestern Ave, Caledonia, WI 53126", "Artist": "Brecken Miles ", "ArtistImage": "https://photos.bandsintown.com/thumb/11015089.jpeg", "Coordinates": [42.7569344, -87.9030724], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Franksville Craft Beer Garden", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "Park Ave, Oostburg, WI 53070", "Artist": "Shonn Hinton & Shotgun ", "ArtistImage": "https://photos.bandsintown.com/thumb/11528983.jpeg", "Coordinates": [43.6249683, -87.8008636], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues & Soul., Funk, Rhythm & Blues, Rock", "Time": "6:00 PM", "Venue": "Oostburg Boogie 2021", "moreBioInfo": "Shonn Hinton has traveled the world as the guitarist for Grammy award winning musicians including Patti LaBelle, Jill Scott, John Legend and Mary J Blige, to name a few. He has played hundreds of arenas around the world to tens of thousands of music fans….but it wasn’t “home”. Wanting to get back to his roots, and support local musicians and his Milwaukee community, he thought “why search the world for great musicians when they’re right in your own backyard?” He then formed the super powerhouse group, Shotgun. Although the group had played together for over a decade in Milwaukee, they decided to emerge into their own band that would headline tours, showcasing their pocketed, classic sound. Shotgun’s opportunity to shine came when they performed songs live from Shonn Hinton’s 2014 instrumental Gospel, Rock and Blues album “The Happy Hour LP.” The reaction from their fan base sealed the deal as their supporters were avidly amazed, along with the movers and shakers of the music industry. Shotgun debuted their first full length album in 2016 with musicians Shonn Hinton, Olen Franklin, Darrien Williams, Alex Julien, Afton Johnson, Sean Williamson, Randy Kombrec and Terry Jeans Jr., the album delivered music’s next great awakening. The band has tightened up to the original 5, and is about to deliver their second full length album. “Reloaded”, due out in 2020, promises a full gamut of musical onslaught. The band includes so much of their personal styles, that blues-rock may be an overall introduction to the sound, but therein lays such a diversity of sound & influence throughout the record that it needs to be heard by music lovers all over the world Poised, primed, and sharp as a number two pencil, “there’s nothing we’d rather do than create and perform are music all over the world,” Hinton says, “and we’re going to do it.”", "otherInfo": "No event info available"}, {"Address": "333 N Broadway, Milwaukee, WI 53202", "Artist": "B.J. Fisher ", "ArtistImage": "https://photos.bandsintown.com/thumb/11468839.jpeg", "Coordinates": [43.0346519, -87.9076594], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "B.J. Fisher @ Nicole's Year of Music Fest", "moreBioInfo": "In the spring of 2011, I was rehearsing a batch of songs with college classmates and had dates set to record my first album in Milwaukee, Wisconsin with a well respected producer, but the project fell through after a failed kickstarter campaign. Soon afterward, my wife Brit had a miscarriage, our car was totaled and we were served a two week notice to move out of our apartment, since our neighbor lady had called the police on us twenty times for just about anything she heard. Upon meeting her through her locked door, she whined, \"I hear you singing and playing your guitar, and it's annoying.\" Regardless, we sheltered songwriting. In the the throws of life, while raising a young family (including twins), late night songwriting lit a path of reminders for me to carry on as an artist. In the spring of 2019, after a momentous epiphany, Brit and I determined that I would make my first record, Night Reminder. Together, we ran a successful kickstarter campaign. After receiving the amount needed at midnight, Brit gave birth to our fifth child at 5AM. It was a cosmic high five! Having both the howl of a band and the intimacy of solo performance, Night Reminder, is a musical portrait of my journey. My brother, Samuel Fisher, partnered with me to make videos for the singles preceding the album's release. For the first video, \"Nothing at All,\" we hopped a train; for the second, \"Human Heart,\" we took my family to the late 1800's; the third, \"What Keeps Me Up,\" releases this April.", "otherInfo": "Nicole's Year of Music Mini Music Fest\nJuly 24th, 2021 from Noon-Midnight Nicole's Third Ward Social is proud to present \"Nicole's Year of Music\" Mini Music Fest in celebration of our One Year Anniversary of Music! \n\nLINEUP: \nNoon-1:00 Georgia Rae \n1:30-2:30 Grey:Mercy \n3:00-4:00 Sarah Day \n4:30-5:30 Jack Tell \n6:00-7:00 B.J. Fisher \n7:30-8:30 Raine Stern \n9:00-10:00 Fellow Kinsman \n10:30-11:30 The Midnight Purchase \n\nNicole's Third Ward Social \n333 N Broadway Milwaukee, WI 53202\n\nhttps://www.nicolesthirdwardsocial.com"}, {"Address": "2001 N Shore Dr, Delavan, WI 53115", "Artist": "Dad Strength ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [42.6110362, -88.6099969], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Dad Strength @ Private Event (Delavan, WI)", "moreBioInfo": "No artist bio available", "otherInfo": "Private Event"}, {"Address": "Menomonee Falls, WI", "Artist": "The Last Bees ", "ArtistImage": "https://photos.bandsintown.com/thumb/9075291.jpeg", "Coordinates": [43.1788967, -88.1173132], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Mr. Brews- Ian Ash of The Last Bees (Solo)  - Menomonee Falls, WI", "moreBioInfo": "There's an undeniable scent of nostalgia in the air. Our distraction-filled digital lives have us craving something that is organic, real and spontaneous. The Last Bees was a spontaneous experiment that soon took on a brand of its own. Ian Ash was inspired by the Led Zeppelin throwback of Greta Van Fleet, and the 60's throwback of artists like JD McPherson, Megan Trainor and Pokey LaFarge. One coldwinter in early January, Ash finished recording “Can't Wait” at his home studio in Wisconsin. It was a track with an early Beatles approach, fitting, as Ash is a self-proclaimed Beatles geek with a vocal resonance resembling John Lennon. Ian buzzed down to Chicago to play the track for his manager, who posited the question- how about making a collection of songs like this?!... So, Ash went back to his hive and did just that. He wrote, produced and arranged songs that hark back to a time not so different from our current culture; a time when people also needed positive, uplifting release from the vicissitudes of a world changing so quickly. The melodies were sweet as honey, but the vocals and instruments had an edge that stung like a bee. And thus, The Last Bees was born.", "otherInfo": "No event info available"}, {"Address": "210 S Water St, Watertown, WI 53094", "Artist": "Blue Steel 815 ", "ArtistImage": "https://photos.bandsintown.com/thumb/11030053.jpeg", "Coordinates": [43.1926993, -88.72676829999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "The Bar", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "200 N Harbor Dr, Milwaukee, WI 53202", "Artist": "Battles ", "ArtistImage": "https://photos.bandsintown.com/thumb/9427385.jpeg", "Coordinates": [43.0287958, -87.8985381], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock", "Time": "7:00 PM", "Venue": "BMO Harris Pavilion", "moreBioInfo": "Battles is an American rock band that formed in 2002. The group is composed of drummer John Stanier (formerly of Tomahawk and Helmet), guitarist/keyboardist Ian Williams (formerly of Don Caballero and Storm and Stress), guitarist Dave Konopka (formerly of Lynx), and guitarist/keyboardist/vocalist Tyondai Braxton (son of Avantgarde Jazz musician Anthony Braxton). Battles released three EPs in 2004, each on a different label (Cold Sweat, Monitor and Dim Mak). Their debut LP, Mirrored, was recorded by Keith Souza and released on 14 May 2007 to widespread critical acclaim, and it generated a fair amount of buzz in indie rock circles. The album received an extremely high score of 9.1 in a Pitchfork Media review; \"Atlas\", meanwhile, was voted \"best single of the week\" by NME, and received a glowing review in the UK's Clash Magazine where comparisons were made to Glitter Beat. The band scored its first UK cover feature in May 2007, talking to Plan B Magazine about the making of Mirrored.", "otherInfo": "No event info available"}, {"Address": "Milwaukee, WI", "Artist": "Mixtape MKE ", "ArtistImage": "https://photos.bandsintown.com/thumb/11097476.jpeg", "Coordinates": [43.0389025, -87.9064736], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Dancehall, Dance-pop, Euro-pop, New Wave, Euro-dance, 80s", "Time": "7:00 PM", "Venue": "Private Event", "moreBioInfo": "Mixtape: A Tribute to the 80’s is a high energy dance band playing your favorite UK and Euro-Pop, New Wave, and classic American hit songs from the height of the MTV era. Righteously fun, energetic, and tubular to the max, this band features experienced Milwaukee musicians who lived it, loved it, and look forward to bringing back the memories and creating new ones. Mixtape will take you back to the 80’s and on to the dance floor – like, for sure!", "otherInfo": "No event info available"}, {"Address": "7036 Grand Geneva Way, Lake Geneva, WI 53147", "Artist": "Dina Bach Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/6501742.jpeg", "Coordinates": [42.6083315, -88.40920489999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country Pop, Pop", "Time": "7:00 PM", "Venue": "Private Event ", "moreBioInfo": "Dina Bach’s fingers first graced the keys of the family piano at the age of 10, and her love of music and ear for composition began to flourish immediately. In 2017, after years of working to make time for her music around life’s other obligations, Dina left her job as a high school Spanish teacher to pursue music full time. As a singer, songwriter, and pianist, Dina focuses on pop and country-pop where her warm vocals and playfully evocative lyrics entertain listeners and audiences alike. Her musical influences range from Sara Bareilles and Norah Jones to Carol King and Frank Sinatra. When Dina began performing in the larger Chicago area, she quickly built a dedicated fan base. Currently, she performs solo throughout the Midwest and has played at some of Chicago’s hottest venues, including House of Blues, Joe’s Bar, Elbo Room, and Uncommon Ground. Dina also donates her time and voice to charity by performing at events such as the Autism Speaks Walk (Soldier Field, Chicago) and the Expressions Gala (Artspace 8, Chicago) in support of Autism Speaks. In addition to solo shows, Dina routinely collaborates and shares the stage with various musicians. She opened for British singer/songwriter Callaghan, hosted a singer/songwriter showcase at Ballydoyle Pub (Downers Grove, IL), and has performed and written with two-time Grammy Award Nominee, Dave Rave. Together, Dina and Dave plan to release an album of original compositions in late 2017. Dina's most recent release - her 2016 EP Kiss Me Like That - was made possible by the support of her fans through PledgeMusic. The album’s closing track, “Summertime,” was featured in Chicago Music Magazine’s local pulse for hot new music and Dina was invited to Chicago’s WGN Radio where she was interviewed by Mike Stephen and performed four original songs in the famous Michigan Avenue studio. In late 2016, Dina started a songwriting challenge that requires her to write and release an original song every week for one year. She seeks inspiration and ideas from fans on social media and at shows, writes fresh lyrics, and records a video for weekly release on, “Music Monday.” In addition to fostering creativity, this challenge provides her with an opportunity to connect with fans. The response was so positive that Dina extended the challenge beyond the one year mark and started a Patreon (www.patreon.com/dinabachmusic) campaign to offer her fans the chance to support her music. Dina is a native of Wheaton, IL, 30 miles west of Chicago, where she is currently based. She is available for performances in the Midwest and elsewhere and is currently unsigned. www.dinabachmusic.com Dina also composes original wedding songs for couples getting married - A unique memory for your wedding day and special keepsake for years to come! More information @ www.sealedwithasong.com Singer Songwriter Pianist", "otherInfo": "No event info available"}, {"Address": "3450 S 52nd St, Greenfield, WI 53219", "Artist": "Westward Road ", "ArtistImage": "https://photos.bandsintown.com/thumb/9525355.jpeg", "Coordinates": [42.9817391, -87.97886489999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Christian, Christian Country, Gospel, Adult Contemporary, Southern Gospel, Worship", "Time": "7:00 PM", "Venue": "Memorial United Methodist Church", "moreBioInfo": "Providing a unique blend of gospel and modern worship music is where Westward Road excels. Westward Road is an exciting and dynamic family trio, led by Scott Roberts, a 20 year veteran worship leader and nation charting songwriter, and his wife, the talented and award winning vocalist, Kelli Roberts. Their son, Garrett Roberts completes the superbly gifted musical family with his smooth vocal tones. Their \"out of the box\" take on worship and gospel music paired with their God given ability to communicate the Good News takes audiences into the presence of God in a very powerful way. They have performed for audiences in large theaters and for intimate settings in rural churches, festivals and fairs. A Westward Road concert leaves you uplifted by their message of hope and encouraged to live a life of trust in God. Their new take on gospel music along with their smooth family harmonies and ability to lead God's people into His presence through worship will have audiences of all ages falling in love with this fun and energetic trio.", "otherInfo": "No event info available"}, {"Address": "2020 S Allis St, Milwaukee, WI 53207", "Artist": "Kenny Reichert ", "ArtistImage": "https://photos.bandsintown.com/thumb/11472514.jpeg", "Coordinates": [43.0071484, -87.903969], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Chillhop, Jazz", "Time": "7:00 PM", "Venue": "Kenny Reichert 4tet at Enlightened Brewing", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "WI-32, Milwaukee, WI", "Artist": "Steve Vorass on Drums ", "ArtistImage": "https://photos.bandsintown.com/thumb/8776757.jpeg", "Coordinates": [43.0389157, -87.9064927], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Hard Rock, Hardcore Punk, Indie Folk, Metal, Pop-metal, Metalcore, Indie Pop, Indie, Rock, Pop", "Time": "7:00 PM", "Venue": "Mixtape Private Birthday Party", "moreBioInfo": "Steve Vorass is a semi-professional drummer with 20 years of experience. I live in Milwaukee Wisconsin and enjoy sharing drum-nerdery.", "otherInfo": "Mixtape Private Birthday Party"}, {"Address": "N64W23180 Main St, Sussex, WI 53089", "Artist": "Lost In A Name ", "ArtistImage": "https://photos.bandsintown.com/thumb/6181177.jpeg", "Coordinates": [43.1339955, -88.208607], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock", "Time": "7:00 PM", "Venue": "Lost In A Name @ Thirsty Duck", "moreBioInfo": "Sometimes less can definitely be more, though it took some years for this mantra to take hold of Lost In A Name. Formed in 2006, the Milwaukee, Wisconsin-based group's previous releases saw them find themselves and their sound throughout the course of over a dozen lineup changes. Now in 2014, the trimming of personnel down to just two members, and the highly anticipated release of their second full length album, A Silence In Static, has in fact guided the band closer towards their essence, and rendered them more powerful than ever before. A Silence In Static is an album that marks the nexus of their creative path. Founding singer/guitarist Danny Schmitz, alongside drummer Geoff Slater, have developed a style that is certain to have music fans and critics alike both perplexed and engaged, not just by its lush and imperative array of audio wizardry, but also by its slippery tacitness when it comes to defining where the band belongs in the genre spectrum. Modern metalcore has met power pop, punk, progressive rock, technically masterful playing, and deeply honest lyrics, to create a unique, hyper-slick and absolutely massive sound that belies the fact that this is music performed by a two-piece. They however weren't alone throughout the writing and production process. Produced by Joel Wanasek of JTW studios, they collaborated with a number of talented individuals along the way. Guitarist Clint Lowery of Sevendust, Alien Ant Farm bassist Tye Zamora, guitarist Jessie Farnsworth of Newsted and more all lent their years of experience to A Silence In Static. Yet when it comes to backing it up live the band requires no human assistance - utilizing a punishingly loud rig, electronic samples, and a dazzling, interactive light show, Schmitz and Slater are a live force to be reckoned with. A Silence In Static is a massive album that is simultaneously hard-hitting and vigorously melodic. Although having existed for some time, we can be sure that this is the true point of the band's genesis.Lost In A Name is now perfectly poised to take their gripping anthems and reputable live show from coast to coast of the USA and beyond. http://lostinaname.com http://lostinaname.bandcamp.com http://itunes.com/lostinaname http://twitter.com/lostinaname", "otherInfo": "No event info available"}, {"Address": "S74W17096 Janesville Rd, Muskego, WI 53150", "Artist": "Bree Morgan ", "ArtistImage": "https://photos.bandsintown.com/thumb/11441872.jpeg", "Coordinates": [42.9092808, -88.12832230000001], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Pop, Country", "Time": "7:00 PM", "Venue": "Lucky's at The Lodge - BMR", "moreBioInfo": "Born in Mauston, WI, music has always been a passion. Starting with her moms 90's hip hop CD, she knew every word to every song. Then came Reba McEntire, Shania Twain, Martina McBride, Dixie Chicks, and many more 90's country artists to push the passion along. Starting to sing in school at a young age, Bree was always ready to take center stage, no fright, and perform to her best. Grade school in Mauston, WI turned into middle and high school in Westfield, WI, and musicals became a big part of life, performing in Fiddler on the Roof, The Music Man and her favorite, Ado Annie in Oklahoma, along with doing everything she could in band, playing the clarinet and performing in color guard, and choir, when she sang 1st soprano down to 1st tenor. Getting her first guitar from her Dad and Step-mom the Christmas after her senior year, opened up a whole new world of song writing. Bree played her first full song on the guitar for her dad June 15th, 2013, and will remember her fathers face and tears as one of the many things that will push her for her dreams. Attending UW- La Crosse after high school for a year, Bree learned that the college life wasn't for her. After finishing out her year at UW-L, she found new music friends back in Hometown, Mauston, WI. Starting off with karaoke shows, she quickly learned music is what she was born to do. In the spring of 2014, Exit 69 Feat. Bree Morgan was born, and later Bree was introduced to Kyle Roberts, a 17 year old blues guitarist from Mauston, WI, who she wrote songs, and played acoustic shows with. Although Bree has been in the band business for only a little over 6 years, she has met many great musicians and found who her friends are in the music community in little ol' Mauston, WI, a place she will forever call home. After singing for a year with Shotgun Jane, Bree decided to continue on as a musician for hire, filling in for bands, performing acoustically, solo and duo shows, and now running her own band again, along side live music lover Derrick Roenneburg, Bree Morgan Reloaded, a hard hitting country band, bringing a boot-stomping, music from all decades!", "otherInfo": "Full band at Lucky's at the Lodge! 7-11pm"}, {"Address": "25276 W Grass Lake Rd, Antioch, IL 60002", "Artist": "Heather Moran ", "ArtistImage": "https://photos.bandsintown.com/thumb/11182179.jpeg", "Coordinates": [42.4482401, -88.12400989999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "Gritman&Moran@Sunset Grill", "moreBioInfo": "Ms. Moran is blessed to be musically surrounded with some of Chicago's top rock and Jazz musicians on the scene today. She is perfect for your wedding, cocktail hour, private and/or corporate event. She is equally at home in any size venue. Born and raised in Illinois, Ms. Moran has been performing for most of her life. She studied voice as a child at New Trier High School and Northwestern University in Illinois. As an adult, she studied opera at Carnegie-Mellon University in Pennsylvania, and the University of Colorado. She eventually returned to Chicago to earn a BA in theater from Columbia College. Over the past several years, Ms. Moran has divided her time between her two loves: acting and singing. As an actor, Ms. Moran has worked with numerous theater companies in Chicago, but most extensively with the Factory Theater, a storefront community theater company in their eleventh season with over 100 all original productions under their belts. She is also a Second City alumna skilled in improvisational theater. As a singer, Ms. Moran has performed in many settings: nightclubs, weddings, private and corporate functions, and most notably, on Navy Pier's two premiere dinner cruise ships, Mystic Blue and The Odyssey. Some venues she has appeared at include: San Francisco's Empire Plush Room, Drury Lane Water Tower, Katerinas, Grant Park, Andys Jazz, Park West, The Acorn Theater in Michigans Three Oaks, Café Luciano, The Field Museum, The Stonefire Restaurant, Tivoli, Tuscany-Wheeling, Websters Wine Bar, Magnum's Steakhouse, Davenports, Gold Star Sardine Bar, Martyr's, and Joy Blue. She just recently ended a 12-month engagement at Chicago Old Towns wonderful Bistrot Margot and can be seen frequently performing at Katerinas on Irving Park. She was also recently a regular performer at Tivoli Ristorante in West Chicago and frequently performs for the city of Chicagos Cultural Affairs department. She currently resides and performs all over Lake County with her duo partner, guitarist Steve Gritman. She also plays locally with many talented musicians , some including Dan Patten, Gina Gonzalez, Mike Ryan, Pat Ryan and Mike Novello. Jazz standard tramp. Also, singer of pretty much everything else you can get your hands on........", "otherInfo": "Vocals and guitar...A whole lotta everything!"}, {"Address": "200 N Harbor Dr, Milwaukee, WI 53202", "Artist": "Primus ", "ArtistImage": "https://photos.bandsintown.com/thumb/9427385.jpeg", "Coordinates": [43.0287958, -87.8985381], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Alternative", "Time": "7:00 PM", "Venue": "BMO Harris Pavilion", "moreBioInfo": "Primus is a rock band formed in California in the mid-1980s by two ex-members of thrash metal band Blind Illusion, Les Claypool and Larry Lalonde. Les (vocals and bass guitar) has been the only constant member. They have had two guitar players (although Larry has held onto the role for the past 16 years) and many different drummers (although Tim Alexander and Bryan Mantia were the only ones who recorded with the band, and Jay Lane was the only other one who had creative impact) in the past. Their music has proven difficult to define; while usually considered by critics to be funk-metal or alternative metal, Primus has been called everything from \"thrash funk\" (as the band blends funk-style bass technique with thrash influenced guitar riffs and songs tempos), to \"alternative rock\" to \"the Freak Brothers set to music.\" Les Claypool himself once described their music as \"psychedelic polka.\" Thanks to the diversity of their sound they have been able to gain fans from nearly all rock subgenres. Primus is the only band to have their own ID3 genre tag in Winamp. They are characterized by their irreverent approach to music — they release their records on Claypool's Prawn Song Records label, a parody of Led Zeppelin's Swan Song, and their catchphrase was, for several years, \"Primus Sucks!\". In 2003 the band dropped that catchphrase, as well as Tim Alexander's nickname \"Herb\". Early Days (1984–1991) Primus began as Primate in the mid-1980s with Claypool and guitarist Todd Huth. Drummer Peter Libby was added in later, although the band would go through many other drummers throughout their early history. They formed in El Sobrante, California, United States. After rising to local music scene stardom with their brand of funk/metal fusion, Huth and current drummer Jay Lane left in 1989 to pursue other projects. Claypool recruited death metal guitarist and one time Joe Satriani student Larry LaLonde (usually referred to as \"Ler\" later) and eclectic drummer Tim \"Herb\" Alexander. Primus gained even greater popularity and soon released their first album, Suck on This, a live recording culled from two of their Berkeley concerts. The album was financed by Les' father. In their early days, Primus were heavily associated with the Bay Area Thrash scene. Opening for bands such as Testament and Exodus they picked up a following of fans who were involved in the scene as a result. Today, Primus is one of few \"alt-metal\" bands commonly enjoyed by \"true metal\" fans, perhaps as a result of this. It is an infamous fact that after the death of their bassist Cliff Burton in 1986, Metallica strongly considered Les Claypool (a close friend of the band) to be Cliff's replacement. After much deliberation, James Hetfield decided that Claypool was \"too funky for Metallica\", and Jason Newsted was chosen instead. The rest, for both Metallica and Primus, is history. Primus played a number of early shows at Barrington Hall, a notoriously free-wheeling Berkeley student housing co-operative. Barrington Hall is often referenced in the band's music: the song \"Frizzle Fry\" refers to a Barrington party, and the album Tales from the Punchbowl refers to the LSD-spiked punch that was frequently served at Barrington social events. In 1990 the band released their first studio album, Frizzle Fry also on Prawn Song and released singles for \"John the Fisherman\" and \"Too Many Puppies.\" With a music video — featuring Kirk Hammett — a studio album, and a tour with Jane's Addiction, Primus's popularity grew to the point where they attracted attention from Interscope Records, who signed them in 1990. Peak Years (1991–1996) Primus' major label debut was Sailing the Seas of Cheese supported by singles \"Jerry Was a Race Car Driver,\" and \"Tommy the Cat (featuring Tom Waits),\" which both appeared on MTV (a third single \"Those Damned Blue-Collar Tweekers\" was also released but did not feature a video). The band also appeared in Bill and Ted's Bogus Journey and made music for Beavis & Butthead. With a major label behind them, Sailing the Seas of Cheese went gold and the band toured in support of Rush, U2, Anthrax, and Public Enemy. Today, Sailing the Seas of Cheese is considered an alternative rock classic by many critics. After the release of Sailing the Seas of Cheese, in 1992 Primus released a cover song EP Miscellaneous Debris, with their version of XTC's \"Making Plans for Nigel\" managing to break airwaves. In 1993, Primus released Pork Soda, which managed to debut at #7 on the Billboard Top 10. The album was darker than previous Primus efforts, dealing with murder, suicide, and alienation. The band has commented that prior to recording, they had been touring for nearly two solid years and were thus in a somber mood. \"My Name Is Mud\", \"DMV\", and \"Mr. Krinkle\" were hits, the latter inspiring a video featuring Claypool in a pig suit and tuxedo playing upright bass in an abandoned warehouse as a carnival of oddities parades behind him, including Claypool's wife and her twin sister. The band reportedly put their heart and soul into the video, but it received next to no airtime on MTV. Pork Soda also carries the distinction of being the first full length album recorded at Claypool's house. The band would subsequently record all of their albums in his home studio. In 1993, Primus headlined the alternative rock festival Lollapalooza. They also made an appearance at the Woodstock '94 Music Festival where they performed \"My Name is Mud\" with predictable results (Claypool claims to still have mud in his speakers). It was clear that Primus-mania was growing, and the band was churning out material frequently. In the previous four years they had released three albums, an EP, six music videos, and a home video. To top that all off, they toured with Rush, who they consider to be one of their biggest influences. During a lull in 1994, the original Primus lineup consisting of Claypool, Huth, and Lane reunited to record Riddles are Abound Tonight under the band name Sausage. Among the pre-Primus songs they recorded were \"Temporary Phase\", \"Prelude to Fear\", and \"Shattering Song.\" The video to \"Riddles Are Abound Tonight\" featured the band in blue leotards performing on stationary bicycles. In 1995, Primus released their fifth album, Tales from the Punchbowl. It was very well received and contained Primus's most successful single to date, the Grammy-nominated \"Wynona's Big Brown Beaver.\" The ubiquitous song was accompanied by an equally ubiquitous video with the band members dressed up in cartoonish plastic cowboy costume (similar to the suits worn in the then current Duracell battery commercials). So great was their popularity that the band was invited to perform on David Letterman and Conan O'Brien's shows. Two other less successful singles, \"Mrs. Blaileen\" and \"Southbound Pachyderm\" (the latter of which featured a claymation video that apparently only got played on MTV a small number of times) were also released. Many falsely believed \"Wynona\" was about actress Winona Ryder. Claypool has acknowledged several times that the song is not about Ryder, indicating that the song's name is spelled and pronounced differently. While this placated Ryder, her then boyfriend Soul Asylum vocalist David Pirner took offense and renamed one of his songs \"Les Claypool's a Big Fucking Asshole\" in concert. Claypool was apparently not even aware of this at the time, although this did cause tension between fans of Primus and Soul Asylum for a brief period. Mantia Era & Hiatus (1997–2002) Disturbed by their sudden fame, Primus gradually began to disown \"Wynona.\" It would not be long before Claypool stated that they would stop playing it altogether. Nonetheless, Alexander left the band in 1996 due to creative differences. Rumored replacements for Alexander included Mike Bordin of Faith No More, but in the end he was replaced by Bryan \"Brain\" Mantia of Limbomaniacs and Praxis. Mantia was one of the many drummers Claypool auditioned for the original line-up of Primus before settling with Alexander — Mantia bowed out beforehand due to a foot injury. With Mantia aboard, Primus was asked in 1997 to compose the theme song to South Park after the show's creators Trey Parker and Matt Stone professed to be big fans. (Les Claypool was an early supporter of their Spirit of Christmas video postcard/demo.) Primus also contributed to the South Park \"Chef Aid\" album with the song \"Mephisto and Kevin\", telling the story of Gopherboy. By this time, bands that were influenced by Primus's bottom-heavy rock — such as Tool, KoЯn, and Limp Bizkit— were starting to gain a growing audience in the alternative metal genre which Primus had helped to promote. 1997's Brown Album was a departure from previous Primus leaving the majority of fans disappointed. Critically, it was Primus's least successful album, having received, for the most part, adverse reviews. Commercially it did not do as well as previous efforts. Both singles \"Shake Hands With Beef\" and \"Over the Falls\" flopped. The band would later distance itself from the album. Claypool would go so far as to comment in concert, \"does anyone want to hear anything from the Brown Album? Me neither.\" Antipop was released in 1999, and was the first album to feature heavy input from outside musicians and producers. The album was seen as a 'return to form' by most long term Primus fans, featuring harder edge song-writing fans had been craving as well as greatly improved production over the previous album. The band toured with Ozzfest and released a video for \"Lacquerhead\" that was banned from MTV because of its drug content, even though it was an anti-drug song. In 2000, Primus performed a cover of the Black Sabbath classic \"N.I.B.\" with Ozzy Osbourne on vocals. This track appeared originally on the album \"Nativity in Black, Vol. 2: A Tribute to Black Sabbath\". The single hit number 2 on the Billboard Modern Rock tracks, the band's highest charting single in nearly a decade. The track would later be released on Ozzy's Prince of Darkness box-set in 2005. After touring to promote Antipop throughout 2000, citing studio mismanagement and general dissatisfaction, Primus went on indefinite hiatus in 2001. During the hiatus, Alexander released two albums with the band Laundry and performed with Blue Man Group, A Perfect Circle, and Born Naked, among others. Claypool explored the jam band scene with Oysterhead (featuring his friend Trey Anastasio of Phish as well as Stewart Copeland) and his own Colonel Les Claypool's Fearless Flying Frog Brigade. He also collaborated with Mantia in Colonel Claypool's Bucket of Bernie Brains. LaLonde joined Mantia to produce two experimental No Forcefield records, and tried unsuccessfully to start a recording studio. Reformation (2003–Present) In late 2003, Claypool reunited with LaLonde and, in a surprise move, Tim Alexander to record a DVD/EP called Animals Should Not Try to Act Like People, which Claypool described as the first DVD with supplementary music, as opposed to the contrary. The band staged a two month tour in which they performed two sets per show, the second consisting of their 1991 release Sailing the Seas of Cheese in its entirety. 2004 saw them continue touring, and even performing their 1990 release Frizzle Fry in its entirety. For these two tours, the band sold recordings directly recorded from the sound-board online, following an example of other bands such as Phish. The performance in Chicago was video taped as well, and was released on the 'Hallucino-Genetics' Live DVD. The band's style as of their last EP was based on the jam band style with extended soloing from band members and less focus on lyrics. This follows the musical evolution of Les Claypool's work during the Primus hiatus, it is unknown whether this style was simply temporary or if the band has permanently switched over to it. On July 19, 2005, it was announced that Primus was going to release a new full-length album by spring of 2006 with an international tour following shortly thereafter. The release would have been the first full-length Primus album since 1999's Antipop, and the first full-length album with Alexander on drums since 1995's Tales From the Punchbowl. Later that year, the band performed at Lollapalooza in July and Vegoose in October while still spending time recording new songs; no new tracks were performed at these festivals. As spring of 2006 came and went, Primus' reported new album did not materialize. The band has been tight-lipped about the album's progress, although an update on Tim Alexander's website stated that he was still working on new Primus material at the time. Primus performed at the 1st Annual Hedgpeth Festival in Twin Lakes, Wisconsin that year in July. No new tracks were performed, and no word was given by any of the members regarding the new album. October 17th saw the release of the band's first ever greatest hits compilation album They Can't All Be Zingers on Interscope Records as well as a DVD released on Prawn Song Records called Blame It on the Fish: An Abstract Look at the 2003 Primus Tour De Fromage. The DVD contained live footage from the band's 2003 reunion tour, interview segments, behind the scenes footage, and other assorted material including a 30 minute mockumentary about the band in 2065. In November 2006, the band commenced the month-long Primus: The Beat a Dead Horse Tour 2006. During the tour, Primus began performing \"Wynona's Big Brown Beaver\" for the first time in 7 years. The music video game Guitar Hero 2 for the Playstation 2 was also released in November and featured the Primus song \"John the Fisherman.\" The game would later be released for the Xbox 360 in April 2007. In 2008, Primus continued their post-hiatus trend of performing at large outdoor festivals when they played the Rothbury Music Festival over the July 4th weekend in Rothbury, Michigan and the Outside Lands Festival during late-August in San Fransisco, California. Side Projects Since reuniting in 2003, the band members have balanced their Primus duties with a number of various other projects. Les Claypool continues to tour and record with his \"Fancy\" band. They have released one full-length album, Of Whales and Woes (2006), and a live DVD, Fancy (2007). Claypool has also tried his hand at cinema, writing and directing the jam band spoof Electric Apricot: Quest for Festeroo (2006), and playing the role of a preacher in James Isaac's indie horror film Pig Hunt (2008). He also published his first novel, South of the Pumphouse (2006), and even started his own wine company, Claypool Cellars. Tim Alexander released the debut album titled This Is a Dream from his project Fata Morgana, which was written, produced, and almost entirely performed by Alexander. He is also playing shows and recording material with his other group Into The Presence consisting of Nicki Tedesco and Luis Carlos Maldonado. Both albums feature a number of guest performers, many of whom Alexander has worked with at one time or another throughout his career. Larry LaLonde joined the touring band for System of a Down vocalist and multi-instrumentalist Serj Tankian in 2007 in support of Serj's debut solo album, Elect the Dead, which also subsequentally features several appearances by former Primus drummer Bryan \"Brain\" Mantia.", "otherInfo": "No event info available"}, {"Address": "3000 Pleasant Valley Rd, West Bend, WI 53095", "Artist": "Brantley Gilbert ", "ArtistImage": "https://photos.bandsintown.com/thumb/10412219.jpeg", "Coordinates": [43.3563911, -88.1866775], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Southern Rock", "Time": "7:00 PM", "Venue": "Washington County Fair", "moreBioInfo": "Catch the \"Not Like Us\" Tour featuring Michael Ray & Lindsay Ell! Pre-order Fire & Brimstone here: http://brantley.lnk.to/FireBrimstone", "otherInfo": "No event info available"}, {"Address": "25276 W Grass Lake Rd, Antioch, IL 60002", "Artist": "Gritman & Moran ", "ArtistImage": "https://photos.bandsintown.com/thumb/11182175.jpeg", "Coordinates": [42.4482401, -88.12400989999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Pop, Rock, 80s, 70s, Yacht Rock, 2000s, Jazz", "Time": "7:00 PM", "Venue": "Gritman&Moran at Sunset Grill", "moreBioInfo": "Heather Moran has performed regionally, nationally and in the Chicagoland area for the last decade. Some recent venues she has appeared at include: Strawberry Moon in Wauconda, New York's Metropolitan Room and The Waterclub, Pittsburgh's BackStage Bar, The Hibiscus in New Jersey, San Fran's Plush Room, Wilson Center of the Arts and Oconomoc Theater in Wisconsin, The Skokie Theatre, Drury Lane Watertower, Katerina’s, Grant Park, Andy’s Jazz, Park West, Bistrot Margot, Tuscany-Wheeling, Webster’s Wine Bar, Davenport’s, The Green Mill, Gold Star Sardine Bar and Martyr's. Heather has performed on numerous radio station programs and was recently featured performing her Rosie Clooney holiday jazz on the channel 9 WGN morning show. She attended college at Carnegie-Mellon University, University of Colorado-Boulder and Columbia College. She also studied at Second City theatre in Chicago. To keep up her jazz chops, she recently opened for Bob Newhart with a full orchestra to a sold-out Chicago theatre. You can visit Heather's other website at www.HeatherMoran.com Steve Gritman has been performing in central Illinois and eastern Iowa for the last twenty years on guitar, violin, ukulele, & mandolin. Steve has performed with countless acts playing contemporary music, jazz and classical-most recently as the violinist for the Adagio Trio throughout central and eastern Iowa. As a newcomer to the Chicago area music scene, his diverse musical background and multi instrumental capability allows him to play a wide variety of music for nearly all occasions. They also have a full band with a core group of members including Pat Ryan on drums. Mike Ryan on Bass, Dave Childress on keyboard/sax and Robb Calabro on Sax", "otherInfo": "Vocals and guitar...A whole lotta everything!"}, {"Address": "718 N Spring St, Random Lake, WI 53075", "Artist": "The Now ", "ArtistImage": "https://photos.bandsintown.com/thumb/9099255.jpeg", "Coordinates": [43.5558535, -87.96893089999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Other, Rock, Rock And Roll, Punk, Emo, Cover Band", "Time": "8:00 PM", "Venue": "Random Lake Fireman's Picnic", "moreBioInfo": "The Now has been a staple of the SE Wisconsin cover band scene for over 13 years and has quickly propelled themselves to the biggest festival venues in the market. An established, experienced rock band THE NOW provides an engaging show with touring level sound and lighting to match their tight vocal harmonies and musicianship. Performing every weekend has made this band a tight live act with pro performers who truly love what they do.", "otherInfo": "No event info available"}, {"Address": "Park Ave, Oostburg, WI 53070", "Artist": "Cash Box Kings ", "ArtistImage": "https://photos.bandsintown.com/thumb/9052834.jpeg", "Coordinates": [43.6249683, -87.8008636], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues", "Time": "8:00 PM", "Venue": "Oostberg Boogie!", "moreBioInfo": "The Cash Box Kings are bona fide blues royalty. Co-led by real-deal Chicago blues vocalist and songwriter Oscar Wilson and Madison, Wisconsin-based songwriter, harmonica giant and singer Joe Nosek, the band plays masterfully raw and unvarnished houserocking blues. Wilson's huge, gritty vocals and Nosek's powerhouse harmonica fuel their razor-sharp original songs. With their top shelf musicianship and trademark good humor, The Cash Box Kings are a one-of-a-kind blues band. In the words of MOJO magazine, the band is \"flawless.\" Mixing tough Chicago and Delta blues, jumping proto-rock 'n' roll, and steamrolling \"bluesabilly\" (their original mix of Chicago blues and Memphis rockabilly), they attack every song they play with contemporary authority and old school authenticity. The extraordinary ensemble playing between Nosek, Wilson, guitarist Billy Flynn, bassist John W. Lauler, drummer Kenny \"Beedy Eyes\" Smith and their friend, pianist Queen Lee Kenehira, is a true force of nature. The musicians feed off of each other's ideas and energy, effortlessly moving from a lowdown purr to a full throttle roar. According to No Depression, \"The Cash Box Kings are a royal hive of raucous houserockers. Whether resurrecting the past or living in the moment, they satisfy your craving for hardcore Chicago blues, served up hot and tasty.\" After the tremendous critical and popular response to The Cash Box Kings' 2017 Alligator Records debut, Royal Mint, the band returns with Hail To The Kings!, their tenth career release. Recorded in Chicago and produced by Nosek, the album features 13 songs, including 11 originals written or co-written by Nosek and Wilson. According to Nosek, one of the secret weapons of Hail To The Kings! is Wilson's growth as a songwriter. \"He's always brought great originality to the material,\" says Nosek, \"but now he's bursting with songs and ideas.\" Another weapon is the masterful guitar work of Flynn, who delivers one blistering performance after another. Nosek says, \"His guitar playing is a master class on old school blues.\" From the hard Chicago sound of Smoked Jowl Blues to the sly humor of Joe, You Ain't From Chicago to the up-to-the-minute text of The Wrong Number to the streetwise Take Anything I Can, the album burns hot from start to finish. Special guest Shemekia Copeland turns the heat up as she joins her friend Oscar Wilson for the mischievous duet, The Wine Talkin' On Bluesman Next Door and Jon Burge Blues, Nosek and Wilson bring socially conscious truth to power, shining a light into some of society's darkest corners. \"Blues music is used to transform and to find relief,\" notes Nosek. \"Our songs are all about real life topics that matter—good times, tough times and some bad situations. We'll raise our voices when we have to, and we'll have a good time doing it.\" Joe Nosek founded The Cash Box Kings in Madison, Wisconsin in 2001 and, since 2007, has co-led the band with the charismatic, larger-than-life vocalist Oscar Wilson. Over 20 years apart in age and coming from vastly different backgrounds, the two form an unlikely pair, combining Wilson's indisputably authentic South Side Chicago blues vocals with Nosek's dynamic harmonica, songwriting and singing talents. According to Wilson, \"The Cash Box Kings are a throwback to the golden age of blues with some kickin' fresh young blood. Joe is my best friend in the music world—the band is a marriage made in heaven for both of us.\" \"Oscar is godfather to my oldest son,\" says Nosek. \"We have each other's backs. We're family.\" In their first six years, The Cash Box Kings won a large and loyal audience across the Midwest. Wilson joined the group in 2007, bringing with him an instantly commanding stage presence and an authoritative vocal style that gives fire-breathing power to the music. A self-taught musician and singer with an encyclopedic knowledge of almost every blues song known to man, Wilson is a natural-born entertainer and a perfect foil for Nosek and the band. Born in 1953 on Chicago's 43rd Street (aka Muddy Waters Drive), Wilson grew up in the company of many famous blues artists. Junior Wells, Elmore James, Big Smokey Smothers and close family friend David \"Honeyboy\" Edwards were all regulars at weekly Friday night fish fries/jam sessions at the Wilson home. Throughout his adulthood, Wilson held regular jobs but was always welcome sitting in with Chicago blues mainstays like Melvin Taylor and Johnny B. Moore. His vocal inspirations range from Muddy Waters, B.B. King and Albert King to Jimmy Reed, Jimmy Rogers and Little Walter, but he mostly sings like Oscar Wilson. The Chicago Tribune declared, \"Oscar Wilson stands as a dominant figure. He brings a magisterial presence.\" A self-described blues fanatic, Nosek, born in Wisconsin in 1974 and raised in the suburbs of Chicago, spent his youth soaking up as much blues music as he could hear, both live and on record. In his teens, he began sneaking into blues clubs to watch Junior Wells, James Cotton, Otis Rush, Jimmy Rogers, Sunnyland Slim and others. Nosek recalls, \"Seeing those guys made a huge impression on me and propelled me into wanting to learn how to play the blues.\" He took up harmonica, quickly cultivating his own aggressive, fluid style. After moving to Madison in the early 1990s, he began sitting in with artists such as Clyde Stubblefield and Luther Allison. Finding like-minded musicians hell-bent on playing raw, rough-edged, hard-charging blues, Nosek formed The Cash Box Kings. They released their first album, Live! At The King Club, in 2003, instantly earning praise from critics and fans, and gaining a reputation as one of the hottest live bands on the circuit. With nine previous releases to their credit and hundreds of live performances under their belts, The Cash Box Kings have won widespread acclaim throughout the blues world. Their 2013 release Black Toppin' won the Blues Blast Music Award for Traditional Blues Album of the Year. It was also nominated for a 2014 Blues Music Award (BMA) in the same category. 2015's Holding Court was nominated for two BMA's (Best Traditional Album and Album of the Year) and the band was also nominated for the Band of the Year Award. In 2017, their Alligator debut Royal Mint was named among the Top Ten Blues Albums of the Year by MOJO magazine. The Chicago Tribune said the band plays \"unflinching blues distilled to its essence and steeped in tradition.\" They've been featured on NPR Music as well as in the pages of No Depression, The Pittsburgh Post-Gazette, Living Blues, Blues Music Magazine, Vintage Guitar, Blues Blast and many other publications, and in 2018 were again nominated for a Blues Music Award as Blues Band of the Year. The Cash Box Kings regularly headline Chicago venues like Buddy Guy's Legends, and have played major festivals across the U.S. and Europe. They've blown away audiences at the Chicago Blues Festival, the Tampa Bay Blues Festival, the Doheny Blues Festival, the Mississippi Valley Blues Festival, the New Orleans Jazz and Heritage Festival, the Cincinnati Blues Festival, the Cambridge Folk Festival (UK), the Moulin Blues Festival (Netherlands), the Lucerne Blues Festival (Switzerland), the Baltic Blues Festival (Germany) and the Edmonton Blues Festival (Canada). They have also performed in Belgium, France, Spain and Uruguay. With Hail To The Kings! and tour dates scheduled throughout the USA and Europe, The Cash Box Kings have earned their own blues throne and are ready to hold court. They bring an up-to-the-minute urgency to their traditional, tough, fun and gritty blues that brings audiences to their feet night after night. Blues Music Magazine says they are \"rollicking, sinewy and superb.\" Vintage Guitar adds, \"They are glorious, with an inspiring eloquence and grace.\" Blues & Rhythm sums it up best, declaring them, \"absolutely brilliant.\"", "otherInfo": "12:30 PM - 1:30 PM\nMichael & Joshua Ammons\n\n2:00 PM - 3:30 PM\nLittle Blues Machine\n\n4:00 PM - 5:30 PM\nThe Stephen Hull Experience\n\n6:00 PM - 7:30 PM\nShonn Hinton & Shotgun\n\n8:00 PM - 10:00 PM\nThe Cashbox Kings"}, {"Address": "419 Highland Dr, Kohler, WI 53044", "Artist": "Ben Wagner Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11197625.jpeg", "Coordinates": [43.7398584, -87.78179039999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Pop, Acoustic, Folk", "Time": "8:00 PM", "Venue": "The Winery Bar Kohler 8pm-12am", "moreBioInfo": "Wisconsin singer/songwriter Ben Wagner weaves flavors of indie, folk and country into his wholesome brand of Americana.", "otherInfo": "No event info available"}, {"Address": "1434 N Farwell Ave, Milwaukee, WI 53202", "Artist": "Paul Cebar ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.0485862, -87.8961233], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Shank Hall", "moreBioInfo": "Paul Cebar and the Milwaukeens are hot. He has sent his love in performance throughout this country and others. He has entertained with a unique vintage style. Swinging his stuff in Zoot Suits, early 50ish hats and such. Inspired by the music souls of those greats in folk, blues, jazz genres. Cross mixes of african, cajan and latin beats. He reflects all that we want to hear with deep down soul feeling. He touches you deep. He touches you oh so sweet. Listening is easy with hip hopping, toe tapping, shaking that booty inspired audiences flying off the handle ending up hurt by wiggles and smiles. Ouch! Some times you just have to grind. http://www.paulcebar.com/video/index.html", "otherInfo": "http://paulcebar.com/http://www.johnsieger.com/shankhall.com"}, {"Address": "2417 Silvernail Rd, Waukesha, WI 53072", "Artist": "Collective Soul ", "ArtistImage": "https://photos.bandsintown.com/thumb/6374473.jpeg", "Coordinates": [43.044997, -88.2668389], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Alternative Rock", "Time": "8:00 PM", "Venue": "Waukesha County Fair - Main Stage", "moreBioInfo": "Born during the rise of grunge and alternative rock, Collective Soul broke into mainstream popularity when they rose to international fame in 1993 with the rock anthem “Shine.” The multi-platinum quintet has been making music for two decades since then and has a catalog of #1 hits under their belts. Collective Soul helped shape and define alternative rock with lots of guitars and attitude. Collective Soul was formed in the small town of Stockbridge, Ga., in the early 1990’s. The group consists of principal songwriter and frontman Ed Roland (lead vocals/keyboards/guitars), Dean Roland (rhythm guitarist), Will Turpin (bassist), Johnny Rabb (drummer) and Jesse Triplett (lead guitarist). The band’s debut album Hints Allegations and Things Left Unsaid was originally released in 1993 on Atlanta indie label Rising Storm. The album was a collection of Ed Roland’s demos that spread like fire through the college circuit and the popularity of the album locally spurred Atlantic to pick it up for a major-label release. “Shine” quickly became the rock anthem played across the country on radio and on MTV and set the band up for an arena tour with Aerosmith. Their self-titled second album was a triple platinum juggernaut and would define their sound with guitar driven songs and passionate vocals. The album produced five Top Ten hits and two of the singles–“December” and “The World I Know”–charted on the Top 40, which spoke to the band’s crossover appeal. In 1997, the band went back into the studio to produce their third album Disciplined Breakdown. The album earned Collective Soul a spot on the charts at #16, and produced hit singles “Precious Declaration,” which was #1 four weeks; and “Listen,” #1 for five weeks), which also charted on the Billboard Hot 100, at #65 and #72, respectively. Critically acclaimed Dosage was released in 1999 and produced the hit singles “Run” and “Heavy,” which would take Billboard’s top spot for a record 15 weeks. Collective Soul’s fifth album, Blender, was released in 2000 and, according to Rolling Stone, “simply shreds with unapologetic classic-rock energy.” The album went gold and produced smash hits including “Why, Part 2,” “Vent,” and duet with Elton John “Perfect Day.” The band released a greatest hits collection in 2001 entitled 7even Year Itch: Greatest Hits 1994-2001. Following that album, Collective Soul recognized the music industry was evolving and was one of the first bands to create their own label to have more independence and control over their sound. And, in 2004, that label El Music Group released the dynamic album Youth. From the Ground Up (2005) and Home (2006) were also released under the El Music Group label, along with a DVD featuring their live concert with the Atlanta City Youth Orchestra. In 2007, the band teamed with Target to be the exclusive retailer for the band’s next album Afterwords, from Roadrunner Records. This arrangement was one of the first such exclusive album release deals to be made by a band with a sole retailer. The album was loved by fans and opened at #25 on the Billboard Comprehensive Albums Chart and was #5 on the Billboard Top Internet Albums Chart. In 2008, Collective Soul found themselves on the soundtrack for the film Twilight with “Tremble for My Beloved” from Dosage. Following the film’s success, the song’s exposure earned Collective Soul new popularity and connected with a younger audience. Collective Soul released their self-titled eighth studio album in 2009. The single “Staring Down” charted at #18 on Billboard‘s Adult Top 40. The album debuted at #24 on the Billboard 200 and the single “You” also charted on the Billboard Adult Top 40. Collective Soul’s music has often been covered by well-known artists. In 2001, Dolly Parton won a Grammy Award for Best Country Vocal Performance with her cover version of “Shine”. In further recognition of their artistic achievement, Collective Soul was inducted into The Georgia Music Hall of Fame in 2009. Additionally, as the principal songwriter for the group, Roland was individually inducted as a songwriter in 2014. The platinum-selling rock band is readying for the Fall 2015 release of their long-awaited ninth album, See What You Started by Continuing, followed by a tour to celebrate the band’s 21st birthday. Ed Roland says the band took some time off, came back energized about what they are and always have been: a rock band. “This is the best and most rocking album we’ve done. It’s one of those, ‘just sit back and rock’ records.” Collective Soul continues to rock quite simply for the love of music. The band that helped sonically define alternative rock is more focused and energized than ever. And as Ed Roland puts it, fans can continue to expect “lots of guitars and a fun attitude from the southern gentlemen of rock and roll.”", "otherInfo": "No event info available"}, {"Address": "300 Lakehurst Rd, Waukegan, IL 60085", "Artist": "EXEGESIS ", "ArtistImage": "https://photos.bandsintown.com/thumb/8500712.jpeg", "Coordinates": [42.34563379999999, -87.9042], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Metal, Black Metal", "Time": "8:00 PM", "Venue": "Lakehurst Banquets", "moreBioInfo": "Exegesis Metal Band", "otherInfo": "No event info available"}, {"Address": "1434 N Farwell Ave, Milwaukee, WI 53202", "Artist": "John Sieger ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.0485862, -87.8961233], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Shank Hall", "moreBioInfo": "No artist bio available", "otherInfo": "http://paulcebar.com/http://www.johnsieger.com/shankhall.com"}, {"Address": "300 Lakehurst Rd, Waukegan, IL 60085", "Artist": "Transmetal ", "ArtistImage": "https://photos.bandsintown.com/thumb/11515884.jpeg", "Coordinates": [42.34563379999999, -87.9042], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Thrash Metal, Metal", "Time": "8:00 PM", "Venue": "Lakehurst Banquets", "moreBioInfo": "Ciudad Azteca, Mexico City's TRANSMETAL, centred upon the erstwhile TEMPLE DE ACERO sibling Partida triumvirate of guitarist Juan, bassist Lorenzo and drummer Javier, is amongst the very biggest of Mexican Rock acts, having performed in Mexico, the United States, El Salvador, Colombia, Ecuador, Peru and Bolivia. The studs n’ leather bedecked TRANSMETAL, founded during January 1987, have stuck to their Thrash / Speed Metal stance over nearly twenty Spanish language albums. Upon their formation TRANSMETAL was fronted by vocalist Alberto Pimentel, who featured on the 1988 debut ‘Muerto en la Cruz’, produced by Dark Angel’s Eric Meyer, and the follow up ‘Desear Un Funeral’. On June 18th 1989 the group opened for Death at the Naucalpan Arena Lopez Mateos. In 1990 Pimentel departed to found LEPROSSY. Alejandro González of ILLUSION, and subsequently frontman for Arkhe, would fill the vacancy before Juan Carlos Camarena took the role of second guitarist. The band featured on the high profile ‘New Titans Over Mexico’ tour of 1991, these shows sharing billing with Sacred Reich in January, Kreator in July and Sepultura in December. On May 3rd 1992 TRANSMETAL supported Overkill at the Arena A. Lopez Mateos in Tlanepantla then appeared as part of the ‘Mexican Mosh’ festival alongside Sick of It All, Deicide and Nuclear Assault. The album that year, 'Amanecer En El Mausoleu', featured a cover version of 'Killers' by French band Killers. On November 8th the band scored the high profile support to Black Sabbath's concert at the Palacio de los Deportes in Mexico City. 1992 witnessed the departure of these latest two recruits and Alberto Pimental resumed activities with the band on a stand in basis. A successful Mexican tour during October found TRANSMETAL headlining over Mortuary and Inquisidor. The band's status would engender a further slot at the March 1993 ‘Mexican Mosh’ festival event, this time sharing honours with OVERKILL, KREATOR and Monstrosity among others. The following year TRANSMETAL, together with fellow native acts Angeles del Infierno and Rata Blanca, represented Mexico at the June 1994 ‘Monstruos De Rock’ gathering in Spain. The group notably guested for Slayer on September 10th at the Mexico City Balneario Olimpico. Pimentel would opt out yet again to forge another version of Leprosy (spelt with one ‘S’ on this ocassion) assembling a new band including Ramses guitarist Julio Marquez and ex-INQUISIDOR drummer Felipe Chacon. TRANSMETAL took onboard the esteemed former Luzbel and Huizar frontman Arturo Huizar as their lead vocalist but by February 1998 two members of Panic, vocalist Mauricio Torres and guitarist ‘Eric Towers’ (a.k.a. Ernesto Torres) stabilised the band for the album 'Las Alas Del Emperador'. Meantime, Lorenzo Partida and ex-TRANSMETAL vocalist Alejandro González would create the side project Ultratumba. TRANSMETAL's show at the Adolph Lopez Mateos de Tlalnepantla Arena in Mexico City in July 1999 was filmed and recorded, subsequently put out as two live discs 'dubbed XIII Años... En Vivo - Primera Parte' and 'XIII Años... En Vivo - Segunda Parte'. TRANSMETAL took a novel approach of recording tracks for two albums at once, 'Tristeza De Lucifer' and 'De Bajo De Los Cielos Púrpura', these sessions held in Hammond, Indiana with producer Mike Sheffield. Upon the release of 'Tristeza De Lucifer' the group toured South America during 2001. Shows in Bogota, Colombia, Manizales and Calí in Colombia, River basin in Ecuador, Arequipa in Peru, La Paz and Santa Cruz in Bolivia would prove a first for a Mexican Metal band. 'De Bajo De Los Cielos Púrpura' then arrived in July 2000, prompting a 30 date run of shows across the USA. That same year the debut album 'Muerto En La Cruz' would see a CD re-issue, adding four extra tracks. The band's legacy would be honoured in 2001 with the delivery of no less than two tribute albums in 'Milicia Infernal... Tributo a Transmetal' and the live 'Milicia Infernal... Tributo A Transmetal (En Vivo)', both released on the Denver label. Those paying homage included LUZBEL, PANIC, Disgorge, Ricter, Allusion, ULTRATUMBA, Domain, IRA, A.N.I.M.A.L., Leprycorn and Mechanical Chaos. TRANSMETAL returned in September 2002 with the experimental 'El Amor Supremo', this album, their very first to incorporate keyboards and recorded at Studio 880 in San Pablo California, seeing production duties going to the Cancer, DEATH, Disincarnate, Testament and Konkhra credited guitarist JAMES MURPHY. The band's December 2003 album, 'Lo Podrido Corona La Inmensidad', saw keyboard contributions coming from Erick Fuentes Quintana and a guest guitar solo on the track 'Creador De La Amargura' from JAMES MURPHY. 2004 saw TRANSMETAL tackling an album, 'Temple De Acero', comprising entirely of cover versions including the Scorpions 'The Zoo', Candlemass' 'At The Gallows End', Celtic Frost's 'Return To The Eve' and 'Dethroned Emperor', Accept's 'Balls To The Wall', AC/DC's 'Back In Black' and 'Let Me Put My Love Into You', Sodom's 'Remember The Fallen', BLACK SABBATH's 'Evil Woman', DEATH's 'Evil Death', Uriah Heep's 'Free And Easy' and Twisted Sister's 'The Kids Are Back'. A notable compilation issued in June that same year, '17 Years Down In Hell', re-worked the tracks from the previous two albums, 'El Amor Supremo' and 'Lo Podrido Corona La Inmensidad', in English language. An unaccredited track, a newly recorded version of 'Aborrecer Al Forence', saw Mauricio Torres on vocals. New studio album 'El Despertar De La Adversidad' arrived in February 2006, capitalised on by a run of Mexican shows, gigs in Honduras, El Salvador, Guatemala and spot US gigs. The band would be back in the recording studio before the end of the year cutting the 'Progresión Neurótica' album for November.", "otherInfo": "No event info available"}, {"Address": "105 W Freistadt Rd, Thiensville, WI 53092", "Artist": "Willy Porter ", "ArtistImage": "https://photos.bandsintown.com/thumb/11461819.jpeg", "Coordinates": [43.2358463, -87.9851633], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk, Acoustic", "Time": "8:00 PM", "Venue": "Cheelabration 2021 (8yrs!!!)", "moreBioInfo": "Willy Porter is a contemporary american folk musician from wisconsin. His career as a published singer began in 1990 with his album, The Trees Have Soul, although his popularity began in 1994 with his album Dog Eared Dream, which had the successful single Angry Words, and led to his touring as an opening act for artists including Tori Amos and The Cranberries. Recently, Porter opened for Jethro Tull, where he formed a friendship with Tull's guitarist, Martin Barre.", "otherInfo": "8th Annual Celebration @ Daily Taco & Cantina (105 W. Freistadt Rd., Thiensville) featuring Amazing Food, Live Music, Games and much more! Join us for this day-long, fully-tented, indoor/outdoor, family-friendly, community-wide event to celebrate with us! A portion of the proceeds will benefit the cheel rebuild!!!\nFeatured Music Acts:\n- Comfort Shag (12-3pm)\n- The Hot and Dirty Brass Band (4-7pm)\n- Headliner: The Willy Porter Band (8-11)\n...set breaks by The Cheel \"All-stgars\"\nFood, Games and Much More all day long!\n- Henna, Face Painting, Water Balloon Fight, Tacos, Pit Roast (Boar), Brats, Sammies, 3 Full Bars and more!"}, {"Address": "300 Lakehurst Rd, Waukegan, IL 60085", "Artist": "Noctilucent ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [42.34563379999999, -87.9042], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Lakehurst Banquets", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "2324 18th St, Kenosha, WI 53140", "Artist": "Michael Scott ", "ArtistImage": "https://photos.bandsintown.com/thumb/11328163.jpeg", "Coordinates": [42.6247312, -87.8380529], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Southern Rock, Country, R&b", "Time": "8:00 PM", "Venue": "Duke's Country Saloon", "moreBioInfo": "Michael Scott, in one word, is described as \"Driven.\" Raised in Milwaukee, Michael was introduced to Country Music at an early age. Like many artist he had lots of ups and downs, but with that drive forward attitude. Michael has since performed on the same stages with some of music's greatest entertainers including George Jones, Reba, Kenny Chesney, Chubby Checker, Keith Urban, Rascal Flatts, Toby Keith, Tim McGraw, Montgomery Gentry, Sugarland, 112, Keith Sweat, Buck Cherry, Neal McCoy, Daryle Singletary and many many more. Michael opened for one of his own musical heroes (Tracy Lawrence) at a festival in Wisconsin and within less than a year to the date of that performance, Lawrence signed Michael Scott to his independent label (Rocky Comfort Records). \"Michael Scott is a great live entertainer with a unique voice,\" Lawrence introduced. \"He's got that 'something special,' not only as an entertainer but as a person, that translates well to the public. His live performance reminds me of the early Hank Jr. shows; he's edgy and in your face.\" Michael Scott describes himself as an \"average Joe\" who's a little rebellious, adventuresome and likes to live on the wild side. Admitting that he's an entertainer first who is working to become a great singer and a better musician, Michael Scott is likened to Hank, Jr., George Strait, Eric Church, Kenny Chesney and of course Tracy Lawrence. He combines his high-energy performance with traditional country flavor and a hint of Southern Rock, R&B, and Blues No matter the obstacles, how far, or how long it took to get here, Michael Scott was, is, and continues to be Driven. He has learned from and performed with some of the best in the business. He has become part of the Country Music Community from hundreds of performances on Nashville's famous Lower Broadway to the honky tonks, fairs, festivals, and venues around the world.", "otherInfo": "No event info available"}, {"Address": "279 W Main St, Waukesha, WI 53186", "Artist": "Catelyn Picco ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [43.0115223, -88.2310945], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country, Pop, Country Pop, Acoustic", "Time": "10:30 AM", "Venue": "The Guitar For Life Cafe", "moreBioInfo": "Catelyn Picco is a Singer/Songwriter from Waukesha, Wisconsin. She has been singing for as long as she can remember and when she picked up a guitar at age 12, she knew that performing was something she loved. She has a love for country music, superhero movies and meeting new people. Her previous experience includes: Summerfest, The Wisconsin State Fair, The Waukesha County Fair, and more! In addition to that, her EP titled “Strong and Courageous” is available for streaming on Spotify! For more information and updates about Catelyn visit her website at: www.catelynpicco.com as well as follow her on social media.", "otherInfo": "No event info available"}, {"Address": "5501 Co Hwy M, West Bend, WI 53095", "Artist": "HuDost ", "ArtistImage": "https://photos.bandsintown.com/thumb/11201523.jpeg", "Coordinates": [43.3893044, -88.08055879999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Neo-folk-world-rock, Country, Eastern Fusion, Rock, Folk", "Time": "11:00 AM", "Venue": "Kirtan Fest Milwaukee Presents", "moreBioInfo": "The music of HuDost weaves a seamless tapestry of Folk, World, and Rock that renders tears and laughter in listeners, cultivating the nameless longing that abides somewhere in all our hearts and invoking total celebration. HuDost’s core musicians are Moksha Sommer, from Montréal, and Jemal Wade Hines from Kentucky. Having toured the U.S., Canada, and Europe constantly since April 2006, HuDost has grown and expanded, travelled rocky and glorious terrain and marveled at all they can learn and explore. Moksha and Jemal Wade in this time have grown as artists, as seekers, as a couple and as a family. Since 2015 they have also been highly engaged activists, doing advocacy work as KY Congressional District Representatives for ONE (a non-profit organization working to end extreme poverty and, specifically, the sexism of poverty). HuDost’s last album 'of Water + Mercy' received rave reviews and as an independent release reached #24 in the BILLBOARD SALES CHARTS for Folk/Americana also winning the 2020 Independent Music Award for Social Action Song. In the last year they also received two of the 'Best of Nashville 2020’ awards. On past albums HuDost has worked with GRAMMY Award-winning producer Malcolm Burn (Bob Dylan, Emmylou Harris, Peter Gabriel) and GRAMMY Award-winning mixers Oz Fritz (Tom Waits, Bill Laswell, Primus) and Vance Powell (Jack White, Chris Stapleton, Pearl Jam, Willie Nelson, Buddy Guy, Beyonce, Beck, Alicia Keys, Melissa Etheridge, Kings of Leon). In November, 2021 HuDost will be releasing a new album, ‘Anthems of Home’ that defines real, honest love and is a lush, breathtaking original collection of compositions that ask important questions. In this time of loss and awakening HuDost’s new album gives powerful voice to this journey in a way that will remain timeless and will prove the resilience that we all share. Special guests on the album include Jars of Clay, The Accidentals, Christie Lenée and others. Their early release from the new album, ‘Our Words Will Be Louder’, included additional music video cameos from Kevin Clash (Elmo), Kevin Hearn (from the Barenaked Ladies), Cy Curning (from The FIXX), GangstaGrass, Alana Bridgewater, Nawal, Hymn for Her, Jai Uttal, and more. HuDost worked with minister/activist William J. Barber II and all proceeds from it went to the Poor People’s Campaign. It received press coverage in over 130 major news publications and radio including CTV News, The Observer, Roots Music Canada, All Access Music, and received the ‘Best Music Video of the Week’ from Blues and Roots Radio. HuDost functions as a duo or as a band, including guest musicians of varying sensibilities and backgrounds, and often including dance in their shows. As a duo their instrumentation includes vocals, harmonium (Indian Pump-Organ), NORD Keys, guitars, Dulcinet, percussion, and a slew of sonic ambient effects. Their music is a rich, eclectic blending of pop and rock with traditional Sufi music, Bulgarian, Croatian, Macedonian and Balkan folk music, Farsi, Turkish, Arabic, and folk. Their sound crosses all borders and barriers, taking the listener on a journey they will never forget. Highlight performances include Bonnaroo, Resident band at FloydFest, BhaktiFest, World Café Live, Blissfest, The ARK, Alex Grey’s CoSM, the Salvador Dali Museum, Shakori Hills Grassroots Festival, headlining The Islands Folk Fest (Vancouver), WMNF’s Tropical Heat Wave Festival, The Levitt Pavilions, WoodSongs at the Kentucky Theater (on PBS), Nashville’s Bluebird Café, Music City Roots, Tim Robbins’ WTF?! Fest, The Montreal Folk Festival, The Stan Rogers Folk Festival, and many more. Highlight collaborations and opening slots for other artists include Ani DiFranco, Philip Glass, Jon Anderson (YES), Snatam Kaur, Steve Kilbey (The Church), Ramy Essam, California Guitar Trio, Bell Orchestre, Neko Case, Jim Lauderdale, Omar Faruk Tekbilek, Mercan Dede, and many more. HuDost's music is a powerful expression of life's journey and discovery. In 2008, Moksha went through a painful process of brain surgery due to a tumor. The healing from this included re-learning language skills, losing and regaining proper sight, and experiencing seizures. This could have been staggering but instead served as learning that has fueled a potent desire to bring healing through sound. In 2013 their amazing son, Kaleb, was brought into the world. It is through music that the losses and gains, pains and triumphs, and excruciating beauty of life can be given a voice of empathy to the synonymous lives of all people. Both critics and fans have said time and time again that the music of HuDost is this very expression. HuDost’s message comes from real experience, real emotion, and real concern for the world - from the birth of a child, to the healing of the body, to the healing of the planet, their words and music echo the human experience.", "otherInfo": "Join us for a two day Sufi inspired, transcendent Kirtan experience featuring Moksha Sommer and Jemal Wade Hines of HuDost with Kaita. This will include music/concerts and retreat sessions! We are limiting the attendance of this gathering to 65 people, please take precautions where necessary to prevent the spread of Covid-19. We will be outside for the duration of the event. Use of the facility is permitted with the exception of the pool one hour before and after performances and workshops. Come enjoy the space, connect to our beautiful community, and journey blissfully inward. Please register in advance to save your spot. Contact Kaita at 414-412-2473.\nYou can also purchase tickets in advance for Saturday, Sunday or BOTH days (it is a better price for both days).\nThe full event- Saturday and Sunday: https://hudost.com/product/665445\nSaturday only- https://hudost.com/product/665442 \nSunday only- https://hudost.com/product/665444"}, {"Address": "332 N Milwaukee St, Milwaukee, WI 53202", "Artist": "Tommy Odetto ", "ArtistImage": "https://photos.bandsintown.com/thumb/11367530.jpeg", "Coordinates": [43.0347501, -87.9057625], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues & Rock, Rock And Roll", "Time": "11:30 AM", "Venue": "Smoke Shack", "moreBioInfo": "Tommy Odetto first got the chills from music as a little boy when he came across Elvis Presley, Buddy Holly, and The Beatles. As Tommy approached his teens, he discovered guitarists such as Jimi Hendrix and Eric Clapton. Deeply inspired, he picked up the guitar and never looked back. A few years later Odetto was a semi-finalist for Guitar Center’s King of the Blues. He was also featured in Guitar Player magazine as an artist to watch. After two successful stints with local bands, in 2016 he decided to pursue his dream of being a frontman. Since the move to fronting his own band, Tommy has been fortunate to be invited to perform at Bottlerock Napa 2018, and has opened for bands like, Chevy Metal, Tommy Castro, Coco Montoya, Y&T, Walter Trout, Uriah Heep, Ace Frehley, Trainwreck with Kyle Gass (Tenacious D) and Robin Trower to name a few. He is also a regular fill-in for Big Brother and the Holding Company. Now, only two years later, the Marin County native is celebrating his long-awaited sophomore release. Curses and Revelations is an unapologetic Rock and Roll record with themes of love lost, depression, addiction, recovery, self-discovery, and redemption. Five original melodic hard rock songs that highlight his raw, honest lyrics and peel back the curtain of the heart and mind of Odetto. Curses and Revelations features many standout guitar moments that are so passionate and soulful that it’s as if we are witness to a musical truth serum. Recorded at Studio 606 and produced by John Lousteau and Ethan Turner, this new work touches on everything Odetto loves: Hard Rock, Blues, a 60's Pop mentality, with a Grunge era swagger.", "otherInfo": "No event info available"}, {"Address": "Dousman, Dousman, WI 53118", "Artist": "Ben Titus Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8668351.jpeg", "Coordinates": [43.014176, -88.4725983], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Big Spoon @ Dousman Derby Days", "moreBioInfo": "Ben holds a BM in Music Education (PreK-12 Instrumental) from Longwood University and an MM in Music Education from Virginia Commonwealth University. While he majored in clarinet and performs primarily on bass and guitar outside of the concert band world, Ben is a multi-instrumentalist, performing with numerous ensembles on a number of different instruments. Past credits include the Mid-Atlantic Wind Symphony (principal clarinet, bass clarinet), Aaron Noë All-Stars (electric and upright bass), Christian Youth Theater (electric and upright bass), Fredericksburg Academy Players (bass, drumset, guitar, auxiliary percussion), and the Rappahannock Pops Orchestra (clarinet, bass clarinet, timpani/aux. percussion). As an educator, Ben has a wide variety of experience. His busy career so far has included conducting concert bands, jazz ensembles, orchestras, and chamber groups during his career. Ben is also an in demand clinician, presenting clinics and performances for Gerald Veasley’s Bass Bootcamp, The Virginia Bass Forum, and various schools and lesson programs throughout the Mid-Atlantic region and southeast Wisconsin. Ben maintains a small but thriving private studio of guitar, bass, clarinet, and theory students in Milwaukee and via Skype. Since 2005, Ben has developed a reputation as a first-call jazz, blues, fusion, and rock bassist. He has shared the stage with the late great tenor saxophonist James Moody, Grammy Award-Winning alto saxophonist Eric Marienthal, John DeSalme (tenor sax, US Army Blues), and Duffy Jackson (drums). He has also opened for Jimmie's Chicken Shack, Edwin McCain Band, and Chase Rice. Ben has been an integral member of bands playing events ranging from inaugural balls to state fairs to Wisconsin’s Summerfest Music Festival.", "otherInfo": "Parade, Beer Garden, and Big Spoon. Sounds like a great Sunday!"}, {"Address": "232 N Milwaukee St, Waterford, WI 53185", "Artist": "Kenny Hotopp ", "ArtistImage": "https://photos.bandsintown.com/thumb/11214486.jpeg", "Coordinates": [42.7673424, -88.20910099999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alt-country, Country Blues", "Time": "1:00 PM", "Venue": "Kenny solo on the river", "moreBioInfo": "Kenny was raised in a small farming town in Illinois. His passion for music came at an early age as he immersed himself in his parents’ classic rock and country records. After high school, Kenny moved to Los Angeles, CA, and then spent time in France, before ultimately settling down outside Milwaukee, WI. It wasn’t until he turned 40, and with the encouragement of his beautiful wife, that Kenny began to appreciate his own voice and flair for playing guitar. His original Midwest sound is created by his rich, deep baritone voice and self-taught melodic guitar. With songs that are shaped from experience on the road and raising his family, he is always writing about the people he has met and places he has been, along the fascinating path of life. He plays solo or with The Night Owls band. Kenny is making music his way and hopes you will enjoy the ride as much as he does.", "otherInfo": "Come hang at Docs for some afternoon music on the Fox"}, {"Address": "1434 N Farwell Ave, Milwaukee, WI 53202", "Artist": "BRETT NEWSKI ", "ArtistImage": "https://photos.bandsintown.com/thumb/11411491.jpeg", "Coordinates": [43.0485862, -87.8961233], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Power Pop, Alternative Rock, Punk, Dork Rock, Geek Rock, Alternative, Garage, 90s, Folk Punk, Satire, Indie Rock", "Time": "1:00 PM", "Venue": "BOOKS SOLD OUT: LAUNCH PARTY moved to 11/19 @ Anodyne (full band)", "moreBioInfo": "NOTABLE FESTIVAL APPEARANCES: Rolling Stone Festival, Iceland Airwaves, Reeperbahn Germany, SXSW official BRETT NEWSKI supports and tours:  Courtney Barnett, Pixies, Violent Femmes, Manchester Orchestra, New Pornographers, Chuck Ragan, Rocky Votolato, Ezra Furman, Better than Ezra How do you feel when someone starts playing on their phone while you’re talking to them? It’s a dark moment. It’s a seemingly small, yet significant moment when we realize we’ve got work to do as both individuals, and as a species. BRETT NEWSKI’s fourth studio album Don’t Let the Bastards Get you Down is a call to arms against whatever destructive forces we may find ourselves battling, from our individual struggles with toxic relationships, low self esteem, loneliness, and apathy to the more global challenges facing us in 2020: The erosion of face-to-face human connection, the breakdown of the proverbial village, the destruction of the planet, and the myriad ways in which our social media addictions amplify these problems. Depression and anxiety are at all time highs, with many, if not most of us, struggling to preserve our optimism. So how do we regain control and stay hopeful in the face of these challenges? Perhaps it’s less screen time. Perhaps it’s changing the way we approach our tiny pocket TVs. Perhaps it’s discovering or recommitting to our passions. Perhaps it’s getting our hands dirty in pursuit of real solutions to our problems (instead of just complaining online). Perhaps Don’t Let the Bastards Get You Down can shed some positive insight. In Last Dance (cowritten with Grammy nominated songwriter Pat Macdonald, ‘Future’s So Bright I Gotta Wear Shades’), Newski lays bare the highly relatable challenge of trying to stay informed and engaged while simultaneously staying afloat psychologically: “I ain’t trying to build the ark, I just really wanna learn how to swim / Thru a sea of plastic bottles, all the refuse, the mess we are in.” In Grow Your Garden, Newski issues a wake-up call from the hypnotic, numbing effects of living with our eyes glued to our screens: “If I was the dirt beneath the sneakers on your soulless feet / I’d nudge you far from the mirage so you could see the water”. In Lousy T-Shirt, Newski describes the traps of social comparison in these “tiny TV times”, in which we so often compare ourselves to the “greatest hits” of others’ lives. (“I ain’t making any headlines / It’s a failures parade / I drove all the way to Hollywood and all I got’s this lousy t-shirt.”) He doubles down on this theme in Buy Me a Soul, singing “Step out from behind these little screens that rule our lives / I’m sick of highlights / Cause we’re an empty shell and we’re on earth but we’re in hell / Can anybody hear me? / Is this a permanent bad dream? Or is it too much reality?” What could topically threaten to amount to “too much reality” for the listener is buoyed by Newski and collaborator Spatola’s signature blend of largely up-tempo, guitar-driven alternative with splashes of what they describe as “Geek Rock”, “Happy Punk”, and “Diet Grunge”. The band has had a busy few years, playing alongside acts like PIXIES, Courtney Barnett, Violent Femmes, Better than Ezra and Manchester Orchestra, and will be touring extensively in support of this release.  “Newski's live shows are part rock n' roll, part stand up, and part therapy. In the end, the room is won over,” says Jim McGuinn of The Current in Minneapolis.", "otherInfo": "Blending humor with mental health struggles, alternative songwriter/illustrator/podcaster BRETT NEWSKI makes fun of his own anxieties by offering mental health boosts in his first book \"It's Hard to be a Person: Defeating Anxiety, Surviving the World, and Having More Fun.\" \n\nJuly 25 is a Sunday daytime book launch party, where he'll unveil the new book, play new songs, and answer audience questions around defeating anxiety and tactics for feeling better in your brain. https://brettnewski.com/\n\n1pm doors 2pm show. DAN HUBBARD opens."}, {"Address": "750 N Lincoln Memorial Dr, Milwaukee, WI 53202", "Artist": "Tally Ho Brass ", "ArtistImage": "https://photos.bandsintown.com/thumb/11534807.jpeg", "Coordinates": [43.0439191, -87.89297619999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "German, Cover Band, Jazz, Volksmusik, Austrian, Czech, Brass", "Time": "1:00 PM", "Venue": "The Beer Garden At The War Memorial", "moreBioInfo": "Inspired by popular brass ensembles such as da Blechhauf’n, Mnozil Brass and Viera Blech, Tally Ho blends traditional polkas, waltzes and marches with modern composition styles, bringing an exciting new sound and energy to this genre of music. Beyond the German and Austrian style, Tally Ho is pushing American brass music to a new level with original compositions and fresh arrangements of many songs you know and love.", "otherInfo": "Check out this new collaboration between Kegel’s Inn and the War Memorial Center. Enjoy a beer with a view, try one of the many amazing brats and Tally Ho! will be there with real, LIVE music."}, {"Address": "18490 W Old Gages Lake Rd, Gages Lake, IL 60030", "Artist": "Brecken Miles ", "ArtistImage": "https://photos.bandsintown.com/thumb/11015089.jpeg", "Coordinates": [42.3536971, -87.9928422], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "1:30 PM", "Venue": "Jesse Oaks Food & Drink", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "617 W Main St, Lake Geneva, WI 53147", "Artist": "Cole Brandt ", "ArtistImage": "https://photos.bandsintown.com/thumb/11059357.jpeg", "Coordinates": [42.5919345, -88.4320434], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, Electronic Dance Music, Acoustic Guitar, Classical, Jazz, Spanish, Acoustic Pop, Tropical House", "Time": "2:00 PM", "Venue": "Cole Brandt Live @ The Bottle Shop", "moreBioInfo": "I'm a musician from the Rockford/Chicago/Madison areas. I specialize in pop/rock/jazz/classical acoustic music as well as electronic dance music.", "otherInfo": "Cole Brandt Live"}, {"Address": "8330 Fox River Rd, Waterford, WI 53185", "Artist": "Robert Allen Jr. Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11380847.jpeg", "Coordinates": [42.8331154, -88.2300483], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues, Blues-rock", "Time": "2:00 PM", "Venue": "Bobberz", "moreBioInfo": "\"BLUES ARTIST OF THE YEAR NOMINEE\" 2019 -WAMI AWARDS \"MILWAUKEE'S BEST WINNER\" 2019 -SHEPHERD EXPRESS METRO \"EXTRAORDINARY GUITAR GURU\" -ONMILWAUKEE.COM \"POWERFUL, GREAT SONGS\" -BLUES REVUE MAGAZINE", "otherInfo": "The Robert Allen Jr. Band"}, {"Address": "10521 IL-47, Hebron, IL 60034", "Artist": "Lisa  Marie ", "ArtistImage": "https://photos.bandsintown.com/thumb/11370186.jpeg", "Coordinates": [42.4783641, -88.44089939999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country Pop, Indie, Country, Pop Rock Indie Country, Contemporary Country, Pop Country, Pop", "Time": "2:00 PM", "Venue": "Lisa Marie//Hoop's Sports Bar & Grill", "moreBioInfo": "Lisa Marie grew up in a small town in the Northwest Suburbs of Chicago, Illinois. At an early age, she had a passion for music. Her musical influences are Tori Kelly, Shania Twain, Alicia Keys, Jessie James Decker, Miranda Lambert, Ashanti.. just to name a few. Lisa Marie has been added to Backyard Country on Chicago's BIG 95.5 Sunday playlist. When the ISSA announced the nominees of the 2021 International Singer-Songwriter Association Awards, Lisa Marie got nominated in five categories: Female Vocalist of the Year, Female Rising Star, Female Single of the Year 'Just Wanna', Female Emerging Artist of the Year, & Female Songwriter of the Year.", "otherInfo": "Come out and have Sunday Funday with me at Hoop's Sports Bar and Grill. \n\nLisa Marie grew up in a small town in the Northwest Suburbs of Chicago, Illinois. At an early age, she had a passion for music. Her musical influences are Tori Kelly, Shania Twain, Alicia Keys, Jessie James Decker, Miranda Lambert, Ashanti.. just to name a few. Lisa Marie has been added to Backyard Country on Chicago's BIG 95.5 Sunday playlist. Both current singles are being played on radio stations worldwide. \n\nWhen the ISSA announced the nominees of the 2021 International Singer-Songwriter Association Awards, Lisa Marie got nominated in five categories: Female Vocalist of the Year, Female Rising Star, Female Single of the Year 'Just Wanna', Female Emerging Artist of the Year, & Female Songwriter of the Year."}, {"Address": "27843 W Grass Lake Rd, Antioch, IL 60002", "Artist": "The Gingers ", "ArtistImage": "https://photos.bandsintown.com/thumb/11383863.jpeg", "Coordinates": [42.4265615, -88.15856529999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classic Rock Covers, Female Fronted Rock, Classic Rock", "Time": "2:30 PM", "Venue": "Blarney Island", "moreBioInfo": "These chicks rock! The Gingers are an all-female fronted, redheaded, Chicago based classic rock band who put on an entertaining and energetic rock show. The band delivers a lively-fun-loving and high-energy performance that keeps audiences engaged and rockin’ along - no matter the age group. Their high-energy arsenal is filled with the greatest rock songs. Covering: Zeppelin, ACDC, Foreigner, Boston, Motley Crue, Deep Purple, Foo Fighters, Sabbath, Heart, Rush, Whitesnake, Thin Lizzy, Pretenders, Joe Walsh, Bad Company, Stevie Nicks, Fleetwood Mac, Joan Jett, Cher, Foghat, BTO, REO, BOC, Molly Hatchet, Twisted Sister, Styx, Night Ranger, Poison, T-Rex and more!", "otherInfo": "Get stranded on Blarney Island with The Gingers! \n\nIt's Blarney Gras weekend! Beer, Boats, Bands & Beads\nhttp://www.blarneyisland.com/"}, {"Address": "S64 w18295, Muskego, WI 53150", "Artist": "Tommy Odetto ", "ArtistImage": "https://photos.bandsintown.com/thumb/11367530.jpeg", "Coordinates": [42.9277704, -88.1429587], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues & Rock, Rock And Roll", "Time": "2:30 PM", "Venue": "Tail Spin Bar & Grill", "moreBioInfo": "Tommy Odetto first got the chills from music as a little boy when he came across Elvis Presley, Buddy Holly, and The Beatles. As Tommy approached his teens, he discovered guitarists such as Jimi Hendrix and Eric Clapton. Deeply inspired, he picked up the guitar and never looked back. A few years later Odetto was a semi-finalist for Guitar Center’s King of the Blues. He was also featured in Guitar Player magazine as an artist to watch. After two successful stints with local bands, in 2016 he decided to pursue his dream of being a frontman. Since the move to fronting his own band, Tommy has been fortunate to be invited to perform at Bottlerock Napa 2018, and has opened for bands like, Chevy Metal, Tommy Castro, Coco Montoya, Y&T, Walter Trout, Uriah Heep, Ace Frehley, Trainwreck with Kyle Gass (Tenacious D) and Robin Trower to name a few. He is also a regular fill-in for Big Brother and the Holding Company. Now, only two years later, the Marin County native is celebrating his long-awaited sophomore release. Curses and Revelations is an unapologetic Rock and Roll record with themes of love lost, depression, addiction, recovery, self-discovery, and redemption. Five original melodic hard rock songs that highlight his raw, honest lyrics and peel back the curtain of the heart and mind of Odetto. Curses and Revelations features many standout guitar moments that are so passionate and soulful that it’s as if we are witness to a musical truth serum. Recorded at Studio 606 and produced by John Lousteau and Ethan Turner, this new work touches on everything Odetto loves: Hard Rock, Blues, a 60's Pop mentality, with a Grunge era swagger.", "otherInfo": "No event info available"}, {"Address": "N86W16396 Appleton Ave, Menomonee Falls, WI 53051", "Artist": "Claire Kelly Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8631372.jpeg", "Coordinates": [43.1756194, -88.1135901], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Player's Pub", "moreBioInfo": "Official music page of Claire Kelly. Stay tuned for recording updates, videos, upcoming events and inspirational quotes.", "otherInfo": "No event info available"}, {"Address": "5555 7th St Pavilion #1, Kenosha, WI 53144", "Artist": "BEN MULWANA ", "ArtistImage": "https://photos.bandsintown.com/thumb/11064847.jpeg", "Coordinates": [43.1756194, -88.1135901], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Ben Mulwana @ Petrifying Springs Biergarten", "moreBioInfo": "Ben Mulwana is a Ugandan-born and raised artist residing in Wisconsin. With soulful lyrics and a diverse range of musical inspiration, Ben's music has a storytelling quality that is both unique and familiar. Whether alone or with his band, he brings high energy, engaging with his listeners and sharing his heart through his music. Ben released his debut EP, \"Wano Naawe\", in June 2019; and his most recently released Single, \"Lies of the Devil\", is available on all streaming platforms. Ben is set to release his next project in June 2021", "otherInfo": "No event info available"}, {"Address": "350 Constance Blvd, Williams Bay, WI 53191", "Artist": "Straight No Chaser ", "ArtistImage": "https://photos.bandsintown.com/thumb/11014188.jpeg", "Coordinates": [42.5670436, -88.5583432], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, A Cappella", "Time": "4:00 PM", "Venue": "Music by the Lake", "moreBioInfo": "If the phrase “male a cappella group” conjures up an image of students in blue blazers, ties, and khakis singing traditional college songs on ivied campuses... think again. Straight No Chaser (SNC) are neither strait-laced nor straight-faced, but neither are they vaudeville-style kitsch. They have emerged as a phenomenon with a massive fanbase and a long list of accomplishments including 2 RIAA Gold Certified albums, over 1.5 million concert tickets sold, over 1 billion streams on Pandora, and over 1 million albums sold worldwide. Straight No Chaser is the real deal, the captivating sound of nine unadulterated human voices coming together to make extraordinary music that is moving people in a fundamental sense... and with a sense of humor.", "otherInfo": "No event info available"}, {"Address": "1525 24th Ave, Kenosha, WI 53140", "Artist": "Westward Road ", "ArtistImage": "https://photos.bandsintown.com/thumb/9525355.jpeg", "Coordinates": [42.6306775, -87.8371318], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Christian, Christian Country, Gospel, Adult Contemporary, Southern Gospel, Worship", "Time": "6:00 PM", "Venue": "Prayer House Assembly", "moreBioInfo": "Providing a unique blend of gospel and modern worship music is where Westward Road excels. Westward Road is an exciting and dynamic family trio, led by Scott Roberts, a 20 year veteran worship leader and nation charting songwriter, and his wife, the talented and award winning vocalist, Kelli Roberts. Their son, Garrett Roberts completes the superbly gifted musical family with his smooth vocal tones. Their \"out of the box\" take on worship and gospel music paired with their God given ability to communicate the Good News takes audiences into the presence of God in a very powerful way. They have performed for audiences in large theaters and for intimate settings in rural churches, festivals and fairs. A Westward Road concert leaves you uplifted by their message of hope and encouraged to live a life of trust in God. Their new take on gospel music along with their smooth family harmonies and ability to lead God's people into His presence through worship will have audiences of all ages falling in love with this fun and energetic trio.", "otherInfo": "No event info available"}, {"Address": "2417 Silvernail Rd, Pewaukee, WI 53072", "Artist": "The Kentucky Headhunters ", "ArtistImage": "https://photos.bandsintown.com/thumb/8970350.jpeg", "Coordinates": [43.044997, -88.2668389], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Pop, Country, Blues, Country Blues", "Time": "6:00 PM", "Venue": "Waukesha County Fair", "moreBioInfo": "\"The Kentucky Headhunters,\" says founding member, guitarist/vocalist Richard Young, \"are and always will be in love with playing live. It's our lifeblood.\" The Grammy-winning band—declared \"the great American rock 'n' roll band\" by Billboard—is never more spontaneous and unpredictable as when they are performing live on stage. \"We threw away the set list 20 years ago,\" says Young, whose brother Fred plays drums, cousin Greg Martin plays guitar and longtime friend Doug Phelps sings and plays bass. Although the Southern rock, blues and country band has been recording and touring together for over 30 years (and making music together for over 50 years), they had never, until 2016, performed overseas. That year, Richard—a notoriously uneasy flier—let his son John Fred (drummer for rising star rock group Black Stone Cherry) talk him into bringing The Kentucky Headhunters to Europe. A tour of Sweden and the United Kingdom was booked, and the band was on its way to earning a whole new audience for their raucous and rowdy music. The Kentucky Headhunters' new Alligator Records album, Live At The Ramblin' Man Fair, was recorded at The Ramblin' Man Fair in Maidstone, UK, a highlight of the tour. In front of 25,000 screaming fans, The Kentucky Headhunters rip through ten smoking hot tracks from their first-ever UK performance. The results are staggering. Combining old-school blues and blistering Southern rock with country overtones and a rural sensibility, The Kentucky Headhunters cross borders and genres with ease, as the elated UK audience roars its collective approval throughout the concert. Mixing six high-energy originals, searing blues rockers and a rollicking version of The Beatles' \"Don't Let Me Down\" (with Black Stone Cherry), Live At The Ramblin' Man Fair captures The Kentucky Headhunters at the absolute height of their power. Closing out the album are three recently discovered bonus studio tracks from the legendary Meet Me In Bluesland sessions featuring late blues piano icon Johnnie Johnson (known for his seminal piano work driving Chuck Berry's most famous songs). With no other country, rock or blues band quite like them, it's no surprise that the history of The Kentucky Headhunters is as deeply rooted as their music. Growing up on a 1300-acre family farm in Edmonton, Kentucky, the Young brothers (Richard and Fred), cousins Greg Martin and Anthony Kenney heard plenty of raucous R&B and deep, soulful blues courtesy of Fred and Richard's mother, who listened to powerhouse radio station WLAC late at night. \"She was a real hip white girl,\" Richard says. \"She was a huge influence on us.\" Their father loved big band jazz, Benny Goodman, Tommy Dorsey and Sarah Vaughan. \"Music in our home was a mixture, unlike what most farm kids heard.\" Part of their musical upbringing included their friendship with three African-American families who lived and worked on nearby farms. The boys heard gospel and blues, both sung by their neighbors in the fields and blasting out of their radios. They were reared on Howlin' Wolf and Muddy Waters (the name Headhunters was a nickname given to Waters and Jimmy Rogers at the start of their careers, when they came into a club ready to take on all comers). \"All of these things taught us the blues,\" says Richard. The Kentucky Headhunters began their professional journey in 1968 when the Young brothers and their cousins Martin and Kenney formed the Southern blues-rock band Itchy Brother. The band morphed into The Kentucky Headhunters in 1986. Their first album, 1989's Pickin' On Nashville, was released by Mercury Records and surprised the world, becoming a bona fide hit and selling over two million copies. The album won a Grammy Award, three Country Music Awards, an American Music Award and an Academy Of Country Music Award. It spawned four consecutive Top 40 Country hits and established them as a musical force to be reckoned with. By 1993 they had befriended Chuck Berry's famous pianist Johnnie Johnson and recorded That'll Work, surprising and delighting their country-loving audience with their deep blues playing. Befriending Johnson and recording with him was a dream come true for the band. According to Fred, \"We were fortunate to know him. It was a good marriage.\" Richard adds, \"Anyone who ever played with him became a better player.\" Constant touring has kept the band busy and each new release has kept them in high demand. 2015's Alligator CD, Meet Me In Bluesland (recorded in 2003 with Johnnie Johnson) brought the band to the attention of a whole new audience. No Depression called the album, \"A raucous, rockin' romp that'll put a big ole grin on your face. Johnson is showcased here at the height of his powers, pounding out licks like a wrecking ball.\" The Wall Street Journal called it, \"a collection of rollicking, loose-limbed songs rooted in the blues and vintage-style rock 'n' roll.\" 2016's On Safari (Plowboy Records), led to the band's first European tour and in turn to the album Live At The Ramblin' Man Fair, their second career live album. \"Truth is,\" says Richard, \"we didn't even know we were being recorded. I found out later the festival folks recorded our whole set. After hearing it, I knew it captured us exactly as we really are, and I knew we had to release it.\" With the new album and another UK/European tour in the works, The Kentucky Headhunters are excited to visit their new friends and fans across the ocean, as well as hitting the highway across the U.S. and Canada. Whether they're turning Southern rock fans on to blues or turning blues fans on to Southern rock, The Kentucky Headhunters are simply thrilled to be enriching the lives of so many music fans for so many years. According to Richard, \"When the four of us get together, it's a powerful thing. It makes people happy. It's really good music.\"", "otherInfo": "No event info available"}, {"Address": "116 W Wisconsin Ave, Milwaukee, WI 53203", "Artist": "Frankie Valli and The Four Seasons ", "ArtistImage": "https://photos.bandsintown.com/thumb/8228526.jpeg", "Coordinates": [43.0389505, -87.9108801], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Pop", "Time": "7:30 PM", "Venue": "Riverside Theatre", "moreBioInfo": "Rock and Roll Hall of Fame inductees Frankie Valli and the Four Seasons have sold over 100 million records worldwide. Frankie Valli a not only a pop music icon, but an actor as well having been featured in the iconic television show, THE SOPRANOS, as Rusty, the capo in the Lupertazzi crime family. Valli’s career was the inspiration for the Broadway juggernaut JERSEY BOYS. In 2014, Valli’s life story will once again be featured. This time in the film adaptation of JERSEY BOYS, directed by Academy Award winning director Clint Eastwood. Valli and his longtime partner, Bob Gaudio are serving as Executive Producers. Valli has also signed on for Rob Reiner’s next romantic comedy, And So It Goes, where he will co-star alongside Michael Douglas and Diane Keaton. In the meantime, Frankie Valli continues to tour throughout the U.S. and abroad to packed houses receiving nightly standing ovations from thrilled fans of multiple generations.", "otherInfo": "Frankie Valli and The Four Seasons"}, {"Address": "200 N Harbor Dr, Milwaukee, WI 53202", "Artist": "Cerfus Project ", "ArtistImage": "https://photos.bandsintown.com/thumb/11017320.jpeg", "Coordinates": [43.0287958, -87.8985381], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Corporate Event", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "8948 W Watertown Plank Rd, Wauwatosa, WI 53226", "Artist": "Ben Harold ", "ArtistImage": "https://photos.bandsintown.com/thumb/11530677.jpeg", "Coordinates": [43.0458737, -88.02489369999999], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "Ben Harold & The Rising (duo) at RMHC (private event)", "moreBioInfo": "No artist bio available", "otherInfo": "Having been influenced by the vibrant energy of bands like Tom Petty & The Heartbreakers; Bruce Springsteen & The E Street band; and Jason Isbell & The 400 Unit--Ben Harold & The Rising creates a unique yet familiar approach to roots-rock music. Their sound and style could fit in any number of eras yet remains modern and unique to the band. The combination of old-soul rock ‘n roll with Dylan-esque story-telling works seamlessly with the personalities that you see on stage—what you see and hear is what you get, and what you get, you will instantly love. This is a quintessential American rock band.\n\nBen Harold & The Rising is a 2020 WAMI nominee."}, {"Address": "906 S Barclay St, Milwaukee, WI 53204", "Artist": "7000apart ", "ArtistImage": "https://photos.bandsintown.com/thumb/11368592.jpeg", "Coordinates": [43.02198550000001, -87.9093934], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Organic Pop", "Time": "7:00 PM", "Venue": "7000apart at The Ivy House", "moreBioInfo": "Through combining powerful vocals with strong songwriting, the Swedish/American Organic Pop duo delivers music on an emotional level. The singer Amelie Eiding & the instrumentalist Jon Kresin have both struggled with mental health issues and now want to help others through their music. After meeting each other Jon’s senior year of high school where Amelie was an exchange student, they were forced into a long-distance relationship 7000 kilometers apart for 3 years. Once they got married, they moved to the U.S. and decided to start pursuing music. In September 2018 they launched a successful crowdfunding campaign to record their debut album in Sweden. They are planning on releasing new music in 2019.", "otherInfo": "7000apart is bringing their beautiful harmonies & lots of energy for a night at The Ivy House! They'll perform some originals & well-known covers from the last few decades, so it's sure to be a great night!\nFor more info on the band check out their socials: https://linktr.ee/7000apart"}, {"Address": "1131 Janesville Ave, Fort Atkinson, WI 53538", "Artist": "Tribute Quartet ", "ArtistImage": "https://photos.bandsintown.com/thumb/11106180.jpeg", "Coordinates": [42.9141777, -88.8483534], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Gospel, Worship Music, Church, Praise Worship, Christian Music, Church Music, Praise Music", "Time": "1:00 PM", "Venue": "Living The Stories Tour", "moreBioInfo": "Since 2006, multi-award winning and multi-Dove Award nominated recording artist Tribute Quartet has become one of the country's most dynamic, beloved and sought after male quartets in all of gospel music. Gary Casto, Josh Singletary, Gus Gaches, and Ian Owens have proven to possess a combination of musical talent, warm and engaging personalities, and a focus that has kept them on the path to continued success since their inception. In an ever-changing musical climate, Tribute has remained steadfast in their goal to make music that is both timely and relevant to the current musical scene and their fan base while propelling their mission to share the Hope of the Gospel. With a career that has already spanned the U.S., as well as several foreign countries, Tribute continues to shine a Light into a world in need of truth, hope, love and healing. With several awards and number 1 songs to their credit, Tribute's music continues to inspire and encourage generations of believers. With their passion for this music and the message it brings, this team is dedicated to a quality presentation of communication through the art of gospel quartet music. Fans, peers, and industry insiders agree Tribute brings a breath of fresh air to Gospel Music.", "otherInfo": "Multi-Dove Award nominated, Tribute, shares an afternoon of inspiration and songs from the latest recording, “Living The Stories.”"}, {"Address": "1131 Janesville Ave, Fort Atkinson, WI 53538", "Artist": "Tribute Quartet ", "ArtistImage": "https://photos.bandsintown.com/thumb/11106180.jpeg", "Coordinates": [42.9141777, -88.8483534], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Gospel, Worship Music, Church, Praise Worship, Christian Music, Church Music, Praise Music", "Time": "7:30 PM", "Venue": "Living The Stories Tour", "moreBioInfo": "Since 2006, multi-award winning and multi-Dove Award nominated recording artist Tribute Quartet has become one of the country's most dynamic, beloved and sought after male quartets in all of gospel music. Gary Casto, Josh Singletary, Gus Gaches, and Ian Owens have proven to possess a combination of musical talent, warm and engaging personalities, and a focus that has kept them on the path to continued success since their inception. In an ever-changing musical climate, Tribute has remained steadfast in their goal to make music that is both timely and relevant to the current musical scene and their fan base while propelling their mission to share the Hope of the Gospel. With a career that has already spanned the U.S., as well as several foreign countries, Tribute continues to shine a Light into a world in need of truth, hope, love and healing. With several awards and number 1 songs to their credit, Tribute's music continues to inspire and encourage generations of believers. With their passion for this music and the message it brings, this team is dedicated to a quality presentation of communication through the art of gospel quartet music. Fans, peers, and industry insiders agree Tribute brings a breath of fresh air to Gospel Music.", "otherInfo": "Multi-Dove Award nominated, Tribute, shares an evening of inspiration and songs from the latest recording, “Living The Stories.”"}]