var minneapolis_events = [{"Address": "8280 Parley Lake Rd, Waconia, MN 55387", "Artist": "Maygen & The Birdwatcher ", "ArtistImage": "https://photos.bandsintown.com/thumb/11456487.jpeg", "Coordinates": [44.8727549, -93.7306764], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana", "Time": "12:00 PM", "Venue": "Waconia Wine Festival", "moreBioInfo": "The two musicians that make up the Minnesota-based folk duo Maygen & The Birdwatcher — Maygen Lacey, an accomplished Midwest CMA-nominated singer/songwriter and Noah Neumann, a guitar virtuoso with a taste for Delta Blues — couldn’t be more different. From upbringing and musical taste to the Minneapolis vs Saint Paul debate, there are few things these two agree on. However, the short list of mutual loves includes: sarcasm, the great outdoors, quality beer, and having a good ‘ol time, the latter of which is immediately apparent upon listening to the pair’s energetic, genre-bending, roots-flavored sound. They've added 3 more cowboys to their band and now like to describe their sound as \"an indie-folk duo colliding with a bluegrass roots backing band while scratching the occasional southern rock itch.\"", "otherInfo": "all five of us on our fav little shack stage in the sun. <3"}, {"Address": "1100 Canterbury Rd, Shakopee, MN 55379", "Artist": "Fabulous Armadillos ", "ArtistImage": "https://photos.bandsintown.com/thumb/6160877.jpeg", "Coordinates": [44.79071949999999, -93.4828186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "R&b, Rock, Country, Hard Rock, Motown, Soul, Rnb-soul, R&b/soul", "Time": "12:00 PM", "Venue": "Canterbury Park", "moreBioInfo": "http://www.fabulousarmadillos.com", "otherInfo": "Full Saturday Lineup Includes: Zac Brown Band, Ashley McBryde, Mitchell Tenpenny, and Fabulous Armadillos Friday Lineup Includes: Carrie Underwood, Brett Young, Blanco Brown, and Ian Munsick Thursday Night Lineup Includes: Lynyrd Skynyrd, Kip Moore, Elvie Shane, and 32 Below 3-Day passes and Camping available. To return to the list of all Twin Cities Summer Jam ticket options please click"}, {"Address": "Saint Croix Falls, WI", "Artist": "David Harland ", "ArtistImage": "https://photos.bandsintown.com/thumb/11368770.jpeg", "Coordinates": [45.4099615, -92.63965089999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "1:00 PM", "Venue": "Private Wedding Event", "moreBioInfo": "No artist bio available", "otherInfo": "Solo Guitar"}, {"Address": "1100 Canterbury Rd, Shakopee, MN 55379", "Artist": "Shane Martin ", "ArtistImage": "https://photos.bandsintown.com/thumb/11147591.jpeg", "Coordinates": [44.79071949999999, -93.4828186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "2:00 PM", "Venue": "TC Summer Jam 2021", "moreBioInfo": "Shane Martin is quickly becoming one of the top draws in the Midwest with a unique blend of modern country rock routinely performing over 200 shows per year as a solo artist and with his full band. From sharing the stage with numerous national acts to captivating audiences at festivals or in a packed venue, Martin's concerts are a high energy good time that gets crowds on their feet dancing, singing along and always leave them wanting more… “Shane is a great singer songwriter on the teetering edge of country, pop, and rock where it's just dangerous enough to be fun,” Nashville EMMY award winning engineer/producer Kenny Royster A Top 5 Finalist in the 2012 Texaco Country Showdown where he competed for “Best New Act in Country Music” at Nashville’s legendary Ryman Auditorium (hosted by LeAnn Rimes), Martin’s live band is a group of talented veteran musicians that has performed at some of the top country music festivals in the country, including WEfest, Countryfest, Moondance Country Jam, Lakes Jam, and Winstock. The group has shared the stage with a wide variety of top artists, inclun'sding Ronnie Dunn, Lee Brice, Ronnie Milsap, Granger Smith, Eric Paslay, Bellamy Brothers, Clay Walker, Tyler Farr, Jerrod Niemann, David Nail, Josh Thompson, Easton Corbin, Sawyer Brown and Black Hawk.", "otherInfo": "TC summer Jam\nCanterbury Park, Shakopee, MN \n1100 Canterbury Rd, Shakopee, MN 55379 \nhttps://tcsummerjam.com/\n\nShane Martin is a premier country rock group from Minneapolis area performing the best in country and a unique blend of classic to modern rock and pop. From sharing the stage with numerous national acts to captivating audiences at festivals or in a packed venue, Shane Martin concerts are a high energy goodtime that gets crowds on their feet dancing, singing along and always leave them wanting more…\nwww.shanemartin.com \nEPK and Live Video:\nhttp://www.shanemartin.com/epk"}, {"Address": "Minneapolis, MN", "Artist": "Stephen Witt ", "ArtistImage": "https://photos.bandsintown.com/thumb/8629494.jpeg", "Coordinates": [44.977753, -93.2650108], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Gospel, Christian, Christian-gospel, Christian/gospel", "Time": "3:00 PM", "Venue": "Wedding (Private Event)", "moreBioInfo": "Singer, Songwriter, Worship Leader.", "otherInfo": "No event info available"}, {"Address": "1100 Canterbury Rd, Shakopee, MN 55379", "Artist": "Ashley McBryde ", "ArtistImage": "https://photos.bandsintown.com/thumb/8488683.jpeg", "Coordinates": [44.79071949999999, -93.4828186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock And Country, Country", "Time": "4:00 PM", "Venue": "Canterbury Park", "moreBioInfo": "Ashley McBryde holds her audience captive with her bourbon-soaked sense of humor and commands the room with her songs. You walk in a stranger and leave feeling like an old friend. Arkansas native Ashley McBryde is following her own mantra of “do what you dream.” Performing and writing have been her only jobs since 2007. A storyteller at heart, Ashley’s music cuts deep and yet offers healing like the rough-cut realness of the work of her mentors Lisa Carver, Carl Jackson and Travis Meadows. She writes songs that feel good. She writes songs that hurt. She’s been known to turn a honkytonk into a church. January 19, 2015, Ashley joined Song Factory as writer and artist. “I am so proud and excited,” she beams. “Everything about this family of creatives is soaked in good juju.” If you’re trying to spot Ashley in a crowd, look for the long dark curls … they’re likely sticking out the back of a ball cap. She’ll be the first to tell you she only wears boots, which suits her just fine. Should you compliment her she’ll quickly give the credit to Dinah, her J45 and say, ” I just like to make noise and have fun.” If you’re looking for an entertainer that can tear your heart out but keep you laughing , you’ve found one. She’s one hell of a good time. Just ask her. Learn more about Ashley McBryde and listen to her music at www.ashleymcbryde.com.", "otherInfo": "Ashley McBryde at Twin Cities Summer Jam in Shakopee, MN\n\nTickets on sale NOW"}, {"Address": "4300 O'Day Ave NE, Saint Michael, MN 55376", "Artist": "Hitchville ", "ArtistImage": "https://photos.bandsintown.com/thumb/11510333.jpeg", "Coordinates": [45.2163964, -93.5958137], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "4:00 PM", "Venue": "BOBfm FEST", "moreBioInfo": "Country super-group Hitchville has quickly solidified themselves among the upper echelon of regional talent. Under the leadership of dynamic lead vocalists Heidi Owens and Matthew Kneefe, the group’s trademark harmonies are hardly the last thing attending “Hitchville Residents” are talking about long after the smoke has cleared and the group has left the stage. The combination of face-melting vocals and “don’t try this at home” instrumental solos leads to an unforgettable live show in which the band has worked tirelessly to produce. They trekked to Nashville to record their self-titled debut release which spawned their first hit single “Whoop It Up”. The song has since become an anthem that proves relevant to not just the summer months, as it garnered major market radio support year round, everywhere from the upper Midwest, to Florida, Texas, and Nashville. The group’s second single “Fly” hit radio soon afterwards, and can still be frequently heard (as well as “Whoop It Up”) in between innings at Minnesota Twins’ home games at Target Field. In their short time together, Hitchville has graced the main stages of some of the region’s largest festivals, including Moondance Jammin’ Country, Country Fest, Country Jam, Ramble Jam, and 4 years straight at the biggest country music and camping festival in the nation, WE Fest. They have been blessed to open those stages for some of the biggest superstars in country…from Carrie Underwood and Rascal Flatts, to Kenny Chesney, Toby Keith, and Luke Bryan, to Big & Rich, Sugarland, Zac Brown Band, and Blake Shelton. The band has even recently returned from their second consecutive headlining concert in the form of a huge beach party for Miller Lite and the NFL’s Minnesota Vikings at the Hard Rock Hotel in Cancun, Mexico. Hard at work in Nashville on their sophomore project, Hitchville is humbled to have that album’s first single, “Even When It’s Bad It’s Good” rocket to #1 on the iHeartRadio “Top 5 in the 5” Countdown just a few short weeks after its release. Over the past few years, fans have come to know to expect the unexpected at a Hitchville show. There’s really only one place where the beer is always cold, the people are always friendly, the music is always world class, and the energy is always palpable…Heidi, Matt, Kris, Jesse Ray, Martial, Marv, and Doug welcome everybody home… Hitchville. Welcome...to Hitchville. Country music's hottest vocal powerhouse! Debut album AVAILABLE NOW on iTunes!!", "otherInfo": "No event info available"}, {"Address": "300 Chestnut Street, Chaska, MN", "Artist": "Becky Rae Dalton ", "ArtistImage": "https://photos.bandsintown.com/thumb/8019278.jpeg", "Coordinates": [44.78690400000001, -93.6002151], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Folk, Alternative", "Time": "5:00 PM", "Venue": "Chaska Days", "moreBioInfo": "Minneapolis singer/songwriter Becky Rae Dalton has gracefully emerged onto the twin cities music scene connecting with audiences through her powerful vocals, catchy lyrics, and authentic performances. After 16 years of writing and performing music, as well as overcoming vocal/health challenges, Becky Rae finishes a three year journey of creating her debut album “Ready or Not”. The alt/folk/country album will be release on September 30th, 2017", "otherInfo": "Saturday, Solo 5-8"}, {"Address": "4300 O Day Ave NE, Saint Michael, MN 55376", "Artist": "Russ Parrish Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11559327.jpeg", "Coordinates": [45.2163964, -93.5958137], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Acoustic Pop, Country, Folk, Acoustic Rock, Pop, Americana, Acoustic, Folk Rock, Indie, Rock", "Time": "5:00 PM", "Venue": "BOBfm Music Fest Ft. Shalo Lee Band/Hitchville/Hell CountryTruckers", "moreBioInfo": "Russ Parrish is an award winning singer-songwriter Nashville native who moved to Minnesota in 2016. Influenced by artists like Ed Sheeran, The Beatles, and Dan + Shay, his lyrics and melodies come together to form powerful songs. Russ has won several awards including the John Lennon Songwriting Contest, the Chris Austin Songwriting Contest, and the Minnesota State Fair Amateur Talent Contest. He has also won Honorable Mention in American Songwriter Magazine’s Lyric Contest & NSAI’s song contest presented by CMT. His music focuses on the journey between faith and doubt. From love to loss, hope to heartbreak, and the unknowns in-between. There’s a place for everyone to join the journey in his songs…", "otherInfo": "Saturday, July 24th Music 5:00pm | Gates-5:00pm | Russ Parrish 5:00pm | Hell Country Truckers | 7:30pm - Hitchville | 9:30pm - 11:00pm - Shalo Lee Band\n\nBrought to you by Summerfield, The St. Michael Cinema and of course BOBFM! This festival will go to 11pm with great music by Shalo Lee Band, Hitchville, The Hell Country Truckers and more! Gates at 5pm Russ Parrish solo acoustic performance at 5pm Hell Country Truckers at 6pm Hitchville at 7:30 Shalo Lee Band at 9:30!"}, {"Address": "1100 Canterbury Rd, Shakopee, MN 55379", "Artist": "Niko Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/11183119.jpeg", "Coordinates": [44.79071949999999, -93.4828186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "5:30 PM", "Venue": "Twin Cities Summer Jam", "moreBioInfo": "“GOOD TIME” deserved permanent ink, since the phrase is more than just an album title. It’s also a way of life for Moon, an adventurous artist, writer and musician with an enduring optimism and a flair for challenging boundaries. That attitude is apparent in the EP, a judiciously layered synthesis of his Georgia roots, pairing Atlanta-bred hip-hop and rural-fed traditional country, two genres that were considered incompatible not that long ago. When an Atlanta booking agent offered him $200 a night, and allowed him to mix his original music in with covers songs, it was a no-brainer. Moon took the gig – loved it – and fortuitously bumped into another Atlanta musician, Zac Brown, who hadn’t yet taken his band to the national level. The two began co-writing, and Moon became a regular collaborator, credited on five #1 Zac Brown Band hits: “Loving You Easy,” “Homegrown,” “Beautiful Drug” and “Keep Me In Mind”. Some of country’s prominent movers and shakers bought into Moon’s artistic story right away. Already signed to Warner/Chappell, he landed a booking deal with the Creative Artists Agency, and secured Luke Combs’ partners, Lynn Oliver-Cline and Chris Kappy, as his managers. Sony Music Nashville – his first choice for a label – signed Moon within a week of an audition in chairman/CEO Randy Goodman’s office.", "otherInfo": "No event info available"}, {"Address": "781 Old Hwy 8 SW, New Brighton, MN 55112", "Artist": "Tommy Bentz Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11006841.jpeg", "Coordinates": [45.0361407, -93.19814459999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Barley John's Brew Pub", "moreBioInfo": "The Tommy Bentz Band is based in Western Wisconsin, and extensively tours regionally in the US and bi-annually to the UK. The Tommy Bentz is a fantastic power trio that has been in existence for over 15 years, jamming in the style of \"the Allman Brothers meets Van Morrison\". Tommy leads the band as the singer/songwriter/guitarist whose professional soloing chops radiate throughout the band's performance. A standout slide player, Tommy has often been touted as one of the best in the Midwest. His seemingly effortless style ranges from strident and thick \"Clapton-esque\" lines and tone to satisfyingly classic rock 'n roll. Tommy grew up enthralled with the guitarists in the Allman Brothers Band and the great British blues rockers — Jeff Beck, Jimmy Page and, especially, Cream-era Eric Clapton. Tommy focuses this power into a tight, focused wall of sound with his amazingly talented trio of musicians. Jason McLean's melodic and groovy bass lines and harmony vocals combine perfectly with Alex Burgess's rock-solid, musical percussion talents and spot-on background vocals. The band combines all of their years of musical performance into a tight, energized, soulful, live musical package like none other you've heard before. Amazing musicians in their own right, the group has 4 original CDs under their belts, as well as a full-length performance DVD, but boasts a list of covers that would make any lover of blues-rock drool in anticipation - from Hendrix, SRV, Cream/Clapton, Stones, Beatles, The Band and so, so many more. The shows include songs Bentz has written and recorded, mainly bluesy rock that spotlights his impeccable work on guitar, an instrument he didn’t take up until his mid-teens. While reading Bentz's lyrics, one gets a snapshot of his ideals - from the strength he derives from family ties to the always present issue of respect in this ever changing world. The audience are then left with the impression of a man who has learned much from where he's been, has processed that knowledge and now presses forward into the unknown with great purpose. If lyrics alone drove Bentz's work, the product would be wonderful, but combined with their technical musical prowess, warm and soulful vocals, southern jam style blues-rock combined with acoustic singer/songwriter flair...the audience is given a magically wide-ranged musical evening that truly is the Tommy Bentz Band experience.", "otherInfo": "No event info available"}, {"Address": "2528 Nicollet Ave S, Minneapolis, MN 55404", "Artist": "David Huckfelt Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11235851.jpeg", "Coordinates": [44.9563234, -93.2780612], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Appalachian, Folk, Delta Blues, Indie Folk, Blues, Rock, Bluegrass, Ambient", "Time": "6:00 PM", "Venue": "Icehouse Patio", "moreBioInfo": "In a career on the road less traveled that has found him sharing stages with a staggering diversity of artists: from Mavis Staples, Emmylou Harris & Greg Brown, to Bon Iver, Arcade Fire & Gregory Alan Isakov, and more recently an impressive array of Native American musicians including John Trudell, Quiltman, Keith Secola, and Annie Humphrey, Huckfelt wanted to build a new musical community for this collection of songs. While his 2018 solo debut record “Stranger Angels” was written in complete isolation at Isle Royale National Park on Lake Superior just a few miles from the Canadian border, “Room Enough, Time Enough” was created in the borderlands of southern Arizona, in the musical mecca of Tucson, the high Sonoran Desert and one of the richest, most biodiverse ecosystems in the world. He asked Tucson producer and multi-instrumentalist Gabriel Sullivan (XIXA) to open up Dust + Stone Studios to a host of friends, contemporaries, strangers, artists, outlaws, cowboys, and Native musicians: Ojibwe ambassador of Native Americana music Keith Secola, Tucson's own living songwriting legend Billy Sedlmayr, Giant Sand founder and head purveyor of the southwestern electric-fuzz border sound Howe Gelb; former Bob Dylan drummer Winston Watson, and Calexico hired guns Connor Gallaher on pedal steel and Jon Villa on trumpet. Together with the unmatched vocal chants of John Trudell's constant collaborator & Warm Springs Nation Native singer Quiltman, these songs found their people and vice versa in a perfect storm of generosity, fierceness and compassion. In thousands of shows across the United States, Canada & overseas, Huckfelt’s grassroots following has grown from small-town opera houses, Midwestern barn concerts, and progressive benefit events to national tours and festival stages like Hardly Strictly Bluegrass, Edmonton and Calgary Folk Fests, and the legendary First Avenue club in his beloved Minneapolis home.", "otherInfo": "David Huckfelt's \"Room Enough, Time Enough\" record release residency @ Icehouse patio - Minneapolis, MN. Outdoors, socially-distanced, reserved tables & limited capacity. Sponsored by 89.3 The Current"}, {"Address": "6801 Flying Cloud Dr, Eden Prairie, MN 55344", "Artist": "Blood Brother ", "ArtistImage": "https://photos.bandsintown.com/thumb/11372020.jpeg", "Coordinates": [44.880285, -93.41174099999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Flying Dutchman Spirits", "moreBioInfo": "No artist bio available", "otherInfo": "Come out and enjoy an exciting set of music by one person band Blood Brother!"}, {"Address": "4022 E 46th St, Minneapolis, MN 55406", "Artist": "Leslie Rich and the Rocket Soul Choir ", "ArtistImage": "https://photos.bandsintown.com/thumb/11021405.jpeg", "Coordinates": [44.91989419999999, -93.21425239999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Singer Songwriter Rock", "Time": "7:00 PM", "Venue": "Leslie Rich & the Rocket Soul Choir @ SolSta Records", "moreBioInfo": "Leslie Rich (vocals, guitar, keyboards) grew up in Northern Ireland, listening to a mix of indie rock, acoustic songwriters and traditional Celtic music. Inspired by artists like Luka Bloom and Throwing Muses, Leslie became the principal songwriter, singer and guitarist for bands such as Emily Ryder, A Little Of The Ready and the Celtic folk band Hounds of Finn, recording on various labels including Immortal Recordings, Time To Be Proud Records, New Folk Records and Loud Folk Records. He founded the Rocket Soul Choir in 1994, mainly as an acoustic response to the heavy, guitar-driven, Irish bands cropping up at that time. Even while Leslie recorded solo albums, played in other projects and relocated to Minneapolis, the Rocket Soul Choir continued in various configurations over the years--always with the mission to create stripped-down rock. The band has released four albums, including the 2016 EP Kidder's Son, which received high praise on both sides of the pond, and their new album The Butcher Boy--the first featuring the current lineup. When not making music, Leslie loves to bake and cook and claims his best songs have come from picking up a guitar while waiting on a cheesecake to come out of the oven. Pete Boulger (drums, percussion, keyboards) joined the band in 2015 and has been a key component of the songwriting process ever since. Originally from Duluth, MN, he draws on wide-ranging influences, including the lush pop of Jellyfish and the glam-rock of bands like T-Rex and NY Dolls. He has been in a multitude of Twin Cities bands such as Church Of Cash, Sawbones, Dander and The Grande Machine. Along with the Rocket Soul Choir, he also performs with Rich Yarges & The Pop Mechanics and Jim Crego and The North Electric. Outside of music, he loves all things cheesy from the 70s and 80s. Pete also loves to cook--everything from award-winning chili to homemade pasta and smoked meats. Atom Robinson (bass, vocals, piano, organ) is a multi-instrumentalist and recording engineer who joined the band in 2018 as the bassist. Born and raised in Wisconsin playing coronet and string bass, he went to college in Illinois, spent some lost years in Iowa and then moved to St. Paul, where he has been ever since, playing electric bass and dabbling in lap steel guitar, electronic music, guitar, accordion, piano and organ. He has recorded, performed, and toured nationally and internationally with roots rock bands, a Prince tribute band, jazz ensembles, pop geniuses, liturgical music ensembles, and a rock and roll choir. As a bandleader, he fronts Doctor Lock, blanc blank, and The Atom Robinson Electric Freak Out Experience. Atom has been called a “freaking delight” by all members of the band. He does not cook. Past members, that have made an indelible mark on the Rocket Soul Choir are: Jason Wahl, Michael Jorgenson, Gary Morrison, Jonny Mitchell, Paul Woods, Emma Rea, John Steel and Rick McCullough.", "otherInfo": "After the pandemic put a hold on our in-person show from last year, we have finally rescheduled an in-person show at SolSta records fabulous new location in St Louis Park. It'll be a fabulous night of vinyl celebration with plenty of RSC originals and some deep vinyl cuts from some of our favorite records!"}, {"Address": "12530 Ulysses St NE, Minneapolis, MN 55434", "Artist": "Benjamin Raye ", "ArtistImage": "https://photos.bandsintown.com/thumb/6805923.jpeg", "Coordinates": [45.19795, -93.2381825], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Pop, Acoustic, Country, Folk", "Time": "7:00 PM", "Venue": "Benjamin Raye & Erica Hanson @The Roadside", "moreBioInfo": "Singer/Songwriter from the Minneapolis-St. Paul, MN area. You can see me play a couple time a week at various venues in the area.", "otherInfo": "This is a duo show"}, {"Address": "3611 Victoria St N, Shoreview, MN 55126", "Artist": "Matt McIntyre - multi-instrumentalist ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0549192, -93.13356379999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Power of 10 at Slice of Shoreview Days", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "Delano, MN", "Artist": "Turn Turn Turn ", "ArtistImage": "https://photos.bandsintown.com/thumb/10281697.jpeg", "Coordinates": [45.0419073, -93.7891331], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Rieder Homestead Concerts", "moreBioInfo": "Simon Recordings is proud to announce the release of Can’t Go Back, the debut album of the new Cosmic American trio Turn Turn Turn. Turn Turn Turn is the story of girl meets boy meets girl--a trio who bonded over their mutual love of close harmony 60s and 70s country, folk and pop music and formed an original Americana band. Members Adam Levy (guitar, vocals), Savannah Smith (guitar, vocals) and Barb Brynstad (bass, vocals) are all mainstays of the Minnesota music scene and together craft an infectious, pop-infused Americana. More about the band. Even though Turn Turn Turn was born as a cover band, the group's original material – sweetheart alt-country folk-pop with a smattering of soulful strut – quickly stole the spotlight. (Imagine if Emmylou Harris recruited The Beatles to form her house band with the Mamas & the Papas on backing vocals, and they asked Sly Stone to sit in for a song or two.) The band recently recorded an album at the state-of-the-art Zoo School Studio in pastoral St. Croix Falls, Wisconsin, engineered by Jason Shannon. The result is 12 masterfully constructed songs that showcase Levy’s adept soul/folk/country guitar playing and the band's supernatural harmonies. When the members of Turn Turn Turn sing together, their voices – each with a distinctive timbre and complementary range – blend in a delectable, cosmic way, forming a rootsy, Laurel Canyon-inspired sound that is both distinctive and familiar.", "otherInfo": "No event info available"}, {"Address": "311 W 84th St, Bloomington, MN 55420", "Artist": "The R Factor ", "ArtistImage": "https://photos.bandsintown.com/thumb/11416059.jpeg", "Coordinates": [44.8508825, -93.2839068], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Variety, Country, Top 40, Dance, Big Band, Pop, Rock", "Time": "7:00 PM", "Venue": "The R Factor Live", "moreBioInfo": "This group of 15 musicians is the last entity to perform as The Rupert's Orchestra of Minneapolis, and although the name has changed, The “R” Factor performs every week at clubs and private events throughout Minneapolis, and is in high demand on the corporate entertainment scene, performing for numerous events throughout the United States. This heavy performance schedule assures our corporate clients a product that is well rehearsed and extremely polished. The R Factor (formerly the Rupert's band) play's Weddings, Corporate Events, Private Events, Birthday’s, Anniversary Party's, ETC..., we would be GREAT!! We have over 500 songs for YOU to pick from (We will email you our song list, Video, and more information)--we will work with your budget--we supply ALL Sound, Lights, Production, Road Crew and Tech Staff--the we also go out as a 6-7-8-9-10+++++) We consist of Bass, Drums, Guitar, Keyboards, Alto Sax, Tenor Sax, Flute, Trumpet, Violin, and 6 Lead Singers Male & Female all in Tuxes and Gowns--our music is Complete Variety especially 40;s, 50's, 60's, 70's & 80's Big Band, Motown, Classic Rock, R&B, Soul, Top 40, Country, Oldies, Swing, Jazz, Standards (Sinatra, Tony Bennett, Streisand, Harry Connick Jr., Dorsey, Count, Lettermen, Elvis, Temptations, 4 Tops, Nat & Natalie Cole, Sammy Davis Jr., Johnny Mathis, Stevie Wonder, Fleetwood Mac., Ella Fitzgerald, Earth, Wind, & Fire, Shania Twain, Chicago, Sheryl Crow, Bobby Darin, Anne Murry, Reba McEntire, Linda Davis, Anita Baker, Linda Ronstadt, Louis Armstrong, Amy Grant, Bonnie Raitt, The Beatles, Glenn Miller, Brian Seltzer, Donna Summer, Neville Brothers, Smokey Robinson, Cab Calloway, Diana Ross, Marvin Gaye, Johnny Gill, Sly, Santana, Dean Martin, Bette Midler, Aretha, Dixie Chicks, The Righteous Brother, & Many, Many, Many, MORE....) we play iPod's during the breaks we take all night & those tunes can be yours or ours played on our system. Your event will be the Party of the Year with everyone Dancing and Singing all night. WE WILL WORK WITH YOUR BUDGET!!!!!!", "otherInfo": "Join us for our 1st performance at the VFW since Covid and remember to bring your dancing shoes"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "The Shackletons ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Under The Canopy - Left Lane Cruiser, The Shackletons, & Little Man"}, {"Address": "20700 Chippendale Ave, Farmington, MN 55024", "Artist": "Tyler Herwig ", "ArtistImage": "https://photos.bandsintown.com/thumb/10456394.jpeg", "Coordinates": [44.6478298, -93.1357262], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Pop, Cover Band, Acoustic", "Time": "7:00 PM", "Venue": "Live at Bourbon Butcher", "moreBioInfo": "There are many ways to describe Tyler Herwig: unique, talented and charismatic. Above all, Tyler Herwig is real. He sings honestly and from the soul combining art, story and song in perfect unison.", "otherInfo": "One voice and six strings in the back of his truck is all it took to launch Tyler Herwig Music into one of Minnesota’s favorite acoustic artists. Tyler has followed his love for music since childhood covering musical styles of all genres. He seamlessly combines high-energy performances with deep, emotional musical interpretations that captivates every audience. You will easily find yourself singing along and having an amazing time."}, {"Address": "525 N 5th St, Minneapolis, MN 55401", "Artist": "Mersiv ", "ArtistImage": "https://photos.bandsintown.com/thumb/9195777.jpeg", "Coordinates": [44.98411309999999, -93.27921750000002], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Fillmore Minneapolis", "moreBioInfo": "Pretty.Dark.Loud For Booking Inquiries: Madison House Inc. Mary Allen & Tynan Conroy mary [at] madison-house.com tynan [at] madison-house.com Website: www.madisonhouseinc.com Management: Tank Email: Tank@7Smgmt.com", "otherInfo": "DOORS: 7PM SHOW: 730PM THIS SHOW IS: 18 AND OVER"}, {"Address": "Harris, MN", "Artist": "The Rough & Tumble ", "ArtistImage": "https://photos.bandsintown.com/thumb/11203899.jpeg", "Coordinates": [45.5860723, -92.9745964], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk, Americana", "Time": "7:00 PM", "Venue": "The Rough & Tumble at Goose Lake Ranch", "moreBioInfo": "The Rough & Tumble are a folk/Americana duo comprised of Mallory Graham and Scott Tyler. Formerly from Nashville, they now live full-time in a 16ft camper with their two dogs playing shows across the US.", "otherInfo": "On Saturday July 24, The Rough & Tumble will be performing at Goose Lake Ranch in Harris, MN. This is an outdoor show at a private residence. You must RSVP to attend. Masks and social distancing will be required.\n\nThe Rough & Tumble are as easy to detect as a stray dog on your doorstep-- and as difficult to send home. The dumpster-folk, thriftstore-Americana duo, consisting of Mallory Graham & Scott Tyler and their menagerie of classic folk and homemade instruments, have been hobbling around the country in their 16ft camper with their two dogs since 2015, taking their songs to the far corners of the US and to the weird little towns they pass along the way. In February 2021 they released We're Only Family If You Say So, an album about what it means to be family, and what it means to lose it. With a single debuting on The Bluegrass Situation and Grateful Web referring to the album as \"a must listen,\" it has been embraced by fans for its stark honesty, unique storytelling and well-crafted melodies, especially at a time when families are deeply divided.\n\nwww.theroughandtumble.com"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Little Man ", "ArtistImage": "https://photos.bandsintown.com/thumb/7578213.jpeg", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Spiritual, Classic Rock, Rock, Garage Rock, Glam Rock, Psychedelic Rock", "Time": "7:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "Late 60's early 70's influenced rock with a modern feel. Spiritual rock, garage rock, neo-psychedelic, retro, classic rock.", "otherInfo": "Under The Canopy - Left Lane Cruiser, The Shackletons, & Little Man"}, {"Address": "4571 Valley Industrial Blvd S #500, Shakopee, MN 55379", "Artist": "Cory Coffman ", "ArtistImage": "https://photos.bandsintown.com/thumb/11206112.jpeg", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie, Folk, Indie Folk, Pop", "Time": "7:00 PM", "Venue": "Badger Hill Brewing", "moreBioInfo": "Cory Coffman is a Duluth, MN songwriter, arranger and multi-instrumentalist. Blending a bohemian-punk ethos with an indie-folk sound, Cory Coffman melds his inviting voice with a musical eclecticism, giving his songs popular appeal. Presenting poetic depth and musical thoughtfulness, Coffman is witty enough to laugh with, yet endearing enough to cry to. In his debut album, Coffman paints his place as an artist worth listening to. Canvas and Color is as much about hopeful new beginnings as it is the nostalgic past. With heartwarming lyrics and subtle satire, Coffman pairs simple chord progressions with sweet melodies that speak to the innocence in us all.", "otherInfo": "No event info available"}, {"Address": "Blaine, MN", "Artist": "Eric Gordon ", "ArtistImage": "https://photos.bandsintown.com/thumb/11357403.jpeg", "Coordinates": [45.1607987, -93.23494889999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Private Event", "moreBioInfo": "Eric Gordon is a singer and songwriter based out of Minneapolis, Minnesota. Although he is no foreigner to the Minnesota music scene, Eric gained recognition as a contestant on the television show, American Idol. Eric released his debut R&B-pop album, Nobody Said That It Was Easy, in spring of 2017. The first single (also the title track), premiered via live performance on the NBC-affiliate, KARE-TV channel in Minneapolis and immediately gained national radio airplay on iHeartMedia stations, including Minneapolis/Saint Paul stations, Cities 97.1 and KDWB 101.3. Organically achieving over half a million plays across all streaming platforms, the success of the single (and album) paved the way for Eric to open for such bands as Color Me Badd, Echosmith, Ocean Park Standoff, and The Revivalists. Since the release of Nobody Said That It Was Easy, Eric has penned a handful of new singles, including 2019's holiday single, Imagination. He is currently writing and working on a follow-up R&B album, scheduled for release in early 2022.", "otherInfo": "No event info available"}, {"Address": "Northfield, MN", "Artist": "Six Mile Grove ", "ArtistImage": "https://photos.bandsintown.com/thumb/8249168.jpeg", "Coordinates": [44.4582983, -93.161604], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Roots & Americana, Folk", "Time": "7:00 PM", "Venue": "Private house concert", "moreBioInfo": "It all started in the small town of Lyle, MN (pop. 500) with a skid loader and a fence post, when Six Mile Grove frontman Brandon Sampson was 7 years old. He injured his hand when helping his dad on the family farm. The physician recommended guitar playing for rehabilitation, and a few weeks later, Sampson came home from the music store with a new guitar. His younger brother Brian threw a fit, and was appeased with a shiny drum set. And so the seeds of Six Mile Grove were planted. The brothers spent years pounding away on their instruments in the kitchen of their great grandmother’s old house, as well as singing in church with their mom, an organist and devoted music lover. Soon Brian’s friend Barry, from across the woods, wanted to join the noise, and so his years of piano lessons began paying off. The boys realized they would need a bass player, put an ad in the paper, and dug up Dezi Wallace from the “big city” of Austin, MN, who arrived courtesy of his mom, as he did not yet have a driver’s license. Fast forward 20 years, and Six Mile Grove has a lot to be proud of. They have weathered the ever changing music scene as a primarily self-managed, self-produced, and self-recorded band. Their music has evolved accordingly, as an organic, honest voice that has not been tinkered with or tainted by the lure of record labels or flashy music producers. You’re sure to find influences of Minnesota music’s founding fathers; from Bob Dylan to the Jayhawks. Six Mile Grove honors it’s roots, but has also managed to forge it’s own sound and space on a stage without compromise. In addition, their friendship, touring and recording with legendary Johnny Cash guitarist Bob Wootton, has lended even more distinctly to their “good all-American boy” sound and style. Six Mile Grove is releasing it’s seventh album this Summer 2017. In this album, Sampson muses on the responsibilities of providing for a family, keeping love alive, and fighting for what’s right in the world. These themes resonate with all the members of the band, as guys with day jobs, wives and kids. You’ll hear the whines and growls in Nelson’s piano and lead guitar licks; the take-it-easy pace of Wallace’s bass, the newly added color of John Wheeler’s steel guitar and the simple to furious tempos in Brian Sampson’s drums. As Wootton states, “There’s nothing fancy about them and they don’t try to be something they’re not. And that’s what I like about them.”", "otherInfo": "No event info available"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Rachel Holder ", "ArtistImage": "https://photos.bandsintown.com/thumb/8390724.jpeg", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "7:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "Curb Recording Artist Rachel Holder Check back very soon for updates early 2018. Have a blessed Christmas and Holiday Season! I look forward to releasing new music and getting back out on the road! God Bless XOXO Planted my feet in Nashville soil & Country Music runs through my veins.", "otherInfo": "Newly-opened, fully-tented outdoor venue with choice lake-views, full dinner and cocktail service (same menu as indoors)."}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Left Lane Cruiser ", "ArtistImage": "https://photos.bandsintown.com/thumb/9393093.jpeg", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues", "Time": "7:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Under The Canopy - Left Lane Cruiser, The Shackletons, & Little Man"}, {"Address": "Red Wing, MN", "Artist": "Chastity Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/8162135.jpeg", "Coordinates": [44.5660691, -92.5369563], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Soul", "Time": "7:00 PM", "Venue": "Anderson Center 25th Anniversary Party", "moreBioInfo": "Based in Minnesota, but with roots in Tennessee, Chastity grew up surrounded by country and soul music. In the full gospel church of her childhood, she played saxophone and drums and found her singing voice and a passion for music. Her first show was in Knoxville, TN, and then it was on to Minneapolis. Since then, she’s been featured on NPR’s “Favorite Sessions,” CMT, American Songwriter, the London Times, Paste Magazine and others. Chastity has toured the U.S. and abroad, appearing on the U.K.’s Later…with Jools Holland. For much of 2016, she toured alongside folk icon/activist Ani Difranco. “What I’ve realized is that the personal is political,” Brown said in a recent interview. “Just by me being a bi-racial, half-black, half-white woman living in America right now is political. Just being a person of color, a queer woman of color, for that matter, is freaking political. My focus, as far as this record, I guess it’s really been psychological. I’m really intrigued by the perseverance of the human spirit and the complexities and contradictions that we embody as human beings.\" \"Silhouette of Sirens is comprised of snapshots of memory, both lived and imagined. Not all of these tunes derive from this, which is why I say, ‘both lived and imagined.' Some are love/sex/relationship-inspired, which in my opinion make the pain one might experience more bearable. In James Baldwin’s essay, ‘The Artist Struggle for Integrity,' he says, 'I tell you my pain so that I might relieve you of yours.'\" Light is a central character on Silhouette of Sirens. Even the title speaks to this push and pull between danger and safety, shadows and shiny lights, and the things we can reach out and touch as opposed to the things we only hear in the distance. “What is even happening? One can only guess,” Brown sings in the opening track “Drive Slow,” embracing an uncertainty and sense of wonder from the beginning of the record. By the third track, she’s carrying us along with her on a journey inward. Like many masterful songwriters, she has the ability to make her stories feel intensely personal yet open-ended; even in “Carried Away,” it’s hard to tell whether she’s singing about a romantic rift, an abusive friendship, or the havoc that anxiety and depression can wreak on an unguarded mind. \" “Don’t leave me here all alone / For so long you’ve been my light in the dark,” Brown sings on the album’s centerpiece, “My Stone,” while the sexy, Prince-channeling acoustic funk jam “Whisper” beckons the listener to come closer, to dance with her in the dark, to “whisper in my ear all that you need.\" “I think it’s about different types of heartbreak, and how one deals with it,” Brown says of the album. “And not the heartbreak of a coupled relationship; just living life, and the experiences that break your heart. There are these moments on the album where it’s like, ‘this is intense.' And then hopefully, there are moments where it’s alleviated — as I feel like life is. Life is hard. Every tree, every plant, everything you see in the natural world, just through a growth process, you see how hard it is to grow and bend towards the light.\"", "otherInfo": "No event info available"}, {"Address": "21050 135th Ave N, Rogers, MN 55374", "Artist": "Maiden Dixie ", "ArtistImage": "https://photos.bandsintown.com/thumb/11533449.jpeg", "Coordinates": [45.2005839, -93.5472041], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country Rock, Country And Rock, Blues, Rock, Country", "Time": "7:30 PM", "Venue": "Short Or Tall Music Fest", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Tom Hunter ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "No artist bio available", "otherInfo": "Newly remodeled classic nightclub featuring raised ceilings, luxury booths, tiered seating, and state-of-the-art sound and lights."}, {"Address": "1237 WI-35, Hudson, WI 54016", "Artist": "Tim Sigler ", "ArtistImage": "https://photos.bandsintown.com/thumb/11517304.jpeg", "Coordinates": [45.0426043, -92.7575306], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "8:30 PM", "Venue": "ERIC CHURCH TRIBUTE ***TENT PARTY*** @ Big Guys Hudson (ALL CHURCHED UP)", "moreBioInfo": "With roughly 200 shows per year, Tim Sigler is bound to have a show coming up in your area sometime soon...Whether it's George Strait, Garth Brooks, Johnny Cash, or Keith Urban, etc—The Tim Sigler Band plays all of your favorite country songs! We hope you'll take a look at our schedule and come check out a show!", "otherInfo": "Sat, July 24th: Eric Church fans, it's tent party time! \"All Churched Up\" featuring the Tim Sigler Band w/ special guest Ali Gray...30+ of your favorite Eric Church songs all in one night! Discount tickets & VIP table reservations on sale now."}, {"Address": "318 N 1st Ave, Minneapolis, MN 55401", "Artist": "Your Smith ", "ArtistImage": "https://photos.bandsintown.com/thumb/9190870.jpeg", "Coordinates": [44.9818534, -93.2724269], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Fine Line Music Cafe", "moreBioInfo": "30/f/LA", "otherInfo": "Your Smith"}, {"Address": "16722 198th Ave, Big Lake, MN 55309", "Artist": "Jonah And The Whales ", "ArtistImage": "https://photos.bandsintown.com/thumb/9054325.jpeg", "Coordinates": [45.3316933, -93.6933175], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "The Kind You Can Dance To, Rock", "Time": "9:00 PM", "Venue": "Jonah & The Whales return to The Buff!", "moreBioInfo": "Jonah and the Whales, a Twin Cities music staple, manage to both maintain a loyal following, and continually gain new friends. Jonah and the Whales are constantly changing with the crowd, the times, and the people who love to follow them. Just a quick glance at the responses on the band's web page says it all, “I have watched Jonah and the Whales for years. and never been disappointed with the show...a lot has changed...but the quality hasn't.” Jonah and the Whales guarantees to bring the party each and every performance with non-stop rock, techno, pop, top-40 and classic hits. With more music than they can possibly play in a night, they will custom tailor their repertoire for each and every show! This band takes audience participation to a new level. You haven’t lived until you’ve experienced the Jonah and The Whales cowbell choir! With costumes, spot on impersonations, visual effects, and a concert quality sound and light show, you won't know what hit you when you see Jonah and the Whales! Don't make the mistake of thinking that you might see the same show if you saw the band last year or even last month, Jonah and the Whales are constantly updating their repertoire and putting on performances that just won't quit! Whether you are a Jonah virgin, an old friend, or someone who hasn't been to a show in a while, come see Jonah and the Whales! They are sure to be playing close to you soon and will definitely knock your socks off. Be prepared to drink plenty of water or something a little stronger and don't forget to breathe because the Whales are unstoppable!", "otherInfo": "No event info available"}, {"Address": "1100 Canterbury Rd, Shakopee, MN 55379", "Artist": "Zac Brown Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11266608.jpeg", "Coordinates": [44.79071949999999, -93.4828186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Twin Cities Summer Jam", "moreBioInfo": "Three-time GRAMMY-winning multi-platinum artists Zac Brown Band have had five consecutive albums reach the top 10 of the Billboard 200 and four consecutive albums debut at #1 on Billboard’s Country Albums chart. To date, the group has sold more than 25 million singles and eight million albums. They have achieved 15 #1 radio singles and are the second act to top both the Country and Active Rock formats. They have developed a reputation with critics and fans alike for a live show marked by strong musicianship that defies genre boundaries. The band’s latest album, ‘WELCOME HOME,’ a return to their classic sound, was produced by GRAMMY-winning producer Dave Cobb and In the Arena Productions. Rolling Stone praised the album’s “southern storytelling, rootsy instrumentation and the sonic swell of eight bandmates who, once again, are firing on the same cylinder.” The No. 1 triumph of ‘WELCOME HOME’ follows three platinum-selling albums (‘Uncaged,’ ‘You Get What You Give,’ and ‘JEKYLL + HYDE’), the 5x-platinum ‘The Foundation,’ and their 2013 project, ‘The Grohl Sessions Vol. 1.’", "otherInfo": "No event info available"}, {"Address": "302 2nd St, Hudson, WI 54016", "Artist": "Audio Circus ", "ArtistImage": "https://photos.bandsintown.com/thumb/11299230.jpeg", "Coordinates": [44.9730897, -92.756523], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Rock., Dance, Pop", "Time": "9:00 PM", "Venue": "Audio Circus @ Ziggy's Hudson", "moreBioInfo": "Ladies and gentlemen, step right up! HEAR mind numbing mash ups and medleys! SEE death defying booty shaking! FEEL your troubles disappear!", "otherInfo": "The circus is back in town!"}, {"Address": "35 Oak Ave S, Annandale, MN 55302", "Artist": "West Highway ", "ArtistImage": "https://photos.bandsintown.com/thumb/11160586.jpeg", "Coordinates": [45.2623985, -94.12409410000001], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "West Highway at Rendezvous!", "moreBioInfo": "We are a five piece country/classic rock cover band featuring male and female vocals, acoustic & electric guitar, bass & drums.", "otherInfo": "Come join us for our first show at Rendezvous! We KNOW you know how to party Annandale, so let's have some fun!"}, {"Address": "1601 University Ave W, St Paul, MN 55104", "Artist": "Halloween, Alaska ", "ArtistImage": "https://photos.bandsintown.com/thumb/119524.jpeg", "Coordinates": [44.9560052, -93.1679649], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Turf Club", "moreBioInfo": "Halloween, Alaska is a Minnesota-based band consisting of James Diers (voice, guitar), Ev (keyboards, voice, programming), Matt Friesen (electric bass guitar), and David King (acoustic and electronic drums). All of the group's members live in the Twin Cities, except for Diers who resides in Madison, Wisconsin. The group first formed in 2002, and work on a self-titled debut soon began to be recorded. Completed in 2003, two tracks from the disc were featured in the Fox television series The O.C.: \"Des Moines\" in season one, and \"All the Arms Around You\" in season two. The track \"State Trooper\" is a cover version of the song by Bruce Springsteen. A second disc entitled Too Tall to Hide was released in 2005. Members of the group are or have been part of the bands The Bad Plus, Love-Cars, Happy Apple, 12 Rods, and The Few Nice Words. \"Halloween, Alaska\" is not the name of a city or town that actually exists in Alaska.", "otherInfo": "Halloween, Alaska"}, {"Address": "1601 University Ave W, St Paul, MN 55104", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [44.9560052, -93.1679649], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "9:00 PM", "Venue": "Halloween, Alaska at Turf Club", "moreBioInfo": "Official Page of drummer Dave King. (no messages, please)", "otherInfo": "James Diers - voice/guitar/keys\nJake Hanson - guitar/voice\nDave King - acoustic & electronic drums/keys\nBill Shaw - bass/voice"}, {"Address": "5912 County Rd 6 SW, Howard Lake, MN 55349", "Artist": "Mitch Gordon & the Unleaded Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9156180.jpeg", "Coordinates": [45.0661941, -94.0728547], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country And Original Material", "Time": "9:00 PM", "Venue": "Wright County Fair 9:00p", "moreBioInfo": "Growing up in a musical family, Mitch's taste for country music was high on his mind. From Singing tunes \"Little Bitty\" and \"Hey Good Looking\" when he was a lad, 'til today where he has performed with some great musicians and friends along the way. With touring over 14 states over the past 11 years, writing music, and learning every day from everyone around him he wouldn't trade it for anything. Mitch has had some of the best influences including his father (whom still plays today) and brother that got him all started with this crazy life. Mitch feeds off of many artists for inspiration such as the greats of Waylon and Merle to bands as the Turnpike Troubadours, Alan Jackson, Aaron Watson and more. Mitch currently has released two studio albums (Top Shelf & All In), one single (One Go Around) and his recent single titled \"The River\". Gordon says, \"I love writing and creating songs from my couch, porch and the studio, it is a love / hate process ha ha ha\" Mitch is the one that makes sporadic decisions and will try just about anything to make the wheels turn in the right direction. \"I hope to see you out on the road\"! -MG", "otherInfo": "No event info available"}, {"Address": "711 Hennepin Ave 4th floor, Minneapolis, MN 55403", "Artist": "Mize ", "ArtistImage": "https://photos.bandsintown.com/thumb/11275272.jpeg", "Coordinates": [44.977381, -93.274895], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Downtempo, Dubstep, Electronic", "Time": "9:00 PM", "Venue": "The Loft, Skyway Theatre", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "240 S Knowles Ave, New Richmond, WI 54017", "Artist": "Varsity Rejects ", "ArtistImage": "https://photos.bandsintown.com/thumb/11015321.jpeg", "Coordinates": [45.1208775, -92.5372301], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Variety, Pop Punk, Cover Band", "Time": "9:30 PM", "Venue": "Varsity Rejects - Live at The Wild Badger", "moreBioInfo": "Twin Cities Party Rock Cover Band, playing the best danceable party rock hits from bands like Motley Crue, Gun 'N Roses, Blink 182, Good Charlotte, Led Zeppelin, Poison, Bowling For Soup, Maroon 5, Nickleback, All American Rejects, Van Halen, ACDC, Bruno Mars, Fallout Boy and many more!", "otherInfo": "🤘🎵 ROCKIN' DANCE PARTY 🎵🤘\nVarsity Rejects brings its one-of-a-kind party-rock show to The Wild Badger in New Richmond, WI\nFeaturing danceable rock music from your favorite artists from the 80's to today! If you like bands like Motley Crue, Poison, Blink 182, Good Charlotte, Bowling for Soup, Guns 'N Roses, AC/DC, and Fallout Boy, you will love our setlist of great danceable rock songs!"}, {"Address": "Island Lake Park, Shoreview, MN 55126", "Artist": "Barley Jacks ", "ArtistImage": "https://photos.bandsintown.com/thumb/10205977.jpeg", "Coordinates": [45.053181, -93.13254099999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Americana, Acoustic, Folk, Bluegrass", "Time": "12:00 PM", "Venue": "Slice of Shoreview Days", "moreBioInfo": "“Synergy is the interaction of forces so that their combined effect is greater than the sum of their individual parts.” – an apt description for the Barley Jacks. Brian’s mastery of the fiddle and mandolin is perfectly complemented by the virtuosity of Mike Cramer on guitar, Keith Yanes on bass, and Joel Arpin on percussion. The first thing an audience notices is the way these amazing musicians interact on stage. Each player listens and responds to the others. Brian responds to a musical idea of Mikes’s that is in turn elaborated on by Keith. Brian replies and so on until the music becomes something new and alive. Audience members get caught up in the action not unlike spectators watching top tennis players play an extended volley at Wimbledon. These guys really play and they really play. Native Minnesotan Brian Wicklund has been an integral part of the acoustic music scene for decades. As a teenager, he won dozens of fiddle contests. He has toured nationally and internationally with bands Stoney Lonesome, Judith Edelman Band, Kathy Kallick Band, Lorie Line’s Pop Chamber Orchestra, Chris Stuart Band, and currently with Brother Mule. He has been busy as a studio musician and producer laying down fiddle and mandolin tracks on over a hundred projects including two CD projects of his own. Brian also wrote best-selling books, American Fiddle Method published by Mel Bay. He is in constant demand as a teacher worldwide. Mike Cramer brings 20 years of eclectic guitar virtuosity to the band. Keith is as comfortable in a symphony as he is in a jazz combo or a bluegrass band. Joel constantly seeks grooves to propel the band in new directions. Together, they truly are synergy.", "otherInfo": "No event info available"}, {"Address": "8280 Parley Lake Rd, Waconia, MN 55387", "Artist": "Russell & Skippin Stones ", "ArtistImage": "https://photos.bandsintown.com/thumb/11257093.jpeg", "Coordinates": [44.8727549, -93.7306764], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Trio Parley Lake Winery MN", "moreBioInfo": "RussellsMusic.com - SkippinStones.net - Soloist, Duet, Trio, Full Band Russell is a well Traveled musician, entertaining audiences for years with a blend of music that includes Original tunes, Folk Rock, Acoustic Rock, Americana, Jazz, Contemporary hits and Mainstream pop/rock/indie rock. Throughout his career, he has performed, recorded and worked with a variety of amazingly talented musicians and artists. His recording titles include “Simple Song”, ”Jacobs Well”, “Rise Up” and “Dreamland”. “Music is gratifying to me as an artist and performer and it’s exciting to see the audience connect to their favorite tunes in such a positive way\". In addition to working as a solo-artist, Russell also performs with Skippin Stones as a Duet, Trio or full band. \"Forever grateful, my music roots were nourished by my family, parents support as well as 13 siblings, the larger family and freinds. Their dynamic variety, taste and passion for music were and are a defining influence in my writing and performing”. Russell is also a songwriter and may include his original material in performances when requested. He has a comfortable stage presence, warm personality that leaves a lasting impression with his audiences.", "otherInfo": "No event info available"}, {"Address": "221 5th St E, Saint Paul, MN 55101", "Artist": "Ken Valdez ", "ArtistImage": "https://photos.bandsintown.com/thumb/11425728.jpeg", "Coordinates": [44.9493556, -93.08803610000001], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Rock, Blues Rock, Hard Rock, Latin Rock, Blues, Funk Rock, Funk", "Time": "12:30 PM", "Venue": "Mears Park", "moreBioInfo": "Ken Valdez fuses elements of blues, rock, funk and Latin music to create a sound all his own. His latest release “Soul Renegade” was met with critical acclaim and featured appearances/collaborations with a few well known special guests ranging from guitar phenoms like Eric Gales and Doyle Bramhall II to members of Fleetwood Mac and even Prince's rhythm section. It also caught the attention of the legendary Billy Gibbons who asked Ken to open his recent solo tour and then go on the road with the iconic ZZ Top. Currently, like the majority of his peers, Valdez took some time off from touring due to the global pandemic. While sheltering in place he finished a new record which should be released in the very near future. This world class guitarist/singer/songwriter/producer brings something fresh to the musical landscape with his unique melodiic, rhythmic sounds. Whether he is playing with his full band or performing solo/acoustic, you will find his music is moving, heartfelt and genuine with no denying that he can burn like a wildfire and shake your very soul! The time is coming for new Ken Valdez music and for live events to make their return! Get ready!", "otherInfo": "Family friendly early afternoon show in the heart of St Paul, MN!"}, {"Address": "900 Payne Ave, Saint Paul, MN 55130", "Artist": "Jonathan Foster Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11142435.jpeg", "Coordinates": [44.9683357, -93.07331169999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Americana Singer-songwriter", "Time": "1:00 PM", "Venue": "Jonathan Foster live at Caydence Records & Coffee", "moreBioInfo": "Forging his own American dream, songwriter Jonathan Foster brings a roots blend of Folk-Americana music as a recording and performing artist. He is known for his soulful vocals, acoustic guitar and harmonica, passionate delivery, and off the beaten path introspective lyrics. In June 2021, he is due to release his 5th independent studio album, The Dark & the Light, the follow up from his 2019, release of his latest album Wildlife (Miracle Mile Records/After Hours Recorders) featuring Bruce Turgon (Foreigner, Lou Gramm, Black Sheep) on bass guitar, Morgan Hannaford (Honeybee, Across The Grain, Muletown) on pedal steel guitar and dobro, and National Fiddle Hall of Fame inductee Scott Joss (Kris Kristofferson, Merle Haggard, Dwight Yoakam). Wildlife includes the ear worm songs Louise, California Golden, and a rollicking cover of Bob Dylan's Girl from the North Country. Foster has spent much of his life travelling, songwriting, and touring small venues across the U.S. with his roots born in the rural Adirondack Mountains of New York to the second half of his life in Northern California. In his music and songwriting you'll hear 'll hear traces of his upbringing, love of the outdoors, his songwriting heroes, geographic meanderings, and the character's he's met in between.", "otherInfo": "On tour, Americana roots songwriter Jonathan Foster performs solo-acoustic at Caydence Records & Coffee in St. Paul, Minnesota! -www.JonathanFosterMusic.com"}, {"Address": "18919 Lake George Blvd, Oak Grove, MN 55303", "Artist": "Matt Schatza Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/8870918.jpeg", "Coordinates": [45.3129725, -93.3467], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "R&b, Funk, Rock, Blues", "Time": "1:00 PM", "Venue": "MS3 @ SRO", "moreBioInfo": "The Matt Schatza Trio is powerhouse variety band that guides you through a far reaching tour of musical landscapes with every performance. The signature sound of this dynamic three-piece can be envisioned as a scalding crucible, frothing with elements of Blues, Funk, Hip Hop, Reggae, Rock, Folk, Country, and Jazz, all of which make themselves known throughout their performance of original material, as well as their innovative take on popular renditions. Each of the three members of this all-star cast are heavily rooted in the Minneapolis music scene and have performed throughout the midwest states, bringing their act to venues, breweries, bars, festivals, corporate events and have recently landed a spot as the house band for the QCTV show, \"An Evening with Jimmy Good.\"", "otherInfo": "No event info available"}, {"Address": "9950 N Shore Rd, Waconia, MN 55387", "Artist": "Rob Meany & Terramara ", "ArtistImage": "https://photos.bandsintown.com/thumb/11269659.jpeg", "Coordinates": [44.8882067, -93.77831409999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alternative Jazz-pop-rock", "Time": "1:00 PM", "Venue": "Rob Meany Live At Sundays At Sovereign", "moreBioInfo": "Rob Meany & Terramara create jazz-infused rock, with a sound akin to Steely Dan meets Ben Folds. Founded in 1998 by singer-songwriter-keyboardist Rob Meany, the band has released three records of original songs over the last 20 years, garnering a loyal following among jazz-rock lovers worldwide. According to music critic Chris Riemenschneider of the Star Tribune, ”the sophomore album, Four Blocks To Hennepin, is a piano- and horn-driven effort full of tight, poppy harmonies and instrumental jams that could light an incense stick.” The band has been a featured performer at Taste of Minnesota, Minneapolis Parks Summer Concert Series, and Rochester’s Riverside Concert Series. Rob has also won several awards for his songwriting from the World Billboard Music Contest and the Independent Music Awards. Rob emerged as a solo artist in 2016 with the release of his first album, Ferris Wheels Unbound, “a shimmering collection that might be recommended to fans of Marshall Crenshaw, XTC and chamber pop.”— Jay Gabler, 89.3 The Current.", "otherInfo": "Solo performance by Rob Meany on outdoor patio stage."}, {"Address": "731 County Rd 30 SE, Delano, MN 55328", "Artist": "Tyler Herwig ", "ArtistImage": "https://photos.bandsintown.com/thumb/11285594.jpeg", "Coordinates": [45.032832, -93.8729688], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, Cover Band, Acoustic", "Time": "2:00 PM", "Venue": "Tyler Herwig LIVE at Fountain Hill Winery", "moreBioInfo": "There are many ways to describe Tyler Herwig: unique, talented and charismatic. Above all, Tyler Herwig is real. He sings honestly and from the soul combining art, story and song in perfect unison.", "otherInfo": "One voice and six strings in the back of his truck is all it took to launch Tyler Herwig Music into one of Minnesota’s favorite acoustic artists. Tyler’s love for music drives him in writing original songs and covering musical styles of all genres. He seamlessly combines high-energy performances with deep, emotional musical interpretations that captivates every audience."}, {"Address": "3395 Coon Rapids Blvd NW, Coon Rapids, MN 55433", "Artist": "7000apart ", "ArtistImage": "https://photos.bandsintown.com/thumb/11129617.jpeg", "Coordinates": [45.178523, -93.3533688], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Organic Pop", "Time": "3:00 PM", "Venue": "7000apart at Boulevard Bar & Grille - Coon Rapids", "moreBioInfo": "Through combining powerful vocals with strong songwriting, the Swedish/American Organic Pop duo delivers music on an emotional level. The singer Amelie Eiding & the instrumentalist Jon Kresin have both struggled with mental health issues and now want to help others through their music. After meeting each other Jon’s senior year of high school where Amelie was an exchange student, they were forced into a long-distance relationship 7000 kilometers apart for 3 years. Once they got married, they moved to the U.S. and decided to start pursuing music. In September 2018 they launched a successful crowdfunding campaign to record their debut album in Sweden. They are planning on releasing new music in 2019.", "otherInfo": "Boulevard Bar & Grille is an excellent neighborhood hangout to meet your friends and family for dinner and drinks! Join us every Sunday for LIVE MUSIC on the Patio!\nMore about the music:\n2019 has all the makings to put 7000apart firmly on the musical map as performers of quality, honest, and straight from the heart music.” -Belter Radio United Kingdom\n“We Are More” - together. The up-and-coming Swedish/American duo, 7000apart, is stepping into a high note of their music career by releasing their debut album, “We Are More”, shining a hopeful light on relationships and overcoming struggles.\nThe story began for this husband-wife duo with Amelie leaving Sweden to attend a U.S.A high school as an exchange student, where she met Jon and they fell in love. As Amelie’s exchange year ended, 7000apart was created as a way of keeping their relationship strong while being 7000 kilometers apart. After three years of long distance, they were reunited and got married. By then, their music project had grown from having something in common to a passionate career pursuit.\n“Organic pop” is the best way to label the genre of the album, with powerful vocals and inspirational songwriting. “We Are More” was recorded in the heart of Sweden and contains 10 songs that bring the listener on a journey of love, hope and overcoming struggles.\nListen to 7000apart's new single \"Nothing to Worry About\" here: https://www.7000apart.com/ntwa"}, {"Address": "20168 St Croix Trail N, Scandia, MN 55073", "Artist": "Briana Fernandez Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11397512.jpeg", "Coordinates": [45.2375879, -92.76982129999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, Christian Alternative, Soul, Country, Jazz, Classic Rock", "Time": "3:00 PM", "Venue": "Riverside Unplugged at Rustic Roots", "moreBioInfo": "Briana Fernandez Music is a singer and songwriter based in St. Paul, Minnesota and has been performing ever since she was 7 years old and singing since she was 2. Over the past five years, Briana has gained experience in touring, recording, and performing throughout the Midwest. She toured with two of her university’s bands, Worship Live and One Accord (with whom she recorded an EP, Mountains Fall), and is currently performing all over Minnesota with the band Riverside All-Stars. Briana is on a regular schedule singing the National Anthem for the University of Minnesota’s many sports teams. She has sung the National Anthem twice at the new US Bank Vikings Stadium.", "otherInfo": "No event info available"}, {"Address": "3395 Coon Rapids Blvd NW, Coon Rapids, MN 55433", "Artist": "Jim Stapley ", "ArtistImage": "https://photos.bandsintown.com/thumb/9097245.jpeg", "Coordinates": [45.178523, -93.3533688], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues, Soul, Acoustic, Americana", "Time": "3:00 PM", "Venue": "Boulevard Bar & Grille - Coon Rapids", "moreBioInfo": "ABOUT Jim Stapley has the kind of voice that comes along once in a generation; a powerful brew of blues and soul, laced with sublime falsetto. Described as “gritty, pretty, and profound” by Classic Rock Magazine, his songs of love, hope, and political disenfranchisement are stories for the everyman. Having worked with music industry legends including Kenney Jones (Faces/Small Faces/The Who), Ronnie Wood (Faces/Rolling Stones), Danny O’Donoghue (The Script), Tony Visconti (producer: David Bowie, T.Rex, Morrissey) and Eddie Kramer (producer: Jimi Hendrix, Led Zeppelin, Rolling Stones), Jim Stapley is a lauded performer who delivers equal parts raw energy and mature vulnerability. Jim cuts through the noise, leaving his listeners feeling empowered, restored, and ready for the tribulations of another day.", "otherInfo": "Solo Show"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Prudence Johnson ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "No artist bio available", "otherInfo": "Newly-opened, fully-tented outdoor venue with choice lake-views, full dinner and cocktail service (same menu as indoors)."}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Joe Savage ", "ArtistImage": "https://photos.bandsintown.com/thumb/9656091.jpeg", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classic Blues, Acoustic, Country Gospel, Country Blues, Country Boogie, Country, Old School", "Time": "4:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "Hosting a songwriter night every Sunday in Fort Worth, TX off West 7th street at Landmark Bar & Kitchen 9-midnight buy digital music: joesavage.bandcamp.com", "otherInfo": "Newly-opened, fully-tented outdoor venue with choice lake-views, full dinner and cocktail service (same menu as indoors)."}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Dan Chouinard ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "No artist bio available", "otherInfo": "Newly-opened, fully-tented outdoor venue with choice lake-views, full dinner and cocktail service (same menu as indoors)."}, {"Address": "13753 Ibis St NW, Andover, MN 55304", "Artist": "Hitchville ", "ArtistImage": "https://photos.bandsintown.com/thumb/11510344.jpeg", "Coordinates": [45.21978499999999, -93.309305], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country", "Time": "4:00 PM", "Venue": "Private Event", "moreBioInfo": "Country super-group Hitchville has quickly solidified themselves among the upper echelon of regional talent. Under the leadership of dynamic lead vocalists Heidi Owens and Matthew Kneefe, the group’s trademark harmonies are hardly the last thing attending “Hitchville Residents” are talking about long after the smoke has cleared and the group has left the stage. The combination of face-melting vocals and “don’t try this at home” instrumental solos leads to an unforgettable live show in which the band has worked tirelessly to produce. They trekked to Nashville to record their self-titled debut release which spawned their first hit single “Whoop It Up”. The song has since become an anthem that proves relevant to not just the summer months, as it garnered major market radio support year round, everywhere from the upper Midwest, to Florida, Texas, and Nashville. The group’s second single “Fly” hit radio soon afterwards, and can still be frequently heard (as well as “Whoop It Up”) in between innings at Minnesota Twins’ home games at Target Field. In their short time together, Hitchville has graced the main stages of some of the region’s largest festivals, including Moondance Jammin’ Country, Country Fest, Country Jam, Ramble Jam, and 4 years straight at the biggest country music and camping festival in the nation, WE Fest. They have been blessed to open those stages for some of the biggest superstars in country…from Carrie Underwood and Rascal Flatts, to Kenny Chesney, Toby Keith, and Luke Bryan, to Big & Rich, Sugarland, Zac Brown Band, and Blake Shelton. The band has even recently returned from their second consecutive headlining concert in the form of a huge beach party for Miller Lite and the NFL’s Minnesota Vikings at the Hard Rock Hotel in Cancun, Mexico. Hard at work in Nashville on their sophomore project, Hitchville is humbled to have that album’s first single, “Even When It’s Bad It’s Good” rocket to #1 on the iHeartRadio “Top 5 in the 5” Countdown just a few short weeks after its release. Over the past few years, fans have come to know to expect the unexpected at a Hitchville show. There’s really only one place where the beer is always cold, the people are always friendly, the music is always world class, and the energy is always palpable…Heidi, Matt, Kris, Jesse Ray, Martial, Marv, and Doug welcome everybody home… Hitchville. Welcome...to Hitchville. Country music's hottest vocal powerhouse! Debut album AVAILABLE NOW on iTunes!!", "otherInfo": "No event info available"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Peter Johnson ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "No artist bio available", "otherInfo": "Newly-opened, fully-tented outdoor venue with choice lake-views, full dinner and cocktail service (same menu as indoors)."}, {"Address": "422 E Mulberry St, Stillwater, MN 55082", "Artist": "The Jorgensens ", "ArtistImage": "https://photos.bandsintown.com/thumb/9125490.jpeg", "Coordinates": [45.0593248, -92.80537179999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Soul, Americana, Rock, Blues, Acoustic", "Time": "4:30 PM", "Venue": "P D Pappy's", "moreBioInfo": "The two troubadours teamed up to record Brianna’s debut album “Wandering” with Kurt acting as producer and arranger for Brianna’s multi-instrumentalist talents. It did not take long for the pair to team up as songwriters and performers to form as a team in life on and off stage The sound is powerful and undeniably fresh, taking root in rock, blues and some southern kissed Americana soul. Kurt Jorgensen has been long time band leader of the Kurt Jorgensen Band, releasing eight albums to date and receiving the praise of fans and critics alike. The Minnesota Music Awards has presented Kurt with singer of the year, entertainer of the year, songwriter of the year album of the year and song of the year. Brianna has toured nationwide with other artists as a bandleader and solo. Brianna has performed multiple times at South by Southwest, impressing industry luminaries and fans. After releasing their debut album \"Love Wins\" Kurt and Brianna successfully toured the country, The Jorgensens are preparing to release the 2nd album “The Lexington Stretch’ in September 2019", "otherInfo": "FULL BAND SHOW"}, {"Address": "Shakopee, MN", "Artist": "Mike Nash & Southern Drawl Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9781675.jpeg", "Coordinates": [44.7973962, -93.5272861], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Southern Rock, Country Americana, Texas Country Music, Tropical, Country & Southern Rock, Texas Country", "Time": "5:00 PM", "Venue": "Gunderson's Island House Concert", "moreBioInfo": "Southern Rockin' Country with a twist of lime, a splash of saltwater and distilled in the backwoods of Tennessee.\" Mike Nash has been touring the U.S. from coast to coast since the band's humble beginnings in 2012.\"Tirelessly building our grass roots fan base from the ground up is the key to our success\" says Mike, frontman and guitarist for the band. \"We have been honored to have won several awards for Band of the Year as well as Entertainer of the Year beacuse of the support of our incredible fans who will regularly drive hundreds of miles for our shows and who have spread our message like wild fire\". During their rise, Mike Nash and his band has graced the stages of many of the world's most popular artists. From legends such as Lynyrd Skynrd, Charlie Daniels Band and Jimmy Buffett (in Key West)- to classic country artists like Aaron Tippin, Neil McMcoy, and Pure Prarie League-and including modern day stars such as Brantley Gilbert, Blackberry Smoke, Eli Young Band and Justin Moore. Other notables include David Allen Coe, Eddie Money, Rory Feek and The Romantics. One of Nash's most exciting achievements came in 2012 when the University of Tennessee debuted the video for the Mike's rocked up, barn burning version of \"Rockytop\" on the jumbo-tron at Neyland Stadium to a sold out crowd of over 102,000. The song went on to smash radio charts and is one of the most popular versions in America being played on NBC's Sunday Night Football for millions of viewers in celebration of Peyton Manning's record breaking touchdown pass in October of 2014.", "otherInfo": "Gunderson House Concert\n$20 at the door\nBYOB and bring a chair\nDoors open at 4pm\nShow 5pm\nPlease RSVP to: steveng73@hotmail.com"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Richard Kriehn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8280307.jpeg", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Americana", "Time": "5:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "Minnesota-based multi-instrumentalist Richard Kriehn played with the “Guys All-Star Shoe Band” and the “House Band” on A Prairie Home Companion from June of 2010 until the host, Garrison Keillor retired in July of 2016. Richard has performed in symphony orchestras, bluegrass bands, baroque ensembles, pit orchestras, cover bands, country bands…but his new project, \"New Shoes\" takes the cake! He, and some fellow \"prairie homies\" put together a great quartet! They play everything: Bach, Bluegrass, Beatles and Beyond! Way before Prairie Home, Richard lived in Nashville. While in Nashville, he toured with Travis Tritt, Aaron Tippin and Michael Peterson, all the while, playing in the Nashville Mandolin Ensemble and the bluegrass group 1946. He appeared numerous times on the Grand Ole’ Opry and made appearances on The Rosie O’Donnell Show, Prime Time Country as well an episode of Walker, Texas Ranger. Before he and his family moved to the Twin Cities, they lived in Eastern Washington where he was a faculty member in the School of Music, Washington State University.", "otherInfo": "Are you lonesome tonight? Got heartaches by the number?"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Fiddle Heirs ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "‘Boogie on Fiddle Funday’ with Armchair Boogie, Johnson Brothers, Fiddle Heirs & guest Bettina V"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Johnson Brothers ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "‘Boogie on Fiddle Funday’ with Armchair Boogie, Johnson Brothers, Fiddle Heirs & guest Bettina V"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Ferguson ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Punk, Emo", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Bluegrass Blowout ‘Fiddle Funday’ with Armchair Boogie, Ferguson, Carbone, & Peck Trio, Johnson Brothers and guests Bettina V & Ryan Young"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Ryan Young ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "‘Boogie on Fiddle Funday’ with Armchair Boogie, Johnson Brothers, Fiddle Heirs & guest Bettina V"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "CARBONE ", "ArtistImage": "https://photos.bandsintown.com/thumb/6023107.jpeg", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "House, Electronica, Techno, Electronic", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "Tunca Oskay Tığlı (a.k.a Cärbone) was born and raised in Istanbul at the age of 25-years-old Cärbone has many years of DJ and Producing experience in electronic music for almost 7 years. He started playing piano and drum in his early days and has been into various musical instruments from a young age. Cärbone’s musical interest is heavily concentrated in Proper and Deep Techno. 2015 was the start of Cärbone professional career in music where he started playing in private parties, festivals and various events in Istanbul. Cärbone’s previous project called \"O-SKY\" started his DJ hit carrier in the early months of 2010. DJ'ed around 5 years at the famous electronic night clubs in Istanbul (TR) and Indianapolis (USA). During this period, he took forward his works of DJ sets to make a deal with Beatgate Records and begun to play his music as a resident DJ in Karantina renound club in Cesme. He has come to London due to popular demand and progress his Pointblank experience. The Cärbone project was born in London and cultivated in the cult underground culture in 2015. Shared decks with Sam Paganini, Oliver Huntemann, Boris Brejcha, Redshape, ANNA, Kobosil, SHADED, Alex Niggemann, Kaiserdisco, Alex Stein, Dubspeeka, Mørbeck, Murat Uncuoglu, Mark Knight, Ryan Crosson, Nick Curly, Traumer and more. Cärbone’s music is a mixture of Deep, Hypnotic, Melodic and Minimal sounds, Aggressive and Dark Techno simply because he is killing and breaking all barriers in his music. Soon to be released will be his 2EP's in the end of 2017. For booking/remix requests contact with: carbonemusic@gmail.com T : +90 (541) 541 93 91", "otherInfo": "Bluegrass Blowout ‘Fiddle Funday’ with Armchair Boogie, Ferguson, Carbone, & Peck Trio, Johnson Brothers and guests Bettina V & Ryan Young"}, {"Address": "3010 Minnehaha Ave, Minneapolis, MN 55406", "Artist": "Armchair Boogie ", "ArtistImage": "https://photos.bandsintown.com/thumb/8981447.jpeg", "Coordinates": [44.9478853, -93.23447739999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "The Hook and Ladder Theater & Lounge", "moreBioInfo": "Armchair Boogie's high-energy take on the Jamgrass genre fuses intricate arrangements of acoustic guitar and banjo with the funky back beats of electric bass and drums. From Madison, Wisconsin, the band tours nationally, puts on barn burner shows, and continues to climb festival lineups. Augie Dougherty (banjo, vocals) and Ben Majeska (guitar, vocals) started playing together in the fall of 2014 while attending the University of Wisconsin- Stevens Point. Within a year, their musical collaborations led to the formation of Armchair Boogie. Eager to expand their sound for a bigger stage, Augie and Ben recruited bassist Eli Frieders and drummer Dan Waterman to fill out the band's four-piece configuration. Armchair Boogie solidified their current line-up in the spring of 2017 when Denzel Connor took over for a departing Dan on drums. In conjunction with the release of their debut self-titled album, the band moved to Madison, WI- a jumping off point from where Armchair Boogie has become a regular on the upper Midwest festival circuit while also sowing roots in the Rocky Mountains. New album out October 2019!", "otherInfo": "‘Boogie on Fiddle Funday’ with Armchair Boogie, Johnson Brothers, Fiddle Heirs & guest Bettina V"}, {"Address": "8335 Crystal View Rd, Eden Prairie, MN 55344", "Artist": "Darren Jackson ", "ArtistImage": "https://photos.bandsintown.com/thumb/11091316.jpeg", "Coordinates": [44.8536714, -93.4327199], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classic Rock, Folk Rock, Indie Rock, Classic Country", "Time": "6:00 PM", "Venue": "Fat Pants Brewing Co.", "moreBioInfo": "In addition to being the creative force behind the Minneapolis-based band, Kid Dakota, Darren Jackson also frequently performs solo acoustic shows that feature a carefully curated selection of covers, including classic country (i.e., Hank Williams, Johnny Cash, Merle Haggard, George Strait, etc.), classic rock (Bob Dylan, The Rolling Stones, The Eagles, Credence Clearwater Revival, etc.), 80’s college rock (R.E.M., The Replacements, Violent Femmes, The Cure, etc.), and indie rock (Wilco, The Shins, Nirvana, Uncle Tupelo, etc.).", "otherInfo": "No event info available"}, {"Address": "6161 Hwy 65 NE, Minneapolis, MN 55432", "Artist": "Benny Weinbeck ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [45.0792034, -93.2430078], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Crooners Lounge and Supper Club", "moreBioInfo": "No artist bio available", "otherInfo": "Newly remodeled classic nightclub featuring raised ceilings, luxury booths, tiered seating, and state-of-the-art sound and lights."}, {"Address": "3770 Bellaire Ave, White Bear Lake, MN 55110", "Artist": "Jason Gray ", "ArtistImage": "https://photos.bandsintown.com/thumb/11051680.jpeg", "Coordinates": [45.05525480000001, -92.99347680000001], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, Folk", "Time": "6:00 PM", "Venue": "Order Disorder Reorder Show", "moreBioInfo": "New album \"Order\" available everywhere you listen to music.", "otherInfo": "Live, Safely-distanced indoor Solo Acoustic Concert with Singer/Songwriter Jason Gray in Support of the Epilepsy Foundation of Minnesota. \n\nSave the Date! Stay tuned for Ticket Info. \n\n Contact booking@jasongraymusic.com for more details."}, {"Address": "3022 Hennepin Ave, Minneapolis, MN 55403", "Artist": "Hunny Bear ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [44.9475781, -93.2986499], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Granada Theater", "moreBioInfo": "No artist bio available", "otherInfo": "Join us for a night of local jazz and amazing dining as we welcome back HUNNY BEAR with THE RED HOT DJANGO PEPPERS"}, {"Address": "2400 Mystic Lake Blvd, Prior Lake, MN 55372", "Artist": "The Jorgensens ", "ArtistImage": "https://photos.bandsintown.com/thumb/9125490.jpeg", "Coordinates": [44.7330233, -93.4752761], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Soul, Americana, Rock, Blues, Acoustic", "Time": "6:30 PM", "Venue": "Mystic Lake Casino Hotel", "moreBioInfo": "The two troubadours teamed up to record Brianna’s debut album “Wandering” with Kurt acting as producer and arranger for Brianna’s multi-instrumentalist talents. It did not take long for the pair to team up as songwriters and performers to form as a team in life on and off stage The sound is powerful and undeniably fresh, taking root in rock, blues and some southern kissed Americana soul. Kurt Jorgensen has been long time band leader of the Kurt Jorgensen Band, releasing eight albums to date and receiving the praise of fans and critics alike. The Minnesota Music Awards has presented Kurt with singer of the year, entertainer of the year, songwriter of the year album of the year and song of the year. Brianna has toured nationwide with other artists as a bandleader and solo. Brianna has performed multiple times at South by Southwest, impressing industry luminaries and fans. After releasing their debut album \"Love Wins\" Kurt and Brianna successfully toured the country, The Jorgensens are preparing to release the 2nd album “The Lexington Stretch’ in September 2019", "otherInfo": "FULL BAND SHOW"}, {"Address": " , Minneapolis, MN 55403", "Artist": "Jack Klatt ", "ArtistImage": "https://photos.bandsintown.com/thumb/11516448.jpeg", "Coordinates": [44.9691279, -93.2878982], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Country, Americana, Blues", "Time": "7:00 PM", "Venue": "7th Street Entry", "moreBioInfo": "Musical missionary, tireless troubadour and producer Jack Klatt isn’t one to be easily categorized or relegated to a narrow niche. he comes across as a young man with a wizened and worldly perspective, an artist who possesses a timeless sensibility of both place and purpose. Yet, his artistic integrity extends to more than simply his songs. It embodies both execution and intent.. the way he’s mastered his deft finger-picking technique and used that sturdy approach to bring his material an authenticity reminiscent of the most revered musicians and storytellers. His upcoming album It Ain’t The Same (due September 27 on Yep Roc Records) reflects that reverential attitude, but adds a depth and devotion that ensures its contemporary credence. With Klatt himself singing, playing guitar and sitting in the producer’s chair, it boasts the talents of a skilled set of session players -- John James Tourville (The Deslondes) on electric guitar and pedal steel, Casey McDonough (NRBQ) on bass skills, and Alex Hall (JD McPherson, The Cactus Blossoms, Robbie Fulks) on drums, percussion, keys and engineering. It Ain’t The Same is, as its title suggests, something truly special.", "otherInfo": "No event info available"}, {"Address": " , Minneapolis, MN 55403", "Artist": "Faith Boblett ", "ArtistImage": "https://photos.bandsintown.com/thumb/11547000.jpeg", "Coordinates": [44.9691279, -93.2878982], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Jack Klatt and Buffalo Nichols with Faith Boblett", "moreBioInfo": "Faith Boblett is a Minneapolis singer-songwriter with roots in northern Minnesota. She began writing her own music at the age of thirteen, shortly after teaching herself to play the guitar. Though Faith was raised in a musical household, she has been persistent in finding her own voice through songwriting and performing. Her goal? Timeless songs. Faith’s music falls somewhere in the realm of pop, Americana, rock, and alt-country. She pulls inspiration from songwriters like Sheryl Crow, Brandi Carlile, and Tom Petty. Faith Boblett was named one of 2018’s Best New Bands by First Avenue. In 2013, Faith released her debut album, Oil & Water, produced by Brent Sigmeth. In 2014, Faith released Tell ME, an EP produced by Knol Tate. In November of 2018, she released her second full-length album, Enough, produced by Knol Tate & Faith Boblett. Faith's third LP, take care, was released in October 2020. In addition to writing and performing her own music, Faith Boblett is also a part of the larger Minneapolis music scene. She has performed as a part of the annual XTC: Senses Working Overtime tribute, as well as other tribute shows for Tom Petty, Dolly Parton, and Shania Twain. Faith has also provided backup vocals for other local bands like Fathom Lane, Deleter, American Housewife, Blue Green, XIII Arrows, Nick Costa, and The Crash Bandits.", "otherInfo": "No event info available"}, {"Address": "3022 Hennepin Ave, Minneapolis, MN 55403", "Artist": "MG Bailey ", "ArtistImage": "https://photos.bandsintown.com/thumb/11054305.jpeg", "Coordinates": [44.9475781, -93.2986499], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Soul, Punk, Americana, Roots, Rock", "Time": "7:00 PM", "Venue": "MG Bailey plays Granada Theater", "moreBioInfo": "MG Bailey is a one man Rock n' Roll band that brings energy, honesty, and a few laughs to every show. Influences range from 90's rock of all kinds to classic sounds like country and reggae. I have been recording/releasing original music and performing them as-well as covers all around the Chicago land area and surrounding states for the last decade. Currently working on my 7th record and preparing for whatever 2021 might bring.", "otherInfo": "MG Bailey brings his one man show to the Granada Theater.\n\nStarting as a one man band 10 years ago, MG has performed weekly in the Chicago land area and surrounding states. Performing at venues ranging from backyard parties to Chicago classics like Metro. MG brings a full sound and unique approach that can catch an audience off guard in the best way. Lots of laughs and crowd interaction that have kept the drinks flowing and the toes tapping.\n\nhttps://mgbailey7.bandcamp.com/"}, {"Address": "701 North 1st Avenue, Minneapolis, MN 55403", "Artist": "Buffalo Nichols ", "ArtistImage": "https://photos.bandsintown.com/thumb/9979978.jpeg", "Coordinates": [44.97855089999999, -93.2759781], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Blues-rock, Blues Revival, Blues, Folk", "Time": "7:30 PM", "Venue": "7th St Entry", "moreBioInfo": "No artist bio available", "otherInfo": "Buffalo Nichols"}, {"Address": "1710 Crossings Blvd, Shakopee, MN 55379", "Artist": "Tyler Herwig ", "ArtistImage": "https://photos.bandsintown.com/thumb/11286203.jpeg", "Coordinates": [44.7738746, -93.4101622], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Pop, Cover Band, Acoustic", "Time": "4:00 PM", "Venue": "Tyler Herwig Live at McCoy's Copper Pint", "moreBioInfo": "There are many ways to describe Tyler Herwig: unique, talented and charismatic. Above all, Tyler Herwig is real. He sings honestly and from the soul combining art, story and song in perfect unison.", "otherInfo": "One voice and six strings in the back of his truck is all it took to launch Tyler Herwig Music into one of Minnesota’s favorite acoustic artists. Tyler’s love for music drives him in writing original songs and covering musical styles of all genres. He seamlessly combines high-energy performances with deep, emotional musical interpretations that captivates every audience."}, {"Address": "360 N Broadway St, Saint Paul, MN 55101", "Artist": "Benjamin Raye ", "ArtistImage": "https://photos.bandsintown.com/thumb/6805923.jpeg", "Coordinates": [44.9511535, -93.08387839999999], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Rock, Pop, Acoustic, Country, Folk", "Time": "5:30 PM", "Venue": "Benjamin Raye - St. Paul Saints pregame show", "moreBioInfo": "Singer/Songwriter from the Minneapolis-St. Paul, MN area. You can see me play a couple time a week at various venues in the area.", "otherInfo": "This is a solo show.\nI am playing the St. Paul Saints pregame show at CHS Field, just outside the main gate!"}, {"Address": "Forest Lake, MN", "Artist": "The Jorgensens ", "ArtistImage": "https://photos.bandsintown.com/thumb/9125490.jpeg", "Coordinates": [45.2788561, -92.9852183], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Soul, Americana, Rock, Blues, Acoustic", "Time": "6:30 PM", "Venue": "Arts In The Park", "moreBioInfo": "The two troubadours teamed up to record Brianna’s debut album “Wandering” with Kurt acting as producer and arranger for Brianna’s multi-instrumentalist talents. It did not take long for the pair to team up as songwriters and performers to form as a team in life on and off stage The sound is powerful and undeniably fresh, taking root in rock, blues and some southern kissed Americana soul. Kurt Jorgensen has been long time band leader of the Kurt Jorgensen Band, releasing eight albums to date and receiving the praise of fans and critics alike. The Minnesota Music Awards has presented Kurt with singer of the year, entertainer of the year, songwriter of the year album of the year and song of the year. Brianna has toured nationwide with other artists as a bandleader and solo. Brianna has performed multiple times at South by Southwest, impressing industry luminaries and fans. After releasing their debut album \"Love Wins\" Kurt and Brianna successfully toured the country, The Jorgensens are preparing to release the 2nd album “The Lexington Stretch’ in September 2019", "otherInfo": "Acoustic duo"}, {"Address": "318 N 1st Ave, Minneapolis, MN 55401", "Artist": "Black Pistol Fire ", "ArtistImage": "https://photos.bandsintown.com/thumb/11329185.jpeg", "Coordinates": [44.9818534, -93.2724269], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Garage Rock, Blues, Rock", "Time": "8:00 PM", "Venue": "Fine Line Music Cafe", "moreBioInfo": "BLACK PISTOL FIRE “Sleep on these guys at your own risk, because what they did to BMI on Friday afternoon was unholy… leaving a trail of scorched earth and melted minds.” - Consequence of Sound, Lollapalooza 2015 Black Pistol Fire is a high-octane rock duo based out of Austin, Texas by way of Toronto, Canada; composed of Kevin McKeown on guitar/lead vocals and Eric Owen on drums. Drawing inspiration from blues, R&B and rock greats such as Led Zeppelin, Chuck Berry, Nirvana, Buddy Holly and Muddy Waters, BPF’s gritty and dynamic performances are fueled by undeniable musicianship. Dubbed the “next big thing” by Huffington post after SXSW 2013, BPF has developed a reputation for their untamed live performances. Described as “Pure fire on stage”(Degenrefy), they are quickly becoming festival veterans, including performances at Lollapalooza, Austin City Limits, Bonnaroo, Sasquatch Music Festival, Shaky Knees and Governor's Ball, among others. After Lollapalooza 2015, Yahoo Music described Black Pistol Fire as “a power duo that can almost match the power and intensity of the massive rock sounds of the likes of Led Zeppelin and Fleetwood Mac… in a breakout set.” Black Pistol Fire has shared the stage with acts like Gary Clark Jr, Weezer, Heart, Wolfmother, Black Rebel Motorcycle Club and Band of Skulls. Their signature sound has been featured throughout television and entertainment. Their single, “Show Pony” was featured in the Ted 2 official trailer and they performed their song “Blue Eye Commotion” in a national T-Mobile TV ad. Their music can also be heard in Madden ‘15 and Tony Hawk Pro Skater 5 video games and in numerous TV shows including Sons of Anarchy, Castle and About a Boy. \"Black Pistol Fire… were, by far, the best band that played LouFest… This was the craziest I've seen any of the crowds at the festival… Drummer Eric Owen, shirtless and wrists wrapped, pounded the skins like he was summoning a devil. McKeown stomps so hard during his rough and intricate dirty blues, you thought he would make a hole in the stage... A must see.\" - KDHX (St Louis), Loufest 2014 New album, \"Don't Wake the Riot\" out May 20th! Pre-order now on iTunes and recieve our new single \"Bad Blood\" instantly!", "otherInfo": "Black Pistol Fire"}, {"Address": "711 NE 15th Ave, Minneapolis, MN 55413", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [45.0033373, -93.2519346], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Jazz", "Time": "8:30 PM", "Venue": "Dave King Trucking Trio & King Broder at Indeed Brewery", "moreBioInfo": "Official Page of drummer Dave King. (no messages, please)", "otherInfo": "Dave King Trucking Trio:\nDave King, drums\nErik Fratzke, guitar\nBrandon Wozniak, saxophone\n\nKing Broder:\nDave King, drums\nAndrew Broder, turntables and electronics"}]