var neworleans_events = [{"Address": "3001 Tchoupitoulas St, New Orleans, LA 70115", "Artist": "Eric Johanson ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.9200434, -90.0812105], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "NOLA Brewing Tap Room", "moreBioInfo": "No artist bio available", "otherInfo": "Solo acoustic set in Nola Brewing Barrell Room. Free show."}, {"Address": "7400 Lakeshore Dr, New Orleans, LA 70124", "Artist": "Big Al and the Heavyweights ", "ArtistImage": "https://photos.bandsintown.com/thumb/11232175.jpeg", "Coordinates": [30.0238145, -90.1136406], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues, Rockabilly, Spicy Cajun Boogie & Louisiana Blues", "Time": "5:00 PM", "Venue": "Felix's Restaurant & Oyster Bar", "moreBioInfo": "http://bigal.net From Cajun to Zydeco, Blues to Rock, and everything in between, Big Al & the Heavyweights offer a musical gumbo sure to please all! Formed in 1996 as the Unknown Blues Band , with founding members Big Al Lauro, Warren Haynes ( Allman Bros, Gov't Mule), and Rick Gergen ( Sweethearts of the Rodeo), the band has been featured at festivals and venues throughout the US since. The latest CD \"World Full of Trouble\" (Ellersoul Records) is the band's 7th CD release, and includes several guest artists, such as famed Muddy Waters guitarist Bob Margolin, and New Orleans guitarist, John Lisi from Delta Funk. Big Al and the Heavyweights also welcome back former Heavyweight and harmonica virtuoso, Jason Ricci. \"World Full of Trouble\" was recorded at famed Suite Mix Studios in Slidell, LA noted for Funky Meters guitarist Brian Stoltz's numerous recording projects. The Cd charted at # 10 on the Living Blues Charts and was frequently played on XMs Bluesville. Big Al and the Heavyweights' live performances are family oriented, energetic and most of all fun.", "otherInfo": "Come out to the Lakeshore Location for some great New Orleans Seafood, and Big Al and the Heavyweights!"}, {"Address": "100 Marina Del Ray Dr, Madisonville, LA 70447", "Artist": "Casey Saba ", "ArtistImage": "https://photos.bandsintown.com/thumb/11216637.jpeg", "Coordinates": [30.4000547, -90.15340289999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Experimental, Rock, 60s, Classic Rock, 70s, Hard Rock, Fusion, 80s, 90s, Folk, Eclectic, Early Country, Metal, Alternative", "Time": "6:00 PM", "Venue": "The Blind Tiger Marina Cantina", "moreBioInfo": "www.CaseySaba.com", "otherInfo": "Music from 6pm-9pm! Free Show! Beautiful Scenery! Right there on the water!"}, {"Address": "500 River Highland Blvd Suite 100, Covington, LA 70433", "Artist": "Hannah Belle ", "ArtistImage": "https://photos.bandsintown.com/thumb/10083978.jpeg", "Coordinates": [30.4591553, -90.0848127], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country Blues, Country", "Time": "6:00 PM", "Venue": "Hannah Belle @ Etouffee ", "moreBioInfo": "“Music has always been at the heart of my family,” says Hannah when asked how it all started. “From a family gospel band, to singing along with Faith Hill and Shania Twain, then jamming out to Creedence Clearwater Revival, music was a part of everything we did.” Hannah grew up in rural Mississippi in a place called Red Lick. “There wasn’t too much to do around there. Town was 30 miles away… so on a normal day you could find me working outside with the animals or singing my heart out with a karaoke machine in my bedroom.” Hannah’s family has always been musical. On her dad’s side, music ran deep tracing her family heritage all the way back to Jerry Lee Lewis and Mickey Gilley. And even her dad himself fronted his own band back in the 60’s playing lead guitar and singing everything from country to rock and roll. “I always joke and say that music runs in my DNA, but the older I get, I truly believe it. It’s not really a choice, it is a part of me.” Hannah began her career singing in church. With her dad being a Baptist preacher, she always had the opportunity to get on a stage and perform… and that’s exactly what she did. “We had a family band, and my part was to play my red tambourine and sing my heart out,” she laughed, “and I loved every minute of it. I knew that I was meant to be a performer.” Her performing continued as she grew up. Throughout high school you could find her singing at any event at school, performing at local town festivals and participating in talent contests, and even singing the National Anthem for the Dixie National Rodeo in Jackson, MS. But Hannah always knew there was more inside of her than just singing other artist’s music. “I knew there was more to this.. I loved singing all of the classics from Patsy Cline to Loretta Lynn. My favorites to cover were Shania Twain, the Dixie Chicks, Faith Hill, and Patty Loveless, but I wanted to sing my songs.” Even though she didn’t have any songs at that point! In 2007, she graduated from high school and headed to college. That’s where her songwriting journey began. “I wrote my first song sitting in a piano practice room at Mississippi College. I had been wanting to write for a long time, but nothing would ever come.” After many prayers and almost giving up, she sat down to the piano and the words flowed. “I was so excited! I had tried for so long, and finally it happened. It lit a fire under me and ignited a passion I always knew was there.” From there, Hannah continued to write and inevitably recorded her first original album titled “Chasing Thunder” produced by Ernie Rowell and recorded at Fun House Studios in Nashville, TN. “It felt so good to put my words out there, and the title “Chasing Thunder” was so fitting because it summed up what I was trying to do… chase a dream of being successful in the music business which is so hard to accomplish, something that might not ever happen.” But success did happen for Hannah! With two more original albums under her belt, “Preacher’s Daughter” and “Catch Her if You Can,” Hannah was chosen as a Country Music Association Emerging Artist from 2013-2017 where she was honored with her very own booth in the Music City Center to meet and greet with fans from all over the world at the CMA Fan Fair X during CMA Fest. On top of that, she was honored with a nomination for “Songwriter of the Year” at the 2017 Nashville Universe Awards. “I still can’t believe it sometimes! I’m just a country girl from Red Lick, MS and people are taking notice of my songs, my music… That’s been my dream for as long as I can remember.” She had also polished her skills as a performer, performing at fairs and festivals in Mississippi and the Southeast Region while sharing the stage with big named artists such as Sawyer Brown, Frankie Ballard, Diamond Rio, Bucky Covington, T Graham Brown, Jo’el Sonnier, Shenandoah, Joe Diffie, and Josh Thompson, just to name a few. And she was able to make another one of her childhood dreams come true by filming several music videos that had much success with one claiming a top 5 spot in the Independent Country Music Association awards and her others being picked up by Great American Country, CMT, and The Country Network. It seemed that everything was falling into place for Hannah and her career, but then tragedy struck her family. “We were at CMA Fest in June, and I was doing my usual meet and greet with the fans… that’s when I noticed my dad wasn’t himself.” Having already recovered from major heart surgery months before, Hannah’s dad, Paul, was diagnosed with cancer. “Everything just kind of stopped. He was the driving force behind my success in the industry, and when he got sick, it all came to a screeching halt.” Hannah’s focus turned solely to the wellbeing of her father leaving music by the wayside. After over a year of fighting the terrible disease, the family heard the news that they were longing for…”Your dad is cancer free.” “Thankful didn’t even begin to describe the way I felt. Our family had witnessed a true miracle through the healing of my dad.” After overcoming so much, Paul encouraged Hannah to get back in the saddle and continue on her musical journey. She had never stopped writing and had even challenged herself to write more during the times of struggle and heartache. “I felt that writing was a way of releasing what I was feeling. It was a way for me to cope, and I really think some of my best writing came during that time.” That’s when they decided to head back into the studio to make her fourth album. With new original music and a reignited passion, Hannah is ready to take on whatever comes next. “I feel like it’s a new beginning for me. I don’t know what’s next or where I am going from here… All I know is music is my heart, songwriting is my passion, performing in front of crowd is when I am the happiest, and I am meant to be a part of the country music family.”", "otherInfo": "No event info available"}, {"Address": "3501 Jourdan Rd, New Orleans, LA 70126", "Artist": "Grayson Capps ", "ArtistImage": "https://photos.bandsintown.com/thumb/8753153.jpeg", "Coordinates": [30.0023569, -90.0190646], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Rock, Soul, Blues", "Time": "6:00 PM", "Venue": "Faubourg Beer ", "moreBioInfo": "With ‘Scarlett Roses,’ Grayson Capps first solo release in six years, the acclaimed Alabama songwriter showcases the kind of understated brilliance that can blossom when creativity is detached from expectation, when songs are truly given the space and time to find their writer. Capps wrote the album slowly and steadily. Recorded over two whirlwind sessions with his partner, the Grammy Award-winning engineer/producer, Trina Shoemaker. The collection tackles the heavy burdens of growing older: separation from loved ones, the weight of fatherhood, the mortality of our parents, self-medication. As serious as it may sound, Capps manages to write with an eye towards beauty and humor, extracting hard-won catharsis and even genuine joy from pain and loss. Hailed by NPR for his “unbridled energy and authenticity,” Capps first emerged as a solo artist in 2005. His debut record, ‘If You Knew My Mind,’ earned rave reviews. American Songwriter declared, “Take the poetry of Texas troubadour Townes Van Zandt, combine with Steve Earle’s edgy attitude and stir with a little cup of the bayou-blues (think Howlin’ Wolf) and you start to get a taste of Capps’s scrumptious gothic gumbo.” He has since gone onto release five similarly exalted albums that have earned him devoted followings in both the US and Europe.", "otherInfo": "Grayson Capps and Corky Hughes at Faubourg Beer - Saturday 7/24 6-7:30pm - New Orleans, LA"}, {"Address": "618 Frenchmen St, New Orleans, LA 70116", "Artist": "Honey Island Swamp Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8229481.jpeg", "Coordinates": [29.9639455, -90.0580186], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Bayou Americana, Roots Rock, Rock", "Time": "7:00 PM", "Venue": "DBA", "moreBioInfo": "Great music begins with great songs, and great songs are what the Honey Island Swamp Band is all about. The band came together when Aaron Wilkinson (acoustic guitar, mandolin, vocals) and Chris Mulé (electric guitar, vocals) were marooned in San Francisco after the levee breaches following Hurricane Katrina devastated New Orleans. After a chance encounter with fellow New Orleans evacuees Sam Price (bass, vocals) and Garland Paul (drums, vocals), and with no prospects of getting home any time soon, they figured they’d better cook up something new, and quick! A few days later they had put together a song list, landed a weekly gig at San Francisco’s Boom Boom Room, and settled in to share a little taste of Southern culture with their new West coast neighbors. Their 7-song eponymous debut was recorded in 2006 at famed Record Plant studios in Sausalito, CA, and was received so well that the band decided to make the new group priority number one upon moving back to New Orleans in early 2008. Honey Island Swamp Band's music has been described as \"Bayou Americana\", with timeless songs from Wilkinson & Mulé, highlighted by Mulé's searing guitar, Wilkinson's sure-handed mandolin, and 4-part vocal harmonies, all anchored by the powerful groove of Price & Paul's Louisiana stomp rhythm section. The addition of Trevor Brooks on Hammond B-3 organ to the HISB family in 2010 has rounded out the band’s sound, which draws from a variety of influences in the world of roots music, including artists such as Lowell George & Little Feat, The Band, Taj Mahal, Gram Parsons, Jerry Garcia, Johnny Cash, Jimmy Reed, Clarence “Gatemouth” Brown, and New Orleans’ own Earl King and Dr. John. In April 2009, the band released its first full-length album – Wishing Well – and on the strength of such songs as \"Natural Born Fool\", \"Till the Money's Gone\", and the album's title track, Wishing Well was awarded 2009's “Best Blues Album” by OffBeat Magazine, which also named HISB as 2009’s “Best Emerging Artist” and 2010’s “Best Roots Rock Artist”. Most recently HISB won the award for “Best Roots Rock Artist” of 2011 at the Big Easy Awards, New Orleans' most prestigious arts & entertainment honors. Their highly anticipated new album Demolition Day drops on April 29th! (Jazz Fest weekend) Recorded at the Parlor Studio in New Orleans, Honey Island Swamp Band teams up with producer/musician Luther Dickinson of the North Mississippi Allstars to capture a rhythm and a feel born straight from the heart of Americana. Preorder your copy now on iTunes & Amazon. iTunes: http://apple.co/1VWgOFz Amazon: http://amzn.to/22SVuGv Demolition Day will be available on April 29th, 2016! http://apple.co/1VWgOFz", "otherInfo": "No event info available"}, {"Address": "907 S Peters St, New Orleans, LA 70130", "Artist": "Bonerama ", "ArtistImage": "https://photos.bandsintown.com/thumb/8407660.jpeg", "Coordinates": [29.9426876, -90.065991], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Soul, Brass Funk Rock, Funk, R&b, Rnb-soul, R&b/soul", "Time": "7:00 PM", "Venue": "the howlin wolf", "moreBioInfo": "BONERAMA When Bonerama struts onstage with its four-trombone frontline, you can guess it’s not quite like any rock ’n’ roll band you’ve seen. When they tear into some vintage New Orleans funk, there’s no questioning from which city these guys hail. And when those ‘bones start ripping into Hendrix and Led Zeppelin licks, all stylistic bets are off. Even in a city that doesn’t play by the rules, New Orleans’ Bonerama is something different. They’re not a traditional brass band, but they’ve got brass to spare—even with no trumpets or saxes in sight. They can evoke vintage funk, classic rock and free improvisation in the same set; maybe even the same song. Bonerama has been repeatedly recognized by Rolling Stone, hailed as “the ultimate in brass balls” (2005) and praised for their “…crushing ensemble riffing,human-feedback shrieks and wah-wah growls” (2007). Bonerama carries the brass-band concept to places unknown; what other brass band could snag an honor for “Best Rock Band” (Big Easy Awards 2007)? As cofounder Mark Mullins puts it, “We thought we could expand what a New Orleans brass band could do. Bands like Dirty Dozen started the ‘anything goes’ concept, bringing in the guitars and the drumkit and using the sousaphone like a bass guitar. We thought we could push things a little further.” New Orleans’ fertile club scene was directly responsible for Bonerama getting together.Trombonists Mullins and Craig Klein were both members of Harry Connick’s band, where they’d been since 1990. Both were looking to supplement this gig with something a little less structured. “Harry sets the bar pretty high, and you have to play it the same way every night for everyone to follow.” The big chance came in the summer of ’98, when Mullins had a weekly residency at Tipitina’s in the French Quarter. The club was then turning weekly slots over to some of the city’s favorite musicians,including Allen Toussaint and Cyril Neville; Mullins got charge of Wednesdays. Word got out one week that he and Klein were staging their trombone super-session and everybody they knew wanted to get involved. “It seemed that half the trombone players in town showed up,” Klein recalls. “At the end of the night we had them all onstage, maybe fifteen trombones at once. It sounded like a freight train; a big wall of sound coming right at you.” The players in the lineup all add to Bonerama’s diverse blend: Rick Trolsen was one of the first to answer the call for trombonists at Tipitina’s. A New Jersey native who grew up on hippie communes, he first saw New Orleans when the Navy shipped him there; he soon resolved to get out of the Navy and into music full-time. New Orleans native Steve Suter is a classically-trained player and a former member of the Louisiana Philharmonic. A key member of the early lineup was bass trombone player Brian O’Neill. A few years older than his bandmates, O’Neill had toured with R&B legend Wayne Cochran and his CC Riders. “He could do all the stuff that you’re not supposed to be able to do on a trombone,” Mullins says. Sousaphone player Matt Perrine adds the bassline to Bonerama’s sound and an additional voice to the songwriting. Matt has played with everyone from the New Orleans’ Nightcrawlers brass band to the alternative rock trio the Tin Men. Guitarist Bert Cotton learned his chops at the Berklee College of Music in Boston, and then came to New Orleans to immerse himself in funk. “He can fill out the chords harmonically, which is one thing that makes us different from a traditional brass band sound,” Klein says. Currently, drummer Eric Bolivar (who played Latin music in New York before joining Anders Osborne’s band in New Orleans) is tag-teaming with Terence Higgins,legendary drummer of the Dirty Dozen Brass Band. Along with his jazz connections, Mullins is Bonerama’s resident rock ’n’roller: It was Mullins who instigated the offbeat classic-rock covers that have become a band tradition. Edgar Winter’s “Frankenstein” was the first nugget to get the treatment and songs by Hendrix, Zeppelin, Black Sabbath and the Allman Brothers Band have since appeared in their set right alongside the funk and jazz-flavored numbers. “There’s definitely something about the guitar and the trombone that are related,” Mullins figures. “You compare the fretboard to the slide; there’s a lot of similarity there.” Indeed, the sounds Mullins makes by playing through a guitar amp and wah-wah pedal may explain why he’s named Jimi Hendrix as one of his favorite trombonists. “It’s great to grab people with the rock songs, and then turn them on to some New Orleans music at the same time,” Klein says. The buzz on Bonerama grew with hometown acclaim (with the band winning numerous OffBeat Magazine Awards; and Mullins regularly topping Offbeat’s trombone category), lots of roadwork, and a pair of live albums—the first recorded close to home at the Old Point in Algiers; the second on tour in New York. The Boston Herald called them a “bonehead’s dream”; the Vail (CO) Daily noted that “the sound is fat and wet; sometimes downright lusty.” As hometown music zine Offbeat put it, “That nerdy kid in the band room with the trombone just might have the last laugh after all.” Since live performance is what Bonerama is all about, it’s no coincidence that their third album, Bringing It Home, is also their third consecutive live disc. It also testifies to the amount of tightening-up the band’s done in recent years. Joining another stack of Bonerama originals are covers ranging from the Meters and George Porter Jr. to the Beatles (two from the White Album, no less) to Thelonious Monk. And when they take on Led Zeppelin’s “The Ocean” – with trombones doing the familiar backing vocals along with the big guitar riff – you can practically hear the audience’s jaws dropping. Opening the disc is the high-stepping original “Bayou Betty,” which recently got some extra mileage: Bonerama were the house band for the all-star Comic Relief benefit in Las Vegas in November 2006 and played that tune as the likes of Billy Crystal, Robin Williams and Whoopi Goldberg took the stage. Another memorable show happened the same month back at Tipitina’s, when the Future of Music Coalition sponsored a night to benefit the New Orleans Musicians’ Clinic. Not only did Bonerama play alongside the likes of Steve Earle, Mike Mills (R.E.M.) and Tom Morello (Rage Against the Machine), but also behind Tony Clifton - the international lounge lizard created by Andy Kaufman, making one of his first appearances (courtesy of Bob Zmuda, Kaufman’s partner and Comic Relief founder) since rising from the dead. The band has lately survived some harder times as well. They were dealt a shock in December 2005 when band member Brian O’Neill passed away from a sudden heart attack while playing a solo piano gig. “He’s not the kind of guy you can replace,” says Mullins. “Nobody could do what he could. After dealing with our own grief, we had to face the question of what it meant to us as a band.” Original trombonist Rick Trolsen wound up rejoining the band; so a lot of O’Neill’s spirit – along with his distinctive parts – is still present. <PRE></PRE> In case anyone needs more proof, the festive vibe of the new CD gives evidence that the spirit of New Orleans music is still going strong. “The music came back to town quicker than most anything else did,” notes Mullins. “Things look better now than I thought they ever could after the storm happened, that’s for sure.” ### www.bonerama.net MANAGEMENT Highsteppinʼ Productions / Philip Stepanian 617.628.5600 pstep@highsteppinproductions.com BOOKING Blue Mountain Artists / Hugh Southard 704.525.1559 hugh@bluemountainartists.com PUBLICITY Madison House Publicity 303.413.8308 www.madisonhousepublicity.com", "otherInfo": "No event info available"}, {"Address": "500 Canal St #2210, New Orleans, LA 70130", "Artist": "DUKES of Dixieland ", "ArtistImage": "https://photos.bandsintown.com/thumb/6326891.jpeg", "Coordinates": [29.9426876, -90.065991], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "Jazz @ Blue Dog", "moreBioInfo": "The DUKES of Dixieland blow New Orleans jazz into the 21st Century, weaving strands of pop, gospel, and country with authentic New Orleans sounds. More than 32 years of tradition stand behind today's DUKES as they step forward with a sound that is durable and flexible, as jazz is meant to be. The DUKES of Dixieland - strong tradition, new ground, great sounds. The DUKES have worn their New Orleans jazz heritage proudly as globe-trotting jazz ambassadors from the heart of the Big Easy. They are the oldest continuing Dixieland jazz band and have sold out such venues as The Hollywood Bowl, the Kennedy Center and the Smithsonian, to name but a few. Bright and brassy or smooth and dark as cane syrup, the DUKES bring a time-honored authenticity to all of the hits of Dixie's yesteryear.", "otherInfo": "No event info available"}, {"Address": "7165 Lower Bay Rd, Lakeshore, MS 39520", "Artist": "T. Graham Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/8854154.jpeg", "Coordinates": [30.2657037, -89.4488526], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Urban Cowboy, Pop Rock, Country Blues, Soul, Country, Gospel", "Time": "7:00 PM", "Venue": "The Whiskey Barrel", "moreBioInfo": "THE INIMITABLE T. GRAHAM BROWN BEGAN HIS MUSICAL JOURNEY IN 1973 WHILE ATTENDING THE UNIVERSITY OF GEORGIA IN HIS HOMETOWN OF ATHENS. AFTER MOVING TO NASHVILLE IN 1982, THE GRAMMY NOMINATED, CMA AWARD, DIAMOND ADDY AWARD FOR EXCELLENCE IN ADVERTISING, BACK TO BACK PRISM AWARD WINNING CHART TOPPER HONED HIS SKILLS AS A SONGWRITER AFTER SIGNING WITH EMI PUBLISHING COMPANY. AT THE SAME TIME, HE BEGAN TO SING SONGWRITER'S DEMOS AND THE WRITERS AND PRODUCERS BEGAN TO HEAR THE POWER AND SOUL IN HIS SINGING AND HIS DYNAMIC ABILITY TO INTERPRET WORDS AND MUSIC THROUGH A PERFECTLY PITCHED VOICE. THE NASHVILLE MUSIC BUSINESS KNEW HIS WAS A TALENT TO BE RECKONED WITH. WITHIN TWO YEARS OF ARRIVING IN MUSIC CITY, CAPITOL RECORDS SIGNED HIM TO AN EXCLUSIVE RECORDING CONTRACT AND WHAT WOULD BECOME A LONG LIST OF ALBUMS THAT TOOK COUNTRY MUSIC BY STORM. HE HAS ALSO RECORDED FOR WARNER BROTHERS AND SONY AND NOW HAS A RECORDING RELATIONSHIP WITH SONY RED AND A RETAIL PARTNERSHIP WITH CRACKER BARREL OLD COUNTRY STORES. SIMULTANEOUSLY, HE STARTED A LONG AND SUCCESSFUL CAREER SINGING ADVERTISING JINGLES. HE WAS THE \"FACE AND VOICE\" OF TACO BELL'S WILDLY SUCCESSFUL \"RUN FOR THE BORDER\" T.V. CAMPAIGN FOR OVER FOUR YEARS. HIS WIDE RANGE OF VOCAL ABILITY COULD ALSO BE HEARD ON NATIONAL MUSIC ADS FOR MCDONALD'S, BURGER KING, HARDEE'S, COCA COLA, DR. PEPPER, 7-UP, ALMOND JOY, KENTUCKY FRIED CHICKEN, FORD, DODGE, HARRAH'S CASINOS AND DOZENS MORE. HE HAS HIT THE BILLBOARD, CASH BOX AND CHRISTIAN MUSIC CHARTS 35 TIMES WITH HITS SUCH AS \"I TELL IT LIKE IT USED TO BE\", SELF PENNED \"HELL AND HIGH WATER\", AND \"DARLENE\". ALSO, HE WROTE THE MULTIPLE AWARD WINNING SONG, \"WINE INTO WATER\", WHICH HAS BEEN RECORDED OVER A HUNDRED TIMES BY ARTISTS ALL OVER THE WORLD. MOST RECENTLY BY COUNTRY SUPER STAR LORETTA LYNN ON HER LATEST CRITICALLY ACCLAIMED ALBUM, \"FULL CIRCLE\". AS A RECORDING ARTIST, SONGWRITER, PERFORMER AND PRODUCER, BROWN HAS SCORED MULTIPLE NUMBER ONE SONGS IN THE COUNTRY, BLUES AND GOSPEL FIELDS. OVER THE YEARS, \"HIS T-NESS\" HAS RECORDED WITH MANY OTHER ARTISTS. HIS DUET PARTNERS HAVE INCLUDED GRAMMY WINNERS THE BEACH BOYS, TANYA TUCKER, VINCE GILL, GEORGE JONES, DELBERT MCCLINTON, JASON CRABB, BRAD DAVIS, THE OAK RIDGE BOYS, AND ROCK AND ROLL HALL OF FAME MEMBERS MICHAEL MCDONALD, STEVE CROPPER AND LEON RUSSELL. BROWN'S LATEST ALBUM AND HIS FIRST GOSPEL EFFORT IS THE GRAMMY NOMINATED, CRITICALLY ACCLAIMED \"FOREVER CHANGED\". \"HE'LL TAKE CARE OF YOU\", THE FIRST SINGLE FROM THAT PROJECT, A DUET WITH VINCE GILL, BECAME A GOSPEL HIT. T. GRAHAM BROWN HAS PERFORMED ON THE ICONIC STAGE OF THE GRAND OLE OPRY HUNDREDS OF TIMES AND HE MAINTAINS A BUSY TOURING SCHEDULE ALL OVER THE U.S. AND EUROPE. HE'LL TELL YOU WITH A GRIN ,\"I'VE GOT A BAND AND A BUS AND I'LL KEEP TAKING THE MUSIC TO THE PEOPLE AS LONG AS GOD LET'S ME. IT'S WHAT I LOVE TO DO\"!", "otherInfo": "No event info available"}, {"Address": "300 Bourbon St, New Orleans, LA 70130", "Artist": "Nayo Jones ", "ArtistImage": "https://photos.bandsintown.com/thumb/11281037.jpeg", "Coordinates": [29.9557609, -90.0678872], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz, R&b, Soul", "Time": "7:30 PM", "Venue": "The Jazz Playhouse", "moreBioInfo": "Nayo Jones hails from Phoenix, Arizona born in Chicago, Illinois into a family of musicians, she was destined to be in “the business”. As a child Nayo sang and danced her way through life. She belted out Supreme songs at talent shows in grade school and mimicked Whitney Houston in front of the mirror. Nayo’s father William “Doc” Jones, a Jazz musician and music educator born and raised in Chicago noticed her musical gift & helped nurture her natural ability from the very beginning. Growing up surrounded by classic jazz and Motown hits Nayo answered her calling at an early age. A classically trained flutist, Nayo would go on to compete & play the flute on a professional level at a very young age, she also sang in the church choir. As a graduate of Spelman College, the prestigious historically black college for women in Atlanta, Georgia, Nayo focused her life on the corporate world not realizing music was still in her destiny. Nayo began her journey on a whim. Her father held a fundraiser benefiting his non-profit music organization at the renowned Rhythm Room located in Phoenix, Arizona. In the middle of the impressive talent set to perform for the occasion, Doc requested his daughter sing a song, “just one song” he persuaded her. The audience received Nayo with joy and jubilation; she enjoyed singing for them as much as they loved having her. This was the beginning of a journey that brings us to today. Nayo wows her crowds and gains loyal fans with her sultry voice and her passion for every performance. To name just a few of her credits, Nayo has appeared as the opening act for such greats as Chris Botti, Otis & the Temptations, The Whispers & Lakeside. She also has performed at the Glendale & Scottsdale Jazz Festivals, Festival in the Desert featuring Patti LaBelle & Smokey Robinson and most recently headlined her own show at the Wild Horse Pass Casino. Though a babe in the music industry she already has the savvy of some of the most classic female artists and has proven to be a force to be reckoned with. Nayo is committed to bringing back the “authenticity of music”. Her fans have compared her to the likes of Natalie Cole, Roberta Flack and even Billy Holiday as she belts out tunes from Jazz standards to adult R&B. Nayo’s body of work also includes her first original album “My Name is Nayo Jones”, two holiday albums, a compilation project featuring her dad Doc Jones, and her EP simply titled “Nayo”. Nayo is currently in the studio working on her sophomore album “One Woman” in which she promises to take her fans on a journey, a journey that will lend insight into some of her most personal & intimate moments in life. Her work which also includes music videos can be found on iTunes, Cdbaby and of course her website www.NayoJones.com", "otherInfo": "No event info available"}, {"Address": "626 Frenchmen St, New Orleans, LA 70116", "Artist": "Rex Gregory ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.964194, -90.05796389999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Snug Harbor Jazz Bistro", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "7165 Lower Bay Rd, Lakeshore, MS 39520", "Artist": "Ashley Barron ", "ArtistImage": "https://photos.bandsintown.com/thumb/11284585.jpeg", "Coordinates": [30.2657037, -89.4488526], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Country Rock", "Time": "8:00 PM", "Venue": "The Whiskey Barrel", "moreBioInfo": "Ashley Barron embraces the independent and powerful countrywoman aura in her writing and music. Influenced by the country greats such as Johnny Cash and other modern stars like Miranda Lambert, she now incorporates her life experiences and stories into her writing, creating passionate, home-grown, and relatable music. Before being a country-rock star, Ashley encircled her music passion by singing in her room, taking music lessons, and being in the high school choir. Diagnosed with Linear Scleroderma and Celiac Disease, Ashley learned to gain courage and love herself when it came to performing—musically or with cheerleading. Used to a crazy lifestyle and a giant family full of support, her passion for music grew, and she declined an invitation to the University of Arizona to attend a local university and go full force into her music career—recording and performing wherever and whenever she could. As an inspiration to her fans, Ashley is devoted to speaking about honest topics that affect her daily life. By persevering through some of her hardest moments, Ashley decided that her logo would be an arrow, signifying to always push ahead and to never give up, even if it seems so easy to do. That’s been proven with her past single, \"Beer in a Bar\", which received critical acclaim and topped in Billboard at #37. Her last release, \"Let Me Go\", showed her strength both lyrically and vocally. In her newest single, Ashley bares her heart on \"Pretend He's You\", giving listeners a deeper understanding of what she is all about. Ashley's self-titled, debut album is coming soon!", "otherInfo": "Doors open at 5."}, {"Address": "4920 Freret St, New Orleans, LA 70115", "Artist": "Retrofit ", "ArtistImage": "https://photos.bandsintown.com/thumb/6298380.jpeg", "Coordinates": [29.9348216, -90.1079206], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Reggae, Country, Rock", "Time": "8:00 PM", "Venue": "Gasa Gasa", "moreBioInfo": "Retrofit is a boutique label series from UK producer Jay Shepheard. With an ear for the past and and eye on the future Retrofit will marry classic electronic musical themes with current dancefloor sound and concepts. Weather it be disco, acid house, vintage techno or anything between expect the highest quality of diverse and melodic electronic music aiming to break free from conformity and establish its own sound in a scene often plagued by short term trends. \"Retrofit: the addition of new technology, features or ideas to older systems.\" retrofitlabel.net", "otherInfo": "In the heat of the New Orleans summer, four musicians decided to put their they love to the people they love. The result was Retrofit, a dare-devil birthed to create ear-catching melodies and a blend of bold flavors that everyone can enjoy. Inspired by the rhythmic nature of the Big Easy along with the rich musical heritage of the Louisiana, themboys simply had to open their ears to let in the music that has inspired their signature sound.Songwriter and vocalist Christopher DiBenedetto (Gravy, Strange Roux), has taken his influence from memories of growing up in this flavorful south Louisiana region. Putting them into stories of love, redemption, and self-discovery with a unique twang that sticks with the listener through and true. With roots all forms of Soul music, Retrofit seeks to create sound waves to revive the spirits of its audience. The group started by making a one night trip to Pensacola, Florida to play an opening slot for a friends band in the area. After enjoying the set and coming together as a group, they couldnt resist but to make it official. Today, Retrofit plays locally around their hometown in New Orleans, while continuing to tour the southern region. Having released their debut EP Be Easy in December of 2017, the quartet is beyond thrilled to spread the same love they;ve received from the city that has inspired them so much.Retrofit has played at such New Orleans venues a 30/90, Banks Street Bar,GasaGasa, Le Bon Temps Roule, Troubadour Hotel, The Basin Lounge, Oak Wine Bar, Rare Form, and the 2019 Banks Street Festival. In Baton Rouge the boys have played the Spanish Moon, Hartley/Vey Theater, Hueys Bar, Lock & Key Whiskey Bar, and at the 2018 annual North Gate Festival. In Oceans Springs find them at Government Street Grocery and Mosaic Tapas as well as The Brickyard in Mobile.Retrofit has shared the stage with Motel Radio, Mia Borders, Roadside Glorious,Naughty Professor, Miss Mojo, The Quickening, Darcy Malone the Tangle, Daria & the HipDrops, Lilli Lewis Project, Burris, Dubya, Allie Porter Band, Marina Orchestra, Captain Green, Brass Mimosa, and more"}, {"Address": "542 S Jefferson Davis Pkwy, New Orleans, LA 70119", "Artist": "Sierra Green ", "ArtistImage": "https://photos.bandsintown.com/thumb/11348412.jpeg", "Coordinates": [29.9655528, -90.0973154], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues, Soul", "Time": "8:00 PM", "Venue": "dmac’s", "moreBioInfo": "Sierra Green is a singer from New Orleans.", "otherInfo": "No event info available"}, {"Address": "626 Frenchmen St, New Orleans, LA 70116", "Artist": "Astral Project ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.964194, -90.05796389999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "Snug Harbor Jazz Bistro", "moreBioInfo": "Astral Project is a four-piece jazz ensemble from New Orleans, Louisiana consisting of Steve Masakowski on the seven-string guitar, Johnny Vidacovich on drums, Tony Dagradi on tenor and soprano saxophones, and James Singleton on bass. Astral Project is known for creating memorable melodies such as \"Sidewalk Strut\" and still incorporating many other influences through improvisation.", "otherInfo": "No event info available"}, {"Address": "626 Frenchmen St, New Orleans, LA 70116", "Artist": "Jason Marsalis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9616884.jpeg", "Coordinates": [29.964194, -90.05796389999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "Snug Harbor Jazz Bistro", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "501 Napoleon Ave, New Orleans, LA 70115", "Artist": "The Soul Rebels ", "ArtistImage": "https://photos.bandsintown.com/thumb/9355108.jpeg", "Coordinates": [29.9174093, -90.1007822], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jam Bands, Funk, Soul, Hip Hop, Jazz", "Time": "9:00 PM", "Venue": "Tipitina's Uptown", "moreBioInfo": "The Soul Rebels are riding high in 2019, receiving national attention with recent performances with Katy Perry and DMX, and featured on NPR’s Tiny Desk series, a debut late night TV appearance on The Late Show with Stephen Colbert, and a headlining set at the TED Conference. The band continues to expand its international reach touring four continents including Europe, Australia, China, South Korea and Japan. Their explosive stage presence has led to live collaborations with the likes of: Nas, G-Eazy, Robin Thicke, Macy Gray, Portugal. The Man, Robert Glasper, Pretty Lights, Curren$y, Joey Bada$$, Talib Kweli, GZA, Macklemore & Ryan Lewis, Mobb Deep, Raekwon, Metallica, and Marilyn Manson among many others, and opening forLauryn Hill and Nile Rodgers. The Soul Rebels started with an idea – to expand upon the pop music they loved on the radio and the New Orleans brass tradition they grew up on. They took that tradition and blended funk and soul with elements of hip hop, jazz and rock all within a brass band context. The band has built a career around an eclectic live show that harnesses the power of horns and drums in a deep pocket funk party-like atmosphere. The Soul Rebels continue to chart new territory as they feature in major films, tour globally, and combine topnotch musicianship with songs that celebrate dancing, life, funk and soul. Most recently The Soul Rebels wrapped up recording for their upcoming fall 2019 album, Poetry in Motion. The album will put the band front and center and showcase the wide breadth of musical genres and special collaborations that have come to identify the musically chameleon-like band.", "otherInfo": "No event info available"}, {"Address": "310 Andrew Higgins Dr, New Orleans, LA 70130", "Artist": "ARMNHMR ", "ArtistImage": "https://photos.bandsintown.com/thumb/10377678.jpeg", "Coordinates": [29.94184079999999, -90.06626589999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic", "Time": "10:00 PM", "Venue": "The Metropolitan NightClub", "moreBioInfo": "Catapulting into 2018 with full force, LA duo ARMNHMR (consisting of Joseph Chung & Joseph Abella) are no strangers to attacking all spectrums of Dance Music. With masterful original productions and beautifully resonating remixes, ARMNHMR has built a loyal following as well as received strong support and recognition from high profile artists throughout the industry. A combination of heart pounding drops and melodic interludes encompass the #HammerSound, guiding their audience into a world filled with emotion and energy. With dozens of planned releases for this coming year along with collaborations with some of the highest caliber artists in the dance music scene, 2018 is looking to be the duos breakout year.", "otherInfo": "ARMNHMR - LIVE AT THE METROPOLITAN! July 24, 2021 at 10:00pm (CDT) NEW ORLEANS, LA"}, {"Address": "1135 Decatur St, New Orleans, LA 70116", "Artist": "Burris ", "ArtistImage": "https://photos.bandsintown.com/thumb/11412283.jpeg", "Coordinates": [29.9605571, -90.05955089999999], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz, Folk Rock, Funk, Rock, Soul", "Time": "10:00 PM", "Venue": "Burris Presents: Emo Night", "moreBioInfo": "Burris comprises founding member and vocalist, Christopher Burris Hochkeppel, and a rotating cast of collaborators. Originally formed in Baton Rouge, LA at the LSU School Of Music, the roots-rock group is now based in New Orleans. Burris can be seen playing all over the city as an acoustic act as well as a full-fledged, six piece rock band! Burris pulls influences from old soul to modern jazz, but the band centers it's eclectic sound around gritty New Orleans tradition and southern-folk music. As a band, the nationally touring act has performed at French Quarter Fest, Festival International, Bethlehem's Musikfest, Northgate Fest, and Baton Rouge’s Live After Five. Following the release of Burris' debut album \"Meant To Be\" in 2015, the group has since swept the south with new and innovative sounds. They will be releasing a sophomore album in 2020 with the help of legendary producer/engineer, Chris Finney. Collectively, members of Burris have shared the stage with George Porter Jr., Rebirth Brass Band, Snarky Puppy, FORQ, The Revivalists, Louisiana’s Leroux, Grace Potter, GIVERS and many more.", "otherInfo": "All your favorite early 2000's bangers packed into one emotional set! Slap on your favorite black T, paint on some eyeliner, and join us as we welcome multiple special guests for a night that's sure to make you cry."}, {"Address": "508 Frenchmen St, New Orleans, LA 70116", "Artist": "City of Trees Brass Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11421706.jpeg", "Coordinates": [29.9627937, -90.05800040000001], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Brass Band, Traditional Jazz, Jazz, New Orleans Traditional Jazz", "Time": "10:00 PM", "Venue": "CoT NOLA at Maison", "moreBioInfo": "https://www.cityoftreesbrassband.com http://www.youtube.com/cotbrassband https://soundcloud.com/city-of-trees-brass-band https://twitter.com/thebrassband www.instagram.com/thebrassband", "otherInfo": "No event info available"}, {"Address": "8140 Willow St, New Orleans, LA 70118", "Artist": "Andrew Duhon ", "ArtistImage": "https://photos.bandsintown.com/thumb/11466647.jpeg", "Coordinates": [29.9493125, -90.12918839999999], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Folk Blues", "Time": "11:00 AM", "Venue": "Brunch with Andrew Duhon at Carrollton Station", "moreBioInfo": "Andrew Duhon is a songwriter who's weighted, soulful songs feel like a sweet spot between his hometown of New Orleans and the familiar landmarks of Americana Music. No Depression call's Duhon \"A soulmate of Van Morrison lyrically and vocally.\" He followed his 2013 Grammy Nominated album, \"The Moorings,\" with a new record released called \"False River,” released in 2018. Duhon often tours as a trio with drums, upright bass, and three part harmonies.", "otherInfo": "Show and Brunch buffet included in ticket!"}, {"Address": "230 Cousin St, Slidell, LA 70458", "Artist": "Casey Saba ", "ArtistImage": "https://photos.bandsintown.com/thumb/11261318.jpeg", "Coordinates": [30.2741468, -89.7829162], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Experimental, Rock, 60s, Classic Rock, 70s, Hard Rock, Fusion, 80s, 90s, Folk, Eclectic, Early Country, Metal, Alternative", "Time": "1:00 PM", "Venue": "The Brass Monkey Draught Emporium", "moreBioInfo": "www.CaseySaba.com", "otherInfo": "Earlier Sunday show! Music from 1pm-4pm! Free Admission!"}, {"Address": "545 Patterson St, New Orleans, LA 10114", "Artist": "Gregg Martinez ", "ArtistImage": "https://photos.bandsintown.com/thumb/11004288.jpeg", "Coordinates": [29.9549993, -90.0501838], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "3:30 PM", "Venue": "Old Point Bar-duo w/James Martinez", "moreBioInfo": "Lafayette, Louisiana native Gregg Martinez has been performing, recording and writing for nearly five decades. Martinez’s 12th album, MacDaddy Mojeaux, celebrates a life-long passion born in the depths of the Louisiana bayou and still burning brightly today. A 2019 inductee into the Louisiana Music Hall of Fame, Martinez has received multiple nominations for OFFBEAT magazine’s Best Male Vocalist in the annual Best of the BEAT Awards. His 2016 release, “Soul of the Bayou,” was named one of OFFBEAT’s Top Ten Albums in Louisiana. The late Ed Bradley of TV's 60 Minutes - upon hearing him perform at the 2005 New Orleans Jazz and Heritage Festival - called Gregg \"one of America's hidden treasures.\" MacDaddy Mojeaux, Gregg's newest CD, is now available ! Blue-eyed Creole soul from the depths of the Louisiana bayou, at its finest!", "otherInfo": "No event info available"}, {"Address": "501 Napoleon Ave, New Orleans, LA 70115", "Artist": "Bruce Daigrepont ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.9174093, -90.1007822], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:15 PM", "Venue": "Tipitina's Uptown", "moreBioInfo": "Bruce was born in New Orleans on July 11, 1958. His parents were part of a post-World War II migration of Cajuns to New Orleans from the rural farming communities of Avoyelles Parish. Located in the uppermost corner of Louisiana's \"Cajun triangle,\" Avoyelles Parish is the forgotten part of Cajun country. Nevertheless, the language and customs of the Cajun people are as deeply rooted here as anywhere in the state. And whenever you walk through the door of Bruce's family home, you return to Avoyelles Parish. His parents have never abandoned their beautiful Cajun French, and they've kept their gumbo and fricassee simmering on the stove. From his website, expanded bio here.", "otherInfo": ""}, {"Address": "501 Napoleon Ave, New Orleans, LA 70115", "Artist": "Bruce Daigrepont Cajun Band ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.9174093, -90.1007822], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:15 PM", "Venue": "Tipitina's Uptown", "moreBioInfo": "No artist bio available", "otherInfo": ""}, {"Address": "2372 St Claude Ave, New Orleans, LA 70117", "Artist": "Squally Lou ", "ArtistImage": "https://photos.bandsintown.com/thumb/11532347.jpeg", "Coordinates": [29.9685778, -90.0523824], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Hip Hop", "Time": "7:00 PM", "Venue": "Club Istanbul", "moreBioInfo": "No artist bio available", "otherInfo": "Squally Lou is performing live at Club Istanbul on July 25th, 2021, so get your tickets now. This showcase is presented by Afton Shows and will feature artists who are local to the NEW ORLEANS,LA area. Visit MyAfton.com for booking info."}, {"Address": "2372 St Claude Ave, New Orleans, LA 70117", "Artist": "BigKingFish ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.9685778, -90.0523824], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Club Istanbul", "moreBioInfo": "No artist bio available", "otherInfo": "BigKingFish is performing live at Club Istanbul on July 25th, 2021, so get your tickets now. This showcase is presented by Afton Shows and will feature artists who are local to the NEW ORLEANS,LA area. Visit MyAfton.com for booking info."}, {"Address": "2372 St Claude Ave, New Orleans, LA 70117", "Artist": "nilly ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [29.9685778, -90.0523824], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Club Istanbul", "moreBioInfo": "No artist bio available", "otherInfo": "Nilly is performing live at Artisans Bar and Gallery on July 23rd, 2021, so get your tickets now. This showcase is presented by Afton Shows and will feature artists who are local to the Atlanta,GA area. Visit MyAfton.com for booking info."}, {"Address": "907 S Peters St, New Orleans, LA 70130", "Artist": "Hot 8 Brass Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9137696.jpeg", "Coordinates": [29.9426876, -90.065991], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Jazz, R&b, Funk, Hip Hop", "Time": "9:00 PM", "Venue": "The Howlin' Wolf", "moreBioInfo": "Hot 8 Brass Band are a Grammy-nominated New Orleans based brass band, whose sound draws on the traditional jazz heritage of New Orleans, alongside more modern styles including elements of funk, hip hop, rap, and its local variation, “bounce.”  Transcending genres and trends, Hot 8 have performed and collaborated with artists from Lauryn Hill, Alice Russell, Mos Def to the Blind Boys of Alabama and George Ezra and have decade long affiliations with actor/BBC 6Music DJ Craig Charles, among others. They were nominated for a Grammy in 2013 for their second album ‘The Life and Times Of…’. and, with acclaimed releases such as ‘Vicennial...’,  ‘On The Spot’ and “Take Cover”, continue to exemplify their ability to honour their city’s musical traditions while forging their own powerful legacy. Hot 8’s incredible tale, which comes across in their life-affirming music, has also previously featured in Spike Lee’s two New Orleans documentaries, When The Levees Broke and The Creek Don’t Rise, and David Simon’s HBO series Treme (in which the band played themselves), to add to extensive features across the world’s media. Mixing an old school street brass approach with funkier currents and hip hop vocals, Hot 8’s magnificent originals are juxtaposed with fresh versions of Snoop Dogg, Stevie Wonder, The Specials, Basement Jaxx and of course their anthemic take on Marvin Gaye’s “Sexual Healing”. Hot 8 Brass Band’s rhythms are loose-limbed and hard-hitting, with most tracks featuring a sousaphone prominently. The legendary group have established themselves as a dominant force on New Orleans streets—the band you want to dance behind during a Sunday second-line parade or witness jazz funeral. Brass band-related activities have been a vital part of New Orleans’ African American community life for over a century, serving as an important source of celebration, bonding, strength, pride, and both individual and collective expression. Jazz funerals are among the most curious and well-known New Orleans brass band customs.  As an exercise of the belief in “rejoicing at death,” the jazz funeral juxtaposes grief and joy. Slow, sad hymns and dirges are played en route to the cemetery, followed by up-tempo songs and joyous second line dancing in a final procession away from the grave.  The city’s traditional obsession with music, parades, dancing, and the rise of black benevolent organizations, has helped to maintain and support brass band activities and culture. Dozens of benevolent societies and groups known as “social aid & pleasure clubs” sponsor weekly Sunday parades. Very different from New Orleans’ better known Eurocentric Mardi Gras parades, the black social club events consist of three main parts: divisions of colorfully dressed social club members, one or more brass bands and the second line—a crowd of up to several thousand people who follow and dance alongside the parade throughout its several-hour duration. The free-form second line dance performed by club members and the crowd, both of whom dance with umbrellas and handkerchiefs, is derived from West African processions. The intensity that builds from the constant creative interaction between hot music and improvised dancing often erupts into a euphoric dimension in which a sense of total freedom, equality, limitless power, and a spiritual redefining of earthly reality seem to overtake all of the participants. Many legendary and influential musicians who would migrate from New Orleans by the 1920s and influence the direction of American music—among them King Oliver, Louis Armstrong, and Sidney Bechet—got some of their early training and experience in street parades and funerals.  The story of the Hot 8 Brass Band has been one of tragedy and triumph. Over the years the Hot 8’s ranks have been decimated by the deaths of four original members due to street violence and illness. The devastation of Hurricane Katrina in 2005 was a life-altering turning point; during which 80% of New Orleans flooded, untold numbers of inhabitants died, and long-term displacement and misery affected hundreds of thousands—raised real concerns about the survival of the city and its indigenous cultural traditions. After being evacuated, displaced, and scattered across the country, the band regrouped and began touring the United States to encourage and support other displaced Katrina victims and promote New Orleans’ recovery.  Hot 8 Brass Band are signed to Tru Thoughts, based in Brighton, UK.", "otherInfo": "Due to changes in CDC guidelines, we are no longer using the pod and social distancing system. Seating and dance floor area will now be open and general admission. By attending the without a mask, you signify that you have been vaccinated."}, {"Address": "2239 St Claude Ave, New Orleans, LA 70117", "Artist": "Vivacious Miss Audacious ", "ArtistImage": "https://photos.bandsintown.com/thumb/8500722.jpeg", "Coordinates": [29.9690056, -90.0554284], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Ingénue Revue ", "moreBioInfo": "No artist bio available", "otherInfo": "Brought to you by Mz. Juno & Vivacious Miss Audacious:\nIngénue Revue features burgeoning burlesque, drag & variety acts from fresh faces and crowd favs, twice a month at Hi-Ho Lounge! Enjoy up and coming talent alongside seasoned pros, debuting new work & signature acts.\n2nd & 4th Sunday\n10pm\n$15\n$25 VIP guaranteed seating\nTipping highly encouraged"}, {"Address": "3016 S Carrollton Ave, New Orleans, LA 70118", "Artist": "KLiK Events ", "ArtistImage": "https://photos.bandsintown.com/thumb/11031207.jpeg", "Coordinates": [29.9610849, -90.11607819999999], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Pop", "Time": "12:00 PM", "Venue": "Boys Of Summer Tour 2021 - New Orleans", "moreBioInfo": "Amazing Events for all with the biggest up and coming artists", "otherInfo": "The 7th year of BOYS OF SUMMER TOUR 2021 is happening in THIS SUMMER! Join us for over 20 amazing social media creators and artists for another amazing concert and meetup! Tickets ON SALE NOW and going fast!"}, {"Address": "214 Royal St, New Orleans, LA 70117", "Artist": "Amina Scott ", "ArtistImage": "https://photos.bandsintown.com/thumb/9613226.jpeg", "Coordinates": [29.9542516, -90.0675966], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "No genre available", "Time": "4:30 PM", "Venue": "Hotel Monteleone", "moreBioInfo": "Hailing from Oakland, CA, Amina Scott is a bassist and composer. Having relocated to New Orleans, LA in 2012, she has since been playing with the New Orleans Jazz Orchestra. She has also played with Steve Turre, David Murray, Joanne Brackeen, Nicholas Payton, Christian Scott Atunde Adjuah, and more.", "otherInfo": "No event info available"}, {"Address": "1111 Canal St, New Orleans, LA 70112", "Artist": "Lindsey Stirling ", "ArtistImage": "https://photos.bandsintown.com/thumb/11267958.jpeg", "Coordinates": [29.9542516, -90.0675966], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Classical Crossover, Electronic", "Time": "7:00 PM", "Venue": "Saenger Theatre", "moreBioInfo": "Lindsey Stirling is one of the biggest artist development breakthrough stories in recent years. An acclaimed violinist from Gilbert, Ariz., Lindsey has entered a futurist world of electronic big beats and animation, using her classical violin training to leap through the music industry with over 10 million YouTube subscribers, over 2 billion views on her YouTube channel, 2 Billboard Music Awards, Billboard chart-topping hits and sold out tours worldwide. She’s created a new music world where modern classical meets the infectious energy of dance and electronica. On stage, Stirling moves with the grace of a ballerina but works the crowd into a frenzy, “dropping the beat” like a rave fairy. Recently, Lindsey released her first ever holiday album called Warmer in the Winter in October which featured classic and original songs and continues to climb the charts. She also was the runner-up on Season 25 of ABC’s hit show “Dancing with the Stars” with her partner Mark Ballas. Lindsey’s last album Brave Enough, debuted at #5 on Billboard’s Top 200 Album Chart and went on to score the #1 spot on Billboard’s year-end Top Dance/Electronic Album list, placing ahead of dance music heavyweights Chainsmokers, Flume and Kygo. The album also had the highest selling week for an album title on the ranking chart and Lindsey herself placed at #6 on the Billboard Top Dance/Electronic Artist year-end list. Collaborations on the album include ZZ Ward, Andrew McMahon and the Wilderness, Rivers Cuomo and Christina Perri to name a few, and earned Stirling a 2017 Billboard Music Award for “Top Dance/Electronic Album”. The album’s current single “Love’s Just A Feeling” featuring up and coming songstress Rooty, recently made its powerful debut on Jimmy Kimmel Live!, and has begun to pick up traction at radio across the US. Lindsey’s professional journey began in September of 2012, with the release of her self-titled debut album. Featuring her smash hit “Crystallize,” which has racked up over 185 million YouTube views, the album reached #1 on Billboard’s Dance/Electronic Chart and Classical Album Chart, earned her a 2014 Billboard Music Award nomination for “Top Dance/Electronic Album,” and was certified Gold by the RIAA. The album reached #1 on Billboard’s Dance/Electronic Chart and Classical Album Chart and peaked at #23 on the Billboard Top 200. In 2014, Lindsey released her sophomore album Shatter Me which debuted at #2 on Billboard’s Top 200 album chart and has sold over a quarter million copies in the US. It was #2 on the Billboard Year End Dance Electronic Album Chart, #1 on the iTunes Album Chart, spent an impressive 21 weeks straight at the #1 spot on the Billboard Classical Album Chart, and was recently certified Gold by the RIAA. The album includes a collaboration with Halestorm lead singer Lzzy Hale on her smash single “Shatter Me,” which has over 78 million views on YouTube and took home the 2015 Billboard Music Award for “Top Dance/Electronic Album” of which Avicii, Disclosure, Calvin Harris and Skrillex were also nominated. In 2016, Lindsey released her first book with Simon& Schuster, a memoir called “The Only Pirate at the Party” which she co-wrote with her sister, Brook S. Passey. Released in January of 2016, the book debuted on the New York Times’ best-seller list and shares stories of Lindsey’s humble yet charmed childhood, humorous adolescence, life as a struggling musician, personal struggles with anorexia, and finally, success as a world-class entertainer. Lindsey’s critically praised concerts have sold out theaters and arenas across the globe, spanning a wide range of continents including the U.S., Europe and South America. Recently Stirling has played to packed crowds at venues such as Red Rocks Amphitheater in Denver, Chicago Theater, New York’s Central Park Summerstage and the Greek Theater in Los Angeles and to date, Lindsey’s tours have sold over 500,000 headline tickets worldwide. Stirling is the model of a modern independent recording artist, with a symbiotic relationship with her fans. A motivational speaker in her spare time, Stirling uses her own story to show teenagers that you’ve got to have confidence in the very thing that makes you unique – then wait for the world to catch up.", "otherInfo": "EVERYONE NEEDS A TICKET REGARDLESS OF AGE! NO CAMERAS OR RECORDERS NO COMPUTERS OR BACKPACKS Covid-19 Acknowledgement By attending an Event at an ATG venue, all patrons are acknowledging their consent to, and agreed to abide by, the safety precautions set forth on www.www.saengernola.com. An inherent risk of exposure to COVID-19 exists in any public place where people are present, and, by attending an event at the venue, you and those in your party are voluntarily assuming such risk."}, {"Address": "1111 Canal St, New Orleans, LA 70112", "Artist": "Kiesza ", "ArtistImage": "https://photos.bandsintown.com/thumb/10219847.jpeg", "Coordinates": [29.9560744, -90.07288630000001], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Pop", "Time": "7:00 PM", "Venue": "Saenger Theatre", "moreBioInfo": "Kiesza stormed onto the scene in 2014 with her impassioned hit “Hideaway”, which has since accrued over a billion streams; the accompanying one-shot video has been featured on several best-of-decade lists. Her debut studio album Sound Of A Woman saw her top charts globally and moved over a million units. Top-tier musicians soon rushed to work with her, and the rising Canadian talent soon counted herself as a feature on releases from the likes of Skrillex, Diplo, Duran Duran and Joey Bada$$, to name a few. The Canadian multi-hyphenate also has a foot in the fashion world, serving as the face of campaigns for top brands like Fendi and Maison Birks. After a life-changing car crash put her on a two-year hiatus, Kiesza returned as an independent artist, releasing music through her own label Zebra Spirit Tribe starting with her sophomore album CRAVE in 2020. The new decade marks a promising new beginning for one of the last decade’s biggest breakouts—and this time, she’s doing it her way.", "otherInfo": "EVERYONE NEEDS A TICKET REGARDLESS OF AGE! NO CAMERAS OR RECORDERS NO COMPUTERS OR BACKPACKS"}, {"Address": "1201 Frenchmen St, New Orleans, LA 70117", "Artist": "Ellis Dyson & the Shambles ", "ArtistImage": "https://photos.bandsintown.com/thumb/11520185.jpeg", "Coordinates": [29.9696278, -90.0581091], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Old Timey, Acoustic, Old-timey, Swing, Folk, Traditional Jazz, Jazz, String Bands, New Orleans Jazz, Big Band, Dixieland, Old Time Stringand", "Time": "7:00 PM", "Venue": "Frenchmen Community Garden (1201 Frenchmen St)", "moreBioInfo": "Ellis Dyson & the Shambles expertly blends old-time influences ranging from early New Orleans jazz to Piedmont murder ballads. The result: foot-stompin’ and eccentric original songs that bring party music of departed eras to crowds both young and old. The Shambles have made waves with their theatrical live shows and dazzling musicianship. The original compositions evoke a bygone era while contributing to the vast tradition of storytelling through songwriting. The group released their 3rd full-length album “Greetings from Shambylvania” in April 2019. The album, deliberately written as a full group, is a series of whimsical vignettes from the fictional town of Shambylvania. Ellis Dyson & the Shambles have performed hundreds of shows throughout the east coast and midwest and have shared a bill with national acts such as Lake Street Dive, Rebirth Brass Band, Pokey Lafarge, and Mipso, to name a few. The band consists of Ellis Dyson (banjo, vocals), Eli Wittmann (acoustic guitar), Kenny Phelps-McKeown (upright bass), Danny Abrams (soprano/alto/baritone saxophones, clarinet, vocals), and Danny Grewen (trombone, vocals). They came together through a series of fortuitous meetings in Chapel Hill, N.C. Beginning back in 2013 as a saxophone and banjo duo, Ellis Dyson & the Shambles has grown into a freight train string band with a flashy horn section.", "otherInfo": "No event info available"}, {"Address": "1614, New Orleans, LA 70116", "Artist": "Khris Royal ", "ArtistImage": "https://photos.bandsintown.com/thumb/11480936.jpeg", "Coordinates": [29.9646278, -90.0579607], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Funk, Edm, Rnb, Rock, Jazz", "Time": "10:00 PM", "Venue": "Khris Royal's KR4TET at Royal Frenchmen Hotel", "moreBioInfo": "Khris Royal was born to be a musician. This young and exceptional New Orleans native began playing the saxophone at seven years old, and producing and writing music at fourteen. Royal’s musical talents were nurtured at the New Orleans Center for the Creative Arts (NOCCA) High School, in classrooms once shared by jazz greats such as Wynton Marsalis, Branford Marsalis, Terrence Blanchard, and Donald Harrison. When Royal was only 16, he was granted a full scholarship to the prestigious Berklee College of Music in Boston, MA and his career has taken off since then. To date, Royal has played with hip-hop giants and jazz and funk legends alike, from Lettuce, to Bobby Brown, Alvin Batiste, Ellis Marsalis, Christian Scott, Branford, Delfeayo and Jason Marsalis, Tony Clifton, The Sam Kininger Band, and Johnta Austin. The impressive young artist has recorded with Mary J. Blige, Ashanti, Nelly and The Game, Erykah Badu, Goapele, D.J. Quick, and is also featured with the Regiment on Season 2 of The Boondocks. Royal has developed relationships with prominent New Orleans artists as well, such as George Porter Jr., Zigaboo Modeliste, Fred Wesley, Big Sam’s Funky Nation, Galactic, and countless more. The range of Khris’ musical relationships is versatile and reflects the scope of his talent. Although Royal continues to expand and develop his craft, from Jazz, hip-hop, rock, soul, electronic, funk, R & B, Blues, and Reggae –musically, there is not much Khris Royal has not already mastered and incorporated into his unique style. In addition to leading his own band, Khris Royal & Dark Matter (see below), Khris Royal has been the only horn player in George Porter Jr. & the Runnin’ Pardners since Fall 2009. In 2011, Royal joined as a touring member of the popular West Coast rock/reggae band, Rebelution.", "otherInfo": "The Khris Royal Quartet featuring\nKhris Royal, Conun Pappas, Max Moran and Trenton O'neal.\nKhris Royal was born to be a musician. This young and exceptional New Orleans native began playing the saxophone at seven years old, and producing and writing music at fourteen. Royal’s musical talents were nurtured at the New Orleans Center for the Creative Arts (NOCCA) High School, in classrooms once shared by jazz greats such as Wynton Marsalis, Branford Marsalis, Terrence Blanchard, and Donald Harrison. When Royal was only 16, he was granted a full scholarship to the prestigious Berklee College of Music in Boston, MA and his career has taken off since then.\nTo date, Royal has played with hip-hop giants and jazz and funk legends alike, from Lettuce, to Bobby Brown, Alvin Batiste, Ellis Marsalis, Christian Scott, Branford, Delfeayo and Jason Marsalis, Tony Clifton, The Sam Kininger Band, and Johnta Austin. The impressive young artist has recorded with Mary J. Blige, Ashanti, Nelly and The Game, Erykah Badu, Goapele, D.J. Quick, and is also featured with the Regiment on Season 2 of The Boondocks. Royal has developed relationships with prominent New Orleans artists as well, such as George Porter Jr., Zigaboo Modeliste, Fred Wesley, Big Sam’s Funky Nation, Galactic, and countless more. The range of Khris’ musical relationships is versatile and reflects the scope of his talent. Although Royal continues to expand and develop his craft, from Jazz, hip-hop, rock, soul, electronic, funk, R & B, Blues, and Reggae –musically, there is not much Khris Royal has not already mastered and incorporated into his unique style.\nIn addition to leading his own band, Khris Royal & Dark Matter (see below), Khris Royal has been the only horn player in George Porter Jr. & the Runnin’ Pardners since Fall 2009. In 2011, Royal joined as a touring member of the popular West Coast rock/reggae band, Rebelution"}, {"Address": "1614, New Orleans, LA 70116", "Artist": "Amina Scott ", "ArtistImage": "https://photos.bandsintown.com/thumb/9613226.jpeg", "Coordinates": [29.9646278, -90.0579607], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Royal Frenchmen Hotel and Bar", "moreBioInfo": "Hailing from Oakland, CA, Amina Scott is a bassist and composer. Having relocated to New Orleans, LA in 2012, she has since been playing with the New Orleans Jazz Orchestra. She has also played with Steve Turre, David Murray, Joanne Brackeen, Nicholas Payton, Christian Scott Atunde Adjuah, and more.", "otherInfo": "No event info available"}]