var nyc_events = [{"Address": "196 Allen St, New York, NY 10002", "Artist": "Casey Shea ", "ArtistImage": "https://photos.bandsintown.com/thumb/6323354.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Indie, Alternative, Folk, Classic Rock, Rock", "Time": "12:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Shea's riding high in the New York scene. One of many great young artists selling songs extremely cheap for fans at AmieStreet.com", "otherInfo": "Live Stream: http://instagram.com/rockwoodmusichall\nRockwood LiveStream Concerts are taking place at 8:00 and 10:00PM EST nightly as we strive to continue bringing you live music during this period of temporary closure.\n\nAll live streams can be found at @RockwoodMusicHall on Instagram Live and all donations given will be split between the Artist streaming, and the venue's staff until we can reopen. NOTE: Instagram Live is only available on mobile and tablets.\n\nPlease RSVP and consider donating. All RSVPs will receive an email reminder 10 minutes before the set is scheduled to begin."}, {"Address": "32 Avenue A, New York, NY 10009", "Artist": "Emily Gabriele ", "ArtistImage": "https://photos.bandsintown.com/thumb/8968164.jpeg", "Coordinates": [-73.985333, 40.723332], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Soul, Blues, Blues Roots, Pop", "Time": "9:30 PM UTC", "Venue": "Mary O's", "moreBioInfo": "Jersey soul. NYC blues.\n\nCheck out my project, \"Special Delivery\" on all streaming platforms.", "otherInfo": "Victor V. Gurbo & Roomful of Sky Music present:\nThe FIRST TUESDAY of every month!\n\nFive Hours of LIVE MUSIC (with no cover charge-- only a $15.00 minimum), while you eat, drink, and hang out at MARY O's, the East Village's greatest Irish Pub & restaurant!!\n\nTues, April 7th, 2020\nMary O's\n32 Avenue A\n(between 2nd & 3rd St)\nNew York, NY 10009\n\nDoors: 5:00pm\nMusic: 6:00pm to 11:00pm\nALL AGES\nVenue Serves Food\nNO COVER ($15.00 minimum)\n\nCome for dinner, drinks, and music in the East Village's greatest Irish Pub! Curated by your hosts, PHIL & VICTOR, each month features a rotating roster of some of NYC's best musical talent!! Mary O's is a celebration of the best that Ireland has to offer: great music, fabulous food, and lively conversation. Come join our scene!\n\nStay for as little or as long as you like-- There's no cover charge, but there IS a $15.00 minimum. And feel free to TIP the musicians :-)\n\n______________\nFeaturing:\n\n1. Emily Gabriele (6pm)\nhttps://www.facebook.com/EGmusicNYC\nhttps://www.instagram.com/EGmusicNYC\n\n2. Victor V. Gurbo (7pm)\nhttps://www.facebook.com/VictorVGurbo\nhttps://www.instagram.com/VictorVGurbo\n\n3. Abigail Lumsden (8pm)\nhttps://www.facebook.com/aalumsdenmusic\nhttps://www.instagram.com/abiwhale57\n\n4. Phil Robinson (9pm)\nhttps://www.facebook.com/PhilRobinsonMusic\nhttps://www.instagram.com/PhilRobinsonMusic\n\n5. Jason Vitelli (10pm)\nhttps://www.facebook.com/JasonVitelliMusic\nhttps://www.instagram.com/JasonVitelliMusic"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Aberdeen (the band) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9924510.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Brass, Instrumental, Jazz, Rock", "Time": "10:00 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Aberdeen is a jazz / indie rock brass band based out of Brooklyn, NY. They create a wall of sound with soaring, horn-driven melodies, supported by a bed of distorted guitars and raucous drums. Brian Plautz is the primary songwriter in the band, along with Alex Conroy and Shubh Saran. The band, featuring saxophones, trombone, trumpet, two guitars, bass and drums never ceases to fill a room with energy. Aberdeen's 2019 debut album Downpour showcases their massive, one-of-a-kind sound, featuring Grammy Award-winning saxophonist Bob Reynolds (John Mayer, Snarky Puppy) and bassist Adam Neely, who hosts a 900,000+ subscriber music channel on YouTube. Demonstrated during Aberdeen's 2019 U.S. State Department tour to Central Asia, Aberdeen's music is about community; a large collective of musicians with the hope of sharing its music to audiences throughout the world.", "otherInfo": "Aberdeen will be canceling/postponing our upcoming spring tour due to the COVID-19 pandemic. Let's stick together during this crazy time (emotionally, not physically) and follow the recommendations as laid out by the CDC.\nTuesday, April 7th, 2020\nTickets: $12\nAges: 21+\nDoors: 6:00pm\nShow: 8:00pm"}, {"Address": "111 E 48th St, New York, NY 10017", "Artist": "Yacine Boulares ", "ArtistImage": "https://photos.bandsintown.com/thumb/8202369.jpeg", "Coordinates": [-73.97423, 40.75574], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "New York, New York", "Time": "10:30 PM UTC", "Venue": "InterContinental New York Barclay", "moreBioInfo": "Yacine Boulares is a French-Tunisian saxophonist, clarinetist and composer based in New York.\n\nAfter graduating with a BA in Philosophy Yacine Boulares decides to take a year off to respond to the urge to play music. He takes his first music lessons and after studying under Andre Villeger for 3 years he wins the Esprit Jazz Festival Competition in Paris and is endorsed by Selmer saxophones (2006) A year later he enters the Conservatoire National Supérieur de Musique de Paris where his horizons broaden under the influence of peers and mentors such as Riccardo Del Fra and Francois Theberge. He soon understands the necessity to go to the roots of Jazz and in 2009 he is granted a Fulbright Scholarship to study at the New School for Jazz and Contemporary music on a merit scholarship.\n\nIn New York, the dream of meeting and playing with his idols becomes true and Yacine gets to learn from Chris Cheek, Donny Mc Caslin, Reggie Workman and with countless musicians who inspire him daily. But New York also exposes him to a myriad of different musics. Soon he is part of ex Fela Kuti' drummer Jojo Kuo' Afrobeat Collective, of late Cameroonian singer Martino Atangana's African Blue Note, of Haitian Kompa legends Tabou Combo. In their musics, he finds a deep echo to his North African roots and the Bikutsi rhythms from Cameroon become reminiscent of the trance rhythms and musics from Tunisia.\n\nThese influences urge him to find his own identity and his explorations of Cameroonian dance rhythms lead to the creation of the band AJOYO, a mystic brew of African tradition, jazz and soul. Yacine signs the music and lyrics of a repertoire that celebrates life, love and justice. The album is released in 2015 on Ropeadope Records and played on radios throughout the world from New Yorks' WNYC to French RFI, London's Jazz FM, National radio in Brazil, South Africa, Nigeria...\n\nIn the meantime, Yacine continues to play as a sideman both in the jazz repertoire with the likes of Sheila Jordan, Theo Bleckman and Becca Stevens and for various projects such as Japanese singer/songwriter Senri Oe (3 albums for Sony Japan).\n\nIn 2014 he is part of an intimate band picked by producer and arranger Robert Sadin to accompany Opera legend Placido Domingo on his remarkable record Encanto Del Mar. Yacine is featured both as a soloist and arranger of the Andalucian standard Lamma Bada and gets the chance to work closely with Ira Coleman, Mark Feldman, Rhani Khridja, Chico Pinheiro and Bridget Kibbey. This is also where he meets cellist Vincent Segal and gets the idea to explore the tunisian Stambeli repertoire with Vincent on cello and drummer Nasheet Waits.\n\nIn 2015 this project is granted the French American Jazz Exchange. The trio album will be recorded and released in 2017 with the French label Accords Croises.\n\nConcurrently to his activities as a performer and a composer, Yacine teaches song-writing at the French Heritage Language Program. In 2014 he is commissioned to compose a Musical telling the story of underserved French speaking African and Haitian communities in the USA. The show Amidou & Toya was premiered in NY in May 2014. Yacine is a D'Addario woodwinds and Lebayle Mouthpieces artist.", "otherInfo": "No other event info available"}, {"Address": "1286 Hicksville Rd, Massapequa, NY 11758", "Artist": "Cuthbert Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/9298868.jpeg", "Coordinates": [-73.48267, 40.71377], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rock, Country And Soul., Pop", "Time": "11:30 PM UTC", "Venue": "Paddy's Loft", "moreBioInfo": "Paul C. Cuthbert is a singer/songwriter, covering multiple music genres.\n\nHe is also the owner of Rock Beach Music Co. where he fronts multiple music acts.", "otherInfo": "☘️Join Paul live every Tuesday night at Paddy's Loft - Irish Pub and Restaurant - Massapequa. New York. 7:30pm to 10:30pm.\n\nTwo for Tuesdays drinks and apps! Fine dining. Authentic Irish Pub. Best Pint of Guinness in New York! Sports on all Tv's.\n\nJoin us for a song and a pint! Slainte!🍻"}, {"Address": "183 W 10th St, New York, NY 10014", "Artist": "Andrea Brachfeld ", "ArtistImage": "https://photos.bandsintown.com/thumb/7248149.jpeg", "Coordinates": [-74.002722, 40.734367], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Jazz", "Time": "11:30 PM UTC", "Venue": "Smalls Jazz Club", "moreBioInfo": "Flutist, composer, arranger, producer, educator, business owner, Andrea Brachfeld, is a graduate of The High School of Music and Art and Manhattan School of Music. Over these past 30 years she has recorded more than a dozen CD's with many artists including, Wayne Wallace, Bobby Carcasses, Africando, Oscar Hernandez (Spanish Harlem Orchestra) and Timbalaye. Her breakthrough performance as the flutist for the popular Latin band Charanga '76, catapulted her into Salsa history and fame as the first female flutist to play this music in the United States. While in high school she received the \"Louis Armstrong Award for Outstanding Student\" from Jazz Interactions . Study with Hubert Laws, Jimmy Heath, and Mike Longo helped her develop her own style. Downbeat magazine referred to Andrea as \"one of the finest jazz flutists around.\" She has twice been the recipient of the Latin New York Music Award as a flutist. She has performed with Dave Valentín, Nestor Torres, Tito Puente, and Ray Barretto among others. While in Venezuela, she had the honor of opening for Chick Corea, and Paco de Lucia. She was recently awarded the Chico O'Farrill Lifetime Achievement Award from Latin Jazz USA. Her first Latin Jazz CD, \"Remembered Dreams\" combines Latin originals with contemporary jazz cuts. Her second CD, \"Back With Sweet Passion\", is a dynamic Salsa recording featuring Grammy winner Oscar Hernandez on piano, and Alfredo De La Fey on violin. Her third CD \"Beyond Standards\" is a collaborative effort with Chembo Corniel, featuring jazz greats Hilton Ruiz on piano and Steve Turre on trombone. She has appeared with the Winnipeg Jazz Orchestra as a soloist performing her own compositions as well as those of Mike Longo, longtime musical director for Dizzy Gillespie. She is currently performing with her own group Phoenix Rising, and her latest Latin Jazz CD is ,\"Into the World: A Musical Offering\" with guest artists Mike Longo, Paul West and Brian Lynch. Awards: * Louis Armstrong Award for Outstanding Student from Jazz Interactions * Latin New York Music Award - Twice the recipient for flutist * Chico O'Farrill Lifetime Achievement Award - Latin Jazz USA * Tribute to Women in Salsa - Salsation Productions, Washington DC * Nominated as Best Latin Jazz flutist - Chip Boaz - Latin Jazz Corner * Pionero Award-2010 1st Annual New York Latin Music Award * Louis Armstrong Award for Outstanding Student from Jazz Interactions Andrea Brachfeld is an accomplished musician, composer, and educator. She has seven CDs out as a leader with the latest, 'Lotus Blossom' relwased in Oct.", "otherInfo": "No other event info available"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "Kosha Dillz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9116730.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Alternative, User Friendly, Hip Hop, Indie", "Time": "12:00 AM UTC", "Venue": "Pianos", "moreBioInfo": "Some say Kosha Dillz, or Rami Even-Esh, is the most interesting rapper in the world. Others like Source Magazine call him \"The hardest working man in Hip Hop.\" From a New Jersey born and bred artist to a Los Angeles transplant, his music has had him go from Super Bowl Commercials to world wide tours with Wu Tang Clan and Matisyahu, with the punk rock attitude of hip hop on the Vans Warped Tour. He most recently played Coachella, curated a viral Passover Seder that took on Kanye West's Sunday Service, and is a playable character in NBA 2k alongside Snoop Dogg and Drake. While many may take his name to be a \"Jewish rapper,\" his stories combine familyculture and personal tales of spirituality battling against the struggles of his addiction and unchained relationships for the artist who has lived on the road for the past ten years. Highly known for being an improv rapper, Dillz has a Ted Talk called \"Freestyle Rap Saved My Life\" and that can best describe how if given 18 minutes, you can change an entire world perspective on anything.\n\nWanna see a show? Prepare to have your perspective changed. It is a goof thing.", "otherInfo": "Kosha Dillz\nAlbum release pary\nNobody Cares Except You."}, {"Address": "95 Stanton St, New York, NY 10002", "Artist": "Jeff Litman, Guitarist/Multi-Instrumentalist ", "ArtistImage": "https://photos.bandsintown.com/thumb/7414154.jpeg", "Coordinates": [-73.988383, 40.721329], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Arlene's Grocery", "moreBioInfo": "No artist bio available", "otherInfo": "Postponed due to Coronavirus. New date TBD."}, {"Address": "915 Wyckoff Ave, Queens, NY 11385", "Artist": "Georgia Maq ", "ArtistImage": "https://photos.bandsintown.com/thumb/10145952.jpeg", "Coordinates": [-73.906299, 40.696974], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Pop", "Time": "12:00 AM UTC", "Venue": "Trans-Pecos", "moreBioInfo": "Georgia McDonald has established herself in recent years as the singer and guitarist of Melbourne, Australia indie rock band Camp Cope, whose sophomore album How to Socialise and Make Friends (Run For Cover/Poison City Records) won widespread acclaim, topping a slew of 2018 end of year lists including NPR, Pitchfork, Billboard, Bandcamp, Stereogum, The Guardian, and Brooklyn Vegan.\n\nThe impact of the trio's music on the indie landscape has been undeniable, with McDonald emerging as a brave, resilient, and often politicized figure. Using her formidable voice to fight for the betterment of the music industry and rally against sexism, racism and all forms of structural inequality, she has never shied away from the uncomfortable and difficult topics that dominate the news cycle.\n\nSo when McDonald describes her debut solo album, Pleaser (Run For Cover/Poison City Records) as \"a love album\", it's immediately clear that this is a step in a different artistic direction. \"I think the main theme is love, obviously, all kinds of love. Love that you walked away from so you could love yourself, unrequited love, forgiving love, love with no point to it,\" she explains.\n\nThe album opens strategically with \"Away From Love\" - the only time guitar is featured on all of Pleaser, with the rest of the album done entirely electronically. \"Away From Love\" and \"Like A Shadow\" were recorded with Darcy Baylis, while the other songs on the record were produced by Run For Cover Records labelmate Katie Dey.\n\nPleaser's 8 tracks shimmer and pulsate, calling to mind pop artists like Lorde, Robyn, Charli XCX and Gwen Stefani. \"I took more time to record the songs and play around with them, and I liked that because I could change things and experiment more,\" McDonald says, continuing \"I think the pressure of working with other people drove me to finish the songs, which I hated but also loved because it's nice to be challenged.\"\n\nWhile McDonald may have felt challenged while writing Pleaser, the experience of listening to the album is anything but difficult. Its unapologetic pop sentiments shine and delight, McDonald's gorgeous alto soaring above each track. It's a record listeners will find themselves quickly falling in love with and returning to again and again - and really, in times like these, who doesn't need more love songs?", "otherInfo": "〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️"}, {"Address": "80 N 6th St, Brooklyn, NY 11249", "Artist": "Jenny Hval ", "ArtistImage": "https://photos.bandsintown.com/thumb/9763268.jpeg", "Coordinates": [-73.961212, 40.718958], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Experimental Folk, Electronic, Avant-garde, Art Pop, Pop", "Time": "12:00 AM UTC", "Venue": "National Sawdust", "moreBioInfo": "Norwegian artist, musician and writer.", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Snack Cat ", "ArtistImage": "https://photos.bandsintown.com/thumb/8776067.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Aleksi Glick- lead guitar vocals, Jeff Koch- bass, Nathan Ellman-Bell- Drums, Seth Weaver - backup vocalstrombone, David Engelhard- sax, Sharik Hasan- keys, Pete Ayres- Vocals, Alita Moses- vocals, Owen Broder- sax, Bailen- Vocals, Rachel Madison- vocals, Colemen Bartels- Drums, Ethan O'Reilly- bass", "Time": "12:00 AM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Snack Cat is a musical collective lead by guitarist Aleksi Glick, that comprises and features of some of NYC's best and most respected young musicians. The groups sound is a cross between soul/rock/jazz/ blues and funk During there short time together Snack Cat has already played some of NY's top venues such as Rockwood Music Hall, Mercury Lounge, The Bowery Electric, Groove and C'mon Everybody.\nThe bands members have played many of the countries top venues including The Kennedy Center, Jazz at Lincoln Center, The Blue Note, The Music Hall of Williamsburg, The Meadowlands, The Jazz Standard, Webster Hall, Summerfest, The Iridum, The Montreux Jazz Festival and Avery Fischer Hall.", "otherInfo": "No other event info available"}, {"Address": "349 W 46th St, New York, NY 10036", "Artist": "John Dokes ", "ArtistImage": "https://photos.bandsintown.com/thumb/9105080.jpeg", "Coordinates": [-73.989737, 40.760666], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Swing, Jazz, Male Jazz Vocal, Jazz Vocals, Standards", "Time": "12:30 AM UTC", "Venue": "Swing 46 Jazz and Supper Club", "moreBioInfo": "There’s a love song to capture every aspect of romance, from the unrequited to the tempestuous. With True Love (released on May 3 via Rondette Jazz), vocalist John Dokes turns his attention, and his elegant baritone, to something deeper. Over the course of ten well-chosen songs and an equally diverse range of moods, Dokes explores the more profound, committed side of affairs of the heart, bringing soulful nuance and hard-earned wisdom to each tale of ardent amour.\n\nAs Dokes makes clear with each knowing inflection and wry turn of phrase, committed love doesn’t necessarily translate into comfortable routine. Throughout the album’s ten songs, Dokes imbues each lyric with smoldering passion or heart-wrenching loss, all the more affecting for being so deeply felt. Even in his suave delivery of the album’s sole original track, “Cool Enough,” the crooner undercuts his dapper cool with a tinge of self-doubt, pleading to know, “Am I cool?”\n\nThough he may have his moments of uncertainty, there’s little question while listening to True Love that Dokes falls squarely into the “cool” camp. Formerly a champion lindy hopper, he continues to get audiences dancing in his regular gig singing with the George Gee Big Band; he carries the same self-confidence from the ballroom to the boardroom, as the Chief Content Officer and President of Accuweather Network, following similarly successful tenures at Viacom and Marvel Entertainment.\n\nWhen working with the world-class quartet on True Love, though, the executive suite is the furthest thing from Dokes’ mind. The album is the second in a planned trilogy, each of which pairs Dokes with a different frontline horn. The first was 2017’s Forever Reasons, his initial small group endeavor (following his big band debut, John Dokes Sings, George Gee Swings), which featured trombonist David Gibson with the same rhythm section as this release: pianist Steve Einerson (Eric Alexander, Eddie Henderson), bassist Alex Claffy (Kurt Rosenwinkel, Jimmy Cobb), and drummer Lawrence Leathers (Cécile McLorin Salvant, Aaron Diehl).\n\nOn True Love they’re joined by alto saxophonist Mark Gross (Delfeayo Marsalis, Dave Holland), whose sinuous tone is an ideal match for Dokes’ dulcet baritone. Their chemistry is immediately apparent on “A Sleepin’ Bee,” the opening track, calling to mind the playful back-and-forth between Nancy Wilson and Cannonball Adderley on their immortal 1961 rendition, which inspired Dokes to include the song here. The song’s lyric, by writer Truman Capote, also lends the album its title, as Dokes concludes the song by repeating the phrase like an echoing memory.", "otherInfo": "No other event info available"}, {"Address": "709 Lorimer St, Brooklyn, NY 11211", "Artist": "Deborah C Smith ", "ArtistImage": "https://photos.bandsintown.com/thumb/10014248.jpeg", "Coordinates": [-73.950162, 40.718099], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Folk, Rock, Americana", "Time": "12:30 AM UTC", "Venue": "Pete's Candy Store", "moreBioInfo": "DeborahCSmith is a Singer/Songwriter, rhythm guitarist and recording artist living in Brooklyn, NY. Recent album, Hearing In the Bardo, is available where ever you get music, buy it on Bandcamp, iTunes, CDBaby or from me in person at a show!\n\nHosting a Songwriting Residency live at Pete's Candy Store (Brooklyn) in January 2020 and recording a new album of songs for release in Spring 2020.", "otherInfo": "Songwriting Workshop!\n\nEach live performance features new songs written based on a prompt posted in the group. Live performers are selected in advance based on availability.\n\n\nThe First Tuesday of the Month at Pete's Candy Store in Brooklyn, NY\n8:30 PM - 10:30 PM\n\nBasic Rules:\n\nGet the song prompt or assignment and write a new song.\n\nIf you're participating online:\nType out the lyrics (if you have lyrics) and share\n\nUpload a listenable version of your tune by the deadline.\n\nListen to others songs and comment!\n\nPerforming on Stage:\n\nYou'll receive a specific email with details of our show night and what to expect."}, {"Address": "242 5th Ave, Brooklyn, NY 11215", "Artist": "Mareike Wiening ", "ArtistImage": "https://photos.bandsintown.com/thumb/8994407.jpeg", "Coordinates": [-73.981253, 40.675478], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Music", "Time": "1:00 AM UTC", "Venue": "Seeds::brooklyn", "moreBioInfo": "www.mareikewiening.com\nhttps://mareikewiening.bandcamp.com\nMareike Wiening is a German jazz drummer and composer based in New York City and Germany", "otherInfo": "No other event info available"}, {"Address": "254 W 54th St, New York, NY 10019", "Artist": "Constantine Maroulis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9494817.jpeg", "Coordinates": [-73.98374, 40.76428], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rockers, Rock Of Ages, Producer Of Spring Awakening, Dreamer, Broadway, Musical Theater, Actor, Rock, Singer & Songwriter, Songwriter, Father", "Time": "1:00 AM UTC", "Venue": "54 Below", "moreBioInfo": "Constantine Maroulis is an accomplished actor, producer, singer and songwriter best known for his Tony-nominated performance in Rock of Ages and his epic run as a finalist during the heyday of “American Idol.”\n\nRecently Constantine joined forces with legendary Guns N Roses drummer Steven Adler, touring the world as Adler’s Appetite featuring Constantine Maroulis. With over 100 million records sold worldwide and his 2012 induction into the Rock and Roll Hall of Fame, Steven has solidified his contribution to Rock and Roll history. Drawing from both Constantine's and Adler's unique musical backgrounds, they are about to unveil a show like none other - delivering GN'Rs iconic songs, the ideas that inspired them, and far more.... Constantine is also developing a number of creative projects in TV and film, including Tony Nominated work as a producer of Broadway’s revival of Deaf West's Spring Awakening, as well as recently releasing the singles, “All About You”, “Here I Come” and “She’s Just Rock N Roll,” from his upcoming album slated for a 2018 release. Additionally, Constantine recently played Judas in the MUNY production of Jesus Christ Superstar, and Che in the North Shore production of Evita.\n\nFor all things Constantine Maroulis, please visit www.ConstantineMaroulis.com", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Noah Gundersen ", "ArtistImage": "https://photos.bandsintown.com/thumb/9170398.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Songwriter", "Time": "2:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Born to a devoutly religious family in Olympia, WA, Noah Gundersen has been writing and recording music since he was but 13, working his way from teenage hardcore and indie rock to the creation of his own distinctive strain of bold, genre-busting songcraft. A series of solo EPs – including 2011’s breakthrough FAMILY – eventually led to 2014’s self-produced full-length debut, LEDGES. CARRY THE GHOST arrived the following year, earning acclaim from the likes of NPR.\n\nNoah continued to gain popularity after his music was featured on television shows like Sons of Anarchy, The Vampire Diaries, One Tree Hill and Nashville. Ever searching, he impelled his music towards new terrain on 2017’s WHITE NOISE, melding his increasingly potent lyrical motifs with complex electronics and startling levels of sonic intensity. The album reaped a whirlwind of critical acclaim upon its 2017 release. Consequence of Sound wrote, “...the Seattle native has evolved to become an even more striking musician, his lyrics not only burning brighter, but his arrangements fuller and more intense to match their maker.”\n\nAlong with his recorded canon, Gundersen – who also maintains membership in Seattle indie rock heroes Young In The City and the all-star Americana collective known as Glorietta – has spent much of his adult life on the road, performing as headline act and support to like-minded artists spanning Emmylou Harris, Beck, City & Colour, and Josh Ritter.", "otherInfo": "Live Stream: https://www.eventbrite.com/e/live-stream-noah-gundersen-tickets-101896473094"}, {"Address": "234 Starr St, Brooklyn, NY 11237", "Artist": "Mo Lowda & The Humble ", "ArtistImage": "https://photos.bandsintown.com/thumb/9215001.jpeg", "Coordinates": [-73.922471, 40.705626], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Alternative, Indie Rock", "Time": "2:00 PM UTC", "Venue": "The Sultan Room", "moreBioInfo": "Born out of the house show scene in Philadelphia, Mo Lowda & the Humble is an indie rock band that has since evolved into a nationally and internationally touring act. Coming off of their latest full-length release, 'Creatures' (2018), the band averages 100+ tour dates a year, including festivals like Firefly, Peach Fest, Mountain Jam, and more. Their tight grooves provide the foundation for textural guitars and memorable vocal melodies. Toeing the line between precision and spontaneity, the band creates a unique, interactive experience every time they hit the stage.\nThey might go to the bar with you after the show... but be cool, man. They are set to release their third studio album in early 2020 with a full US tour to follow.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Morgan James ", "ArtistImage": "https://photos.bandsintown.com/thumb/9814141.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Pop, R&b, Soul", "Time": "9:00 PM UTC", "Venue": "Stageit Livestream", "moreBioInfo": "One voice is all it takes. The right vocalist can make you fall in love at first listen, elicit tears, or bring you back to a different era altogether. A microphone and a stage remain the only necessities. That holds true for New York-based singer and songwriter Morgan James. On her full-length debut for Epic Records, Hunter, she casts an unbreakable spell with a powerhouse voice equally inspired by smoky soul, swaggering R&B, theatrical swing, and a virtuosic classical poise.\n\nThe Idaho native discovered her passion for music early on and pursued it\nwholeheartedly at the prestigious Juilliard School. While in the midst of the institution's rigorous academic program, she soon realized that her path would diverge from the classical world. \"I didn't want a career in opera, but Juilliard still shaped me,\" she confesses. \"The traditional training really made me a disciplined singer. I carry that with me to this day.\"\n\nAfter graduating, Morgan spent the next few years facing the proverbial struggles of being a young artist in New York. Low on money, she bounced back and forth between bartending and restaurant gigs while fighting to survive. Immersed in classic sixties and seventies soul records, she concurrently experienced a pivotal revelation. \"Out of that frustration came this other voice,\" she says. \"It was my true voice, and I feel like I discovered it in the middle of so much hardship just trying to be heard. I embraced who I was at that very moment.\"\n\nSoon, she would be heard in a big way. In 2008, Morgan booked her first Broadway show—appearing in The Addams Family alongside Nathan Lane, as well as in prominent and leading roles in Wonderland, Godspell (Turn Back, O Man), and Berry Gordy's Motown The Musical as Teena Marie. The latter set the stage for her to\nproperly launch her solo career. Gordy recognized the vocalist's immense talent, and introduced her to Doug Morris and L.A. Reid, opening the door for a deal with Epic Records in 2012.\n\nAround the same time, Morgan booked a landmark show at Dizzy’s Club Coca-Cola, where she paid tribute to Nina Simone with a set of songs that were closely associated with the legendary artist. The incendiary show was recorded and released as the critically acclaimed Morgan James Live on Epic Records. It also proved to be the perfect segue for her first studio album, released in June of 2014.\n\n\"I always knew to make a neo-soul pop record,\" Morgan says. \"The foundation is all real ingredients, and those roots of soul and R&B are pretty strong. It's the culmination of my musical life up to this point. The painful songs are straight out of a bad relationship with someone from my past. The joyful moments are wonderful memories. It's all coming from me. I've lived every one of these stories, and I love the genres I'm representing. It's one point-of-view—mine.\"\n\nThe title track and album opener \"Hunter\" boasts a seductive hook with cinematic noir flair. Flaunting the singer's immense delivery and dynamic presence, it's an undeniable and classy come-on that proves as animalistic as it does magnetic. \"From a woman's perspective, it's such an empowering and sexy song,\" she smiles. \"It totally makes me feel like a warrior! Music is so sensual and life-affirming. That's what I look for. You don't often see a girl take this position, and that's what I love about it!\"\n\nMorgan assumed co-writing duties on eight of the collection's fourteen tracks and even performed all of her own background vocals and harmonies. From the empowering farewell of \"Fed Up On You\" to the mournful rumination of \"You Never Lied\", she continually bares it all—both emotionally and musically. \"I sing like I'm never going to sing ever again,\" Morgan affirms. \"I wanted to capture that power and passion every time. At some moments, it might sound flawless; at others, it might sound like it's going to break. I'm revealing something about myself with\nevery song. You've got to do that. My favorite artists, whether Joni Mitchell or Michael Jackson, are and were, always honest.\"\n\nThere's a unique structure to the album. The first five songs boast electronic elements, while the last six don't have any. \"There's a gradient of the record that goes down,\" she says. \"By the time you get to the last song, it's just piano and voice. It starts with a song about power and ego, and it ends on one about surrender and selflessness. I have all of that in me. Maybe we all do.\"\n\nUltimately, her honesty permeates everything that Morgan James does, and it's why you'll always remember her voice. \"I want people to walk away from this album feeling fulfilled. That's the way it used to be. Often, I think I'm from another time,” she says, her voice trailing off. “I just want to bring back the power of the singular legacy voice.\"", "otherInfo": "No other event info available"}, {"Address": "315 West 44th St, New York, NY 10036", "Artist": "Ben Allison ", "ArtistImage": "https://photos.bandsintown.com/thumb/9187978.jpeg", "Coordinates": [-73.989689, 40.759], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Film Music, Improvisation, Jazz, Instrumental, Rock, Other", "Time": "11:00 PM UTC", "Venue": "Birdland", "moreBioInfo": "Bassist/Composer/Producer/Educator Ben Allison has developed an international reputation as a performer, composer and producer and is a leading voice in contemporary jazz. Ben has organized and performed on over 150 tours, winning fans and building new audiences throughout the world with an adventurous yet accessible sound and a flair for the unexpected.\n\nBen has released 13 albums of original music, 7 of which topped the national jazz radio charts, garnering him 9 SESAC Performance Awards. His most recent album, Quiet Revolution is the 3rd to be released on his own Sonic Camera Records label, following 2017’s Layers of the City.\n\nAt the age of 25, Ben formed the Jazz Composers Collective, a non-profit organization that fostered and presented new music. He acted as the Collective’s Artistic Director from 1992 until 2005.\n\nHe currently serves as President of the New York Chapter of the Recording Academy and sits on the organization’s Presidents Council. In 2012, he represented the Recording Academy when he testified before Congress on issues relating to performing rights for artists. He has also served as Vice President, Chair of the Advocacy Committee and organized the first ever Grammy Town Hall in 2015.\n\nBen has written articles for Downbeat, JazzTimes, the IAJE Journal, Premier Guitar, Bass Player as well as his own blog at www.benallison.com/blog. He wrote the theme for the popular NPR radio program On The Media, which is heard by over 1,500,000 listeners weekly, and was a featured composer and performer with the Jazz Sinfonica, 80-piece symphony orchestra, Sao Paulo, Brazil, in 2005, 2008 and 2013. He has conducted residencies and workshops in over 100 universities and conservatories throughout the world.\n\nBen is on the faculty of the New School for Jazz & Contemporary Music and Mannes College of Music in New York City, where he teaches Entrepreneurship in Music, The Entrepreneurial Musician, Senior Seminar, Music Tech Seminar, improvisation ensembles, bass and composition. He serves on the Jazz Executive Committee, which oversees curriculum development for the school.\n\nBen performed his Carnegie Hall debut in February 2012.", "otherInfo": "No other event info available"}, {"Address": "146 Broadway, Brooklyn, NY 11211", "Artist": "Saint PHNX ", "ArtistImage": "https://photos.bandsintown.com/thumb/9379434.jpeg", "Coordinates": [-73.963479, 40.7101], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Alternative, Rock", "Time": "11:00 PM UTC", "Venue": "Baby's All Right", "moreBioInfo": "ᶲ rhythm and face ᶲ (pronounced SAINT PHOENIX)", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Lucy Kitt ", "ArtistImage": "https://photos.bandsintown.com/thumb/8152586.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Lucy Kitt has been writing, performing and promoting her music as an unsigned singer-songwriter for the past 15 years.\nBorn in Upminster, into a music loving family she was raised by her mother and two older siblings. With Lucy’s father being a talented guitar player, it was only a matter of time before Lucy picked up the guitar herself.\n\nFrom the age of 16 she formed a riot girl grunge band ‘Ostara’ with her cousin and two friends. Performing around the gritty nightclubs and bars of the East end of London is where Lucy found her love of playing live.\n\nDuring her university days in Canterbury, Lucy started developing her song writing and soon became a feature on the local music scene. Strongly influenced by 70’s Folk Rock albums she heard growing up: artists like Bob Dylan, Joni Mitchell and Neil Young, Lucy writings are honest, and heartfelt accounts of her personal experiences during this poignant chapter of her life. Many of these songs feature on Lucy’s debut album ‘Stand by’, recorded over a time at SOUP analogue recording studios in London’s east end.\n\nPropelled by her semi-finalist status at the 2006 BBC Radio 2 Young Folk awards, the live music scene beckoned, and Lucy has supported a host of musical talent ever since, including Cara Dillon, Turin Brakes, The Unthanks, Pete Mollinari and Nick Mulvey. Major UK festival slots have included Cambridge Folk Festival, The Isle of Wight Festival, Secret Garden Party, and Lounge on the Farm, and Red Rooster Festival. Having won the 2014 Gibson/Sundance song writing competition, Lucy's songs have been placed firmly on the musical map. She has played gigs around the world, including Northern California, Sweden, Finland, Switzerland, and Germany.\n\nThe hugely successful internet sessions recorded for 'Mahogany', 'Balcony TV' and 'On't Sofa', provides a pathway for the world to discover Lucy's beautiful, vibrant, self-penned lyrics. 90,000 Sound cloud listeners eagerly await her debut album - she is now in the position where all this hard work could really start to shine.", "otherInfo": "Rockwood Music Hall has been a beacon of emerging and established music acts in NYC since 2005. Lucy Kitt brings her acoustic folk rock and heartfelt songs to New York for the first time ever, don't miss this one off show from a unique singer-songwriter from the UK."}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Jim Knable And The Randy Bandits ", "ArtistImage": "https://photos.bandsintown.com/thumb/10182311.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "No artist bio available", "otherInfo": "Jim Knable and The Randy Bandits play songs from the upcoming 2020 album and popular favorites from The Randy Bandits and Jim Knable back catalogs."}, {"Address": "66 North 6th St, Brooklyn, NY 11211", "Artist": "Magic Sword ", "ArtistImage": "https://photos.bandsintown.com/thumb/9668999.jpeg", "Coordinates": [-73.96168, 40.71925], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Electronic, Fantasy, Synth Pop, Darkwave, 80s", "Time": "11:00 PM UTC", "Venue": "Music Hall of Williamsburg", "moreBioInfo": "Ages ago, the immortal Dark One was freed from his prison. Since that time, the forces of good have been searching for the Light, the Chosen One to force him back into his cell. The key to this prison is the Magic Sword. Wielded by the proper soul, it will put the universe back in proper balance.\n\nThe Keeper of the Magic Sword is an old soul who searches endlessly for the Chosen One. With the help of other immortals, The Seer and The Weaver, they are ever trying to stem the tide of the Great Shadow from engulfing all life. When the need is great, they appear with the Magic Sword and a high stakes proposition for those who are pure of heart, perpetually hoping that their search is finally over. The hope is that one day soon one of those who wield the Magic Sword will in fact be the Chosen One, and the enormous power they wield from the Sword will be immeasurably amplified and drive the Shadowbringer back into his cage. Until that fateful day, The Dreadlords of the Nameless One continue to call forth the power of evil and destroy all that is pure and decent in the world with the malevolent forces of Darkness.", "otherInfo": "No other event info available"}, {"Address": "370 New York Ave, Huntington, NY 11743", "Artist": "Fetty Wap ", "ArtistImage": "https://photos.bandsintown.com/thumb/8430607.jpeg", "Coordinates": [-73.425768, 40.869652], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Hip Hop", "Time": "11:00 PM UTC", "Venue": "The Paramount", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Haley Reinhart ", "ArtistImage": "https://photos.bandsintown.com/thumb/9170725.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Pop, Jazz", "Time": "11:00 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Originally from the Chicago area, Reinhart was born into a musical family with a deep love of rock-and-roll, funk, jazz, classic pop, and the blues. In her early childhood, she started joining her parents’ rock band Midnight onstage and quickly found herself hooked on performing. \"One memory that stands out is my golden birthday, when I turned nine on September 9, 1999,” says Reinhart. \"My parents were playing a tattoo convention and there were all these tough-looking people and biker dudes there, and I got up to sing a LeAnn Rimes song with my hair in little Princess Leia buns. But then once I started singing it got so quiet and the tattoo machines all went off—everyone was listening to me. I was so overcome by it, I cried right afterward, but they were happy tears. I just thought to myself, ‘This is amazing.’” Through the years Reinhart continued singing with Midnight, and later joined a high school jazz band that led her to perform at major jazz festivals across Europe while still a teenager. She then studied jazz in college and, at age 20, landed a spot on season 10 of American Idol, eventually finishing in third place. The following year, Reinhart made her full-length debut with Listen Up!, a 2012 Interscope Records release that premiered at #17 on the Billboard 200 chart. A milestone year for Reinhart, 2015 marked the release of \"Can’t Help Falling in Love” (a song included on her 2016 sophomore album Better). Chosen as the unforgettable soundtrack to the Extra Gum ad spot \"The Story of Sarah and Juan,” Reinhart’s spellbinding rendition hit #1 on Spotify’s global viral chart in 2015 and has now amassed over 57 million streams on the platform. That same year, Reinhart began collaborating and touring with YouTube sensation Scott Bradlee’s Postmodern Jukebox, offering up jazz/ragtime/swing-inspired updates of songs like Radiohead’s \"Creep” and The White Stripes’ \"Seven Nation Army.” To date, Reinhart’s Postmodern Jukebox contributions have garnered more than 112 million views on YouTube. Pre-order new album \"What's That Sound?\" now at http://smarturl.it/whatsthatsoundhr", "otherInfo": "No other event info available"}, {"Address": "374 N Midland Ave, Saddle Brook, NJ 07663", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.107508, 40.910168], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Little Falls, New Jersey", "Time": "11:00 PM UTC", "Venue": "Midland Brew House", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "203 Broadway, Amityville, NY 11701", "Artist": "Reverend Jack ", "ArtistImage": "https://photos.bandsintown.com/thumb/9292939.jpeg", "Coordinates": [-73.417088, 40.678275], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Southern Rock", "Time": "11:00 PM UTC", "Venue": "The Warehouse", "moreBioInfo": "Formed out of the Kentucky summer heat of 2016; Reverend Jack is bringing Southern Hard Rock back to the masses!", "otherInfo": "No other event info available"}, {"Address": "233 Butler St, Brooklyn, NY 11217, USA, New York City, NY", "Artist": "Arthur Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8256495.jpeg", "Coordinates": [-73.986465, 40.682058], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Aviva Jaye, Martin D. Fowler, Lora-Faye Åshuvud, Nick Lerman, Cale Hawkins, Dave Palazola", "Time": "11:00 PM UTC", "Venue": "Public Records", "moreBioInfo": "Arthur Moon is the moniker of award-winning composer/singer Lora-Faye Åshuvud, who WNYC calls \"an artist bent on upending your expectations of what a pop song should sound like.\" Åshuvud writes her lyrics using cut up newspaper and magazine articles, and describes the process of composing the experimental pop arrangements as similarly collage-like. \"On the best days,\" she said in an interview with LPR, \"it feels like playing a rousing game of Exquisite Corpse--except only with myself.\" The band’s debut EP Our Head was released on Velvet Elk Records in the Spring of 2017, after their debut track/music video “Wind Up” premiered with NOWNESS the previous summer. The Arthur Moon band also includes Martin D Fowler (composer for This American Life and Limetown), Cale Hawkins (Quincy Jones, Wyclef Jean, Nikki Yanofsky), Aviva Jaye, Nick Lerman and Dave Palazola.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Jeffrey Pepper Rodgers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8737520.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Acoustic", "Time": "11:30 PM UTC", "Venue": "Online songwriting workshop", "moreBioInfo": "Jeffrey Pepper Rodgers is a grand prize winner of the John Lennon Songwriting Contest, a contributor to NPR’s All Things Considered, and the founding editor of Acoustic Guitar magazine.\n\n“Jeffrey Pepper Rodgers’ songs ring true and new. Spot-on work from an American wordsmith.”\n—Patty Larkin", "otherInfo": "Songwriting Sessions Online workshop with Jeffrey Pepper Rodgers, meeting four consecutive Wednesdays 7:30 to 9:30 pm Eastern."}, {"Address": "1160 Broadway 5th floor, New York, NY 10001", "Artist": "Milena Casado ", "ArtistImage": "https://photos.bandsintown.com/thumb/10212573.jpeg", "Coordinates": [-73.988693, 40.744678], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Contemporary Music, Jazz", "Time": "11:30 PM UTC", "Venue": "The Jazz Gallery, NYC", "moreBioInfo": "Milena Casado is a composer, flugelhorn and trumpet player from Spain. She has performed with artists such as Terri Lyne Carrington, Kenny Werner, John Patitucci, Kris Davis, Melissa Aldana, Jorge Rossy, Ben Street, George Garzone and Francisco Mela among others.\n?\nMilena started her musical career studying classical music. Thanks to a friend's father who was always playing jazz on the radio, she developed a love and connection for jazz that would take her to obtain the \"Ferrer Salat Joves Promeses\" scholarship to attend El Conservatori del Liceu in Barcelona in 2016. During that same year she was awarded a full scholarship to pursue her college degree at Berklee College of Music where she graduated in 2019. At Berklee she was part of the Berklee Global Jazz Institute, studying with artistic director Danilo Perez, Joe Lovano and Ben Street among others. Milena was also part of the Berklee jazz and Gender Justice institute studying with Terri Lyne Carrington and Kris Davis.\n\nDuring the course of her career apart from performing with well renowned artists at venues and festivals such as the Blue Note NYC, Dizzy's Club, Smalls Jazz Club, the Monterey Jazz Festival, the Washington DC Jazz Festival, the Toronto Jazz Festival and the Marciac Jazz Festival, she has been focusing on composing her own music, and performing her pieces in different settings which include trio, quartet, sextet and nonet.", "otherInfo": "Following her previous suites “Ithaka” and “Oda to the Crazy Times”, composer, flugelhorn and trumpet player Milena Casado will be premiering her latest suite, ¨Momentos\", at The Jazz Gallery alongside Kris Davis on piano, Ben Street on bass, and Eric McPherson on drums."}, {"Address": "330 7th Ave, New York, NY 10001", "Artist": "Alexandria Wreggelsworth, Soprano ", "ArtistImage": "https://photos.bandsintown.com/thumb/8539186.jpeg", "Coordinates": [-73.99335, 40.74777], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Opera Classical", "Time": "11:30 PM UTC", "Venue": "OPERA America's National Opera Center", "moreBioInfo": "American soprano Alexandria Wreggelsworth currently attends Guildhall School of Music and Drama. With the support of The Worshipful Company of Cordwainers, she is pursuing a Guildhall Artist Masters in Vocal Performance. She received a Bachelor’s Degree in Music at the University of Evansville and studied for two years at UMKC Conservatory of Music and Dance. In recent years, Alexandria has been seen in many opera scenes and full opera productions. In the most recent months, she has been cast in an array of scenes programs, performing the title role of Suor Angelica, Agathe, Donna Elvira, Salud (La Vida Breve), Alice (Falstaff), Lady Billows (Albert Herring), and Female Chorus (Rape of Lucretia). Past opera productions involve Elettra (Idomeneo), Second Woman (Dido and Aeneas), First Lady (The Magic Flute), and the Plaintiff (Trial by Jury). Alexandria has also been seen in several song concerts, including an array of song recitals throughout GSMD, Song in the City, and the St. Marylebone Festival. Future recitals include continued works with Song in the City, pre-LSO, and a WWI commemorative recital to take place at Wolfson College, Oxford.\n\nAlexandria currently studies with Susan Waters and Margaret Humphrey-Clark at GSMD, and has studied with Lindsey McKee, Dr. Anne DeLaunay, Dr. Stacey Uthe and Dr. Linda Lister in previous years.", "otherInfo": "To commemorate the 100 year anniversary of his death, a group of musicians perform selected vocal works of American composer Charles Griffes\n\nCharles T. Griffes is one of the influential members of American musical history, but rarely do many musicians in today's age recognise or even know who he is.\n\nIn partnership with the Song in the City Charity Trust, a group of students from the Guildhall School of Music and Drama have taken up the task to reacquaint today's musicians with this prolific composer. Over the last few months the group have been unearthing and recording the entirety of his art song repertoire, all in order to honour this composer short life and career.\n\nPlease consider joining these musicians as they revive the works of this composer, and to put Charles Griffes in his rightful place next to the other American greats.\n\nTo find more information about the project, go to:\n\nwww.rediscoveringcharlesgriffes.com"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "Ryan Marquez ", "ArtistImage": "https://photos.bandsintown.com/thumb/9916893.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Pop, Soul, Piano Jazz, Jazz, Hip Hop", "Time": "12:00 AM UTC", "Venue": "Pianos", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "158 Bleecker St, New York, NY 10012", "Artist": "Caspian ", "ArtistImage": "https://photos.bandsintown.com/thumb/8084007.jpeg", "Coordinates": [-73.999882, 40.728425], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Rock", "Time": "12:00 AM UTC", "Venue": "Le Poisson Rouge", "moreBioInfo": "Caspian is a rock band from Beverly, Massachusetts, a seaside town 20 minutes north of Boston. Most of the time no one sings. Sometimes we play heavy, other times quite soft. We always try to play with heart. So far we have recorded four albums. The process is always evolving - Thanks for exploring it with us.\n\nCASPIAN has performed over 800 concerts, bringing their music to 40+ countries stretching over 4 continents.\n\nThe band released their latest albim, Dust and Disquiet, in September 2015.", "otherInfo": "No other event info available"}, {"Address": "45-58 Vernon Blvd, Queens County, NY 11101", "Artist": "Tim Pourbaix Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9058199.jpeg", "Coordinates": [-73.952819, 40.747015], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Indie Pop", "Time": "12:00 AM UTC", "Venue": "LIC Bar", "moreBioInfo": "Brooklyn singer-songwriter, Tim Pourbaix, pronounced “pour - bay” is standing at the edge, ready to release his sophomore LP entitled, Gallop. Gallop was written in Pourbaix’s subterranean rehearsal space at the now-closed Flood Studios in Williamsburg, Brooklyn and the candlelit kitchen table of his Clinton Hill home amidst the graveyard shifts.\n\nGallop is a highly anticipated album from Pourbaix because of the local success of his first record, River Well. He has again partnered up with longtime producer and studio owner, Quinn McCarthy from The Creamery Studios in Greenpoint, Brooklyn. After collaborating and releasing River Well together in 2014, Tim began to develop a small, but loyal local following throughout Brooklyn, Manhattan and Queens. Nurturing this connection with his new friends and fans, Tim became involved in the open mic scene, particularly in Brooklyn at such venues as Spike Hill, Pete’s Candy Store and The Topaz. Tim Pourbaix is a staple figure on the small, dark backroom stages of New York City.\n\nPourbaix’s song, “Chapters” from his previous record, River Well soon became a fan favorite and appeared in two indie films, Lonely Boys (2016) and Sweet Parents (2017). Diffuser.FM exclusively premiered the music video and said, “With lyrics like, Chapters come and go out to space / Love that you want to know, I love that you want to know / But I won’t tell a soul / Not even my own, Pourbaix paints an elaborate, yet delicate, picture for the listener.”\n- Diffuser.FM\n\nIncluding his formative years as a young songwriter in the bustling music scene of Denver, Colorado, Pourbaix has shared the stage with and opened up shows for Nathaniel Rateliff, Gregory Alan Isakov, Donovan Woods (Tim McGraw, Lady Antebellum), Dan Layus (Augustana), Esme Patterson, The Little Ones, The Album Leaf, The Long Winters, Margot & the Nuclear So and So’s and The Helio Sequence.\n\nTim Pourbaix has performed solo and with his band at several well attended festivals such as SXSW, CMJ, The Northside Music Festival and The Underground Music Showcase.", "otherInfo": "No other event info available"}, {"Address": "66 North 6th St, Brooklyn, NY 11211", "Artist": "Dance With the Dead ", "ArtistImage": "https://photos.bandsintown.com/thumb/9978418.jpeg", "Coordinates": [-73.96168, 40.71925], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Electronic Rock", "Time": "12:00 AM UTC", "Venue": "Music Hall of Williamsburg", "moreBioInfo": "Dance With The Dead is a music duo from Orange County, CA.", "otherInfo": "Dance With the Dead, Magic Sword"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Boris Pelekh ", "ArtistImage": "https://photos.bandsintown.com/thumb/10074084.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Jazz, Rock, Folk, Gypsy, Classical", "Time": "12:30 AM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "Boris Pelekh is a Russian-born singer, composer, guitarist, most notable as the guitarist of the Gypsy Punk band Gogol Bordello.\n\nPelekh is also the frontman, guitarist and primary songwriter of rock band Hey Guy.", "otherInfo": "Boris Pelekh - Rockwood Stage 3"}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Dana Fuchs ", "ArtistImage": "https://photos.bandsintown.com/thumb/9694939.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Rock Blues Soul", "Time": "12:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "New York City\nDana Fuchs\nLove Lives On\nGet Along Records\nRelease Date: May 18th 2018\n\nDana Fuchs has never dealt in nostalgia. For this questing artist, it’s not about the rear-view but the road ahead. The next song. The next session. Tonight’s show and tomorrow’s bus ride. But as Dana sheds her musical skin with her triumphant fourth album Love Lives On, it seems a fitting juncture to rewind the reels and thumb a backstory as compelling as any in rock ‘n’ roll. This life and times doesn’t always make for easy reading. The triumphs are laced by tragedy, ugliness, injustice. But whatever the obstacles, music and love have been the beacons that guide her on.\n\nAs one of New York City’s favorite daughters, it’s tempting to imagine that Dana’s career began amidst the subterranean throb in the clubs on the Lower East Side. It’s true: that city was her birthplace and springboard to fame. But to truly grasp her artistic motivations, you’d have to follow the family’s car towards Florida, and rattle along the dirt tracks until you hit Wildwood: a backwoods town, population 2000, where black and white were split along battlelines and distrust simmered in the air. “Back in the ’70s, it was a sorta small, racist town,” remembers Dana, who dropped a social hand-grenade by dating a black friend. “We were a big family from New York, Irish-Catholic, there was no one like us in the area. I tended to gravitate more towards the African-American community. I felt more accepted by them.”\nDana and her five older siblings ran wild in the woods (she remembers herself as a “tomboy with dirt under my nails”). Yet this was no picture-perfect childhood, the family’s mood and rhythm set by her father: a former Marine in daily conflict with his demons. “He was a very tortured soul who had one of the most brutal lives of anyone I’ve ever known,” explains Dana of the patriarch commemorated in Faithful Sinner, one of the songs she wrote for the album. “He was tortured by his father and molested by his mother. His beatings only stopped because his father took his own life. My father found him. With all that pain, he was most certainly a flawed parent. He could also be very angry and scary, especially when he drank. Still, we knew he loved us.”\nIf the household was fractious, then music was always the balm. Ostracised at school, Dana found solace in the stomp-and-holler gospel of her local Baptist church, but it was the British classic rock blasted out by her siblings – The Beatles, Rolling Stones, Led Zeppelin, Queen, Fleetwood Mac – that lit a lightbulb over her head. “That’s when I knew I had to do music,” she explains. “When I started hearing that stuff, at 10 or 11, I stopped listening to other music completely. Later on, I appreciated my parents’ music – Hank Williams, Ray Charles, Billie Holiday – but when I heard the old classic rock ‘n’ roll, I lost my mind over that stuff.”\n\nDana’s musical appetite was bottomless, and when fronting a band at a local Holiday Inn was no longer enough, the 19-year-old singer hatched a bolder plan. At this time, New York did not hold happy associations. The city had been the backdrop to the tragic death of Dana’s beloved elder sister, Donna. “She and my brother Don had a band, quite popular in the South. She went up to New York City to find her fame and fortune. She took a lot of wrong turns and tragically ended her life.”\n\nAny other 19-year-old might have run a mile from New York’s bearpit music scene, but Dana used the pain as her fuel (“Donna’s suicide,” she says, “catapulted me from despair to determination to fulfil our shared dream of music”). Yet she still needed a foil. One fateful day, pounding the sidewalks of the Lower East Side, Dana heard the missing puzzle-piece, in the form of Jon Diamond: a heavyweight session guitarist who could already boast credits with Joan Osborne and others. “I was walking by this little club and I heard his guitar from the sidewalk,” she recalls of the musical partnership that flourishes to this day. “I introduced myself to Jon on the break, told him I thought he was great, and that I had come to New York to be a singer. So, he invited me up to sing, and I faked Stormy Monday. Afterwards, he said, ‘You have a good instrument, but you really need to learn what you’re doing’.”\nAfter Jon exposed her to his encyclopedic blues vinyl collection, Dana’s astonishing natural vocal prowess took on new depth and nuance. And so they were ready. Together, Jon and Dana hit the Lower East Side’s live circuit like a wrecking ball, holding their own on bills featuring titans like James Cotton and Taj Mahal, and quickly earning a residency at the Red Lion club. Four nights a week, they shook the foundations until 3am, but there was already the sense they could be far more than a rocking covers band. “Every Tuesday night,” Dana recalls, “we'd play all night, and that's where we wrote our first handful of tunes and we’d try them out on the crowd.”\n\nDrawn by the pair’s original songs and incendiary performances, those crowds were soon stretching round the block, at mythologised hot-spots like Arlene’s Grocery, The Mercury Lounge and B.B. King’s Blues Club. In the studio, meanwhile, Dana and Jon planted their flag with 2003’s Lonely For A Lifetime: an opening gambit that fizzed with potential, splicing a ’60s Stax/Volt vibe with the driving grit of the Stones, and fusing the dark wit and wisdom of Bob Dylan, Tom Waits and Lucinda Williams. “They’re about addiction and religious hypocrisy,” she noted of tunes like Strung Out and Bible Baby, “and like all the tracks on the album, deal with subjects that I have a deep personal experience with.”\n\nBy now, all eyes were on her, and after being spotted by musicians from Broadway’s orchestra pits, Dana won the lead in the hit musical Love, Janis, followed up by the role of Sadie in 2007’s Golden Globe-nominated cult movie, Across The Universe. “We’d been slugging away in New York,” she recalls, “and then I got the show playing Janis Joplin five nights a week. Jon taught me Piece Of My Heart and I went down – and that was it. That led to Across The Universe. The director, Julie Taymor, asked if I could act. So of course, I lied and said, ‘Oh yeah!’”\n\nThe demands of stage and screen inevitably impacted on the band’s studio output. But in 2011, the catalogue was thrillingly reignited by Love To Beg, crowned by the UK’s Classic Rock magazine as blues album of the month on the strength of devastating songs like Keep On Rollin’ and Keepsake, which addressed Dana and Jon’s brief (and ill-fated) romantic coupling. “We fought like cats and dogs,” she grins. “The first two weeks we were together, we were breaking up every day.”\n\nStill deeper depths were plumbed on 2013’s “blisteringly good” Bliss Avenue: an album that saw Dana battling back into the light after the death of her brother, and reaching for redemption on cuts like So Hard To Move and Vagabond Wind. “It really purged my soul,” she said, “in a starker, more naked way, lyrically and musically”.\n\nIt takes a brave artist to rip it up and start again. But Love Lives On is the best kind of evolution, seeing Dana burst defiant from her darkest days with a sound inspired by the siren call of American soul. “It’s a new beginning for me in every way,” she says. “I’m looking forward to starting chapter two.”\n\nRest assured, you’ll find all the factors that have helped her conquer the modern music scene, with 13 new songs that offer heart-on-sleeve songwriting, stellar musicianship and the ragged vocal that Classic Rock described as “juke-joint dirty and illicit, evoking Joplin, Jagger and a cigarette bobbing in a glass of bourbon”.\n\nBut this time there’s a new creative freedom, borne of Dana completing her existing record contract, contemplating a blank canvas and crowdfunding the record that she was burning to make. “I was at an interesting crossroads,” she remembers. “When my contract was up, I felt a sense of relief that I really held the reins for my next move. I need to be running things. I decided to start my own label called Get Along Records, and to get out of New York and go to the home of the music that inspired me to follow my passion: the Memphis Southern soul of Stax/Volt, Hi Records and Sun Studios. From Otis Redding to Al Green to Johnny Cash. All huge influences.”\n\nFor better and worse, the record was also shaped by emotional extremes, as Dana weathered the loss of three beloved family members, before the storm clouds parted with the birth of her son. “Initially, it felt the worst timing to have a baby,” she says, “and I couldn’t have been more wrong. The shift from grief to joy was the most powerful and empowering experience I’ve ever lived. The opportunity arose to take all of the pain from the family loss, the miraculous love of a new baby and put it in a body of music. This album is all about hope and perseverance.”\n\nWith her raw emotions at the surface, Dana hit the album sessions in Memphis with purpose. Armed with songs mostly penned with Jon, the singer found an immediate telepathy with producer Kevin Houston (North Mississippi Allstars, Luther Dickinson, The Bo-Keys, Ian Siegal) and a crack-squad studio band that took in original Hi organist Charles Hodges, Stax heavyweight Steve Potts on drums, keys wizard Glenn Patscha and first-call bassist Jack Daley. “It was so fast and easy,” Dana reflects, “like I’ve never experienced before. Unbelievable mutual respect and admiration between everyone. Not one ego, ever.”\nOn Love Lives On, the songs are the stars. The album opens in commanding style with Backstreet Baby, driven by grooving guitars, a spring-heeled horn section and a savagely beautiful vocal telling of a woman with “nothing to lose”. Cuts don’t come funkier than Ain’t Nobody’s Fault But Mine, while Callin’ Angels fuses upbeat gospel with a poignant lyric. “It has a verse for each family member,” explains Dana. “It’s become a song of conjuring our loved ones in our hearts at every show.”\n\nElsewhere, the bittersweet Sittin’ On rides on clipped guitar, Sad Solution offers an effervescent strut, while the vulnerable and reflective title track – written by Dana as she watched her mother slip away in a Florida hospital following an 11-day vigil – traces the circle of life. “This song is about the experience of losing a mother and then becoming one. Letting go of the first love of my life. Lying next to her as she passed, wishing I had asked her so many things. Wishing I had more time.”\n\nOut of darkness comes light. And out of that fascinating early career emerges an older, wiser Dana Fuchs, armed with the album of her life. New label. New studio. New sound. New possibilities for an artist who has so far only hinted at her potential. “I sure hope those who’ve been with me all along will feel as passionately as I do about it,” she concludes. “And that those who have yet to hear me will now come on board. Love Lives On is almost like a second child to me. It’s who I am at this moment in time, captured on tape…”\n\nIn April, Dana is set to embark on her Love Lives On world tour in support of her forthcoming new album.\n\nLove Lives On will be released on Get Along Records on May 18th worldwide.\n\nCheck out http://danafuchs.com for music, video, tourdates and much more", "otherInfo": "No other event info available"}, {"Address": "330 New York Ave, Huntington, NY 11743", "Artist": "Otan Vargas ", "ArtistImage": "https://photos.bandsintown.com/thumb/8992055.jpeg", "Coordinates": [-73.426084, 40.871037], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Melancholic Rock, Grunge, Singer Songwriter Rock, Hard Rock, Acoustic, Singer Songwriter, Post Rock", "Time": "1:00 AM UTC", "Venue": "Crabtree's NY & Main", "moreBioInfo": "Tondo, Manila is a place where people struggle on a daily basis. It is well known as one of the poorest regions in the Philippines. Born and raised here, singer/songwriter Otan Vargas spent his formative years surrounded mostly by poverty and despair. It is this humble background which helps motivate him to this very day. Vargas’ music is a powerfully simplistic combination of melancholy vocals accompanied by a brooding acoustic guitar. He writes songs about man’s struggle, sorrow and pain and finding the strength to continue on. What started out simply as a means of personal therapy for himself has transformed into an inspirational beacon for adoring fans worldwide.\n\nVargas grew up immersed in music from an early age. His father is an accomplished international entertainer and his siblings all sing and play musical instruments. But it wasn’t until the age of 17 that Otan would start playing the acoustic guitar. Around that time, he also began to follow his father to his shows in the Philippines. It was a great experience for him to see his dad perform live and learn how he handled business matters. But ironically, the family discouraged Otan from pursuing a career in music knowing firsthand how difficult the industry could be.\n\nIn 2006, Vargas travelled to the United States for the first time and would soon settle in with family members in New York. With no serious intentions of becoming a musician at the time, he recorded some videos of himself playing guitar and singing at a friend’s house and uploaded them to YouTube for fun. By a strange twist of fate, the videos gained some popularity on YouTube and eventually ended up being viewed by Aaron Lewis – vocalist of the rock band Staind.\nOtan’s big break came in 2009 when Aaron Lewis unexpectedly invited him on stage to play a song at the Borgata Hotel and Casinos in Atlantic City, NJ. His somewhat nervous, yet captivating rendition of Staind’s hit song “It’s Been Awhile” elicited a standing ovation from the crowd. The video of that performance also spread quickly on YouTube. Shortly after, Otan would release his full-length debut album “Alone” in which he sings about enduring suffering, battling the voices within and trying to find a constant peace for his soul. The album was recorded mainly in one live take with an acoustic guitar and a single vocal microphone, a rarity in this digital age of multi-track recording. Otan describes his genre of music as “Organic Rock”. The songs are focused more on the emotional content and lyrical meaning than the skill or technique involved. He says, “when I write, I always follow where the song wants to go rather than following a certain structure or formula.”\n\nIn 2010, Vargas would perform his original songs for the first time in front of a huge audience of 5,000+ at the Jones Beach Bandshell in New York. And in 2011, he shared the stage with Corey Taylor of Slipknot/Stone Sour, Aaron Lewis of Staind, Lo Pro and Tesla for the “It Takes a Community Charity Concert” at the Pines Theater in Northampton, MA.\n\nIn 2012, Otan released a new EP entitled “Selected Sorrow.” The EP contained the song “Hollow Destination” which was featured in the documentary film “Battlefield of the Mind.” Produced by renowned videographer Fran Strine, the documentary touches on the plight of neglected US veterans who suffer from PTSD and homelessness. It offered a soundtrack which included well known artists such as Mike Mushok of Staind, Pete Murray of Lo Pro and several others including Otan Vargas.\n\nThe following year, Vargas would travel across country by train from his New York residence to perform at the legendary Whisky A Go Go in West Hollywood, CA for the world premiere of the documentary. Others performing on the same stage, were members of the bands Megadeth, Staind, Evanescence and Eye Empire.\n\nIn 2014, Vargas would record a second EP “Origins” with producer Johnny April of Staind. The recording exhibited Vargas’ growing range as a musical artist and included several guest musicians to create more of a rock band feel. He followed up the album with a two-week tour of the Northeast U.S., performing 13 shows in 15 nights.\nIn 2015, Otan would again take the stage alongside Aaron Lewis of Staind. This time in Oklahoma for the Boot Campaign Foundation, an organization that supports US troops and their families.\n\nThen in 2016, Vargas would continue his charitable concert appearances with a performance at the Grand Theatre in Foxwoods Resort and Casinos for the Reach Foundation. The concert featured members of the bands Seether, Staind, Three Days Grace and Saint Asonia.\n\nMost recently, Vargas’ has recorded a new single called “Ground” which features some veteran New York rock musicians including drummer Sal G. of Staind. Vargas experimented with a new formula for this heavy rock project. For the first time, he recorded only the vocal parts and did not include any acoustic guitar. Look for an official release in early 2017.\n\nIt’s been a long, unexpected journey, but all these experiences have developed Otan into a well-respected musician in the rock world and beyond. His story reminds us that if you dream something, no matter who you are or where you come from, it can come true if you work hard and your intentions are pure.", "otherInfo": "No other event info available"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Valentina Evans ", "ArtistImage": "https://photos.bandsintown.com/thumb/9895690.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Acapella, Ranchera, Bolero, Jazz, Worldbeat, Blues, Folk", "Time": "2:00 AM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "“If you melded Chavela Vargas, Ella Fitzgerald and Gal Costa together, you’d find Valentina’s voice there somewhere in between…”\n- Felipe Fournier, 2017 Latin Grammy award winning producer\n\nEqual parts singer, dancer and jaranera, Valentina epitomizes the mélange parfait as a California-born, New York-raised daughter of Mexican and Jamaican immigrants. Together with her extraordinary band, their sound combines her rich and diverse background, including an array of soulful Latin and American folk music and dance. With a voice that’s been hailed for its seductive magnetism, beauty, depth and dynamics, Valentina can easily accommodate herself into any number of genres, always taking her audience on an emotional journey through classic, contemporary and original songs meant to connect, as music is life.\n\nHaving toured the world both as a soloist and as a member of Jarana Beat and Latin Grammy Award winning Flor de Toloache, she is now joining artistic forces with Latin Grammy Award winning producer Felipe Fournier (Costa Rica) to create a compelling new production that will narrate her heart's journey thus far, while seamlessly tying together the numerous musical influences of her upbringing.", "otherInfo": "No other event info available"}, {"Address": "44 E 32nd St, New York, NY 10010", "Artist": "Tender Beats ", "ArtistImage": "https://photos.bandsintown.com/thumb/9255062.jpeg", "Coordinates": [-73.982865, 40.74594], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Alternative, Alternative Rock, Punk Rock, Rock", "Time": "10:00 AM UTC", "Venue": "The Cutting Room", "moreBioInfo": "NYC rock band from Colombia, Italy and Canada", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Nick Finzer ", "ArtistImage": "https://photos.bandsintown.com/thumb/4913357.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Post Bop, Modern Jazz, Trombone, Trombone Jazz, Jazz", "Time": "4:00 PM UTC", "Venue": "Facebook Live & Zoom", "moreBioInfo": "NICK FINZER...\n\n...is one of the most dynamic musicians of the millennial generation.\n\nAn award-winning composer, arranger, and trombonist, Finzer is bringing the joy and power of Jazz to both traditional fans and the most modern 21st century audiences. He’s on a mission to be a passionate voice defining the sound of Jazz in this age while also bringing street cred to the trombone with a bold, tight sound.\n\nBorn into the musical world (Mom Sherry Finzer is an international flutist), Finzer developed a fascination for the music of Duke Ellington and found himself, in high school, performing at the annual Essentially Ellington competition of Jazz at Lincoln Center. It was then that he decided to pursue a life in music himself. His budding talent was recognized by Wycliffe Gordon who began a life-long mentorship by writing four pieces for the young Finzer while he attended the Eastman School of Music. Nick went on to get his masters at Juilliard’s prestigious Jazz program where he was mentored by the trombone legend Steve Turre.\n\nIn 2011 Nick was the winner of the Eastern Trombone Workshop’s National Jazz Trombone Competition and was a finalist in the 2010 International Trombone Association’s Carl Fontana Jazz Trombone Competition.\n\nIn January of 2013 Nick released his recording debut as a bandleader and composer with “Exposition” (Outside In Music). Two tracks appearing on the album garnered Finzer a pair of accolades: The prestigious American Society of Composers and Performers (ASCAP)’s Herb Alpert Award for young composers (2013 & 2015)\n\nIn 2014, Nick composed a new album-length work, “The Chase.” Nick's sophomore album debuted in July of 2015 on Origin Records to rave reviews, a feature article in Downbeat Magazine, and peaked at #6 on the JazzWeek Charts.\n\nFamed trombonist and mentor Wycliffe Gordon called Finzer “a new voice [in] the pantheon of upcoming trombone greats in the making” and added “Nick's CD is a glowing example of things to come.”\n\nWhen away from NYC, Finzer can be found touring the globe not only with his own projects, but as part of YouTube sensation, Scott Bradlee’s Postmodern Jukebox. Finzer has joined the group on television, in viral videos with millions of views, and on tours across North America, Australia, New Zealand and Europe.\n\nFinzer has performed at top Jazz clubs and concert halls with Wynton Marsalis’ Jazz at Lincoln Center Orchestra, Lucas Pino’s No Net Nonet, Ryan Truesdell's Gil Evans Project, Bob Stewart’s Double Quartet, Frank Wess, Terrell Stafford, Lewis Nash, the Tommy Dorsey Orchestra, Walt Weiskopf, Slide Hampton, Frank Kimbrough, Carl Allen, Steve Turre and many more.", "otherInfo": "Live Stream: https://unt.zoom.us/j/738692774"}, {"Address": "415 Forest Ave, Richmond County, NY 10301", "Artist": "Man Down ", "ArtistImage": "https://photos.bandsintown.com/thumb/6131362.jpeg", "Coordinates": [-74.103295, 40.630959], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Brian Leonard, Mike Levay, Mike Parascandola, Tommy Vendittelli, John Biscuti", "Time": "9:00 PM UTC", "Venue": "The Kettle Black", "moreBioInfo": "Man Down", "otherInfo": "No other event info available"}, {"Address": "Point Pleasant Beach, NJ", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.048, 40.0917], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Little Falls, New Jersey", "Time": "10:00 PM UTC", "Venue": "Point Lobster Bar & Grill", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "201 Union Ln, Brielle, NJ 08730", "Artist": "Jessica Rose Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8619942.jpeg", "Coordinates": [-74.052411, 40.107332], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Country, Country Pop, Pop", "Time": "10:00 PM UTC", "Venue": "The Pig & Parrot", "moreBioInfo": "Jessica Rose was named 2017 Emerging Artist by the Country Music Association. She also won the 2017 WSM Road Show competition put on by the Grand Ole Opry and opened for Tracy Lawrence this past Summer. She appeared on American Idol season 12 featuring Keith Urban, Mariah Carey, Nicki Minaj and Randy Jackson. She won the 2017 Josie Award for Modern Country Female Rising Star. Go listen to her new EP “Wild Hearts” on Spotify, iTunes or Apple Music. For more info and fun about Jessica Rose, check out RealJessicaRose.com\n\nhttp://realjessicarose.com\n\nhttp://www.youtube.com/user/realjessicarose\n\nhttps://twitter.com/JessicaRoseLive\n\nhttps://www.instagram.com/RealJessicaRose", "otherInfo": "Jessica Rose performing live at Pig & Parrot Brielle, NJ! 6:00pm"}, {"Address": "153 W 57th St, New York, NY 10019", "Artist": "Jamile Staevie Ayres ", "ArtistImage": "https://photos.bandsintown.com/thumb/9238883.jpeg", "Coordinates": [-73.979018, 40.765267], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Brazilian Music, Jazz", "Time": "10:00 PM UTC", "Venue": "Park Hyatt New York", "moreBioInfo": "Emerging Jazz vocalist Jamile is a recent graduate of the inaugural Master's of Jazz Studies class at City College of New York. Originally from Brazil, she has been a working vocalist on several venues and has had the opportunity to be a featured vocalist on the show 'Eu Sou Maria (Nativitaten)', the largest known outdoors Christimas project in the world, for a total of 500,000 people.\n\n\n\nCurrently based in New York, she has had the opportunity to perform at Minton's Playhouse with the Antonio Ciacca's Swing Society; Smalls Jazz Club with the Scott Reeves Orchestra feat. Steve Wilson, and with the Antonio Ciacca Quartet; and at Jazz At Lincoln Center with the CCNY Graduate Ensemble, along with several other venues throughout the city. Jamile has also received high praise for her performances at the La Spezia Jazz Festival in Italy. Jamile captivates audiences with her unique phrasing influenced by her Brazilian roots that also reaches the tradition of Sarah Vaughan and Carmen Mcrae.", "otherInfo": "From 6:00 pm to 9:00 pm."}, {"Address": "55 Christopher St, New York, NY 10014", "Artist": "Nicole Zuraitis Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8256346.jpeg", "Coordinates": [-74.002238, 40.733782], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Soul-blues, Singer Songwriter, Jazz, Contemporary Vocal Jazz, Vocal, Soul Jazz, Jazz Vocals, Vocal Jazz", "Time": "11:00 PM UTC", "Venue": "55 Bar", "moreBioInfo": ">> Grammy® Nominated New York based vocalist and pianist Nicole Zuraitis blends clever songwriting skills, an effervescent presence and unparalleled vocals in a consummate package that has thrilled audiences across Manhattan and across the world. She is the vocalist for the world famous Birdland Big Band and the Dan Pugach Nonet, the winner of the New York Coffee Music Project Songwriting Competition, ASCAP Herb Alpert Young Jazz Composers Award recipient and was a finalist in the Sarah Vaughan International Jazz Vocal Competition. Her 2017 Album HIVE MIND won Best Jazz Album in the International Music and Entertainment Awards and she was awarded the Johnny Mercer and People’s Choice Award in the American Traditions Competition. Her world music folk band EVA toured internationally alongside folk legends Livingston Taylor, Melanie Safka and Tom Chapin. She has performed with The Omar Hakim Experience as a vocalist at the Iridium Jazz Club, Maz of Snarky Puppy, Don Braden, Rachel Z, Hagar Ben Ari, Dave Stryker, Antonio Sanchez, Cyrille Aimee and Bernard Purdie, Kung Fu and Elise Testone at the New Orleans Jazz Festival. She is a proud member of the Litchfield Jazz Camp faculty. Her love for jazz education has brought her to songwriting and jazz workshops worldwide, including Berklee College of Music, Williams College, University of North Texas, Litchfield Jazz Camp, Australian Embassy, Burnt Hills High School Artist in Residence, Israel Embassy, SAM Academy in Chennai India and Miami Arts Charter School. Nicole holds residencies in New York City at both the 55 Bar and Birdland Jazz Club. Visit www.nicoleZmusic.com for more information.\n\n> “A heart as big as her remarkable voice”-- JAZZ POLICE\n\n> \"Brooklyn’s Nicole Zuraitis Brings Visceral Vocals, Her Powerhouse Presence and Winning Songwriting to Jazz Outing, Hive Mind (Dot Time Records).\"- KEN MICALLEF (DOWNBEAT)\n\n> \"Emerging onto the scene with a notably warm personality, Zuraitis, vocalist extraordinaire, gave her audience a blues “clinic.”....soaring vocals... intimate familiarity....intonation and dreamy clarity.....I watched, transfixed by Zuraitis’s careful mastery of both piano and vocal. She made a mark for herself there (Birdland Jazz Club).”- CHRIS STRUCK CABARET SCENES MAGAZINE 2019", "otherInfo": "No other event info available"}, {"Address": "209 4th Ave, Asbury Park, NJ 07712", "Artist": "Them Vibes ", "ArtistImage": "https://photos.bandsintown.com/thumb/8230757.jpeg", "Coordinates": [-74.00185, 40.223204], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Americana, Rock, Southern Rock", "Time": "11:00 PM UTC", "Venue": "Asbury Lanes", "moreBioInfo": "Formed and honed in East Nashville, TN by lead singer Brother Love, guitar players Alex Haddad and Kyle Lewis, and with the helping hand of a powerhouse rhythm section, Them Vibes shook the foundations of Music City with their blitzkrieg live show and soulful songwriting. Inflected with the rhythmic sway of The Faces and T-Rex, the raw energy of the Rolling Stones and the Black Crowes, and the whiplash funk of Sly And The Family Stone and James Brown, Them Vibes has risen to a sonic experience all of their own.\n\nThe band has opened for household names like Cage the Elephant, Cheap Trick, Lynyrd Skynyrd, and The Flaming Lips. With three records under their belt- Shine On, TV, Electric Fever- their songs have been featured on CBS's NCIS: LA, ABC's The Rookie, Showtime's Shameless, Amazon's Sneaky Pete, Netflix's The Ranch, and a National T-Mobile campaign. America's number one independent radio station, Lightning 100 WRLT, ranked their self titled single, Electric Fever, number 22 in the Top 200 Songs of The Year and Top 4 Best Shows To See Live!\n\nFresh off the road with Maggie Rose, Them Vibes roared back in the studio writing and recording their next EP due out in February 2020, featuring the unrelenting funk heavy single, \"Right On,\" written by Alex Haddad, Brother Love, and Kyle Lewis, and featuring the brilliant, soul stirring vocals of Maggie Rose.", "otherInfo": "No other event info available"}, {"Address": "1409 Queen Anne Rd, Teaneck, NJ 07666", "Artist": "Jerry, at the Beach ", "ArtistImage": "https://photos.bandsintown.com/thumb/10128931.jpeg", "Coordinates": [-74.0048, 40.90166], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Folk Punk, Indie Alternative Rock, Alternative, Indie Rock", "Time": "11:00 PM UTC", "Venue": "Debonair Music Hall", "moreBioInfo": "Jerry, at the Beach is an American indie rock band founded in 2018 in Southampton, New Jersey. Centered around the duo of Josh Russell and Ethan Flynn, the band’s characteristically eclectic sound blends indie rock, pop rock, punk, and folk music with noise, sound collage, and hardcore music. Their debut studio record is due out in April 2020.\n\nRussell and Flynn grew up on the same street in Southampton, New Jersey, but did not meet until high school. After years of playing music together and exploring influences, the duo became Jerry, at the Beach, and over the course of two years, wrote, recorded, and mixed their debut album, often within the confines of a small camper located in the Pine Barrens of Southern New Jersey.\n\nJerry, at the Beach incorporates influences from many different artists and styles from many different eras, including The Beatles, Oasis, Elliott Smith, Death Cab for Cutie, The Velvet Underground, Bob Dylan, The White Stripes, early country blues and folk records, King Krule, Green Day, Swans, Coldplay, Paul Simon, James Taylor, Joni Mitchell, Modest Mouse, Green Day, Sufjan Stevens, and The Band.\n\nTheir music frequently switches style, sound, and instrumentation, often within the confines of a single song, culminating in a highly idiosyncratic sound. Their subject matter frequently covers topics such as nostalgia, various locations throughout New Jersey, alcoholism, depression, suicide, and youth-driven frustration.", "otherInfo": "No other event info available"}, {"Address": "361 Metropolitan Ave, Brooklyn, NY 11211", "Artist": "Cherry Pools ", "ArtistImage": "https://photos.bandsintown.com/thumb/10039919.jpeg", "Coordinates": [-73.955825, 40.714204], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Martin Broda / Rachel Barker / Sean Medeiros", "Time": "11:00 PM UTC", "Venue": "Knitting Factory Brooklyn", "moreBioInfo": "Neon Future: A Guide To A Possible Tomorrow", "otherInfo": "No other event info available"}, {"Address": "5 Seymour St., Montclair, NJ 07042", "Artist": "Fetty Wap ", "ArtistImage": "https://photos.bandsintown.com/thumb/8430607.jpeg", "Coordinates": [-74.216499, 40.812501], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Hip Hop", "Time": "11:00 PM UTC", "Venue": "The Wellmont Theater", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "327 Bowery, New York, NY 10012", "Artist": "Scott Rocco ", "ArtistImage": "https://photos.bandsintown.com/thumb/8753257.jpeg", "Coordinates": [-73.991787, 40.725751], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Alternative, Pop Rock, Rock", "Time": "11:00 PM UTC", "Venue": "The Bowery Electric", "moreBioInfo": "A fire burns deep inside the soul of award winning artist - SCOTT ROCCO. After more than a decade of modest indie releases as a band frontman, having played countless local, city, and out-of-state gigs as a solo-performer, the New York singer, songwriter, & multi-hyphenate proudly carries long-awaited optimism in the world of his debut album - IGNITED.\n\nSet for a 2020 fall release, IGNITED mixes concept storytelling with real life struggles of personal relationships, restless doubt, and the fear of unrealized dreams; all while finding the courage to embrace change igniting the best parts of self through growth and love.\n\nThe release of the IGNITED single is the title track that sets the album’s tone and thematically pulls you into the world of a man chronicling how the ignition of his best self is inevitably manifested by his soulmate.\n\n\"Tracks such as IGNITED by NYC - based Rock artist Scott Rocco will perpetually remain timeless. With melodies which seep just as much pure unadulterated soul as the resounding vocals, you’d have to be fairly dead inside not to get caught up in the tides of euphoria in Ignited.\n\nEven though the vocals were transfixing, nothing left me quite as enamoured as hearing a guitarist with a nuanced style which sits in between that of James Dean Bradfield and Johnny Marr. In a feat of aural alchemy, Scott Rocco combined Marr’s jangly optimistic notes and the deep, tension-building licks which you’ll hear from James Dean Bradfield.\n\nWhen you hit play, every single one of your rhythmic pulses will be in the command of this incredibly talented artist.\" Amelia Vandergast - A&R Factory\n\n“I like to think of myself as the ROCKY of rock 'n roll. I sing for the underdog in us all. The contender that must confront and face insecurity, trauma, and fear throughout our lives. I take these deterrents and channel them into raw emotional heartfelt rock; a type of sound and feeling risen out of love to positively express myself as a way to inspire, enlighten, and heal people through my music.\" Scott Rocco", "otherInfo": "This will be a casual intimate acoustic show following up to the single release of FIGHT FOR YOU."}, {"Address": "900-978 Ocean Ave, Asbury Park, NJ 07712", "Artist": "Pink Talking Fish ", "ArtistImage": "https://photos.bandsintown.com/thumb/9187556.jpeg", "Coordinates": [-74.00046, 40.21978], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Fusion, Rock", "Time": "11:00 PM UTC", "Venue": "Stone Pony Asbury Park", "moreBioInfo": "A Fusion of Pink Floyd, The Talking Heads and Phish!", "otherInfo": "Announcement party for Jams On The Sand!"}, {"Address": "158 Bleecker St, New York, NY 10012", "Artist": "Kiana Ledé ", "ArtistImage": "https://photos.bandsintown.com/thumb/9171080.jpeg", "Coordinates": [-73.999882, 40.728425], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Pop, Love, R&b, Soul", "Time": "11:00 PM UTC", "Venue": "Le Poisson Rouge", "moreBioInfo": "No artist bio available", "otherInfo": "Album Release Show"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "Tim Pourbaix Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9058199.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Indie Pop", "Time": "11:00 PM UTC", "Venue": "Pianos", "moreBioInfo": "Brooklyn singer-songwriter, Tim Pourbaix, pronounced “pour - bay” is standing at the edge, ready to release his sophomore LP entitled, Gallop. Gallop was written in Pourbaix’s subterranean rehearsal space at the now-closed Flood Studios in Williamsburg, Brooklyn and the candlelit kitchen table of his Clinton Hill home amidst the graveyard shifts.\n\nGallop is a highly anticipated album from Pourbaix because of the local success of his first record, River Well. He has again partnered up with longtime producer and studio owner, Quinn McCarthy from The Creamery Studios in Greenpoint, Brooklyn. After collaborating and releasing River Well together in 2014, Tim began to develop a small, but loyal local following throughout Brooklyn, Manhattan and Queens. Nurturing this connection with his new friends and fans, Tim became involved in the open mic scene, particularly in Brooklyn at such venues as Spike Hill, Pete’s Candy Store and The Topaz. Tim Pourbaix is a staple figure on the small, dark backroom stages of New York City.\n\nPourbaix’s song, “Chapters” from his previous record, River Well soon became a fan favorite and appeared in two indie films, Lonely Boys (2016) and Sweet Parents (2017). Diffuser.FM exclusively premiered the music video and said, “With lyrics like, Chapters come and go out to space / Love that you want to know, I love that you want to know / But I won’t tell a soul / Not even my own, Pourbaix paints an elaborate, yet delicate, picture for the listener.”\n- Diffuser.FM\n\nIncluding his formative years as a young songwriter in the bustling music scene of Denver, Colorado, Pourbaix has shared the stage with and opened up shows for Nathaniel Rateliff, Gregory Alan Isakov, Donovan Woods (Tim McGraw, Lady Antebellum), Dan Layus (Augustana), Esme Patterson, The Little Ones, The Album Leaf, The Long Winters, Margot & the Nuclear So and So’s and The Helio Sequence.\n\nTim Pourbaix has performed solo and with his band at several well attended festivals such as SXSW, CMJ, The Northside Music Festival and The Underground Music Showcase.", "otherInfo": "Upstairs Lounge"}, {"Address": "209 4th Ave, Asbury Park, NJ 07712", "Artist": "Maggie Rose ", "ArtistImage": "https://photos.bandsintown.com/thumb/8847246.jpeg", "Coordinates": [-74.00185, 40.223204], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Country, Funk, Soul, R&b, Rock, Americana", "Time": "11:00 PM UTC", "Venue": "Asbury Lanes", "moreBioInfo": "Exceptionally versatile singer-songwriter Maggie Rose released her highly anticipated album, Change The Whole Thing, September 21, 2018. Stamped with her affinity for finely crafted melodies and intricate storytelling, the project encompasses a blend of American music melding Rock, Soul, Rhythm and Blues, Country and Gospel. Maggie's recent album Change The Whole Thing was named by Rolling Stone as one of the \"Best Albums of 2018.\"\n\nThe resilient powerhouse recorded this album at the famed Starstruck Studios in Nashville, TN implementing an impressively demanding method highlighting an artist in complete command of her ever-evolving creative process: live with her 13-piece “family band” in one take, no overdubs, no bullshit and a sound that is best described by the following quote from Rolling Stone:\n\n“Maggie Rose has come into her own with this current earth-conscious, trippy country-soul stage of her ever-evolving musical persona...Rose’s performances [during CMA Fest and Bonnaroo] showed her embracing her inner soul diva, belting with fire on ‘It's You’ and the pulverizing ‘Pull You Through.’ Just to drive the point home, Rose and her band even stretched out on a swinging cover of ‘The Letter,’ doing a more-than-respectable impression of the funky Mad Dogs & Englishmen arrangement originally sung by Joe Cocker.”\n\nLeading to the Fall album launch, Rose incrementally released four Digital 45s from her forthcoming project beginning in October 2017 to both satisfy and build the anticipation of her growing fanbase. The initial 45 earned her a spot in the Top 10 on Sirius XM with the “smoldering” A-side, “Pull You Through.” The “pulverizing” single was hailed by Rolling Stone as a “soulful ballad that rejoices in the healing powers of love...a bare-bones track [that is] really a showcase for the Dusty Springfield-worthy vocals of Rose…”.\n\nIn Spring of 2018, Maggie released \"It's You\" and \"Smooth.\" Rolling Stone once again praised Maggie Rose with \"It's You\" as “a giant, throwback Soul ballad that shows off her dynamic vocals [containing] shades of Aretha Franklin,” and also praised \"Smooth\" as \"a supremely funky rocker with hints of Grace Potter [and] Janis Joplin\".\n\nThe enthusiasm surrounding each Digital 45 release has continually increased the appetite of her fans while relentlessly expanding her following via radio, streaming platforms and through her captivating live performances. The full-length album will feature 12 songs, 12 live in-studio videos, with a full-access behind-the-scenes one-hour musical documentary which peels back the layers and allows the viewer an intimate look into the making of the album.\n\nRose has been named to YouTube’s Emerging Artist and Artist in Residence 2018 programs, and Pandora named her an Artist to Watch 2018. In June, Maggie’s creative breadth and versatility sparked the first-ever partnership between Prescription Songs and Sea Gayle Music, with the two companies signing a joint-venture publishing agreement with Rose. In July, she was tapped for an as-named synchronization deal that lends her voice to a national ad campaign focusing on Women’s Empowerment.\n\nIn 2018, Maggie Rose has played over 150 dates across the world including\nBonnaroo Music and Arts Festival and The Cannes Lions International Festival of Creativity, while sharing the stage with artists such as Kelly Clarkson, Julia Michaels, Brandy Clark, and Bob Weir of Grateful Dead.", "otherInfo": "Maggie Rose returns to Asbury Park, NJ for her American Rock N Soul Tour 2020 w/ special guests Them Vibes! Also to note the hometown show for drummer Sarah Tomek!\n\nTickets: https://www.axs.com/events/391946/maggie-rose-tickets?skin=asburylanes"}, {"Address": "315 West 44th St, New York, NY 10036", "Artist": "Ben Allison ", "ArtistImage": "https://photos.bandsintown.com/thumb/9187978.jpeg", "Coordinates": [-73.989689, 40.759], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Film Music, Improvisation, Jazz, Instrumental, Rock, Other", "Time": "11:00 PM UTC", "Venue": "Birdland", "moreBioInfo": "Bassist/Composer/Producer/Educator Ben Allison has developed an international reputation as a performer, composer and producer and is a leading voice in contemporary jazz. Ben has organized and performed on over 150 tours, winning fans and building new audiences throughout the world with an adventurous yet accessible sound and a flair for the unexpected.\n\nBen has released 13 albums of original music, 7 of which topped the national jazz radio charts, garnering him 9 SESAC Performance Awards. His most recent album, Quiet Revolution is the 3rd to be released on his own Sonic Camera Records label, following 2017’s Layers of the City.\n\nAt the age of 25, Ben formed the Jazz Composers Collective, a non-profit organization that fostered and presented new music. He acted as the Collective’s Artistic Director from 1992 until 2005.\n\nHe currently serves as President of the New York Chapter of the Recording Academy and sits on the organization’s Presidents Council. In 2012, he represented the Recording Academy when he testified before Congress on issues relating to performing rights for artists. He has also served as Vice President, Chair of the Advocacy Committee and organized the first ever Grammy Town Hall in 2015.\n\nBen has written articles for Downbeat, JazzTimes, the IAJE Journal, Premier Guitar, Bass Player as well as his own blog at www.benallison.com/blog. He wrote the theme for the popular NPR radio program On The Media, which is heard by over 1,500,000 listeners weekly, and was a featured composer and performer with the Jazz Sinfonica, 80-piece symphony orchestra, Sao Paulo, Brazil, in 2005, 2008 and 2013. He has conducted residencies and workshops in over 100 universities and conservatories throughout the world.\n\nBen is on the faculty of the New School for Jazz & Contemporary Music and Mannes College of Music in New York City, where he teaches Entrepreneurship in Music, The Entrepreneurial Musician, Senior Seminar, Music Tech Seminar, improvisation ensembles, bass and composition. He serves on the Jazz Executive Committee, which oversees curriculum development for the school.\n\nBen performed his Carnegie Hall debut in February 2012.", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "The Pimps of Joytime ", "ArtistImage": "https://photos.bandsintown.com/thumb/9581988.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Brian J - Lead vocals/guitar, Mayteana Morales - vocals/percussion - http://tinyurl.com/na9u6nt, David Bailis - bass/guitar, Takuya Nakamura - Keys, Anthony Cole - drums", "Time": "11:00 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Let’s take it higher.\n\nAnyone familiar with the Pimps of Joytime live experience knows the feeling—it’s that moment when a deep bluesy groove morphs into a full-on EDM dance beat, or the sensation when the wide-eyed audience collectively elevates in sync with the band’s tangible energy.\n\nOn Jukestone Paradise, the Pimps of Joytime raise the bar with swagger to spare, crafting ten cohesive songs that ring out like the soundtrack for a ride through the diverse Brooklyn neighborhood where their sound materialized. Pulling from lead guitarist and singer Brian J’s deep discography of influences, the creation of Jukestone Paradise began a decade ago, when he penned anthems like “Sky” and “Freedom Dancer,” all the way up to the album’s studio recording sessions.\n\nYou might accurately call the Pimps of Joytime a ‘post-genre’ band; they’re a group whose sound—even within a single song—mirrors the diversity of our era’s musical tastes. “It’s a sonic tapestry that’s representative of this time and place that we live in,” says Brian J.\n\nThat’s where the Pimps excel, by mashing up ‘70s funk tones with modern dance beats, mixed with original samples creating their mosaic sound. For listeners weary of today’s DJ culture but eager to dance with abandon, the Pimps of Joytime are the antidote.\n\n“At our core, the Pimps of Joytime are not just dance music,” says Brian J of the band’s three-part harmony attack. “My first vocal mentor was a doo-wop singer, so I have a long-time love affair with vocal harmonies.”\n\nWith the release of Jukestone Paradise, the band makes official their solid touring lineup, featuring dual female vocalists and percussionists Mayteana Morales and Cole WilliamsX. And they’re hitting the road hard, continuing a constant touring schedule that’s already left prominent sets at festivals like Voodoo, Outside Lands, Bonnaroo and High Sierra in their wake.\n\nBehind the frontlines are bassist/keyboardist David Bailis and drummer John Staten, forming the rhythmic backbone of the Pimps’ audible collage. And for Jukestone Paradise, they called in a few friends to lend their talents, including Ivan Neville, who lends New Orleans flavor to “Sky,” and Rubblebucket’s Alex Toth, who co-wrote the quirky and infectious “Dance Cardia.”\n\nJust as Brooklyn has changed since the Pimps started, so has the band’s sound. But as Williamsburg gentrifies, the Pimps of Joytime’s diverse evolution keeps the neighborhood’s spirit alive. That spirit goes into the Pimps’ pot, over a soulful roux of rhythm and groove.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Nick Finzer ", "ArtistImage": "https://photos.bandsintown.com/thumb/4913357.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Post Bop, Modern Jazz, Trombone, Trombone Jazz, Jazz", "Time": "11:00 PM UTC", "Venue": "Facebook Live", "moreBioInfo": "NICK FINZER...\n\n...is one of the most dynamic musicians of the millennial generation.\n\nAn award-winning composer, arranger, and trombonist, Finzer is bringing the joy and power of Jazz to both traditional fans and the most modern 21st century audiences. He’s on a mission to be a passionate voice defining the sound of Jazz in this age while also bringing street cred to the trombone with a bold, tight sound.\n\nBorn into the musical world (Mom Sherry Finzer is an international flutist), Finzer developed a fascination for the music of Duke Ellington and found himself, in high school, performing at the annual Essentially Ellington competition of Jazz at Lincoln Center. It was then that he decided to pursue a life in music himself. His budding talent was recognized by Wycliffe Gordon who began a life-long mentorship by writing four pieces for the young Finzer while he attended the Eastman School of Music. Nick went on to get his masters at Juilliard’s prestigious Jazz program where he was mentored by the trombone legend Steve Turre.\n\nIn 2011 Nick was the winner of the Eastern Trombone Workshop’s National Jazz Trombone Competition and was a finalist in the 2010 International Trombone Association’s Carl Fontana Jazz Trombone Competition.\n\nIn January of 2013 Nick released his recording debut as a bandleader and composer with “Exposition” (Outside In Music). Two tracks appearing on the album garnered Finzer a pair of accolades: The prestigious American Society of Composers and Performers (ASCAP)’s Herb Alpert Award for young composers (2013 & 2015)\n\nIn 2014, Nick composed a new album-length work, “The Chase.” Nick's sophomore album debuted in July of 2015 on Origin Records to rave reviews, a feature article in Downbeat Magazine, and peaked at #6 on the JazzWeek Charts.\n\nFamed trombonist and mentor Wycliffe Gordon called Finzer “a new voice [in] the pantheon of upcoming trombone greats in the making” and added “Nick's CD is a glowing example of things to come.”\n\nWhen away from NYC, Finzer can be found touring the globe not only with his own projects, but as part of YouTube sensation, Scott Bradlee’s Postmodern Jukebox. Finzer has joined the group on television, in viral videos with millions of views, and on tours across North America, Australia, New Zealand and Europe.\n\nFinzer has performed at top Jazz clubs and concert halls with Wynton Marsalis’ Jazz at Lincoln Center Orchestra, Lucas Pino’s No Net Nonet, Ryan Truesdell's Gil Evans Project, Bob Stewart’s Double Quartet, Frank Wess, Terrell Stafford, Lewis Nash, the Tommy Dorsey Orchestra, Walt Weiskopf, Slide Hampton, Frank Kimbrough, Carl Allen, Steve Turre and many more.", "otherInfo": "Live Stream: https://www.outsideinmusic.com/live"}, {"Address": "20 Lincoln Ctr Plaza, New York, NY 10023", "Artist": "Alison Clancy ", "ArtistImage": "https://photos.bandsintown.com/thumb/7185169.jpeg", "Coordinates": [-73.98109, 40.77084], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Dream Pop, Alternative, Electro Rock, Psychadelic Disco, Altpop", "Time": "11:30 PM UTC", "Venue": "Metropolitan Opera", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "538 Hart St, Brooklyn, NY 11221", "Artist": "Keenan Steiner ", "ArtistImage": "https://photos.bandsintown.com/thumb/8623044.jpeg", "Coordinates": [-73.929977, 40.696366], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "11:30 PM UTC", "Venue": "Hart Bar", "moreBioInfo": "Keenan Steiner is an exuberant yet down in the dumps Brooklyn comedian who delivers sharp punchlines and absurd asides with a big, loose stage presence.\n\nInstagram: @KeenstarTrillionaire\nBook me: kjs451@gmail.com\nCome see me: Facebook.com/ComedyAtTheCorner", "otherInfo": "No other event info available"}, {"Address": "1160 Broadway 5th floor, New York, NY 10001", "Artist": "Nerissa Campbell ", "ArtistImage": "https://photos.bandsintown.com/thumb/8394033.jpeg", "Coordinates": [-73.988693, 40.744678], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Folk, Jazz Blues, Alternative", "Time": "11:30 PM UTC", "Venue": "The Jazz Gallery, NYC", "moreBioInfo": "Singer, Songwriter, learner of Balinese gamelan, guitar & ukulele, and lover of music, travel and learning. Not always in that order.\n\nNerissa Campbell’s music weaves its way through somber pop-ballads, bluesy folk songs, moody instrumentals, and a lyricism full of thought and space. She has developed a unique and deeply personal writing and performing voice - immersed in the jazz tradition, but strongly forging her own direction. The blues is in her wistful and melancholy voice, but it plays hide and seek with space and sound, creating a depth of feeling beyond the obvious; she creates a fine blend of styles dipped in a smoky batter of late night living.", "otherInfo": "Nerissa Campbell - Cricket"}, {"Address": "New York City, NY", "Artist": "Jackopierce ", "ArtistImage": "https://photos.bandsintown.com/thumb/8280131.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Pop", "Time": "12:00 AM UTC", "Venue": "StageIt Live Show with Jack O'Neill", "moreBioInfo": "Jack O’Neill and Cary Pierce, the “Jack O” and “Pierce” who make up the seminal duo Jackopierce, are celebrating 30 years of making music that has amassed a loyal following of millions of fans across the country and the world with a super high-energy live show and what the Dallas Morning News has called “spotless harmonies.”\n\nHaving just released their first studio project 'Feel This Good' in 5 years, Jackopierce is poised and ready to get back on the road full-time.\n\nJackopierce formed in 1988 in Dallas as theater students at SMU. The duo steadily made a name for themselves, especially with two of their signature tracks, “Vineyard” and their version of the classic “Please Come to Boston.” They released ten studio albums (two for major label A&M), toured three continents, nine countries, and 45 states - amassing millions of loyal fans along the way . Over the years They have shared the stage with John Mayer, Dave Matthews Band, Matchbox20, Counting Crows, The Wallflowers, Sheryl Crow, Toad the Wet Sprocket - to name a few. After a five-year breakup, the guys reunited in 2002 to test out the waters. They were very warm and city by city, Jack & Cary got back out there to play for grateful fans that thought they would never see them again. The two now have a totally renewed creative vigor, mutual respect and deep gratitude for their fans.\n\nThese good vibes shine through on their 25th anniversary live album “Live 25.”\n\nIt’s definitely been a creative time for the duo, and celebrating the past inspires the guys to move forward in new, inventive ways. To freshen up the live show, Jackopierce started creating uniquely intimate “Destination Shows.” These shows are a whole new fan experience where people can enjoy gorgeous scenery, share delicious food & wine and have “campfire”-type access to their favorite band. It’s a vacation and concert in one. Each Destination Show provides a unique experience dedicated to the local culture: Napa/Sonoma vineyards at sunset, a ranch in Austin Hill Country, high society in Dallas, a two-mile-high a private club in Aspen, amazing history at the Biltmore in NC, a 14,000 square foot hacienda in San Miguel de Allende, MX - and the list goes on. July 27, Jackopierce will host their first 7th Destination Show in Martha’s Vineyard and they’ll be back for their fourth annual Destination Show in San Miguel in April 2020.\n\n“We have been doing destination events for 10 years now and they have been a huge hit with our fans and have allowed us to make so many great new ones along the way,” said Cary Pierce. “I think these events continue to grow and sell out because people want more than \"just a show” - they want an experience. They want to create lasting memories, explore a new place or visit an old favorite. In some cases, we're offering them a trip of a lifetime. We're finding there a lot of people that really value these experiences.”\n\nJackopierce has celebrated numerous career milestones including the T-Bone Burnett produced A&M debut album “Bringing on The Weather,” being a part of one of the world’s largest live events with close to 400K people in attendance at the 1997 Blockbuster RockFest at Texas Motor Speedway alongside artists No Doubt, Counting Crows, and Matchbox Twenty, performing on Conan O’Brien in 1992 with the Max Weinberg Band backing them up and sitting in the chairs on the Rosie O'Donnell Show.\n\n“Even after 30 years I feel like we're just getting started,” said Cary Pierce.", "otherInfo": "No other event info available"}, {"Address": "1011 Manhattan Ave, Brooklyn, NY 11222", "Artist": "Pet Beast ", "ArtistImage": "https://photos.bandsintown.com/thumb/10148483.jpeg", "Coordinates": [-73.954961, 40.733475], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Troost", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "62 Avenue C, New York, NY 10009", "Artist": "Reed Stewart ", "ArtistImage": "https://photos.bandsintown.com/thumb/9732751.jpeg", "Coordinates": [-73.979786, 40.722549], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Electronic Rock", "Time": "12:00 AM UTC", "Venue": "Nublu", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "44 E 32nd St, New York, NY 10010", "Artist": "Lovely World ", "ArtistImage": "https://photos.bandsintown.com/thumb/10232811.jpeg", "Coordinates": [-73.982865, 40.74594], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Rock", "Time": "12:00 AM UTC", "Venue": "The Cutting Room", "moreBioInfo": "Just like a satellite hurdling towards earth, Lovely World takes the pulse of our culture and mirrors it back to society. Unrequited love, drug addiction, social afflictions and fearful political etiquette are some of the themes this rock hard four piece puts into orbit. Just as you try and label them strictly a hard rock band, a new wave of beautiful harmonies and romantic notions will lay you down with crying guitar leads, solid bottom end and passionate vocals.\n\nHailing from Spartanburg, South Carolina, brothers Landon Rojas (lead vocals and guitar) and Cade Rojas (drums), along with childhood friend Cameron Smith (lead guitar), formed Lovely World in 2015. These three founding members have been close friends since elementary school, jamming new school rock with influences of the best of the 70’s. Recently joined by bassist Michael Gilbert, the lineup is now complete. Recording a new album in 2019, and touring in 2020, this band is one- step closer to world domination…and oh what a lovely world that will be. For more info. lovelyworldmusic.com\n\n-Vicky Hamilton", "otherInfo": "DARK SPARK MUSIC SHOWCASE AT THE CUTTING ROOM, NEW\n\nYORK, APRIL 9 2020\n\nIndustry executive, Vicky Hamilton, welcomes all to The Cutting Room, 33E, 32nd Street, New\nYork on Thursday 9 April for her latest Showcase event.\nFeaturing South Carolina’s Lovely World, New York-based Tender Beats, and Australian\nnewcomers High, it’s shaped to be one not be missed."}, {"Address": "46 Barrow St, New York, NY 10014", "Artist": "Zawadi Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9192454.jpeg", "Coordinates": [-74.004505, 40.732118], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "90s, Soul, Pop, 80s", "Time": "12:00 AM UTC", "Venue": "Greenwich House Music School", "moreBioInfo": "Zawadi is an independent singer/songwriter/composer from Washington D.C, who spent his childhood living around the world before settling in New York City. As a child of the 80s, born to parents who loved Motown and everything Stevie Wonder, Zawadi's music is a fusion of dance synth, soul-filled lyrics, and joy.\n\nWaiting Room is Zawadi's first EP.\n\nIn his own words, \"this the first body of work that is exclusively my creation. It encompasses all of the styles of music I love and sends a message of self-discovery and self-reflection, a message I truly believe in\".", "otherInfo": "Stand Alone Complex takes a look at Zawadi’s musical path, and the supporting characters who helped him through various stages to become the artist he is today. Fresh from an east coast tour with Grammy-nominated artist, John Forte, this show will feature new approaches to Zawadi’s previous work while showcasing some more recent songs and collaborations. Zawadi’s music, led by his powerful and dynamic voice, is heavily inspired by music and video games from the ’80s and ’90s with a mixture of synth supported dance tunes, steady paced songs of joy, and hooks that invite everyone to the party."}, {"Address": "357 Wantagh Ave, Levittown, NY 11756", "Artist": "Reverend Jack ", "ArtistImage": "https://photos.bandsintown.com/thumb/9292939.jpeg", "Coordinates": [-73.500182, 40.715826], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Southern Rock", "Time": "12:00 AM UTC", "Venue": "The Local Tavern", "moreBioInfo": "Formed out of the Kentucky summer heat of 2016; Reverend Jack is bringing Southern Hard Rock back to the masses!", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Graham Norwood ", "ArtistImage": "https://photos.bandsintown.com/thumb/9392660.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Folk, Alternative", "Time": "12:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Graham Norwood writes, plays and sings songs of uncommon beauty. His 3-1/2 octave vocal range, dynamic guitar playing, and versatile songwriting allow him to work in a wide range of styles while always preserving his own unique artistic voice. That he has been legally blind from birth only makes these talents more remarkable.\n\nAfter spending years as a New York sideman and producer with the likes of Bryan Scary, The Dough Rollers, Ward White, Cliff Westfall and others, Graham decided to focus on writing and performing his own original music. Beginning in late 2016, he recorded three sets of demos written and arranged for three separate bands, exploring a variety of different sounds and genres. One of these sessions, recorded by Bryce Goggin (Pavement, Antony & the Johnsons, Evan Dando, Phish) and mixed by John Agnello (Kurt Vile, Son Volt, Sonic Youth, Dinosaur Jr), has evolved into Graham's debut full-length, Out of the Sea, which is slated for a late 2019 release. In the meantime, Graham has just released a four-song EP called Sundry Songs, available now digitally and soon in limited edition 10\" vinyl and CD formats.\n\nOn stage, Graham is equally electrifying with a band or as a solo performer. A typical Graham Norwood Group show covers everything from mellow country-rock to full-on fuzz guitar freakouts, while solo sets put the emphasis on Graham's singing, which has earned frequent comparisons to Jeff Buckley, Jim James and (Graham's beloved) Harry Nilsson. Whether he's playing with a full band or captivating a room with just his voice and acoustic guitar, Graham’s performances are not to be missed. Recently relocated to the San Francisco Bay Area, Graham is now playing regularly up and down the west coast and plotting wider touring for later in the year.", "otherInfo": "No Cover!"}, {"Address": "446 Bedford Rd,, Pleasantville, NY 10570", "Artist": "Alex Cano ", "ArtistImage": "https://photos.bandsintown.com/thumb/9734970.jpeg", "Coordinates": [-73.791368, 41.133657], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Rock, Folk Rock, Alt-rock, Alt-country", "Time": "12:00 AM UTC", "Venue": "Lucy's Lounge - Bar & Kitchen", "moreBioInfo": "No artist bio available", "otherInfo": "Alex Cano 2020 Lucy's Residency"}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Dana Fuchs ", "ArtistImage": "https://photos.bandsintown.com/thumb/9694944.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Rock Blues Soul", "Time": "12:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "New York City\nDana Fuchs\nLove Lives On\nGet Along Records\nRelease Date: May 18th 2018\n\nDana Fuchs has never dealt in nostalgia. For this questing artist, it’s not about the rear-view but the road ahead. The next song. The next session. Tonight’s show and tomorrow’s bus ride. But as Dana sheds her musical skin with her triumphant fourth album Love Lives On, it seems a fitting juncture to rewind the reels and thumb a backstory as compelling as any in rock ‘n’ roll. This life and times doesn’t always make for easy reading. The triumphs are laced by tragedy, ugliness, injustice. But whatever the obstacles, music and love have been the beacons that guide her on.\n\nAs one of New York City’s favorite daughters, it’s tempting to imagine that Dana’s career began amidst the subterranean throb in the clubs on the Lower East Side. It’s true: that city was her birthplace and springboard to fame. But to truly grasp her artistic motivations, you’d have to follow the family’s car towards Florida, and rattle along the dirt tracks until you hit Wildwood: a backwoods town, population 2000, where black and white were split along battlelines and distrust simmered in the air. “Back in the ’70s, it was a sorta small, racist town,” remembers Dana, who dropped a social hand-grenade by dating a black friend. “We were a big family from New York, Irish-Catholic, there was no one like us in the area. I tended to gravitate more towards the African-American community. I felt more accepted by them.”\nDana and her five older siblings ran wild in the woods (she remembers herself as a “tomboy with dirt under my nails”). Yet this was no picture-perfect childhood, the family’s mood and rhythm set by her father: a former Marine in daily conflict with his demons. “He was a very tortured soul who had one of the most brutal lives of anyone I’ve ever known,” explains Dana of the patriarch commemorated in Faithful Sinner, one of the songs she wrote for the album. “He was tortured by his father and molested by his mother. His beatings only stopped because his father took his own life. My father found him. With all that pain, he was most certainly a flawed parent. He could also be very angry and scary, especially when he drank. Still, we knew he loved us.”\nIf the household was fractious, then music was always the balm. Ostracised at school, Dana found solace in the stomp-and-holler gospel of her local Baptist church, but it was the British classic rock blasted out by her siblings – The Beatles, Rolling Stones, Led Zeppelin, Queen, Fleetwood Mac – that lit a lightbulb over her head. “That’s when I knew I had to do music,” she explains. “When I started hearing that stuff, at 10 or 11, I stopped listening to other music completely. Later on, I appreciated my parents’ music – Hank Williams, Ray Charles, Billie Holiday – but when I heard the old classic rock ‘n’ roll, I lost my mind over that stuff.”\n\nDana’s musical appetite was bottomless, and when fronting a band at a local Holiday Inn was no longer enough, the 19-year-old singer hatched a bolder plan. At this time, New York did not hold happy associations. The city had been the backdrop to the tragic death of Dana’s beloved elder sister, Donna. “She and my brother Don had a band, quite popular in the South. She went up to New York City to find her fame and fortune. She took a lot of wrong turns and tragically ended her life.”\n\nAny other 19-year-old might have run a mile from New York’s bearpit music scene, but Dana used the pain as her fuel (“Donna’s suicide,” she says, “catapulted me from despair to determination to fulfil our shared dream of music”). Yet she still needed a foil. One fateful day, pounding the sidewalks of the Lower East Side, Dana heard the missing puzzle-piece, in the form of Jon Diamond: a heavyweight session guitarist who could already boast credits with Joan Osborne and others. “I was walking by this little club and I heard his guitar from the sidewalk,” she recalls of the musical partnership that flourishes to this day. “I introduced myself to Jon on the break, told him I thought he was great, and that I had come to New York to be a singer. So, he invited me up to sing, and I faked Stormy Monday. Afterwards, he said, ‘You have a good instrument, but you really need to learn what you’re doing’.”\nAfter Jon exposed her to his encyclopedic blues vinyl collection, Dana’s astonishing natural vocal prowess took on new depth and nuance. And so they were ready. Together, Jon and Dana hit the Lower East Side’s live circuit like a wrecking ball, holding their own on bills featuring titans like James Cotton and Taj Mahal, and quickly earning a residency at the Red Lion club. Four nights a week, they shook the foundations until 3am, but there was already the sense they could be far more than a rocking covers band. “Every Tuesday night,” Dana recalls, “we'd play all night, and that's where we wrote our first handful of tunes and we’d try them out on the crowd.”\n\nDrawn by the pair’s original songs and incendiary performances, those crowds were soon stretching round the block, at mythologised hot-spots like Arlene’s Grocery, The Mercury Lounge and B.B. King’s Blues Club. In the studio, meanwhile, Dana and Jon planted their flag with 2003’s Lonely For A Lifetime: an opening gambit that fizzed with potential, splicing a ’60s Stax/Volt vibe with the driving grit of the Stones, and fusing the dark wit and wisdom of Bob Dylan, Tom Waits and Lucinda Williams. “They’re about addiction and religious hypocrisy,” she noted of tunes like Strung Out and Bible Baby, “and like all the tracks on the album, deal with subjects that I have a deep personal experience with.”\n\nBy now, all eyes were on her, and after being spotted by musicians from Broadway’s orchestra pits, Dana won the lead in the hit musical Love, Janis, followed up by the role of Sadie in 2007’s Golden Globe-nominated cult movie, Across The Universe. “We’d been slugging away in New York,” she recalls, “and then I got the show playing Janis Joplin five nights a week. Jon taught me Piece Of My Heart and I went down – and that was it. That led to Across The Universe. The director, Julie Taymor, asked if I could act. So of course, I lied and said, ‘Oh yeah!’”\n\nThe demands of stage and screen inevitably impacted on the band’s studio output. But in 2011, the catalogue was thrillingly reignited by Love To Beg, crowned by the UK’s Classic Rock magazine as blues album of the month on the strength of devastating songs like Keep On Rollin’ and Keepsake, which addressed Dana and Jon’s brief (and ill-fated) romantic coupling. “We fought like cats and dogs,” she grins. “The first two weeks we were together, we were breaking up every day.”\n\nStill deeper depths were plumbed on 2013’s “blisteringly good” Bliss Avenue: an album that saw Dana battling back into the light after the death of her brother, and reaching for redemption on cuts like So Hard To Move and Vagabond Wind. “It really purged my soul,” she said, “in a starker, more naked way, lyrically and musically”.\n\nIt takes a brave artist to rip it up and start again. But Love Lives On is the best kind of evolution, seeing Dana burst defiant from her darkest days with a sound inspired by the siren call of American soul. “It’s a new beginning for me in every way,” she says. “I’m looking forward to starting chapter two.”\n\nRest assured, you’ll find all the factors that have helped her conquer the modern music scene, with 13 new songs that offer heart-on-sleeve songwriting, stellar musicianship and the ragged vocal that Classic Rock described as “juke-joint dirty and illicit, evoking Joplin, Jagger and a cigarette bobbing in a glass of bourbon”.\n\nBut this time there’s a new creative freedom, borne of Dana completing her existing record contract, contemplating a blank canvas and crowdfunding the record that she was burning to make. “I was at an interesting crossroads,” she remembers. “When my contract was up, I felt a sense of relief that I really held the reins for my next move. I need to be running things. I decided to start my own label called Get Along Records, and to get out of New York and go to the home of the music that inspired me to follow my passion: the Memphis Southern soul of Stax/Volt, Hi Records and Sun Studios. From Otis Redding to Al Green to Johnny Cash. All huge influences.”\n\nFor better and worse, the record was also shaped by emotional extremes, as Dana weathered the loss of three beloved family members, before the storm clouds parted with the birth of her son. “Initially, it felt the worst timing to have a baby,” she says, “and I couldn’t have been more wrong. The shift from grief to joy was the most powerful and empowering experience I’ve ever lived. The opportunity arose to take all of the pain from the family loss, the miraculous love of a new baby and put it in a body of music. This album is all about hope and perseverance.”\n\nWith her raw emotions at the surface, Dana hit the album sessions in Memphis with purpose. Armed with songs mostly penned with Jon, the singer found an immediate telepathy with producer Kevin Houston (North Mississippi Allstars, Luther Dickinson, The Bo-Keys, Ian Siegal) and a crack-squad studio band that took in original Hi organist Charles Hodges, Stax heavyweight Steve Potts on drums, keys wizard Glenn Patscha and first-call bassist Jack Daley. “It was so fast and easy,” Dana reflects, “like I’ve never experienced before. Unbelievable mutual respect and admiration between everyone. Not one ego, ever.”\nOn Love Lives On, the songs are the stars. The album opens in commanding style with Backstreet Baby, driven by grooving guitars, a spring-heeled horn section and a savagely beautiful vocal telling of a woman with “nothing to lose”. Cuts don’t come funkier than Ain’t Nobody’s Fault But Mine, while Callin’ Angels fuses upbeat gospel with a poignant lyric. “It has a verse for each family member,” explains Dana. “It’s become a song of conjuring our loved ones in our hearts at every show.”\n\nElsewhere, the bittersweet Sittin’ On rides on clipped guitar, Sad Solution offers an effervescent strut, while the vulnerable and reflective title track – written by Dana as she watched her mother slip away in a Florida hospital following an 11-day vigil – traces the circle of life. “This song is about the experience of losing a mother and then becoming one. Letting go of the first love of my life. Lying next to her as she passed, wishing I had asked her so many things. Wishing I had more time.”\n\nOut of darkness comes light. And out of that fascinating early career emerges an older, wiser Dana Fuchs, armed with the album of her life. New label. New studio. New sound. New possibilities for an artist who has so far only hinted at her potential. “I sure hope those who’ve been with me all along will feel as passionately as I do about it,” she concludes. “And that those who have yet to hear me will now come on board. Love Lives On is almost like a second child to me. It’s who I am at this moment in time, captured on tape…”\n\nIn April, Dana is set to embark on her Love Lives On world tour in support of her forthcoming new album.\n\nLove Lives On will be released on Get Along Records on May 18th worldwide.\n\nCheck out http://danafuchs.com for music, video, tourdates and much more", "otherInfo": "No other event info available"}, {"Address": "47 Easton Ave, New Brunswick, NJ 08901", "Artist": "Nathan Bohach ", "ArtistImage": "https://photos.bandsintown.com/thumb/8872197.jpeg", "Coordinates": [-74.448888, 40.497958], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Funk, Rock, Blues, Country, Hip Hop, Fusion, Jazz, R&b", "Time": "12:30 AM UTC", "Venue": "Barça City Cafe & Bar", "moreBioInfo": "Nathan Bohach is an artist in the New York City jazz scene. Raised just outside of Pittsburgh, it is there that he got his introduction to jazz music. Nathan had an affinity for music from an early age, which manifested itself in his participating in marching percussion. Thanks to a twist of fate he was introduced to the vibraphone while performing in these groups. His future became clear after being exposed to the music of Lionel Hampton, Milt Jackson and Stefon Harris but his greatest influence came from producer, recording artist and professor at Juilliard, Mark Sherman.\n\nNathan had the good fortune of meeting Sherman while an Undergraduate student at Marshall University. It was then that he began studying jazz vibraphone, with Sherman, in the tradition of the greats. This relationship with Sherman led him to Jersey City University as a graduate assistant where he will graduate in a few months. Now a resident of New Jersey, Bohach performs in the NYC metro area with various groups on both vibraphone and drum set a second instrument on which he is also quite accomplished. In addition to Sherman, Nathan has studied with Dr. Ben Miller, Rusty Burge and Ben Gillece. He has studied drum set with Jay Ware, Steve Hall and Tim Horner.\n\nNathan favors the styles of Jazz, Funk and Fusion and his playing and writing has been greatly influenced by the afore mentioned artists along with the music and playing of Bobby Hutcherson, Robert Glasper, Snarky Puppy, Roy Haynes, Staton Moore, and Stefon Harris.\n\nNathan has performed shows at venues such as The Stanhope House (NJ), Silvana (NY), Tomi Jazz (NY), The Empty Glass (WV), and more. In addition to this, Nathan has opened for The Mike Dillon Band and Milo Z.", "otherInfo": "No other event info available"}, {"Address": "129 Macdougal St, New York, NY 10012", "Artist": "Yuval Amihai ", "ArtistImage": "https://photos.bandsintown.com/thumb/8294803.jpeg", "Coordinates": [-74.000069, 40.730649], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Jazz", "Time": "12:30 AM UTC", "Venue": "Bar Next Door at La Lanterna di Vittorio", "moreBioInfo": "Yuval Amihai was born in Beer Sheva, Israel in 1981. He began studying the piano at the age of eight, and five years later switched to electric guitar. He soon discovered his passion for improvisation and jazz, and during his high school years he began to travel regularly to Tel Aviv to study with Israel’s leading musicians, and to participate in workshops and master classes. At the age of 16 he started performing professionally with jazz bands around the country and leading several projects with his original music. At 19, Yuval wrote an original composition for his hometown’s string quartet and for the renowned Oud and Violin player Yair Dalal. His music was selected by one of Israel’s leading composers and music educators Michael Wolpe, and was performed in concert halls across Israel. Soon afterwards he started studying at The Jerusalem Academy of Music and the Rimon Jazz School in Tel Aviv and participated in various musical projects. In 2005 Yuval moved to Paris. He quickly made his way into the local jazz scene and started playing in Paris clubs and venues. The following year he studied at the Jazz department of the Paris Region Conservatory, graduating two years later. Since 2008 Yuval leads his quintet, the Yuval Amihai Ensemble, with whom he performs music which is strongly influenced by his childhood in Israel. The ensemble has won numerous awards, including the Grand Prize and the 1st composition prize at the \"La Défense\" National Jazz Competition in 2009, The 1st prize in the Saint-Germain Jazz festival Contest in Paris (2008), and the 3rd prize in the international jazz competition of Hoeilaart, Belgium. The band has performed in opening act concerts for renowned artists as Avishai Cohen, Bojan Z, Rabia Abu-Khalil and Kyle Eastwood, and played in numerous Jazz festivals, concert halls and jazz clubs in France and Europe, including Nancy Jazz Pulsations, La Défense Jazz Festival, Sunset/Sunside Jazz Club (Paris), Jazz à Staint-Gérmain-des-Près Festival (Paris), Guitar Art Café (Belgrade, Serbie), Budo Tomovic Theater (Podgorica, Monténégro), National theaters of Amiens, Sceaux & Valencienne. In 2012 Yuval released his first album with his quintet, \"Yuval Amihai Ensemble\", which was acclaimed by critics and received the \"Chosen Album\" label by French leading jazz critics website CitizenJazz.com. This was followed by a full support by the SACEM organisation's grants program for self-produced albums. In 2015, Yuval records his second album \"LONGING\" with his new trio, including bass player Damien Varaillon and drummer Gautier Garrigue. The album was released May 25, 2015 (distributed by L'Autre Distribution). Acclaimed by critics it receives the \"Chosen album” label by CitizenJazz.com as well as the “Discovery” label in the Jazz News magazine. The trio is invited on several radio shows, including on the national France Musique radio and TSF Jazz radio. The CD release concert is held in September that year at the Duc des Lombards Jazz club in Paris. Jazz guitarist & composer", "otherInfo": "No other event info available"}, {"Address": "486 Halsey St, Brooklyn, NY 11233", "Artist": "Emily Braden ", "ArtistImage": "https://photos.bandsintown.com/thumb/9261815.jpeg", "Coordinates": [-73.934691, 40.683441], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "1:00 AM UTC", "Venue": "LunÀtico", "moreBioInfo": "www.emilybraden.com", "otherInfo": "No other event info available"}, {"Address": "425 Lafayette St, New York, NY 10003", "Artist": "Yacine Boulares ", "ArtistImage": "https://photos.bandsintown.com/thumb/8202369.jpeg", "Coordinates": [-73.991774, 40.729208], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "New York, New York", "Time": "1:00 AM UTC", "Venue": "Joe's Pub", "moreBioInfo": "Yacine Boulares is a French-Tunisian saxophonist, clarinetist and composer based in New York.\n\nAfter graduating with a BA in Philosophy Yacine Boulares decides to take a year off to respond to the urge to play music. He takes his first music lessons and after studying under Andre Villeger for 3 years he wins the Esprit Jazz Festival Competition in Paris and is endorsed by Selmer saxophones (2006) A year later he enters the Conservatoire National Supérieur de Musique de Paris where his horizons broaden under the influence of peers and mentors such as Riccardo Del Fra and Francois Theberge. He soon understands the necessity to go to the roots of Jazz and in 2009 he is granted a Fulbright Scholarship to study at the New School for Jazz and Contemporary music on a merit scholarship.\n\nIn New York, the dream of meeting and playing with his idols becomes true and Yacine gets to learn from Chris Cheek, Donny Mc Caslin, Reggie Workman and with countless musicians who inspire him daily. But New York also exposes him to a myriad of different musics. Soon he is part of ex Fela Kuti' drummer Jojo Kuo' Afrobeat Collective, of late Cameroonian singer Martino Atangana's African Blue Note, of Haitian Kompa legends Tabou Combo. In their musics, he finds a deep echo to his North African roots and the Bikutsi rhythms from Cameroon become reminiscent of the trance rhythms and musics from Tunisia.\n\nThese influences urge him to find his own identity and his explorations of Cameroonian dance rhythms lead to the creation of the band AJOYO, a mystic brew of African tradition, jazz and soul. Yacine signs the music and lyrics of a repertoire that celebrates life, love and justice. The album is released in 2015 on Ropeadope Records and played on radios throughout the world from New Yorks' WNYC to French RFI, London's Jazz FM, National radio in Brazil, South Africa, Nigeria...\n\nIn the meantime, Yacine continues to play as a sideman both in the jazz repertoire with the likes of Sheila Jordan, Theo Bleckman and Becca Stevens and for various projects such as Japanese singer/songwriter Senri Oe (3 albums for Sony Japan).\n\nIn 2014 he is part of an intimate band picked by producer and arranger Robert Sadin to accompany Opera legend Placido Domingo on his remarkable record Encanto Del Mar. Yacine is featured both as a soloist and arranger of the Andalucian standard Lamma Bada and gets the chance to work closely with Ira Coleman, Mark Feldman, Rhani Khridja, Chico Pinheiro and Bridget Kibbey. This is also where he meets cellist Vincent Segal and gets the idea to explore the tunisian Stambeli repertoire with Vincent on cello and drummer Nasheet Waits.\n\nIn 2015 this project is granted the French American Jazz Exchange. The trio album will be recorded and released in 2017 with the French label Accords Croises.\n\nConcurrently to his activities as a performer and a composer, Yacine teaches song-writing at the French Heritage Language Program. In 2014 he is commissioned to compose a Musical telling the story of underserved French speaking African and Haitian communities in the USA. The show Amidou & Toya was premiered in NY in May 2014. Yacine is a D'Addario woodwinds and Lebayle Mouthpieces artist.", "otherInfo": "No other event info available"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "DJ Taela Naomi ", "ArtistImage": "https://photos.bandsintown.com/thumb/7226315.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Pianos", "moreBioInfo": "Taela Naomi is an award winning DJ, model and educator based in NYC whose talent and presence have gained attention both in NYC and internationally. Raised in Brooklyn, NY, Taela's early musical influences included everything from classical composers Rachmaninov and Tchaikovsky to Curtis Mayfield, James Brown, and Michael Jackson. After earning her B.A. from Amherst College, Taela performed as a dancer with shows including The Producers, Dreamgirls, and Bill T. Jones' Broadway adaptation of Superfly. With her knowledge of diverse musical genres, natural ability for cutting and blending, impenetrable focus, and bubbly spirit, Taela has risen to become one of NYC's most sought after DJs. She has played all over NYC and has earned praise from the legendary DJ Red Alert and played alongside the great DJ Tony Touch. Her signature party, The Dance Party, has become a weekly go-to event for music lovers, dancers, and NYC trendsetters. Her latest party series, Rum + Pum Pum Shorts which features Afrobeat, dancehall, reggae, and soca music, has been selling out in record time since it launched in September 2017. Taela won the prestigious Uptown Battle of the Bars competition, earning her the title \"Best Uptown DJ.\" As an educator, Taela created a course in the Art of DJing, which she teaches in public schools in Brownsville Brooklyn, the Bronx, and soon Harlem, which has made a huge difference in the lives of the children. Taela's mission is to transcend the typical club experience to get people to connect and to move, to be present, and to boldly fall back in love with dance parties.", "otherInfo": "No other event info available"}, {"Address": "1411 Kingsley St, Asbury Park, NJ 07712", "Artist": "Sean Tobin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9146897.jpeg", "Coordinates": [-74.000362, 40.225617], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Acoustic, Indie, Punk, Folk Rock, Americana, Punk Americana, Indie Rock, Rockabilly, Rock, Indie Folk", "Time": "2:00 AM UTC", "Venue": "Kim Marie's Eat n Drink Away", "moreBioInfo": "Born and raised on the New Jersey shore, Sean Tobin grew up surrounded by salt, surf, and incredible music. After getting in some trouble in high school, Tobin decided to put his downtime into teaching himself the guitar. A poet in his own right, songwriting soon followed.\n\nIn 2017, Tobin traveled to Europe to walk El Camino de Santiago, a 500-mile trail through the north of Spain. He walked to discover himself and how he should spend his life. Tobin tied his guitar to his 30-pound pack, and each day, walked 20km toward Santiago de Compostela. Upon his arrival, it became obvious that his commitment to his music was how he would spend his days.\n\nSean returned to New Jersey in the fall of 2017 where he worked a white collar job to fund his independent music. He released his first album, This Midnight, in the summer of 2018. He began to build a name for himself in his home state, and in 2019, he played Frank Turner's Lost Evenings III Festival at the House of Blues in Boston.\n\nSean currently lives in Jersey City, NJ.", "otherInfo": "10:00 - Midnight Every Thursday Night!"}, {"Address": "131 Berry St, Brooklyn, NY 11249", "Artist": "La Pachamambo ", "ArtistImage": "https://photos.bandsintown.com/thumb/9887239.jpeg", "Coordinates": [-73.95909, 40.71803], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Gran Torino", "moreBioInfo": "The best of salsa, mambo, cumbia and boogaloo classics!", "otherInfo": "No other event info available"}, {"Address": "10 Kings Rd, Madison, NJ 07940", "Artist": "Dexta Daps ", "ArtistImage": "https://photos.bandsintown.com/thumb/7359203.jpeg", "Coordinates": [-74.4306, 40.76501], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Reggae, Dancehall", "Time": "2:00 AM UTC", "Venue": "Rose Hall ", "moreBioInfo": "Dexta Daps was born in Seaview Gardens, Jamaica, known for producing reggae legends such as Shabba Ranks, Bounty Killer, Elephant Man and Garnet Silk.\n\nGrowing up in the poverty stricken streets Dexta learnt to take out his frustration out the best way he knew how, through music. \"I would hear the melodic voices of the kids crying for help, and the sadness of the people. Their voices, hunger for retribution, it was very inspiring for me, and made me want to sing songs of happiness and joy.\"\n\nIn this day and age of music influences, Contemporary Reggae Music, has become a commodity that has crossed over to Rhythm and Blues, Hip-Hop/Rap, all the way to the Pop world. Dexta Daps has been compared to Sean Paul and Maxi Priest with his versatility and unique voice. His style is different and refreshing and with his latest singles, \"7 Eleven\" & \"Jealous Ova w/ Tifa\", he has proven that. Shaking the dancehall up from Jamaica all the way to down to New York and throughout the United States, Canada, UK & The Caribbean.\n\nDexta Daps is currently having a break out year and has a very busy schedule of shows filled with young and old packing into venues across the world to watch him perform.\n\nDexta recently sparked major interest in the streets with his Dance-Hall abilities when he released his latest monster release “Shabba Madda Pot” Produced by Daseca Productions.\n\nDexta Daps who is currently signed to Daseca Productions promises to continue his rise to the top.\n\nFans are urged to stay up to date with Dexta Daps via his Instagram page.\n\nwww.Instagram.com/DextaDaps", "otherInfo": "No other event info available"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Christina Custode ", "ArtistImage": "https://photos.bandsintown.com/thumb/7519169.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Female Fronted, American Roots, Indie Alternative, Folk, Adult Contemporary, Rock, Original Songs, Blues, Indie, Piano-vocals, Original Singer-songwriter, Adult Album Alternative", "Time": "2:30 AM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "Christina Custode (Cus-tō-dē) is a Grammy Recording Academy Artist and multi-award winning singer-songwriter and pianist currently based out of Buffalo, NY. She recently completed her first full length original project “From Here”. The album consists of 13 original songs written and performed by Custode and produced by the legendary Stuart Epps (Elton John, George Harrison, Led Zeppelin). She has just released her second single \"High Water\" form the project. The first single from this project titled “All For Her” was just released in August 2016. Her first EP (2011) sold out all physical CDs within the first 10 months of release. The project, which consisted of eight songs (all music and lyrics written and arranged by Christina Custode) put Custode on the singer/songwriter map and heralded as an excellent start to a long and promising career. Custode is a graduate from the prestigious Eastman School of Music in Rochester, New York (BM ’10, MA ’14).\n\nShe is heavily influenced by songwriting greats such as Billy Joel, Jewel and John Lennon and has been referred to as “the Carole King of her Generation”. She is a force to be reckoned with on the stage. Bringing her songs, stories and sass to each engagement, she is dynamic performer who is effortless in various performance settings. Christina brings her songs to life through engaging stories and witty banter, keeping audiences of all sizes engaged and entertained. Think Joan Jett meets Chelsea Handler in a bar, with a piano.\n\n\nPlease visit: www.ChristinaCustode.com for tour schedule and additional information.", "otherInfo": "Christina Custode - Rockwood Stage 3"}, {"Address": "407 W 15th St, New York, NY 10011", "Artist": "Seven Davis Jr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10118669.jpeg", "Coordinates": [-74.00604, 40.74223], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Other, Indie Dance, Deep House, Funk, Experimental, Soul, Producer, Indie Pop, Jazz-house, Jazz Vocalist, Trip Hop, Jazz, Indie, Disco, Soulful House, House, Jazz Fusion", "Time": "3:00 AM UTC", "Venue": "Chelsea Music Hall", "moreBioInfo": "\"Sev\" is a Singer, Songwriter and Producer. He began professional training as a jazz vocalist in his early childhood. He began studying production styles of various genres in his teens. He also worked as a vocal arranger, ghostwriter/ghost producer, until deciding to pursue his own solo career in 2012.\n\nHe released debut album \"Universes\" in 2015, on Ninja Tune Records. He left the UK label in 2016 to return to his American soul based roots. In 2017 he released sophomore album “Live from the Other Side\", via his Secret Angels imprint. He also performed the album live as the main opener on the Flying Lotus 3D Tour. During the summer of 2018 he released an underground retro inspired third album titled “Choir Boy”.\n\nIn 2019 he released his 4th album \"S.O.S\" (Self Over Stress). Featuring 17 new songs.", "otherInfo": "Seven Davis Jr curates a night of Disco, House and Funk at Chelsea Music Hall. With NYC alumni Junior Sanchez and Toribio. Introducing Houston Texas duo “Parra”. Plus a special Prince tribute from Seven Davis Jr to celebrate Princes life and passing in April 2016."}, {"Address": "300 W 116th St, New York, NY 10026", "Artist": "Tyrone Shoelaces ", "ArtistImage": "https://photos.bandsintown.com/thumb/9804954.jpeg", "Coordinates": [-73.955731, 40.804401], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Funk, Jam Band Classic Rock, Reggae, Dub", "Time": "1:00 PM UTC", "Venue": "Silvana", "moreBioInfo": "Tyrone Shoelace’s music was recently described as a “wild and sexy eclectic mix of reggae, funk and groovin rhythms that surge ones soul. The band is a talented mesh or cross-section of musicians from various decades that communicate well together and learn from each other to add to this band's success. There’s a positive interplay among the artists. The music at first had an almost funk reggae feel which then suddenly loomed into an explosion of energy with an experimental, trendy, edgy flare with its techno/synthesizer sound that surges excitement and spirit to the listener.” Annette Versage - Fairfield County Music Reporter\n\nThanks Annette, we couldn’t have said it better. Since the band's inception, Tyrone’s sound has continued to evolve into a wild mix of genres - rock, reggae, dub, funk, jam band and even some disco-esque rhythms - culminating in the third CD/Album, Shoot The Radio being released in March of 2016!\n\nWritten, recorded and mixed entirely in Norwalk CT, Shoot The Radio takes on a Norwalk feel with a reference to Sheffield Island on In The Garden and the song I Didn’t Notice which is about growing up on Lexington Ave in South Norwalk. Proud to put Norwalk, CT on the map, the album features a rap by Norwalk native Leo TheFuture Futerelli and was mixed by three-time Grammy winner & Norwalk resident Phil Magnotti. The album cover was created by another Norwalker, Dave Lindsay of Lindsay Media. This record truly captures Tyrone's ever evolving sound and mash up of genres. It has a much more reggae feel and incorporates some electronica dub for the first time.\n\nThe title song, Shoot The Radio has a simple reggae shuffle beat which then morphs into a rap featuring Leo TheFuture Futerelli and his take on growing up with the radio. I Can Tell Its True is one of 2 ballads on the record and is a duet featuring the beautiful vocal stylings of Miss Sarah Golley who also happens to live in Norwalk. The first single, In The Garden is being released in February of 2016 and their springtime CD release tour begins March.\n\nFollow us:\nwww.tyroneshoelaces.com\nFacebook: Tyroneshoelaces\nTwitter: @tyroneband\nInstagram: tyroneband\n\nTyrone Shoelaces is:\nChuck Chesler: Piano, Organ, Wurlitzer, Synths, Vocals\nSam Wagner: Drums, Percussion, Vocals\nMichael Galgano: Electric & Acoustic Guitars\nPhillip “P” Smith: Bass\n\nThe TSL Horns:\nJoseph Meo: Saxophones\nMark Zaleski: Saxophones\nMarshall Rauh: Trombone\n\nThe TSL Ladies:\nElana Zabari: Vocals", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Nick Finzer ", "ArtistImage": "https://photos.bandsintown.com/thumb/4913357.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Post Bop, Modern Jazz, Trombone, Trombone Jazz, Jazz", "Time": "6:15 PM UTC", "Venue": "Instagram Live", "moreBioInfo": "NICK FINZER...\n\n...is one of the most dynamic musicians of the millennial generation.\n\nAn award-winning composer, arranger, and trombonist, Finzer is bringing the joy and power of Jazz to both traditional fans and the most modern 21st century audiences. He’s on a mission to be a passionate voice defining the sound of Jazz in this age while also bringing street cred to the trombone with a bold, tight sound.\n\nBorn into the musical world (Mom Sherry Finzer is an international flutist), Finzer developed a fascination for the music of Duke Ellington and found himself, in high school, performing at the annual Essentially Ellington competition of Jazz at Lincoln Center. It was then that he decided to pursue a life in music himself. His budding talent was recognized by Wycliffe Gordon who began a life-long mentorship by writing four pieces for the young Finzer while he attended the Eastman School of Music. Nick went on to get his masters at Juilliard’s prestigious Jazz program where he was mentored by the trombone legend Steve Turre.\n\nIn 2011 Nick was the winner of the Eastern Trombone Workshop’s National Jazz Trombone Competition and was a finalist in the 2010 International Trombone Association’s Carl Fontana Jazz Trombone Competition.\n\nIn January of 2013 Nick released his recording debut as a bandleader and composer with “Exposition” (Outside In Music). Two tracks appearing on the album garnered Finzer a pair of accolades: The prestigious American Society of Composers and Performers (ASCAP)’s Herb Alpert Award for young composers (2013 & 2015)\n\nIn 2014, Nick composed a new album-length work, “The Chase.” Nick's sophomore album debuted in July of 2015 on Origin Records to rave reviews, a feature article in Downbeat Magazine, and peaked at #6 on the JazzWeek Charts.\n\nFamed trombonist and mentor Wycliffe Gordon called Finzer “a new voice [in] the pantheon of upcoming trombone greats in the making” and added “Nick's CD is a glowing example of things to come.”\n\nWhen away from NYC, Finzer can be found touring the globe not only with his own projects, but as part of YouTube sensation, Scott Bradlee’s Postmodern Jukebox. Finzer has joined the group on television, in viral videos with millions of views, and on tours across North America, Australia, New Zealand and Europe.\n\nFinzer has performed at top Jazz clubs and concert halls with Wynton Marsalis’ Jazz at Lincoln Center Orchestra, Lucas Pino’s No Net Nonet, Ryan Truesdell's Gil Evans Project, Bob Stewart’s Double Quartet, Frank Wess, Terrell Stafford, Lewis Nash, the Tommy Dorsey Orchestra, Walt Weiskopf, Slide Hampton, Frank Kimbrough, Carl Allen, Steve Turre and many more.", "otherInfo": "Live Stream: http://www.instagram.com/nickfinzer"}, {"Address": "55 Christopher St, New York, NY 10014", "Artist": "Tessa Souter ", "ArtistImage": "https://photos.bandsintown.com/thumb/8551329.jpeg", "Coordinates": [-74.002238, 40.733782], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Jazz-world-folk-trance", "Time": "10:00 PM UTC", "Venue": "55 Bar", "moreBioInfo": "“One of the few exceptional standouts in the crowded field of female jazz singers.” Los Angeles Times\n\n“A beguiling artist who infuses everything she interprets with voluptuous intelligence and keen emotional insight.” (KQED Arts). “Tessa Souter makes her audiences feel as though they’ve just experienced something very special.” (Los Angeles Times) “Best of all, she delivers it with a wit and a wink worthy of the toniest joints in town.” (Time Out New York)\n\nBorn in England, the daughter of Trinidadian and English parents, award-winning New York-based vocalist, composer and lyricist, Tessa Souter, imbues a mix of jazz and stunning originals with the soul and passion of flamenco, Indian and Middle Eastern music. She has made four critically-acclaimed albums: Her self-produced Flamenco-tinged debut, Listen Love (2004); the mostly-standards Nights of Key Largo (2008), for the Japanese audiophile label Venus, which garnered her a prestigious Swing Journal Gold Disc Award; Obsession (2009), for the multi-Grammy-nominated Motéma label; and Beyond the Blue (Venus 2011- Motéma 2012), which was picked by the London Times as one of the Top Ten Jazz CDs of 2013, and which features jazz arrangements of classical gems adorned with her own “exhilaratingly mature lyrics.” (Neil Tesser, Chicago Examiner)\n\nTessa performs regularly in New York (Jazz Standard, Kitano, Iridium, Dizzy’s Club Coca Cola, Blue Note, Joe’s Pub, 55 Bar) and all over the world, including four sold out tours of the philharmonic halls of Russia, and regular appearances at Pizza Express Jazz Club. In the US she has headlined at Seattle’s Jazz Alley, SF Jazz Center, Kuumbwa, multiple times at Half Moon Bay’s legendary Bach Dancing and Dynamite Society, and the Xerox Rochester International Jazz Festival (six appearances, one of which was filmed for PBS and continues to air nationally). She is also a regular at Ruth Price’s Jazz Bakery in LA. Her invariably standing-room-only residency at Greenwich Village’s iconic 55 Bar (chosen by CBS New York as one of New York’s Top Five Jazz Clubs) is in its 14th year.\n\n“Singers like her don’t come along every day.” Neil Tesser, Chicago Examiner", "otherInfo": "No other event info available"}, {"Address": "136 Broadway, Amityville, NY 11701", "Artist": "Karen Bella ", "ArtistImage": "https://photos.bandsintown.com/thumb/9346109.jpeg", "Coordinates": [-73.416867, 40.67599], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Karen Bella", "Time": "10:00 PM UTC", "Venue": "Carney's Irish Pub And Restaurant", "moreBioInfo": "Karen Bella, born and raised in New York, is a singer-songwriter and guitarist who performs throughout the tri-state area.\n\nShe studied voice at 9 and began writing original songs at 12. She was always involved with theater production in school as well as band, choir and drama.\n\n\n\nAfter studying at Fivetowns College, Karen began her singer-songwriter music career.\n\nShe released her first album titled “Ordinary Girl”.\n\nBella was invited for a VIP audition for NBC’s The Voice and began performing throughout NYC including places in The Village such as The Delancey, The Living Room, Piano’s and the famously known, The Bitter End. She was even asked to perform at The Harry Chapin Memorial Concert at Harry Chapin Lakeside Theater in Eisenhower Park which she has done for the past several years.\n\n\n\nMajor recent performances have included Huntington’s Folk Festival (July 2015 & 2018), The Smithtown Blues Festival (June 2015) , Philadelphia Music Festival (June 2019) , The Great South Bay Music Festival (July 2019), The Opioids Prevention & Awareness Music Festival (August 2019) and more to come.\n\nAs of June 2019, Sam Ash Music Store sponsors Karen Bella. www.samash.com\nAs of November 2019, Fishman endorses Karen Bella. www.fishman.com\n\n\n\nBella will be releasing a 6 song EP with Producer Josh Dion from the band Paris Monster. March 2020\n\nFor more information on upcoming shows, photos, videos news, music and record releases, please go to www.karenbella.com\n\nFacebook/Instagram: @karenbellamusic\n\nTwitter: @karen_bella_", "otherInfo": "No other event info available"}, {"Address": "1300 Ocean Ave, Asbury Park, NJ 07712", "Artist": "Alkaline Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/8791016.jpeg", "Coordinates": [-73.998973, 40.223908], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Punk, Rock, Alternative", "Time": "11:00 PM UTC", "Venue": "Asbury Park Convention Hall", "moreBioInfo": "In 2018, Alkaline Trio created a brand new full-length album behind a veil of secrecy. Is This Thing Cursed?, their first record in over five years, is a spirited conjuring of everything the band has summoned before, electrified with a new urgency. As it turns out, the most important modern rock band to combine heartbreak, power-pop, and a flirtation with the occult was just getting started.\n\nA few short years ago, Alkaline Trio put on a massive black celebration of close to a hundred songs, over sold out multi-night residencies in a handful of cities including Los Angeles, Chicago, New York, and Orange County, tearing through eight studio albums and nearly two decades of history. The devotion of the band’s adoring cult following was repeatedly rewarded, as the twists of phrase and dark melodies that have become a part of the fabric of their lives danced around them in sweaty, intimate, seductive ceremony. For a subculture of outsiders, misfits, and lonely-hearts, songs like “This Addiction,” “Time to Waste,” and “Radio” are perfect anthems.\n\nAlbums like From Here to Infirmary, Crimson, and Agony & Irony are classics. Now the portal to a new era opens with the fresh vibrancy of Is This Thing Cursed?, a furiously inspired collection of songs created in an unprecedented situation. For the first time in their history, Alkaline Trio booked studio time, arrived with little more than a few ideas, and created an entire album on the spot.\n\n“Everyone always thinks that their newest record is their best record and I'm no different,” says vocalist/guitarist Matt Skiba. “Of course we think it's our best record. We wouldn't put it out if we didn't think it was our best record. As far as where it sits in our ‘catalog’? Hopefully, it's a big step, but a logical one.”\n\nVocalist, bassist, and co-songwriter Dan Andriano concurs. “We made a record in a way we’ve never done it before and it worked. I'm really excited about it. Everything sounds fun and fresh. I suppose any band making their ninth record would like to hope that their longtime fans are going to be into it, but I really feel like we made a record that the old school fans are going to dig. I really, really do.”\n\nGood Mourning (2003) cracked the Billboard Top 20. This Addiction (2010) debuted at Number 1 on Billboard’s Rock, Independent, and Alternative charts. But even with strong record sales, radio play, and several late night talk show performances, the Alkaline Trio torch burns brightest for the diehards. It’s a legion of fans that crisscross the globe for shows; faithful devotees who remain proudly connected to Skiba, Andriano, and longtime drummer Derek Grant.\n\nAs Noisey once summarized, ALK3 “cut themselves from a unique enough black cloth to standout” in a sea of punk lookalikes in the late 90s and early 2000s, mining the poeticism of Jawbreaker, the campy vintage goth of horror rock, and the three-chord driven punk bombast so beloved in their native Chicago scene.\n\nIs This Thing Cursed? hearkens to the creative process of the early days, when the band rehearsed in a tiny apartment on the edge of Chicago’s Humboldt Park, at the intersection of Damen Avenue and Division Street, near D&D Liquor. The appropriately titled “Demon and Division” recalls the vibe of the song “San Franciso,” one of the beloved tracks from the very first album, Goddamnit (1998).\n\n“It has an old Trio vibe to it. Somewhere in the back of my mind I was thinking I wanted it to sound like an old school Trio song,” Skiba explains. In fact, much of Is This Thing Cursed? shares exciting psychic similarities with the discography.\n\n“We slowly realized that in a completely different way there were a lot of parallels between this new record and [2000’s] Maybe I'll Catch Fire,” Skiba confirms. “The process, the themes, there are just a lot of similarities from our perspective. It almost feels like a sister record to it or something, or like a first cousin.”\n\nThe album was tracked in Los Angeles at The Lair. With its weird antiques, big wooden doorways, large velvet drapery, and eye candy sconces, Andriano describes The Lair as “what it would look like if Alkaline Trio designed a studio.”\n\nProducer Cameron Webb (Motörhead, Megadeth) was an essential part of the creative process, encouraging the band to power through their ideas and flesh out their songs with a mixture of spontaneity and certainty. Over the years, Alkaline Trio has worked with the A-list of the genre’s producers, including Webb, Matt Allison (Smoking Popes, Rise Against), Josh Abraham (Thirty Seconds To Mars, Slayer), and Bill Stevenson (Descendents, A Day To Remember). But the advice of the late Jerry Finn (Blink-182, Morrissey) was a pivotal guiding force.\n\n“Jerry's sort of mantra was, 'first thought best thought.' Not that it works every time, but it works a lot,” Skiba explains. “[Another thing he taught us] is that just because something wasn't intentional, that doesn't mean it was a ‘mistake’… In the past we’d spend a lot of time in preproduction. With this record we went in with pretty much nothing. Dan had a couple of demos. I didn't have a single complete demo for the new album, just a few ideas on my phone. We pretty much wrote the whole thing as we recorded it. We wrote a song or two a day.”\n\n“That old school style writing process, combined with how we feel now about what we want when we listen to a record made for a nice combo,” says Andriano.\n\nAs ever, the storytelling remains of paramount importance. As co-lyricists, both of the band’s frontmen avoid empty imagery and flowery words absent of meaning. The songs always tell a story, a mixture of fact and fiction, reality and metaphor.\n\nThe title track began as something very personal for the group’s bassist. “Everyone gets to a point where you feel like you can’t win, you’re up against it,” he explains. “It’s totally irrational but that’s how you feel when you’re completely lost in the throes of depression. You feel like everything you look at, everything you touch, all of it must be cursed. Then it becomes inward, like, ‘Maybe it’s me that’s the problem. Is it this body of mine, this host that I walk around in?’”\n\nWebb suggested Skiba sing a verse on “Is This Thing Cursed?” as well. “Dan sings most of the song’s vocals. It's his baby,” the guitarist says. “He and I work really well together. As corny as it might sound, I'm sure there are a lot of times we're communicating without speaking. Sometimes things are left unsaid or I can tell that he doesn't want me to ask what it's about. There isn't really much that Dan and I wouldn't tell each other, but sometimes it's nice to have the mystery. [This song] is a rare occurrence where [the subject] never came up specifically.”\n\n“Blackbird” is another product of the duo’s collaboration. It was one of the few instrumentals Andriano had worked out before they arrived. He loved the music but wasn’t happy with his own lyrics or melodies before he passed it over to Skiba, who was obsessed with the Lockheed SR-71 Blackbird as a kid. Skiba drew the military airplane on everything, built model kits, and even as an adult, devoured books on it. Around the time the lyrics came together, “Blackbird” was the nickname for a girl he was dating. “She didn't look like a bird, but she has this sleekness, this sexiness, that I felt just reminded me in some way of that plane.”\n\n“I Can’t Believe” is brand new territory for Alkaline Trio. “It's about the current administration,” says Skiba, who traditionally had shied away from political topics. “It’s even more so about the people that continue to think that Trump is a good idea, regardless of all the racism, sexual abuse, and pig-nature of this person. So much damage has been done. I can't believe why anyone would think that's a good idea. It blows my mind. It's the first time I've ever written a song like that.”\n\nAndriano wrote “Little Help” about a type of person he’s “been close to becoming and I don’t care to become.” Another new song, “Pale Blue Ribbon,” is even more personal. It’s about the death of a friend. “It’s about wishing I could go back and talk to him.” As the song declares, “There’s no prize for winning this race.”\n\nIs This Thing Cursed? is filled with the type of naked self reflection and authentic personal revelations that have drawn so many punks, goths, alternative rock advocates, and music fans of all stripes to Alkaline Trio, assuring the band’s continued relevance and vibrancy, now more than 20 years into their story. It’s a passionate display of truth telling emotion set to timeless melodies that’s inspired a type of reverence usually reserved for longer running icons and trailblazers.\n\nLike the Misfits “fiend skull,” the Black Flag “bars,” or the Bad Religion “crossbuster,” Alkaline Trio’s iconic Heart & Skull symbol is bigger than the band it represents. It’s a badge of honor for diverse and defiant individuals who share a passionate commitment to the triumph of the outsider. Like the heart that surrounds the skull, while the band may celebrate the macabre, there’s an ever-beckoning black light within their darkness. No matter how bleak things may seem, the music of Alkaline Trio is there, with a sly phrase and a sweet melody.", "otherInfo": "ALL AGE SHOW DOORS 7:00 PM"}, {"Address": "315 West 44th St, New York, NY 10036", "Artist": "Ben Allison ", "ArtistImage": "https://photos.bandsintown.com/thumb/9187978.jpeg", "Coordinates": [-73.989689, 40.759], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Film Music, Improvisation, Jazz, Instrumental, Rock, Other", "Time": "11:00 PM UTC", "Venue": "Birdland", "moreBioInfo": "Bassist/Composer/Producer/Educator Ben Allison has developed an international reputation as a performer, composer and producer and is a leading voice in contemporary jazz. Ben has organized and performed on over 150 tours, winning fans and building new audiences throughout the world with an adventurous yet accessible sound and a flair for the unexpected.\n\nBen has released 13 albums of original music, 7 of which topped the national jazz radio charts, garnering him 9 SESAC Performance Awards. His most recent album, Quiet Revolution is the 3rd to be released on his own Sonic Camera Records label, following 2017’s Layers of the City.\n\nAt the age of 25, Ben formed the Jazz Composers Collective, a non-profit organization that fostered and presented new music. He acted as the Collective’s Artistic Director from 1992 until 2005.\n\nHe currently serves as President of the New York Chapter of the Recording Academy and sits on the organization’s Presidents Council. In 2012, he represented the Recording Academy when he testified before Congress on issues relating to performing rights for artists. He has also served as Vice President, Chair of the Advocacy Committee and organized the first ever Grammy Town Hall in 2015.\n\nBen has written articles for Downbeat, JazzTimes, the IAJE Journal, Premier Guitar, Bass Player as well as his own blog at www.benallison.com/blog. He wrote the theme for the popular NPR radio program On The Media, which is heard by over 1,500,000 listeners weekly, and was a featured composer and performer with the Jazz Sinfonica, 80-piece symphony orchestra, Sao Paulo, Brazil, in 2005, 2008 and 2013. He has conducted residencies and workshops in over 100 universities and conservatories throughout the world.\n\nBen is on the faculty of the New School for Jazz & Contemporary Music and Mannes College of Music in New York City, where he teaches Entrepreneurship in Music, The Entrepreneurial Musician, Senior Seminar, Music Tech Seminar, improvisation ensembles, bass and composition. He serves on the Jazz Executive Committee, which oversees curriculum development for the school.\n\nBen performed his Carnegie Hall debut in February 2012.", "otherInfo": "No other event info available"}, {"Address": "498 Court St, Brooklyn, NY 11231", "Artist": "Devadas ", "ArtistImage": "https://photos.bandsintown.com/thumb/7460118.jpeg", "Coordinates": [-73.998729, 40.676824], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Christian-gospel, Spiritual, Rock, Christian/gospel, Folk, Kirtan", "Time": "11:00 PM UTC", "Venue": "Prema Yoga Brooklyn", "moreBioInfo": "Devadas is a kirtaniya, composer and artist hailing from Brooklyn, New York. He leads kirtans throughout the world and has recorded a wide variety of acclaimed CDs, including his latest release, The Grand Street Kirtan Sessions, a six hour live recording of live, uncut, traditional temple-style kirtan. In 2012, Devadas collaborated with indie-rock icon J Mascis to produce and record the film score for the feature documentary One Track Heart: The Story of Krishna Das. Devadas produced Nina Rao’s chant album, Antarayaami, and in 2016 launched the Lokah Peace Project, an online and ever-expanding video project aimed at inspiring reflection, empathy and harmony.", "otherInfo": "No other event info available"}, {"Address": "4608 Sunrise Hwy South Service Rd, Oakdale, NY 11769", "Artist": "Too Many Voices ", "ArtistImage": "https://photos.bandsintown.com/thumb/7714756.jpeg", "Coordinates": [-73.11417, 40.75463], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Hardcore", "Time": "11:00 PM UTC", "Venue": "Shakers Pub", "moreBioInfo": "Points east.", "otherInfo": "No other event info available"}, {"Address": "2 Pettit Pl, Island Park, NY 11558", "Artist": "Bryce Larsen ", "ArtistImage": "https://photos.bandsintown.com/thumb/8461237.jpeg", "Coordinates": [-73.653921, 40.596447], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Live Looping", "Time": "11:00 PM UTC", "Venue": "EGP Land & Sea", "moreBioInfo": "Acoustic americana soul artist Bryce Larsen uses live looping to bring his serious guitar chops, powerful vocals, and unique beat boxing style together to create an entirely new take on the “one man band.”\n\nThe American Idol alum is known for his ability to manipulate the mood of a room by telling emotional stories with his music, regardless of whether he is playing covers or originals. Bryce sings the hits and cult favorites from every era and every genre and makes it a point to create an experience for his audience in the moment by constantly conjuring new versions of old favorites, connecting songs and building huge soundscapes on his own that are worthy of stadium performance.\n\nBryce's most recent release, \"Here's to You,\" is a full length, fully produced album that was funded through a Kickstarter crowd-funding campaign that raised over $24,000. He used the money to spend three months in Nashville, TN, working with producer Freddy Wall at the legendary Dark Horse Studios. You can find \"Here's to You\" on iTunes, Spotify, Amazon, and at any of Bryce's shows, along side a CD titled \"best of the Bar,\" his constantly changing collection of live cover song recordings.\n\nBorn in Alexandria, Virginia, Bryce Larsen moved with his family at age 7 to Long Island, NY, where he learned to play mostly through his own compositions, and thus developed a very unique rhythm-oriented style of guitar that is a conglomeration of rock and R&B styles.\n\nDuring his college years, (he studied at Rutgers University and graduated from the CW Post Campus of Long Island University with a degree in music) Bryce spent almost all of his free time touring as the frontman of the horn-laden rock band Stealing Jane, honing his skills in songwriting (and co-writing), arrangement, production, and performance.\n\nThe incredibly popular Fox television show \"American Idol\" featured Bryce in January, 2010, on the series premiere, and for the first two rounds of Hollywood Week as he finished in the top 90. The show brought him exposure in countless new markets, and also brought his musicianship to a new level as a solo artist.\n\nBryce Larsen is now a middle school general music teacher, introducing a new generation to the lifelong benefits of music through piano, guitar, percussion and any instrument he can get his hands on. He works to help kids shed the fear of improvisation and trust themselves and each other as musicians.\n\nMost nights, you can find Bryce performing solo with his Martin GPCPA1 guitar. He loves nothing more than to be on stage, whether he is performing covers (that he truly makes his own), or songs he has written which are often compared to the work of Marc Broussard, John Mayer, the band Sublime and Dave Matthews.", "otherInfo": "No other event info available"}, {"Address": "620 Van Houten Ave, Clifton, NJ 07013", "Artist": "Honor Among Thieves ", "ArtistImage": "https://photos.bandsintown.com/thumb/8478030.jpeg", "Coordinates": [-74.147597, 40.857906], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Hard Rock", "Time": "11:00 PM UTC", "Venue": "Dingbatz", "moreBioInfo": "HONOR AMONG THIEVES, is a Rock band, formed in 2003, on New York City's lower east side. Maurice Johnson- Vocals, Todd Louis- Guitars, David Alva- Bass and Dave (Late Night Dave) Brooks- Drums united over a single mission: To play Rock n' Roll and have one hell of a good time doing it! Their love of music fun demeanor and camaraderie is easily heard in their music and immediately infectious to live audiences, making every show a party, every moment , the best time ever! All four band members share a belief that there's nothing like a live a rock n' roll show and they make it a point to bring their party to the stage regularly and travel often. Still based in New York City, HONOR AMONG THIEVES have, \"The Greatest City in the World\" as their playground and the entire planet by the ears.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Matt Sucich ", "ArtistImage": "https://photos.bandsintown.com/thumb/8834717.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Indie, Alt-country, Acoustic, Folk", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Matt Sucich writes songs, mostly with a pen, and sings them, always with his mouth. His last name is pronounced Sue.Sitch and people often show how much they like his writing by comparing him to other very cool artists. One time Jim James came to a show.", "otherInfo": "Brian Dunne w/ Matt Sucich - Rockwood Stage 2"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Pink Talking Fish ", "ArtistImage": "https://photos.bandsintown.com/thumb/9187556.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Fusion, Rock", "Time": "11:30 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "A Fusion of Pink Floyd, The Talking Heads and Phish!", "otherInfo": "Space Bacon"}, {"Address": "206 W 118th St, New York, NY 10026", "Artist": "Michela Marino Lerman ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.952542, 40.804817], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Jazz, Rhythm & Blues, Blues, World Music, Tap Dancing, Funk, Tap Dance", "Time": "11:30 PM UTC", "Venue": "Minton's Playhouse", "moreBioInfo": "Michela Marino Lerman winner of the 2019 Hoofer Award, is a globally sought after tap dance artist, performer, choreographer, educator and all-around creative spirit. The Huffington Post has called her a “hurricane of rhythm” and the NY Times has called her both a “prodigy” and has described her dancing as “flashes of brilliance”. She very proudly, was mentored by some of the masters of tap dance including Gregory Hines, Buster Brown, Leroy Myers, Marion Coles and Mable Lee. Lerman has performed, choreographed, produced, and directed many projects throughout her career. Some highlights include leading her own band Love Movement and being a member of the band Mwenso and the Shakes, whom she tours with regularly. Performing at the Newport Jazz festival, Jazz at Lincoln Center, opening night of The Shed at the Hudson Yards, The Other Palace on London's West End, and co-producing the documentary American Tap. She has had the honor of working with such masters as Wynton Marsalis, Roy Hargrove, Anna Deavere Smith, Jon Bastiste, Quincy Jones, Steve McQueen and many more. www.michelataps.com @michelataps", "otherInfo": "No other event info available"}, {"Address": "1160 Broadway 5th floor, New York, NY 10001", "Artist": "Gregg August ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.988693, 40.744678], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "11:30 PM UTC", "Venue": "The Jazz Gallery, NYC", "moreBioInfo": "No artist bio available", "otherInfo": "John Ellis-Soprano\nBruce Williams-Alto\nJD Allen-Tenor\nMarcus Strickland-B. Clarinet\nJohn Bailey-Trumpet\nRafi Malkiel-Trombone\nMarcus Rojas-Tuba\nLuis Perdomo-Piano\nGregg August-Bass/Composer\nDonald Edwards-Drums\nMauricio Herrera-Percussion\nFrank Lacy-Vocals\nWayne Smith-Narrator"}, {"Address": "2 6th Ave, New York, NY 10013", "Artist": "Zana ", "ArtistImage": "https://photos.bandsintown.com/thumb/8986020.jpeg", "Coordinates": [-74.004911, 40.719153], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Soul, Gypsy, Pop", "Time": "11:30 PM UTC", "Venue": "The Roxy Hotel", "moreBioInfo": "Zāna is a singer/songwriter, and versatile musician originally from the Oakland Bay Area. Currently, she lives in NYC where you can enjoy her performances at local live venues. Having collaborated with Grammy-winning producers Tim Mitchell and George Noriega, Zāna has launched a solo career as a pop artist. With a growing fan base locally and overseas, she has released 5 singles and her debut EP 'The Beauty of Zora'. A gifted songwriter with a sultry voice, Zāna’s unique style, which fuses Arabic and Latin influences to create what she labels as her ‘gypsy-pop’ sound is both upbeat and soulful, allowing her to showcase her hip-shaking belly dancing moves while performing.\n\nInstruments:\nvocals, drumkit, arabic percussion (i.e. darbuka, riq, sājāt), and guitar.", "otherInfo": "No other event info available"}, {"Address": "66 North 6th St, Brooklyn, NY 11211", "Artist": "Basia Bulat ", "ArtistImage": "https://photos.bandsintown.com/thumb/9697238.jpeg", "Coordinates": [-73.96168, 40.71925], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Folk, Alternative, Pop, Indie, Songwriter, Singer", "Time": "12:00 AM UTC", "Venue": "Music Hall of Williamsburg", "moreBioInfo": "Basia Bulat is a singer-songwriter who lives in Montreal, Canada. Over the course of five albums, she has brought together an intrinsic contemporary sound with a love of classic folk, country and R&B songwriting. Her first two albums, the folk-music-tinted Oh, My Darling (2007) and Heart of my Own (2010) were recorded in analogue with punk-rock producer Howard Bilerman; 2004's Tall Tall Shadow, exploring friendship and grief, was made with Mark Lawson and Arcade Fire's Tim Kingsbury; 2016's Good Advice, a break-up album, was produced in Kentucky with My Morning Jacket frontman Jim James. In addition to her powerhouse voice, Bulat is an accomplished multi-instrumentalist, recording and performing on electric guitar, piano, autoharp, ukulele, bass and charango.\n\nBulat is a three-time Polaris Music Prize finalist and has been nominated for three Juno Awards. In recent years she has also been selected to perform at landmark events such as the Montreux Jazz Festival, and Newport Folk Festival. As a touring artist, she has shared stages with acts including Nick Cave and the Bad Seeds, Neko Case, Arcade Fire, St Vincent, and Sufjan Stevens.", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Space Bacon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9094509.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Jam Bands, Electronica, Rock, Funk, Jamtronica", "Time": "12:00 AM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Brooklyn based jamtronica quartet that weaves composition and improvisation through an ever-changing landscape of segues, inversions, and palindromes.", "otherInfo": "No other event info available"}, {"Address": "288 Jericho Turnpike, Mineola, NY 11501", "Artist": "Dan Reardon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9791571.jpeg", "Coordinates": [-73.647672, 40.747168], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Cornerstone Bar", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "45 Main St, Stanhope, NJ 07874", "Artist": "Six Gun Sal ", "ArtistImage": "https://photos.bandsintown.com/thumb/9945667.jpeg", "Coordinates": [-74.7085, 40.90277], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Southern Rock, Rock, Classic Rock", "Time": "12:00 AM UTC", "Venue": "The Stanhope House", "moreBioInfo": "No artist bio available", "otherInfo": "Rockin the House\nSix Gun Sal\nAnd special guest\nThe Crowning"}, {"Address": "497 Rogers Ave, Brooklyn, NY 11225", "Artist": "Jean Rohe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8355477.jpeg", "Coordinates": [-73.953288, 40.660114], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Brooklyn, New York", "Time": "12:00 AM UTC", "Venue": "The Owl Music Parlor", "moreBioInfo": "“There are plenty of talented artists out there, but what sets Jean Rohe apart are the suppleness of her voice, the integrity of her vision, and the grace she shows in her wide-ranging journeys across the musical landscape.” --John Platt, WFUV New York Jean Rohe sings and plays multi-lingual original music of the Americas, North and South. Whether solo or with her genre-bending trio, Jean brings the full breadth of her stylistic attractions to bear, exploring the intersections of American folk music, jazz, Brazilian and Afro-Peruvian traditions. The product of both a nurturing folk music community in her childhood, as well as the vibrant New York improvised music scene, it is not unusual to find Jean and her band in a downtown jazz club inviting a disarmed audience to sing boisterous choruses. Likewise, her sophisticated songwriting and arranging has found a home at folk music festivals around the country. Jean has performed everywhere from the Birdland to the National Theater in Cuba; from New York City's own Living Room to the Montreux Jazz Festival, where her refreshingly earnest performance won her the audience prize in 2006. She has appeared as a special guest with the Billboard-charting alt-country group Calexico and performs with Liam Robinson in the American/Irish traditional duo, Robinson & Rohe. \"Jean has the remarkable ability, typical of all true artists, to hold her vast palette of technical virtuosity in check and only bring what's needed at any given moment. Hardly the aloof jazz musician we've grown accustomed to, she brings her listeners along for a joyful ride through her soundworld, while challenging them with questions about what it means to be a global citizen.\" --William R. Bauer, Ph.D, author of Open the Door: The Life and Music of Betty Carter Songwriter & performer, Brooklyn, NY.", "otherInfo": "No other event info available"}, {"Address": "261 Lee Ave, Richmond County, NY 10307", "Artist": "Onism E ", "ArtistImage": "https://photos.bandsintown.com/thumb/9368798.jpeg", "Coordinates": [-74.242803, 40.510958], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Alternative Rock, Indie Rock, Rock", "Time": "12:00 AM UTC", "Venue": "Indie Band Guru", "moreBioInfo": "Onism E is Austin and New York City's newest indie rock band. From singer/songwriter and former Senate Records recording artist Eline Chavez, this new project comes after an extended hiatus from the tour scene to further craft and develop her production skills. After a few years of embedding herself in the production side of the music scene, she is finally back and ready to tell the story of those years out of the public eye.\n\nKnown for being a workhorse in the indie music scene, Eline continues to develop her unique and ever-evolving style with Onism E. Rooted in rock music; this is a combination of her alt-rock style and a new found love of moody and often dark melodies.\n\nPromising to make 2020 exciting for their fans, Onism E plans on releasing more music and playing as many shows as possible. Check them out in a city near you!", "otherInfo": "More info to come."}, {"Address": "636 Dean St, Brooklyn, NY 11238", "Artist": "Ari Hoenig ", "ArtistImage": "https://photos.bandsintown.com/thumb/8224716.jpeg", "Coordinates": [-73.969229, 40.680347], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Brooklyn, New York", "Time": "12:00 AM UTC", "Venue": "Soapbox Gallery", "moreBioInfo": "Ari Hoenig (born on November 13, 1973 in Philadelphia, Pennsylvania), is a New York based jazz drummer, composer and educator known for his unusual and intense approach to drumming emphasizing complex rhythms in direct harmony with other group members. Ari is widely noted particularly for his drumming not being relegated to just keeping tempo, or being a side issue to the music he plays in, but rather for elevating drumming as an indispensable part of the performance.", "otherInfo": "No other event info available"}, {"Address": "2823 Long Beach Rd, Oceanside, NY 11572", "Artist": "Nate Charlie Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8983203.jpeg", "Coordinates": [-73.639812, 40.642665], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Acoustic, Reggae, Pop, Acoustic Alternative, Indie Rock, Classic Rock, Indie Pop, Indie Folk, Pop Punk, Alternative, Soft Rock, Rock, Folk", "Time": "12:00 AM UTC", "Venue": "EGP", "moreBioInfo": "Nate Charlie is an acoustic singer/songwriter act that performs a variety of cover songs (from the 60's to now) in his own unique way. Occasionally, Nate Charlie teams up with Frank Justin Stark to perform as the Charlie Justin Duo which adds both vocal harmonies and world percussion.\n\nViewers have complimented Nate Charlie’s clever song arrangements, his aim to stand out from the rest, and his focus to keep a fresh face on that of the acoustic entertainment world. Spanning over 50 venues on Long Island and averaging 150 shows played per year, it’s safe to say Nate Charlie has become a staple act in the Long Island music scene.", "otherInfo": "No other event info available"}, {"Address": "1409 Queen Anne Rd, Teaneck, NJ 07666", "Artist": "The Nerds ", "ArtistImage": "https://photos.bandsintown.com/thumb/8479599.jpeg", "Coordinates": [-74.0048, 40.90166], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Rock", "Time": "12:00 AM UTC", "Venue": "Debonair Music Hall", "moreBioInfo": "You can’t help having the best time of your life when you are with THE NERDS. You\nwill enjoy an experience of sheer entertainment with what critics call the best\ncover band in the world.\n\nThe Nerds calendar of events has completely dominated the club, college, corporate,\nprivate, fair and festival, and wedding markets world-wide. Some highlights include\nselling out Carnegie Hall, PNC Arts Center in NJ, PNC Arts Center in Raleigh NC,\nRockefeller Center, Lincoln Centre, and every major site in New York. Through the\nyears they have performed in the top venues in 38 states. When considering THE\nNERDS for your show, ask yourself. What other cover band has headlined at Carnegie\nHall? If you desire the biggest name in cover bands, contact THE NERDS. The band\njust loves to play from the smallest backyard to the most popular celebrity weddings.\n\nIf this isn't enough, consider the following performances at The China Club in L.A.,\nChina Club in NYC, Hard Rock Café in NYC, Baltimore, and Atlantic City, The House of\nBlues in Vegas, and many more. Highlights also include the house band on ABC for\nBarbara Walter’s “The View” and “Live with Regis and Kathie Lee,” featured live at\nRoseland Ballroom as MTV’s house band, as well as the house band on Carson Daily.\nNot to mention being the National College Band of the Year!\n\nSharing and co-billing shows is a Nerds specialty. Some acts have included Maroon 5,\nHootie and the Blowfish, Harry Connick JR., Earth, Wind & Fire, Sheryl Crow, Southside\nJohnny, Grand Funk Railroad, The Go Go’s, Kool and The Gang, and Train, to name\nonly a few. Once in a while you'll see Jon Bon Jovi get up on the stage and play with\nTHE NERDS.\n\nThe Nerds have performed in hundreds of radio sponsored events for corporations such\nas AT&T, Sony, IBM, Lucent Technologies, Lenovo, Verizon, NBA, NFL and the\nNHL, and countless others! Critics from LA Weekly to The NY Times salute the Nerds\nwith rave reviews. All of this makes THE NERDS a major force in the music\nindustry!!! In particular, THE NERDS love to play weddings, corporates, private parties,\nas well as attracting fresh new audiences to car shows, fairs, and festivals.", "otherInfo": "No other event info available"}, {"Address": "497 Rogers Ave, Brooklyn, NY 11225", "Artist": "Jean Rohe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8355477.jpeg", "Coordinates": [-73.953288, 40.660114], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Brooklyn, New York", "Time": "12:00 AM UTC", "Venue": "The Owl Music Parlor", "moreBioInfo": "“There are plenty of talented artists out there, but what sets Jean Rohe apart are the suppleness of her voice, the integrity of her vision, and the grace she shows in her wide-ranging journeys across the musical landscape.” --John Platt, WFUV New York Jean Rohe sings and plays multi-lingual original music of the Americas, North and South. Whether solo or with her genre-bending trio, Jean brings the full breadth of her stylistic attractions to bear, exploring the intersections of American folk music, jazz, Brazilian and Afro-Peruvian traditions. The product of both a nurturing folk music community in her childhood, as well as the vibrant New York improvised music scene, it is not unusual to find Jean and her band in a downtown jazz club inviting a disarmed audience to sing boisterous choruses. Likewise, her sophisticated songwriting and arranging has found a home at folk music festivals around the country. Jean has performed everywhere from the Birdland to the National Theater in Cuba; from New York City's own Living Room to the Montreux Jazz Festival, where her refreshingly earnest performance won her the audience prize in 2006. She has appeared as a special guest with the Billboard-charting alt-country group Calexico and performs with Liam Robinson in the American/Irish traditional duo, Robinson & Rohe. \"Jean has the remarkable ability, typical of all true artists, to hold her vast palette of technical virtuosity in check and only bring what's needed at any given moment. Hardly the aloof jazz musician we've grown accustomed to, she brings her listeners along for a joyful ride through her soundworld, while challenging them with questions about what it means to be a global citizen.\" --William R. Bauer, Ph.D, author of Open the Door: The Life and Music of Betty Carter Songwriter & performer, Brooklyn, NY.", "otherInfo": "No other event info available"}, {"Address": "Brooklyn, Brooklyn, NY 11237", "Artist": "Starberry ", "ArtistImage": "https://photos.bandsintown.com/thumb/9911572.jpeg", "Coordinates": [-73.963569, 40.695261], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Philadelphia, Pennsylvania", "Time": "12:00 AM UTC", "Venue": "Rubulad", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "361 Metropolitan Ave, Brooklyn, NY 11211", "Artist": "Them Vibes ", "ArtistImage": "https://photos.bandsintown.com/thumb/8230757.jpeg", "Coordinates": [-73.955825, 40.714204], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Americana, Rock, Southern Rock", "Time": "12:00 AM UTC", "Venue": "Knitting Factory Brooklyn", "moreBioInfo": "Formed and honed in East Nashville, TN by lead singer Brother Love, guitar players Alex Haddad and Kyle Lewis, and with the helping hand of a powerhouse rhythm section, Them Vibes shook the foundations of Music City with their blitzkrieg live show and soulful songwriting. Inflected with the rhythmic sway of The Faces and T-Rex, the raw energy of the Rolling Stones and the Black Crowes, and the whiplash funk of Sly And The Family Stone and James Brown, Them Vibes has risen to a sonic experience all of their own.\n\nThe band has opened for household names like Cage the Elephant, Cheap Trick, Lynyrd Skynyrd, and The Flaming Lips. With three records under their belt- Shine On, TV, Electric Fever- their songs have been featured on CBS's NCIS: LA, ABC's The Rookie, Showtime's Shameless, Amazon's Sneaky Pete, Netflix's The Ranch, and a National T-Mobile campaign. America's number one independent radio station, Lightning 100 WRLT, ranked their self titled single, Electric Fever, number 22 in the Top 200 Songs of The Year and Top 4 Best Shows To See Live!\n\nFresh off the road with Maggie Rose, Them Vibes roared back in the studio writing and recording their next EP due out in February 2020, featuring the unrelenting funk heavy single, \"Right On,\" written by Alex Haddad, Brother Love, and Kyle Lewis, and featuring the brilliant, soul stirring vocals of Maggie Rose.", "otherInfo": "No other event info available"}, {"Address": "536 9th Ave # 1, New York, NY 10018", "Artist": "Aya Ishida ", "ArtistImage": "https://photos.bandsintown.com/thumb/7986115.jpeg", "Coordinates": [-73.993559, 40.75686], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Jazz", "Time": "12:00 AM UTC", "Venue": "Trattoria Casa Di Isacco", "moreBioInfo": "Aya Ishida is a New York based vocalist and composer. Originally from Japan, she moved to NYC in 2013 to pursue a music degree at City University of New York Hunter college. In 2014 She transferred to City University of New York City College where she received a B.F.A in Jazz performance under the Kaye Scholarship graduating with Degree Honors Magna Cum Laude in 2017.\n\nFrom the age of 8, Aya has been surrounded by music. Whether it was learning piano or singing in choirs as a soloist, she was always drawn to the energy of performing and discovering. After arriving in New York, Aya took her talent to new heights by studying with such masters as Steve Wilson and Carolyn Leonhart (just to name a couple). She quickly made a lot of connections and now performs regularly with a wide range of musicians.\n\nIn 2018, she released her debut album “Day by Day” having Grammy award winning saxophonist Wayne Escoffery as a producer. It includes her favorite jazz standards with her arrangements and her original compositions singing about her struggles from chasing dreams in NYC. With a soulful voice and an energetic heartfelt performance, she always captivates the audience.", "otherInfo": "No other event info available"}, {"Address": "43 Green St, Huntington, NY 11743", "Artist": "Carrie and The Cats ", "ArtistImage": "https://photos.bandsintown.com/thumb/9073244.jpeg", "Coordinates": [-73.428478, 40.869284], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Rock, Soul, Funk", "Time": "12:30 AM UTC", "Venue": "Finley’s Of Greene Street", "moreBioInfo": "Carrie and The Cats are a soul/rock band from Long Island, New York. Led by the incredible talent of vocalist Carrie Lynn Wicks, the group came together in early 2016 and currently features Will \"Wee Wee\" Bart (Guitar), Mike O'Donnell (Guitar), Billy \"Bad Bones\" Hanley (Saxophone), Chris \"CP\" Parrett (Bass), and Danny Roman (Drums). The band channels the soul and passion of classic acts like the Allman Brothers, Grateful Dead, and Aretha Franklin, while adding a new-school flair reminiscent of Amy Winehouse and John Mayer Trio. The band has had the honor of playing at The Paramount (opening for Matisyahu), Great South Bay Music Festival, Alive After Five, Montauk Music Festival, SXSW, My Father's Place at The Roslyn Hotel, The Rob Bartlett Radio Comedy Hour at Madison Square Garden, and won the 2018 Long Island Blues Challenge.", "otherInfo": "No other event info available"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Hayley Jane ", "ArtistImage": "https://photos.bandsintown.com/thumb/10081927.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Indie Folk, Americana", "Time": "12:30 AM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "\"This rising star has got the \"IT\" factor. She has deeply soulful pipes and vocal range topped off with a mesmerizing stage presence.\"-Live For Live Music\n\nHayley Jane’s performance is layered with raw intensity + linguistic prowess. She has a deeply emotive + highly magnetizing presence that’s generating a buzz in the industry.\n\nHayley pulls inspiration from a variety of styles, including 60s + 70s rock + pop, musical theater, folk, blues, soul, psychedelic, funk + bluegrass. Just as varied, are the many ways she can captivate an audience. Whether the concentrated potency of her solo acoustic performance, the explosive energy + movement of her full band shows, or one of her theatrical performances, she always brings the charisma, humor + passion to move an audience.\n\nHer music has been praised by a wide range of musicians, producers + music lovers alike, for successfully combining a diverse sound with clever, over-the-top lyrics + Vaudevillian-style storytelling. Hayley reawakens her audiences to the wild parts of themselves, great medicine for these modern times.", "otherInfo": "Hayley Jane - Rockwood Stage 3"}, {"Address": "572 Cookman Ave, Asbury Park, NJ 07712", "Artist": "Peak (NYC) ", "ArtistImage": "https://photos.bandsintown.com/thumb/8817630.jpeg", "Coordinates": [-74.00952, 40.21622], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "New York, New York", "Time": "1:00 AM UTC", "Venue": "House Of Independents", "moreBioInfo": "Based around the guitar playing and songwriting of Jeremy Hilliard, the band first came together in mid- 2016. By that Fall they played an inaugural, now-infamous residency at American Beauty in New York City and then road-tested many of the songs on an extended northeast tour. One thing that became apparent right away was that there was going to be an exploratory spirit to their live shows and that the songs are, on one level, springboards for extended improvisation as well as vehicles for dance-floor workouts. Inspired by rock, funk, and jazz artists such as The Band, The Talking Heads, Phish, The Grateful Dead, James Brown, Fela Kuti, Miles Davis, Grant Green and countless others, the goal, in their own words, is to “not know where we’re going” because that feeling of excitement and adventure translates to the audience. Front and center in the mix is Hilliard’s guitar, which is unmistakable in tone. He lists as early inspirations BB King and Jimi Hendrix, and using that as a jumping off point he brings jazz concepts to tell longer, more complex sonic stories.\n\nJeremy is no newcomer to the scene. He established his songwriting voice as a bandleader and lead guitarist for the band Turbine, with whom he made 4 studio albums and toured nationally for many years, including regular appearances on the some of the country’s biggest stages such as Bonnaroo Music Festival, Telluride Music Festival, Gathering of the Vibes, Moedown, and many others. For his new group, he searched far and wide to find the perfect complement to his sound and finally found it in the great gospel organist Otis Williams. Williams is a master of his instrument from a very young age, as well as a musical Swiss Army knife. He is able to incorporate synths, vocals, samples, really any sound under the sun. Coming from the Bronx, the birthplace of hip hop, beat making and dance music are second nature to him. He also plays with a totally unorthodox harmonic approach that will make any listener sit up and take notice. Holding this all together, and the driving pulse of the band, is the bass playing of Eric Thachuk. The new band was lucky enough to meet him when he first moved to New York from Toronto where he worked as a top studio and touring musician. He somehow always knows exactly the right note to play to hold down the fort for all the harmonic and rhythmic interplay, and his elegant choices as an improviser give the music a sophisticated form. He is also a multi-talented musician, programming all the electronic drums on the bands’ debut album. The newest member of the group is John Venezia on drums who is an up-and-coming killer on the kit. He recently finished at Philadelphia’s University of the Arts and although you don’t know it yet you need to see him live. After spending their first summer jamming, and then going out and getting 50 shows under their belt, the band knew that they wanted a full-length studio album to define their sound, and it would be all about the songs. So in early 2017 they hunkered down in Dave Brandwein’s (Turkuaz) Galaxy Smith Studios in Brooklyn to finish writing and record what would become their debut album, Electric Bouquet.", "otherInfo": "No other event info available"}, {"Address": "1218 Jericho Turnpike, New Hyde Park, NY 11040", "Artist": "Phil Smith ", "ArtistImage": "https://photos.bandsintown.com/thumb/7999326.jpeg", "Coordinates": [-73.682788, 40.732903], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "New York City, New York", "Time": "1:00 AM UTC", "Venue": "Olde Trading Post", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "459 Valley St, City of Orange, NJ 07050", "Artist": "The Normal Living ", "ArtistImage": "https://photos.bandsintown.com/thumb/9552060.jpeg", "Coordinates": [-74.24884, 40.76591], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Indie Pop-rock, Americana, Indie Rock, Rock", "Time": "1:00 AM UTC", "Venue": "Hat City Kitchen", "moreBioInfo": "Rock/pop band from Jersey City, NJ, now based in West Orange, NJ.\n\nThe seven members of TNL belong to what has been called the “Oregon Trail Generation.” They watched MTV rise from its infancy, and then lamented its ultimate transformation. As children of the 80s and 90s, they witnessed first-hand the rise of personal computers, the invention of the Internet, and the emergence of a global community. As adults, they also bore witness to the global cultural shifts that happened after 9/11, and then faced the financial crisis of 2008 as they were beginning to build their careers, families, and livelihoods. In the modern age of music, TNL straddles the divide between analogue and digital in their minds, hearts, and bodies. And their songs are also about straddling a line between youth and adulthood; they write about becoming an adult in the modern age, navigating waters that stretch into an ever-expanding universe.\n\nSonically, TNL is a unique blend of guitar-driven songs, layered with intricate piano, pop-rock vocals, and powerful yet sophisticated drums. It’s American heartland rock for the modern era, for Gen Xers who miss guitars in Top 40 music, who identify with the familiar echoes of 1960s girl groups, and who seek out today’s rootsy indie-rock.\n\nTNL was founded by songwriters Liza Zitelli Grabowski and Jon Ryan Grabowski, who began playing together in New York City in 2009. When childhood friend Paul began to join them for shows around NYC in 2010, along with Zitelli siblings Diana and Andrew, TNL was born.\n\nIn 2013, TNL independently produced and released their first EP, Less Radio (recorded at Sweet Sounds Studios in NYC). Less Radio is a rock record that expresses the inspirations and frustrations of the city and its satellites. Navigating urban and suburban landscapes, the characters of Less Radio are always in motion—on stages and subways in “Skyline Blues” and “Time Out, New York,” on ghostly trains in “Penn Station,” and on lonely highways in “Dead End Rock.” They even move in and out of the nostalgic past in “Charlotte Arms” and the dystopian, radio-less future of the haunting title track.\n\nThe blog RockNYC Live and Recorded named Less Radio #22 best album of 2013 and the song “Timeout, New York” as the #16 best song released in 2013. Blog founder and NYC music critic Iman Lababedi wrote, “Imagine Ronnie Spector fronting the E Street Band singing Springsteen-Goffin-King songs, and you will have an idea of what they are going for...It is like they are the last band in town writing new, young, classic rock worth a damn.\"\n\nWith the additions of Nick, Petros, Colin, and Amy over the next few years, TNL expanded its sound and released its first LP, Signals, on Feb 24, 2017. Recorded at Water Music Studios in Hoboken, NJ, Signals is a collection American stories set in the new millennium, as told by characters who consider the redeeming powers of community, love, music, and spirituality. The 8-song LP features an American heartland-rock sound—lush and spirited piano, powerful yet sophisticated drums, and driving guitar and bass, with crisp vocals and harmonies.\n\nIn his review of the Signals, Jersey Beat music blogger Joe Wawrzyniak wrote, “The robust vocals project a winning blend of strength and vigor. The harmonic arrangements boast everything from meaty guitar riffs to rousing horn lines to mighty rolling drums. Whether it's the fist-pumping anthem ‘American Summer’ or the tremendous headlong rush of ‘Into the Night,’ there's plenty to relish on this hugely enjoyable album.”\n\nA record-release show for Signals was held on Feb 25, 2017, at the legendary Maxwell's in Hoboken, to a sold out crowd.\n\nTNL’s next full-length release is planned for 2020, with singles from the new record being released in late 2019. On October 25, 2019, TNL released “How It All Went Down,” the first single from the forthcoming 2020 release. “How It All Went Down” is a powerful, up-tempo rock song driving guitars, a powerful rhythm section, crisp vocals and harmonies, and lush piano. It touches on themes of loss, motherhood, and storytelling, working towards a cathartic emotional ending.\n\nWith Grammy-nominated Chris Badami producing the new material, with mastering by the renowned Scott Hull of Masterdisk, TNL looks to help carry on the story of American songwriting in the millennial age.", "otherInfo": "It may be Good Friday, but every Friday at HCK is a good Friday!! Come dip some crispy fries in delicious ketchup, munch on some homemade poppers, sip on some great draft beers, and dance along to TNL! Bring your friends and family to this wonderful local venue. :)"}, {"Address": "140 Stewart Ave, Brooklyn, NY 11237", "Artist": "Black Tiger Sex Machine ", "ArtistImage": "https://photos.bandsintown.com/thumb/8787902.jpeg", "Coordinates": [-73.926398, 40.710569], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Electro House, Electronic, Futuristic Thriller", "Time": "1:00 AM UTC", "Venue": "Avant Gardner", "moreBioInfo": "Welcome to our Church. Our Helmets. Our Religion.", "otherInfo": "No other event info available"}, {"Address": "136 E Erie St, Blauvelt, NY 10913", "Artist": "Ryan Townsend Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9735440.jpeg", "Coordinates": [-73.951616, 41.063757], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Folk, Folk Rock, Rock", "Time": "1:30 AM UTC", "Venue": "Bailey's Smokehouse", "moreBioInfo": "Mixing folk rock songs with spirited guitars and textures, Ryan Townsend is a singer/songwriter creating unfettered acoustic driven compositions that share an alternative decadence and genuine intimacy. Professing a soulful balance, his voice evokes influences from Joe Cocker and Van Morrison to Ray Lamontagne and Eddie Vedder. He travels the divide between genres, crafting tales with a vintage spirit told in a rhythmic full-throated language. “I’ve always been attracted to the emotions and connections that music can make. How a simple melody or lyric can take you back to certain place or time just like a photograph.”", "otherInfo": "No other event info available"}, {"Address": "1008 Cortelyou Rd, Brooklyn, NY 11218", "Artist": "The Clubs ", "ArtistImage": "https://photos.bandsintown.com/thumb/9342325.jpeg", "Coordinates": [-73.96842, 40.639278], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Funk, Jam Bands, Jam Funk, R&b, Soul", "Time": "2:00 AM UTC", "Venue": "Bar Chord", "moreBioInfo": "Ian Kirkman and his Brooklyn based Funk Troupe!\nBringing a sound as unique and funky as it comes.\nCome out and see this NYC institution.\nAnd the new album is out FUNK on THE FLOOR, ya heard..", "otherInfo": "No other event info available"}, {"Address": "3 Bleecker St, New York, NY 10012", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-73.992626, 40.72543], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "2:00 AM UTC", "Venue": "Von", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "217 E Houston St, New York, NY 10002", "Artist": "Cozway ", "ArtistImage": "https://photos.bandsintown.com/thumb/10115755.jpeg", "Coordinates": [-73.986751, 40.722165], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Mercury Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Vancouver based trap/bass producer comes to New York. Having made his mark with releases on Deadbeats and his latest signing with RL Grime's Sable Valley - Cozway is not an act you wanna miss.\n\nGet your tickets now."}, {"Address": "147-02 Liberty Ave, Queens County, NY 11435", "Artist": "DJ NORIE ", "ArtistImage": "https://photos.bandsintown.com/thumb/10263549.jpeg", "Coordinates": [-73.804112, 40.696241], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Afro Beat, Hip Hop, Reggae, Dance Hall, Soca", "Time": "2:00 AM UTC", "Venue": "Jouvay Night Club", "moreBioInfo": "Unlike his Panamanian namesake, deposed dictator General Manuel Noriega, music is the weaponry of choice for DJ Noriega (better known to his millions of listeners as DJ Norie) although his incomparable mixing skills and irrepressible energy on the microphone transform his musical selections into formidable artillery that is feared by colleagues and competitors alike. Indeed, since he debuted almost two and a half years ago on New York City hip hop station WWPR Power 105.1 FM, Norie’s Sunday night show “Anything Goes-Caribbean Edition”, a vigorous blend of soca, reggaeton, roots reggae and dancehall, accented with a distinctive Brooklyn flavor, consistently tops the ratings for the 8-10 PM time slot according to Arbitron statistics.\nRespectfully referred to as Da Reggae Don, DJ Norie was born to Panamanian parents in Brooklyn, which is often referred to a Jamaica’s 15th parish, due to its concentration of immigrants from reggae’s birthplace. Raised in Brooklyn’s East Flatbush area, Norie became familiar with the music of Shabba Ranks, Super Cat and Ninja Man (dancehall reggae superstars of the late 1980s and early ‘90s) by listening to coveted sound clash cassettes that furthered the popularity of the latest reggae hits and the renown of the era’s premier Jamaican sound systems. “Listening to the cassettes of Stone Love, Kilimanjaro and other sounds I thought, I want to be a part of that,” Norie recalled.\nBarely into his teens, Norie began working with a neighborhood sound doing odd jobs such as carrying speakers and other equipment to their various gigs around Brooklyn. He paid close attention to the deejays (or selectors in Jamaican parlance) observing their proficiency in choosing just the right tunes to elicit roaring responses from the crowd and keep them on the dance floor. When the selectors needed to take a break, Norie got the chance to display his burgeoning skills on the wheels of steel; however, these early career-training sessions took place unbeknownst to Norie’s mother. “I don’t think I will get in trouble for saying this now but my mom used to work nights so I used to sneak out to play at these basement parties, and basically that is how I learned to select,” Norie laughingly discloses. “It was kind of hard in the beginning; they used to line up four or five records, tell me what to play and when I played them, people used to go crazy. So it used to seem like, yeah, I can do this, even though I was scared as s*#t. But I did it anyway and it was a good experience.”\n\nNorie’s fears subsided with repeated stints at the turntables and eventually he was recruited by Spectrum Disco, working with selectors Redds and Super C; as Spectrum’s popularity spread throughout Brooklyn and the greater New York area during the 1990s, so too did Norie’s renown as an intimidating selector. In the late 1990s Super Claude, the founder of Afrique Sound Station, one of the most venerated sound systems in the New York area, recruited Norie to join the set. Alongside Afrique’s remarkable team of selectors, which included Jagga B, Crazy Richie and Super Twitch, Norie’s talents were taken to a wider audience that spanned many states and several countries. “Sometimes you have to make a move, enhance yourself and go for you, and Afrique is where my name really started from, its what took me to the level of traveling with the music,” Norie reflects. “I will never forget Spectrum Disco because that is where I came from but Afrique has been in the business for more than 20 years, they set the trend for ‘nuff sounds and it is a blessing to have been a part of it.”\nNorie has also played on numerous Brooklyn based pirate and Internet stations that exclusively play reggae and Caribbean music (he even started one of his own, My Radio 94.3 FM), a phenomenon indicative of the vast potential for Caribbean music in the New York area. But Norie’s expertise in selecting dancehall also resonated with a mainstream listenership, as he found out when he joined up with (hip hop) DJ Self as one of six deejays comprising a collective called Da Union, which enabled him to take dancehall into several (Manhattan) clubs where it had previously been excluded. This led to a few guest appearances on Power 105.1 FM, and eventually his Sunday night show on the station, which has contributed to his enviable status as America’s most influential radio personality for dancehall reggae. As such, Norie is usually the first to transform a core dancehall anthem into an international hit, which he recently did with Stephen and Damian Marley’s single “Jah Army”, featuring Buju Banton.\nNorie is also the personal deejay for Beenie Man, with whom he travels whenever the artist has a show outside of Jamaica and he has also toured with Elephant Man, Bounty Killer, Mavado and Serani. On March 30, 2011 at New York City’s BB King’s nightclub, Norie made history selecting the rhythms for seven time Grammy winner Stephen Marley’s first performance done solely to backing tracks (that is, without his band’s accompaniment); Marley headlined Norie’s two year anniversary party for his Power 105 show, which was also the one year anniversary celebration for his immensely popular monthly live concert series, “Anything Goes”. “Stephen was a little hesitant at first, because he never performed to tracks before, but he did it and he was happy about it, so it is a great experience to have under my belt,” Norie shares.\nNorie has recently partnered on several projects with Queens New York based VP Records, the largest independent reggae label in the world. He selects the music at each of VP’s album release parties and the label’s artists are regularly showcased at his “Anything Goes” series. For VP Records’ “Reggae Gold 2011”, a collection of the year’s biggest reggae hits, Da Reggae Don provided a vibrant, 35-minute bonus mix CD, rife with artists’ shout-outs to Norie (including 2011 Celebrity Apprentice winner/country superstar John Rich) and customized renditions of popular songs. Additionally, Norie has just started recording artists on his own dancehall rhythms and he plans to release those tracks as part of his own compilation series sometime in the near future.\nEach of Norie’s endeavors is in pursuit of his ultimate goal: expanding the overall popularity of Caribbean music, especially dancehall reggae, the music that inspired his career path almost 20 years ago. “My radio show has served a lot of purposes; not only did it allow my fans to get to know me but it allowed me to give back to this music game,” Norie explains. “But I would like to get further in radio, be more than just a deejay because then I can help reggae by impressing upon program directors that New York’s Caribbean population is really an untapped market that no one is paying attention to so why not go out and support it? We don’t have to follow the same trends that everyone has been doing for years and years, we can do things differently, add on and make it much stronger.”", "otherInfo": "No other event info available"}, {"Address": "39 E 58th St, New York, NY 10022", "Artist": "Stoon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8865245.jpeg", "Coordinates": [-73.971301, 40.762831], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Hip Hop, House", "Time": "3:00 AM UTC", "Venue": "Lavo", "moreBioInfo": "Stoon is one of the most established DJs in the New York tri-state area. His daily growing following, international shows and supporting acts of worldly-renowned DJs demonstrate his talent and marketability. His passion for music began at the early age of 14, after moving to the United States from Morocco. From EDM & Trap to House, Hip Hop & Timeless Classics, his appreciation for different genres is heard in his incorporation of a wide variety of sounds, which make for a unique and memorable set. Always crowd-customized, whether it be in a big high energy room, like Marquee New York or Premier in Atlantic City, or a more intimate and chic setting, such as LAVO NYC, Stoon always looks to take his audience on an unforgettable musical journey.\n\n“There is a time and a place for every song ever made.”\n- Stoon", "otherInfo": "No other event info available"}]