var nyc_events = [{"Address": "New York City, NY", "Artist": "Morgan James ", "ArtistImage": "https://photos.bandsintown.com/thumb/9814141.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Pop, R&b, Soul", "Time": "5:00 PM", "Venue": "Stageit Livestream", "moreBioInfo": "One voice is all it takes. The right vocalist can make you fall in love at first listen, elicit tears, or bring you back to a different era altogether. A microphone and a stage remain the only necessities. That holds true for New York-based singer and songwriter Morgan James. On her full-length debut for Epic Records, Hunter, she casts an unbreakable spell with a powerhouse voice equally inspired by smoky soul, swaggering R&B, theatrical swing, and a virtuosic classical poise.\n\nThe Idaho native discovered her passion for music early on and pursued it\nwholeheartedly at the prestigious Juilliard School. While in the midst of the institution's rigorous academic program, she soon realized that her path would diverge from the classical world. \"I didn't want a career in opera, but Juilliard still shaped me,\" she confesses. \"The traditional training really made me a disciplined singer. I carry that with me to this day.\"\n\nAfter graduating, Morgan spent the next few years facing the proverbial struggles of being a young artist in New York. Low on money, she bounced back and forth between bartending and restaurant gigs while fighting to survive. Immersed in classic sixties and seventies soul records, she concurrently experienced a pivotal revelation. \"Out of that frustration came this other voice,\" she says. \"It was my true voice, and I feel like I discovered it in the middle of so much hardship just trying to be heard. I embraced who I was at that very moment.\"\n\nSoon, she would be heard in a big way. In 2008, Morgan booked her first Broadway show—appearing in The Addams Family alongside Nathan Lane, as well as in prominent and leading roles in Wonderland, Godspell (Turn Back, O Man), and Berry Gordy's Motown The Musical as Teena Marie. The latter set the stage for her to\nproperly launch her solo career. Gordy recognized the vocalist's immense talent, and introduced her to Doug Morris and L.A. Reid, opening the door for a deal with Epic Records in 2012.\n\nAround the same time, Morgan booked a landmark show at Dizzy’s Club Coca-Cola, where she paid tribute to Nina Simone with a set of songs that were closely associated with the legendary artist. The incendiary show was recorded and released as the critically acclaimed Morgan James Live on Epic Records. It also proved to be the perfect segue for her first studio album, released in June of 2014.\n\n\"I always knew to make a neo-soul pop record,\" Morgan says. \"The foundation is all real ingredients, and those roots of soul and R&B are pretty strong. It's the culmination of my musical life up to this point. The painful songs are straight out of a bad relationship with someone from my past. The joyful moments are wonderful memories. It's all coming from me. I've lived every one of these stories, and I love the genres I'm representing. It's one point-of-view—mine.\"\n\nThe title track and album opener \"Hunter\" boasts a seductive hook with cinematic noir flair. Flaunting the singer's immense delivery and dynamic presence, it's an undeniable and classy come-on that proves as animalistic as it does magnetic. \"From a woman's perspective, it's such an empowering and sexy song,\" she smiles. \"It totally makes me feel like a warrior! Music is so sensual and life-affirming. That's what I look for. You don't often see a girl take this position, and that's what I love about it!\"\n\nMorgan assumed co-writing duties on eight of the collection's fourteen tracks and even performed all of her own background vocals and harmonies. From the empowering farewell of \"Fed Up On You\" to the mournful rumination of \"You Never Lied\", she continually bares it all—both emotionally and musically. \"I sing like I'm never going to sing ever again,\" Morgan affirms. \"I wanted to capture that power and passion every time. At some moments, it might sound flawless; at others, it might sound like it's going to break. I'm revealing something about myself with\nevery song. You've got to do that. My favorite artists, whether Joni Mitchell or Michael Jackson, are and were, always honest.\"\n\nThere's a unique structure to the album. The first five songs boast electronic elements, while the last six don't have any. \"There's a gradient of the record that goes down,\" she says. \"By the time you get to the last song, it's just piano and voice. It starts with a song about power and ego, and it ends on one about surrender and selflessness. I have all of that in me. Maybe we all do.\"\n\nUltimately, her honesty permeates everything that Morgan James does, and it's why you'll always remember her voice. \"I want people to walk away from this album feeling fulfilled. That's the way it used to be. Often, I think I'm from another time,” she says, her voice trailing off. “I just want to bring back the power of the singular legacy voice.\"", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "The Trouble Notes ", "ArtistImage": "https://photos.bandsintown.com/thumb/9908633.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Instrumental Rock, Instrumental, Instrumental Folk", "Time": "7:00 PM", "Venue": "Rockwood Music Hall", "moreBioInfo": "Pioneering a new genre through a common tale of dedication, passion, and sacrifice.\nThe Berlin-based band The Trouble Notes is Bennet Cerven violin, Florian Eisenschmidt guitar, Oliver Maguire percussion, and Stefan Bielik bass. Their music doesn't need words to convey stories or foster connections as it resonates across genres and cultures with visionary and accessible compositions.\nAn enchanting violin is paired with a rhythmic guitar, funky bass lines and groovy percussion beats creating a sound that is truly unique to its own. Vitalizing people all over the world the group’s emotionally driven, instrumental ballads function as an escape of the mendacity of daily routines and offer comfort and salvation to people in difficult personal circumstances.\nReflecting on pan-cultural influences and blending an eclectic fusion of traditions, representative of their extensive travels and consequent musical development, they allow their audiences to join them on a musical journey that they will never forget.", "otherInfo": "Due to the spread of the novel Corona virus, we were forced to postpone our Super Bloom tour of North America. The tour was entirely self-organized and funded, and we had prepared a special concert for the new decade!\nOn April 4th we will now organize a special Quarantine Concert Fundraiser that will be broadcasted live. The time remains to be anounced.\nWe know that an online experience could never match the energy and passion you feel in live, but we felt it would be a travesty to deprive you of all the hard work we put into building our new show and sharing our music with you. Most importantly, this concert is meant as a big ‘thank you’ and our attempt to spread some joy in these trying times.\n\nA year removed from their first nationwide tour of the USA; The Trouble Notes are ready again for a new American experience. In spring 2019, the dynamic trio embarked on a two-month journey of the American West, beginning in Austin’s famous SXSW and ending in the snow-covered Rocky Mountains. From the moment they arrived, there was a creative spirit in the air. As they traveled across the storied western landscapes, they would imagine different soundtracks for the breathtaking sights before them: desert, snowy mountains, flower-covered valleys, swamps, and sprawling metropolises. The musings from these wayward experiences culminated in an EP entitled “Super Bloom”. For the first time since their last tour, The Trouble Notes will travel back across the Atlantic to perform the spring-inspired songs of their last journey. Who knows what this next American experience will bring? One can be sure that it will again energize and inspire audiences, becoming a new highlight in a Super Blooming connection between the band and their American audience."}, {"Address": "New York City, NY", "Artist": "Jeffrey Pepper Rodgers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8737520.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Acoustic", "Time": "7:30 PM", "Venue": "Online songwriting workshop", "moreBioInfo": "Jeffrey Pepper Rodgers is a grand prize winner of the John Lennon Songwriting Contest, a contributor to NPR’s All Things Considered, and the founding editor of Acoustic Guitar magazine.\n\n“Jeffrey Pepper Rodgers’ songs ring true and new. Spot-on work from an American wordsmith.”\n—Patty Larkin", "otherInfo": "Songwriting Sessions Online workshop with Jeffrey Pepper Rodgers, meeting four consecutive Wednesdays 7:30 to 9:30 pm Eastern."}, {"Address": "North Plainfield, NJ", "Artist": "Tam Garcia ", "ArtistImage": "https://photos.bandsintown.com/thumb/9215170.jpeg", "Coordinates": [-74.4274, 40.6301], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Alternative, Reggae, R&b, Pop", "Time": "8:30 PM", "Venue": "Mi Casa", "moreBioInfo": "Singer-Songwriter Tam Garcia has been performing since he was fourteen years old. He was the lead vocalist, guitarist, and principal songwriter for Garden State Line, who toured the USA and were nominated for Best Rock Band by the Asbury Park Music Awards two years in a row. In the fall of 2017 Tam set down his guitar and tried his hand at theatre landing the lead role of Jon in Tick, Tick…Boom originally written by American composer and playwright, Jonathan Larson (Rent). From there he went on to win 'Best Vocalist' for his portrayal of Nevin Denham in the award winning Off-Broadway hit musical, 'The Eleventh Hour'. Tam has since returned to music and is currently working on his first solo record.", "otherInfo": "Live Stream Open Mic.\n\nTune in AT 8:30PM to catch Kris Bloomer\nFollowed by Tam Garcia at 9PM\nand Spencer Joyce at 9:30PM"}, {"Address": "New York City, NY", "Artist": "Brian Newman ", "ArtistImage": "https://photos.bandsintown.com/thumb/8284445.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Jazz", "Time": "5:00 PM", "Venue": "StageIt Livestream", "moreBioInfo": "Performer, trumpeter, and vocalist, Brian Newman’s brand of jazz has tirelessly resurrected the magic of Old New York, refreshing the glamorous era with nuances of his own rock-n-roll edge. Whether performing with his own quartet or supporting Lady Gaga and Tony Bennett on tour, Newman’s expert trumpeteering and effervescent stage presence reignited a big band scene in New York City, and has since enticed a new generation of jazz fans across the globe. The Verve Recording artist continues to reign at his weekly residency in New York, as well as appear on television programs and in special performances across the United States and Europe.\nNewman is known for his impeccable horn playing and rendition of romantic favorites. But what sets him apart is his ability to command a room not only with his musical talent, but as a bandleader who makes each person in the audience feel as if they are a part of his performance. His fusion of music playing and easy going banter captures the vivacity of great bandleaders of the past. This exuberance is evident on Newman’s 2016 debut album, Eyes on the City, which pays tribute to his musical journey in New York.\nAlong with his Quartet, fellow musicians from Cincinnati’s College-Conservatory of Music, Newman has allured audiences during his residencies at some of New York’s most iconic venues. His first foray into creating an old school big band night was at the elegant Duane Park for “After Dark,” a jazz and burlesque revue on the downtown scene in Tribeca. “After Dark” lead to a weekly residency at the legendary Oak Room at The Plaza Hotel, a venue steeped in history which was frequented by the likes of Truman Capote, Gore Vidal, Frank Sinatra, Liza Minelli and countless others over its one hundred year history. Newman and his Quartet played each Wednesday to a mixed crowd seeking a slice of history, welcoming Lady Gaga as a surprise guest, until the venue closed in 2011. Currently, Newman performs every Tuesday and Thursday, as bandleader in a residency at Rose Bar at the Gramercy Park Hotel, and select Friday nights at NYC’s legendary Rainbow Room with his orchestra. Brian also routinely appears for special live performances with a diverse array of musical acts, which have included Tony Bennett, Jose Feliciano, Stevie Wonder, Mark Murphy, Dierks Bentley, Willie Nile, Molly Ringwald, David Loeb, Steve Wynn’s Orchestra, Ray Benson’s Asleep at the Wheel and Tommy London.\nNewman’s personal style, which meshes classic suits, vintage tattoos and rock-n-roll, has attracted commercial brands such as Jack Daniel’s, Marc Jacobs and Tiffany & Co., who have collaborated with Newman for special events and performances. The Jack Daniel’s partnership in 2012, which launched the brand’s Sinatra Select premium Tennessee Whiskey, brought Newman alongside Frank Sinatra Jr. himself, in a performance in Cannes, France.\nBrian married burlesque star, Angie Pontani of the World Famous Pontani Sisters in February 2013, with whom he most notably performs in connection with Pontani’s New York Burlesque Festival and Burlesque-a-Pades shows. The couple have a daughter, and reside in the neighborhood of Brooklyn.", "otherInfo": "No other event info available"}, {"Address": "Point Pleasant Beach, NJ", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.048, 40.0917], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Little Falls, New Jersey", "Time": "6:00 PM", "Venue": "Point Lobster Bar & Grill", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "233 West St, New York, NY 10013", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-74.012344, 40.721325], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Country, Rock, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk", "Time": "7:00 PM", "Venue": "City Vineyard", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Josh Okeefe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8498223.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Folk, Country, Rock, Country-folk, Roots, Alternative, Blues", "Time": "7:00 PM", "Venue": "Rockwood Music Hall", "moreBioInfo": "The 4,115 miles that troubadour Josh Okeefe traveled from his birthplace of Derby, England, to his current home of Nashville, Tennessee, tell just one small part of a nomadic life in music which actually spans generations and encompasses myriad genres, traditions and disciplines. Although a relatively new artist, the young guitar-and-harmonica-playing singer-songwriter delivers unforgettably potent lyrics with the gravitas of a seasoned veteran. Attesting to his versatility and wide appeal, Okeefe has also had his songs recorded by Nashville-based major-label artists Ashley Monroe and High Valley, among others.\n?\nHaving performed sold-out shows from California to North Carolina and from Nashville to London and Glasgow, Okeefe has shared stages with legends including Kris Kristofferson, playing for a crowd of 10,000 at London's Kenwood House for the iconic songwriter's birthday celebration. He's also performed with Ramblin' Jack Elliott, Alison Krauss and Rufus Wainwright, among many others. In addition, he's appeared at protest events, helping to draw attention to the Black Lives Matter movement and at the site of the tragic 2017 Grenfell Tower fire in West London, where he performed an original song recounting the harrowing event.\n\nOkeefe dropped out of school at age 16. Living briefly in numerous places including London and the seaside resort town of Brighton, Okeefe often slept on the floors of recording studios, music coffee houses and other small venues. After traveling to America in search of the places his music idols once roamed, he began writing songs at an astonishing pace. Okeefe has earned coveted spots at major music events on both sides of the Atlantic including the Woody Guthrie Folk Festival, Black Deer Festival and England’s prestigious Glastonbury Festival for the first time in the summer of 2019, at the invitation of British folk musician and political activist Billy Bragg. He is also a featured artist on the popular YouTube channel GEMSonVHS.\n\nA rebel artist, a protest singer, the heir to Bob Dylan, or – when he's doing one of his lighter satirical numbers – a harmonica-tootin' Mr. Bean… with raw, topical storytelling and a voice that crackles with authentic folk tradition, Okeefe is all of those and more.\n\n\"He seems to turn a lightbulb on in your head, makes you ask yourself questions and seems to say what is on the tip of everyone’s tongue. Is he the next commentator for this generation? Only time will tell.\" - Huffington Post\n\n\"Okeefe’s voice hits you with the force of a hurricane: a rare, powerful, gravelly sound, the likes of which is usually crafted from many decades of nicotine, alcohol and hard living in the deep south.\" - No Depression\n\nHe is an outlaw and he is commercial. He is topical and he is light. He is a poet, a musician, a writer, and maybe a prophet. - Smithsonian Folkways", "otherInfo": "No other event info available"}, {"Address": "183 W 10th St, New York, NY 10014", "Artist": "Alex Wintz ", "ArtistImage": "https://photos.bandsintown.com/thumb/8218825.jpeg", "Coordinates": [-74.002722, 40.734367], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Jazz", "Time": "7:30 PM", "Venue": "Smalls Jazz Club", "moreBioInfo": "Rising, young guitarist Alex Wintz is quickly gaining a name in the international jazz community. His talent and embrace of contemporary influences molded with a deep gratitude to the traditions of the past has garnered him numerous accolades and acclaim from music lovers across the globe. Wintz is a frequent collaborator with Etienne Charles, Ben Williams and Sound Effect, Roxy Coss, Peter and Will Anderson, and Nick Finzer and has performed at the Newport, Monterey, Montreux, and Montreal Jazz Festivals, among other major venues.\n\nIn May 2017 Wintz released “LifeCycle”, his debut recording on Etienne Charles’ Culture Shock imprint. The album, both challenging and accessible has garnered critical acclaim since it's release with strong endorsements from Downbeat Magazine (3.5 Stars), All About Jazz, and The New York Jazz Record.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Jackopierce ", "ArtistImage": "https://photos.bandsintown.com/thumb/8280131.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Pop", "Time": "8:00 PM", "Venue": "StageIt Online Show with Jack O'Neill", "moreBioInfo": "Jack O’Neill and Cary Pierce, the “Jack O” and “Pierce” who make up the seminal duo Jackopierce, are celebrating 30 years of making music that has amassed a loyal following of millions of fans across the country and the world with a super high-energy live show and what the Dallas Morning News has called “spotless harmonies.”\n\nHaving just released their first studio project 'Feel This Good' in 5 years, Jackopierce is poised and ready to get back on the road full-time.\n\nJackopierce formed in 1988 in Dallas as theater students at SMU. The duo steadily made a name for themselves, especially with two of their signature tracks, “Vineyard” and their version of the classic “Please Come to Boston.” They released ten studio albums (two for major label A&M), toured three continents, nine countries, and 45 states - amassing millions of loyal fans along the way . Over the years They have shared the stage with John Mayer, Dave Matthews Band, Matchbox20, Counting Crows, The Wallflowers, Sheryl Crow, Toad the Wet Sprocket - to name a few. After a five-year breakup, the guys reunited in 2002 to test out the waters. They were very warm and city by city, Jack & Cary got back out there to play for grateful fans that thought they would never see them again. The two now have a totally renewed creative vigor, mutual respect and deep gratitude for their fans.\n\nThese good vibes shine through on their 25th anniversary live album “Live 25.”\n\nIt’s definitely been a creative time for the duo, and celebrating the past inspires the guys to move forward in new, inventive ways. To freshen up the live show, Jackopierce started creating uniquely intimate “Destination Shows.” These shows are a whole new fan experience where people can enjoy gorgeous scenery, share delicious food & wine and have “campfire”-type access to their favorite band. It’s a vacation and concert in one. Each Destination Show provides a unique experience dedicated to the local culture: Napa/Sonoma vineyards at sunset, a ranch in Austin Hill Country, high society in Dallas, a two-mile-high a private club in Aspen, amazing history at the Biltmore in NC, a 14,000 square foot hacienda in San Miguel de Allende, MX - and the list goes on. July 27, Jackopierce will host their first 7th Destination Show in Martha’s Vineyard and they’ll be back for their fourth annual Destination Show in San Miguel in April 2020.\n\n“We have been doing destination events for 10 years now and they have been a huge hit with our fans and have allowed us to make so many great new ones along the way,” said Cary Pierce. “I think these events continue to grow and sell out because people want more than \"just a show” - they want an experience. They want to create lasting memories, explore a new place or visit an old favorite. In some cases, we're offering them a trip of a lifetime. We're finding there a lot of people that really value these experiences.”\n\nJackopierce has celebrated numerous career milestones including the T-Bone Burnett produced A&M debut album “Bringing on The Weather,” being a part of one of the world’s largest live events with close to 400K people in attendance at the 1997 Blockbuster RockFest at Texas Motor Speedway alongside artists No Doubt, Counting Crows, and Matchbox Twenty, performing on Conan O’Brien in 1992 with the Max Weinberg Band backing them up and sitting in the chairs on the Rosie O'Donnell Show.\n\n“Even after 30 years I feel like we're just getting started,” said Cary Pierce.", "otherInfo": "No other event info available"}, {"Address": "497 Rogers Ave, Brooklyn, NY 11225", "Artist": "Robinson & Rohe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8428241.jpeg", "Coordinates": [-73.953288, 40.660114], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Brooklyn, New York", "Time": "8:00 PM", "Venue": "The Owl Music Parlor", "moreBioInfo": "Jean Rohe and Liam Robinson were brought together a decade ago by a love of participatory music-making and American and Anglo folk song. Together they shared this love with others in living rooms, concert venues, festivals, and celebrations, honing their skills as songleaders and balladeers. In 2013, Jean and Liam reinvented their collaboration. As the duo Robinson & Rohe they began cowriting an ever-expanding repertoire of original music that now lives alongside the old songs they hold dear. Both accomplished songwriters in their own rights, Jean (guitar, singing) and Liam (banjo, accordion, singing) let their finely crafted songs shine in detailed arrangements and elegant harmonies. Whether in small clubs or on festival stages, their performances are intimate gatherings in which listeners are invited to share in the music-making. Songwriters Liam Robinson and Jean Rohe play their songs together.", "otherInfo": "An evening of music with sets from Robinson & Rohe and Robbie Pollock"}, {"Address": "Brooklyn, NY", "Artist": "Jamie McLean Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8377674.jpeg", "Coordinates": [-73.9496, 40.6501], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Americana, Blues, Rock, Rock And Roll, Folk, Roots", "Time": "8:00 PM", "Venue": "Facebook Live", "moreBioInfo": "Jamie McLean is a triple threat. As a guitarist for New Orleans royalty Aaron Neville and Dirty Dozen Brass Band he's toured the globe playing fiery guitar everywhere from Madison Square Garden to Japan’s Fuji Rock. His blue eyed southern soul vocals ooze raw emotion and his top line songwriting chops tie everything together. With hundreds of original compositions to his name McLean creates a musical gumbo that incorporates New Orleans soul, Delta blues, middle America roots and New York City swagger\n\nOn February 23 Jamie McLean Band released their long awaited new album One and Only. Recorded at the famed Sound Emporium studios in Nashville One and Only captures the band's strongest songwriting to date. The album was produced by Ken Coomer of Wilco and features special guests Sam Bush and Jeff Coffin of Dave Matthews Band. Live staples \"Virginia\" and \"One and Only\" finally get a beautiful studio performance and Jamie McLean Band will tour behind their new album throughout the US and Canada this year!\n\nThe live show is where Jamie McLean Band excels and the band has shared the stage with the likes of Gregg Allman, Aaron Neville, Dr. John, Taj Mahal, Tedeschi Trucks Band, Trombone Shorty, Los Lobos, Blues Traveler, Marc Broussard, Gov’t Mule and many more. Jamie Mclean Band has also appeared at festivals such as Bonnaroo, Mountain Jam, Targhee Fest, Okeechobee Fest, Ottawa Blues Fest, Quebec City Summer Fest, and Warren Haynes’ Christmas Jam to name a few. McLean has also enjoyed the sponsorship of Gibson Guitars, Fuchs Amplifiers, La Bella Strings, Blue Microphones, John Varvatos and Esquire Magazine.\n\nDon’t miss their amazing live set when they roll into a town near you!\n\n\"McLean and company ooze drops of southern roots rock, blues, R&B, funk and soul out of every note... the rock & roll swagger of the Rolling Stones combined with the songwriting prowess of Ryan Adams.\" - Jambase\n\n“Jamie McLean Band is completely original and completely fabulous... The live version of this band is a three-dimensional experience not to be missed” – Hittin The Note\n\n“A honkin' collection of Southern-style blues rock, Americana, and soul.... as bawdy as anything the Black Crowes tried to snag from The Faces or The Stones circa 'Sticky Fingers' and 'Exile on Main Street' and as groovy and gutsy as Bowie's 'Young Americans.'\" - Charleston City Paper", "otherInfo": "Live Stream: https://www.facebook.com/thejamiemcleanband"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Kaylyn Marie Scardefield ", "ArtistImage": "https://photos.bandsintown.com/thumb/8213300.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, Swing, Folk, Jazz, Folk Jazz, Folk-blues, Blues, Folk-rock", "Time": "9:00 PM", "Venue": "Rockwood Music Hall", "moreBioInfo": "Kaylyn Marie Scardefield is an actress and singer/songwriter based in New York City. Her musical influences range from 50's Classic Pop to 60's Greenwich Folk with a myriad of jazz and a collage of the blues.", "otherInfo": "Live Stream: https://www.stageit.com/kaylyn_marie/uncancelled_music_festival_day_1/73642"}, {"Address": "376 9th St, Brooklyn, NY 11215", "Artist": "Zoe Guigueno ", "ArtistImage": "https://photos.bandsintown.com/thumb/10166546.jpeg", "Coordinates": [-73.98384, 40.667796], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Brooklyn, New York", "Time": "10:00 PM", "Venue": "Barbes", "moreBioInfo": "Zoe Guigueno is a songwriter and bassist headquartered in New York City. She has played and continues to play with the bands Laura Cortese & the Dance Cards, Michael Winograd and the Honorable Mentshn, Della Mae, Joy Kills Sorrow, and Fish & Bird. Her EP, Five Songs, is a collection of stories about relationships, family secrets, and Canadian landscapes. Produced by Alec Spiegelman in Brooklyn, NY, it is Zoe’s debut release under her own name.", "otherInfo": "No other event info available"}, {"Address": "230 Diamond Spring Rd, Denville, NJ 07834", "Artist": "Brady Rymer & The Little Band That Could ", "ArtistImage": "https://photos.bandsintown.com/thumb/10132040.jpeg", "Coordinates": [-74.468243, 40.900246], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Roots Rock, Family Music, Fun Music., Kids Music, Rootsy, Family Friendly, Americana", "Time": "10:00 AM", "Venue": "Celebrate the Children", "moreBioInfo": "Three-time children’s GRAMMY nominee Brady Rymer toured and recorded with RCA roots-rock band From Good Homes for thirteen years, sharing the stage with the likes of Bob Dylan, Dave Matthews and the Grateful Dead’s Bob Weir, before parenthood expanded the scope of his music to include young and old alike. Together with his longtime bandmates in the Little Band That Could – outstanding players all, with backgrounds from Americana to Zydeco -- they “might just be the best-sounding band in children’s music,” according to NPR’s All Things Considered – he has released nine acclaimed albums and brings energetic, rockin’ “music with a rock n’ roll heart” (the New York Times) to kids and families across the country.", "otherInfo": "Sorry, this show has been cancelled. Please check our website and social media for updates on upcoming shows. www.bradyrymer.com"}, {"Address": "1300 Raritan Rd, Clark, NJ 07066", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.30659, 40.632306], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Little Falls, New Jersey", "Time": "5:00 PM", "Venue": "Oh' Brian's on the Green", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "319 Frost St, Brooklyn, NY", "Artist": "Soccer Mommy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9944041.jpeg", "Coordinates": [-73.938692, 40.719277], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Indie Rock, Indie Pop, Bedroom Pop, Lo-fi", "Time": "7:00 PM", "Venue": "Brooklyn Steel", "moreBioInfo": "For Sophie Allison, aka Soccer Mommy, color theory is a distillation of hard-won catharsis. The album confronts the ongoing mental health and familial trials that have plagued the 22-year-old artist since pre-pubescence, presenting listeners with an uncompromisingly honest self-portrait, and reminding us exactly why her critically-acclaimed debut, 2018’s Clean, made her a hero to many. Wise beyond her years, Allison is a songwriter capable of capturing the fleeting moments of bliss that make an embattled existence temporarily beautiful. With color theory, Allison’s fraught past becomes a lens through which we might begin to understand what it means to be resilient.\n\nClean demonstrated Allison’s nuanced approach to lyricism and her disinterest in reducing complex emotional worlds into easily-digestible sound bites. On it, she projected the image of a confused but exceedingly mature teenager -- the type to offer up life-saving advice while cutting class under the bleachers. Clean led Soccer Mommy to sell out tour dates and play major music festivals around the world on top of opening for the likes of Kacey Musgraves, Vampire Weekend, and Paramore. A grueling touring schedule made it so that Allison had to get used to writing on the road, a challenge that exhilarated her. She wrote dozens of songs in hotels, green rooms, and in the backseat of the van. The ones that make up color theory were recorded in her hometown of Nashville at Alex The Great, a modest studio where the likes of Yo La Tengo have recorded, just two miles from her childhood home. Produced by Gabe Wax and engineered by Lars Stalfors (Mars Volta, HEALTH, St. Vincent), color theory’s sonic landscape is vast and dextrous, illustrating how much Allison has evolved as a musician and matured as a person over the past year. The melodies on color theory shimmer on the surface, but they reveal an unsettling darkness with each progressive listen.\n\n“I wanted the experience of listening to color theory to feel like finding a dusty old cassette tape that has become messed up over time, because that’s what this album is: an expression of all the things that have slowly degraded me personally,” Allison says. “The production warps, the guitar solos occasionally glitch, the melodies can be poppy and deceptively cheerful. To me, it sounds like the music of my childhood distressed and, in some instances, decaying.” Allison used a sampling keyboard and string arrangements drawn from old floppy discs to lend color theory a timeworn aesthetic. She also opted to enlist her band in the recording process, which hadn’t been the case on any of her earlier releases. “At the base of every song on color theory is a live take done to tape. This album reflects our live performance, which I’ve grown really happy with,” she says.\n\ncolor theory is thematically subdivided into three sections, each of which is named for a color that distills the mood Allison wanted to freeze in time. We begin with blue, a color that evokes a certain melancholy, and for Allison, illuminates depressive episodes and memories of inflicting self-harm. On “circle the drain,” she admits that “the days thin me out or just burn me straight through” over a swirling, guitar-driven arrangement that inspires a sense of ease in spite of the distressing lyrical content. The next section is represented by yellow, a color that points to illness, both mental and physical. “My mom has been terminally ill since I was a pre-teen, and I never really found a way to deal with it,” Allison says. “On ‘yellow is the color of her eyes,’ I sing about a period when I was on an international tour and kept feeling like my time with her was ticking away.” Lackadaisical from the outset, the song marries its relaxed arrangement with gutting lyrics that will ring true to anyone who has ever witnessed a loved one’s health decline.\n\nThe final section, represented by grey, addresses that fear of loss directly. “Watching my parents age and witnessing sickness take its toll made me think a lot about the cycle of life, and forced me to confront the paranoid sense that death is coming for me,” Allison says. On the color theory’s closer, “grey light,” she doesn’t shrink from the terrifying promise of death’s inevitability and instead gives herself over to it completely. Atop a faded, oceanic bed of instrumentation, she unflinchingly admits, “I see the noose/ It follows me closely whatever I do.” But it’s not all tragic, and moments of lightness appear on this album, too. Take lead single “lucy,” which navigates an all-consuming dread with cunning wit and showcases Allison’s deft songwriting prowess. Here, she pleads with a devilish character and succumbs to his cruelty just as easily as she delights in his attention. “That irks me -- that I’m falling down/ From heaven through the Earth/ To hellfire to wear his crown,” she sings, the twinkling instrumentation taking on an eerie, unsettling bent as the song progresses.\n\ncolor theory investigates a traumatic past in exacting detail; in doing so, Allison finds inroads for healing through self-acceptance, and occasionally, humor. (“I’m the princess of screwing up!” she declares at one point.) This isn’t a quest to uncover some long-since forgotten happiness so much as it is an effort to stare-down the turmoil of adolescence that can haunt a person well into adulthood. Allison is a gifted storyteller, one who is able to take personal experience and project it to universal scale. On color theory, she beckons in outsiders, rejects, and anyone who has ever felt desperately alone in this world, lending them a place to unburden themselves and be momentarily free.", "otherInfo": "due to the evolving coronavirus (covid-19) pandemic, this show will be postponed. we are working on scheduling a new date and will update you as soon as we can. hold onto your tickets, they will be valid for the rescheduled date but refunds will be issued at point of purchase if you can no longer attend. thank you for understanding, stay safe and healthy ❤️"}, {"Address": "New York City, NY", "Artist": "Damien Escobar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8310600.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Contemporary Soul", "Time": "7:00 PM", "Venue": "The Internet", "moreBioInfo": "Easy come, easy go; was the lesson two-time Emmy Award winning violinist, Damien Escobar learned when he and his brother walked away from a multi-million dollar brand that took ten years to build. The now 27-year-old's claim to fame came early on in his teens when he, alongside his brother, appeared on \"America's Got Talent\" as Nuttin' but Stringz. Two urban kids from Jamaica, Queens, playing a blend of hip hop and classical melodies with a violin was somewhat surprising to viewers, and unique to say the very least; and the duo quickly shot to stardom-- appearing in commercials and movies, touring, and even adding a platinum selling album to their accolades. But growing creative differences eventually became too much for the pair to bear, and the success of Nuttin' but Stringz came to an end-- shattering the name and reputation Damien worked hard to establish, and forcing him to rebuild from rock bottom.\n\nAfter the fall, Damien is reveling in the climb. Since re-launching his career, Escobar boasts of 200K downloads from his first R&B mixtape, \"Sensual Melodies\"; and has more than a few notable solo headliner performances under his belt including: CBS Upfront Presentation, Food & Wine Magazine’s Best New Chef Awards, Indy Car Championship Awards, Major League Baseball Annual Golf Fundraiser Event, Angela Simmons \"Electric Daze\" Fashion Show, Russell Simmons’ Hip Hop Inaugural Ball, and corporate concerts for FRIDAYS, Walmart, Target, and more.\n\nEscobar, once a self-proclaimed retired violinist, is now on everyone’s radar; and has even obtained online success with viral videos picked up by media giants such as WorldStarHipHop.com, Huffington post, CNN, and Allhiphop.com. A recent feature in PEOPLE Magazine elevated Escobar to new heights in his solo career; highlighting his movement of giving back to others by doing random acts of kindness.The star even found his way back on national television, accepting an invitation to appear as a performer in WEtv’s “David Tutera’s: Unveiled”. And since then invitations to appear on television haven’t ceased; landing Escobar in the interviewee chair at Fox News and NBC, with other appearances lined up for the remainder of 2014.\n\nAs a veteran, knowing the ups and downs of the industry, Escobar has committed to centering his career around the loyal fans he refers to as \"good people,\" who constantly remind him of why he got back into music. His appreciation for the support system he feels sustains him, spawned his Pop-Up Performance campaign. Armed with a giant speaker, a mic, and his violin, Escobar set out to surprise unsuspecting New Yorkers with a pop-up concert experience. The response to his documented journey was overwhelmingly positive, and resulted in Damien announcing a seven city pop-up performance tour this summer.\nCurrently, Escobar is appreciating his journey as a fresh new artist, with the recent release of his high-energy, inspirational single \"Freedom\" which he debuted on The Katie Couric show in support of Kennedy’s Cause, that single subsequently went on to open up at #15 on the iTunes dance charts. The artist has also tapped into the book industry, penning his first children’s book entitled “The Sound of Strings.” He will begin his book tour at the start of the new school year.\n\nIn 2012 Nuttin' But Stringz disbanded and Damien Escobar emerged as a solo artist out to make a name for himself. Humble in his dealings but confident in his craft, Damien makes it no secret that he's determined to gain recognition for being the \"dopest\" violinist to crossover into mainstream music. In an industry not overpopulated by instrumentalist, the Hip-Hop violinist is looking to change the game. He's a pioneer with a plan, and the future of music rest in his hands.", "otherInfo": "We may be in period of social distancing but the music music must still go on! Join me for my first ever digital concert which will be one to remember. Watch the stream live on www.dameesco.com at 7pm EST. #crooner"}, {"Address": "770 Broadway, New York, NY 10003", "Artist": "Leighann Lord ", "ArtistImage": "https://photos.bandsintown.com/thumb/10225022.jpeg", "Coordinates": [-73.99186, 40.73108], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Standup Comedy", "Time": "8:00 PM", "Venue": "Facebook New York", "moreBioInfo": "Leighann Lord has appeared on ABC, NBC, Lifetime, VH-1, HBO, Comedy Central, and is a former co-host of StarTalk Radio, with Neil de Grasse Tyson. She was a national finalist in the ABFF-HBO Comedy Wings Competition and she received the 2019 Humanist Arts Award. She is the author of several humor books including: Dict Jokes and Real Women Do it Standing Up. Her DryBar Comedy Special will be out this Summer.", "otherInfo": "I’m Having a Party! To celebrate my 28th anniversary in standup comedy, please join me 8PM, Friday, April 3 on my Facebook Page for a video watch party. I’ll be showing a five-minute clip of a show I did at Carolines for New York Women in Communications. And immediately following the watch party, hang out with me for my Facebook Livestream! I’ll be talking comedy and answering questions and making an announcement or two!"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "ALO ", "ArtistImage": "https://photos.bandsintown.com/thumb/9778985.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Jam Rock, Rock", "Time": "8:00 PM", "Venue": "Brooklyn Bowl", "moreBioInfo": "ALO is more than a band. It’s a musical relationship that has endured for over two decades, with band members playing in numerous projects together and apart. Following the 2012 release of their freewheeling Sounds Like This, the band took time off to work on various side projects. Zach Gill (keys/vocals) toured the world with the band’s college pal Jack Johnson; Dan “Lebo” Lebowitz (guitar/vocals) played shows with the Grateful Dead’s Phil Lesh; Steve Adams (bass/vocals) toured and recorded with Nicki Bluhm & the Gramblers; Dave Brogan (drums/vocals) joined up with Utah band, Mokie. These and other endeavors have influenced the band’s new album Tangle Of Time.\n\nMore than previous releases, Tangle Of Time really taps into what makes ALO unique. It’s that special blend of classic songwriting and the ability to stretch out jams and distill dance floor grooves. It's heartfelt lyrics that make you smile, reflect and just want to sing along either way. It's four great musicians who all write and sing. And four friends who've been through a lot together and still support, challenge and inspire one another.\n\nEntering Allegiant Records in San Anselmo, California this past January with co-producer Dave Simon-Baker, the four members decided they’d take a different recording approach. Instead of spending pre-production days jamming and co-writing, each member brought in their own demos, roughly three dozen in total, for the group to listen to, pick apart and eventually whittle down to the 11 songs that make up Tangle Of Time. Once they narrowed their focus, they turned their attention to arrangements and production techniques. Songs were tightened up, layers made more experimental and the end results validated their new approach.\n\nLebo described the shared respect and admiration the band felt during the recording process this way: \"There are four strong opinions in the room, but playing together for so long we've all become pretty good at the empathy thing at this point; we can be very Zen about it. We truly value being together at this point in our careers, and whatever we get from our solo and side gigs, no matter how much fun we have, it's not this.\"\n\nThat sort of maturity, the ability to take stock of your friends, loved ones, and collaborators, and truly appreciate them is certainly one of the cornerstones of Tangle Of Time. Lebo, Adams and Gill first started playing music together in middle school, and then with Brogan right after college. Somehow, these relationships have lasted, evolved and been made stronger every year. One can almost hear the group releasing a satisfied existential sigh throughout the album, finding acceptance, love and contentment with the world they've built.\n\n\"I really appreciate the guys right now, more so than ever,\" Gill shared, excitedly adding, \"Years ago the feeling was, 'I wanna get to my songs and see how they sound while we're all here', whereas now I'm rooting for everyone else's songs. It's great.\"\n\nThat approach of supporting each other’s songs worked like a charm, capturing each member’s distinct songwriting voice, while simultaneously expanding the notion of what an ALO song or album can be. Take for instance the one-two-punch of the synth-filled, spacey jam vehicle \"The Ticket\" and the pedal steel-driven easy-going happiness of \"Simple Times\". Although two ends of the sonic spectrum, both are classic Gill songs at their core but stretched wide and far by the band’s collective effort.\n\nNot to be outdone, Lebo's guitar epic \"Undertow\" is a song that practically begs to be stretched out live, with its swirling double guitar outro intoxicating the listener to such a degree that you might find yourself on the band's website, dreamily purchasing tickets for an entire run of shows just to see where the song ventures live. Lebo pairs this with \"Push\", a jaunty yet thoughtful number with a playful guitar riff that's basically the musical equivalent of joy.\n\n\"Not Old Yet\" and \"Keep On\", Adams’ contributions to the album, are also touchstones to the spirit of Tangle Of Time. The first is a light-hearted romp about keeping a positive perspective on life’s long road of hurdles and surprises, while the second is an upbeat, forward-thinking sing-along with lines that could be the album's mantra: \"Wherever this takes us, I know/That we've got each other, we've still got a long way to go.\"\n\nBrogan's \"Coast To Coast\" is among the most intriguing songs on the record. He, along with co-writer buddy Ben Malan, came up with a layer-upon-layer soundscape consisting of beautifully esoteric textures. The funky but ominous track tells the surreal tale of a band on the run, with more ideas and energy than know-how. Brogan shared that the theme of “tangled time” materialized unexpectedly over the course of the sessions, elaborating: \"There's a point where there is more behind you than ahead of you, and you realize that time becomes a limiting factor.\"\n\nPut the record on your turntable, and you can clearly hear the band’s excitement to get back on the road and explore these songs with their audience. Improvisation is a staple of what the band does, and as Adams stated: \"Being in that unknown is such a great life lesson beyond just the music. For all the careful planning and preparing we do, being in the moment is really when it all matters.\"\n\nThe band is also planning new ways to expand the theatrical shenanigans that have become a fantastic complement to the live show. From confetti canons to 12-foot beach balls, pre-show skits to elaborate theme nights, bubble suits to a laser-shooting ukulele (yes, really)... ALO is always on the hunt for new and exciting ways to interact with fans to make their shows truly special. Gill, the band's head prankster, put it this way: \"I want people to come to a show expecting to be engaged in a fun and creative way. When I see someone dancing or singing along or reaching out to hit a giant beach ball, I start playing to the dancer and at that point, it's really a circle of energy traveling back and forth from the stage. The larger theatrical concepts are ways of interacting with the audience on another level.\"\n\nOn Tangle Of Time the band has reached that other level, and are ready to bring everyone along.", "otherInfo": "Ages 21+"}, {"Address": "85 Ave A, New York, NY 10009", "Artist": "Elif Sanchez ", "ArtistImage": "https://photos.bandsintown.com/thumb/9071103.jpeg", "Coordinates": [-73.9843, 40.725256], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Latin, Folk, Jazz, World Fusion", "Time": "8:30 PM", "Venue": "Drom", "moreBioInfo": "Elif is a Turkish singer, who blends her folkloric roots with jazz and latin music. She is enchanted by traditional music from different parts of the world. That is why, you might hear many other influences in her music.\n\nBerklee College of Music graduate\ndistinguished herself in the States with her unique approach to traditional Turkish folk music.\n\nShe performed with artists such as Antonio Serrano, Jacob Collier, Terence Blanchard, Tigran Hamasyan, Aynur Dogan, David Liebman, Dream Theater and Guinga.\n\nShe presented her new sound in world-renowned stages in US, Turkey, Spain, Italy, Greece, Ecuador and Israel.\n\nElif is currently working on her upcoming album, which will be released on September 2019.", "otherInfo": "Songs Against War, artists from all around the world will perform for peace @ DROM"}, {"Address": "340 Sinatra Dr, Hoboken, NJ 07030", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.0285, 40.73801], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Little Falls, New Jersey", "Time": "9:00 PM", "Venue": "House of 'Que", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "253 W 125th St, New York, NY 10027", "Artist": "Natu Camara ", "ArtistImage": "https://photos.bandsintown.com/thumb/10175173.jpeg", "Coordinates": [-73.950127, 40.809904], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "New York, United States", "Time": "9:00 PM", "Venue": "Apollo Theater", "moreBioInfo": "In Conakry, a sprawling legion of Natu Camara’s adoring fans regard her as “the Tina Turner of Guinea.” In her music and during high-octane shows, the impassioned singer-songwriter substantiates\nthe weighty nickname. In the early 2000s, Camara led West Africa’s first all-female hip-hop group,\nthe Ideal Black Girls (IBG). Years after releasing Guinèya Moumonèra (It’s Not a Shame to Be a\nWoman)- a multiplatinum opus advocating for women’s rights- as a member of IBG, the dynamism of\nCamara’s musical evolution is revealed in Dimedi (“Child” in her native language, Susu), an inspira-\ntional solo debut underscoring the significance of children having positive role models. Singing in five\nlanguages, Dimedi showcases Camara’s unique blend of afro-rock, pop, and soul that speaks to the range\nof heroes influencing her individual sound: Miriam Makeba, Nina Simone, Fela Kuti, and Baaba Maal, Paul simon etc...", "otherInfo": "\"POSTPONED\""}, {"Address": "203 Broadway, Amityville, NY 11701", "Artist": "Dan DelVecchio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9166815.jpeg", "Coordinates": [-73.417088, 40.678275], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Rock, Indie, Blues, Pop Rock, Funk, R&b, Soul, Alternative, Pop, Jazz, Dance -", "Time": "10:00 PM", "Venue": "The Warehouse", "moreBioInfo": "Those who have found their life’s passion can usually pinpoint the exact moment they discovered it, loved it for the first time, and needed to learn everything about it.\n\nFor musician Dan DelVecchio, that moment was in daycare - many moons ago (5 years old), when he was scolded for trying to pick up an acoustic guitar sitting in the corner of the room. While other children dreamt of being astronauts or building rocket ships out of mega blocks, Dan was ready to jam on stage with the greatest of the great.\n\nWhen he got a bit older, he accompanied his brother Michael to Sam Ash music store, where he needed to pick up a saxophone for middle school band. They may have been at the store for his brother, but that day will forever be the one where Dan’s daycare dreams began to grow into a reality.\n\nThere, standing in the guitar department, Dan was encouraged to pick up and strum along to the beat inside his soul, and his passion began to take shape.\n\nAs years passed, Dan became more and more accustomed to the guitar, and fell more and more in love with performing. He surrounded himself with mentors from diverse backgrounds – Dennis DelGaudio (Billy Joel), Chris Justino (Broadway), Artie Blaurock (Sweet Revenge, Dorian Grey, Needulhed), & Rick Stone (Jazz Guitar at Hofstra University). Each of these amazing talents provided him with a unique perspective on guitar stylings and teachings.\n\nTaking that knowledge to the next level, Dan joined the likes of Indie/Alternative Rock band Face the King (CI Records) and performed across the continental US for a multitude of shows, including a full leg of Vans Warped Tour, Rockstar UPROAR Festival, the main stage at the CBGB Festival in Times Square, NY (with Billy Idol and Jane’s Addiction!), as well as the world’s largest music festival - Summerfest, in Milwaukee, WI.\n\nFace the King was chosen as a National Finalist for the Ernie Ball Vans Warped Tour competition alongside PVRIS, and are three-time winners of the Ernie Ball Battle of the Bands. Their full-length album, “Once More Is All I Am,” was released in November of 2017.\n\nDan is also collaborating on songwriting and performing with two up-and-coming Alt/Indie groups, Don’t Believe in Ghosts (Forward Thinking Records), and A Second Life. These bands have received high acclaim, as shown by their multiple plays on retail radio playlists and on Spotify, national plays on Sirius XM Radio, and a number of live shows including Bowery Ballroom, The Paramount, NYC Marathon, and an upcoming appearance at the world-famous South By Southwest (SXSW) in Austin, TX.\n\nIn 2017, Don’t Believe In Ghosts released their debut full-length album, “Give it Meaning”, and A Second Life released their first four singles, “Civil War”, “Just Whisper”, “Beautiful Distraction”, and “You’re Missing From Me”.\n\nTo take a listen to the alt-vibes of Face the King, Don’t Believe in Ghosts, and A Second Life, check them out on Spotify:\n\nFace the King: https://open.spotify.com/artist/4Rg22QdAlQc1KrhWuNwGWq\n\nDon’t Believe in Ghosts: https://open.spotify.com/artist/5uLKc9jyRkcyoTNF1JLWe1\n\nA Second Life: https://open.spotify.com/artist/1FJj42V3fVy1sdxs0OgTQ5\n\nAs a session musician, Dan has performed with countless artists from different Genres – Robbie Rosen (American Idol), MarissaAnn (The Voice), Alessandra Guercio (The Voice), The Frankel Sisters (X Factor), Julia Lambert, Nicoletta Slapo, Sammi Rae Murciano, The 00’s Band, and with Hank Lane Music Productions for weddings in the tri-state area. As a result he has shared the stage with those who top the charts today and in years past, some who include – Shawn Mendes, Ed Sheeran, Kings of Leon, Jake Miller, Coheed & Cambria, Shinedown, Staind, Billy Idol, Jane’s Addiction, and countless others.\n\nLiving a life of performance, especially that of music, means you never quite know what or where your next gig will be. To steal a line from Dan’s favorite movie, Forrest Gump – “I don’t know if we each have a destiny, or if we’re just floating around accidental – like on a breeze. But I think maybe it’s both.”\n\nIn Dan’s case, it is most definitely a touch of both. A destiny come true, thanks to years of training and mentorships, as well as a dream that started at the age of 5 and blossomed into today’s amazing career.\nBut the dream doesn’t stop here. Dan DelVecchio is always looking for new opportunities to expand his horizons in music, to follow the breeze and see where it takes him. Are you interested in learning from or playing with Dan? Contact him here today!\n\nBio written by Adina Perullo", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "SPACE CADE7S ", "ArtistImage": "https://photos.bandsintown.com/thumb/9067399.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rap, R&b, Hip Hop, Soul", "Time": "10:00 AM", "Venue": "SoFar NYC (INSTAGRAM TAKEOVER)", "moreBioInfo": "East Coast Hip-Hop/Soul Collective - WWW.SPACECADE7S.COM", "otherInfo": "Live Stream: https://www.instagram.com/sofarnyc"}, {"Address": "New York City, NY", "Artist": "Morgan James ", "ArtistImage": "https://photos.bandsintown.com/thumb/9814141.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop, R&b, Soul", "Time": "5:00 PM", "Venue": "Stageit Livestream", "moreBioInfo": "One voice is all it takes. The right vocalist can make you fall in love at first listen, elicit tears, or bring you back to a different era altogether. A microphone and a stage remain the only necessities. That holds true for New York-based singer and songwriter Morgan James. On her full-length debut for Epic Records, Hunter, she casts an unbreakable spell with a powerhouse voice equally inspired by smoky soul, swaggering R&B, theatrical swing, and a virtuosic classical poise.\n\nThe Idaho native discovered her passion for music early on and pursued it\nwholeheartedly at the prestigious Juilliard School. While in the midst of the institution's rigorous academic program, she soon realized that her path would diverge from the classical world. \"I didn't want a career in opera, but Juilliard still shaped me,\" she confesses. \"The traditional training really made me a disciplined singer. I carry that with me to this day.\"\n\nAfter graduating, Morgan spent the next few years facing the proverbial struggles of being a young artist in New York. Low on money, she bounced back and forth between bartending and restaurant gigs while fighting to survive. Immersed in classic sixties and seventies soul records, she concurrently experienced a pivotal revelation. \"Out of that frustration came this other voice,\" she says. \"It was my true voice, and I feel like I discovered it in the middle of so much hardship just trying to be heard. I embraced who I was at that very moment.\"\n\nSoon, she would be heard in a big way. In 2008, Morgan booked her first Broadway show—appearing in The Addams Family alongside Nathan Lane, as well as in prominent and leading roles in Wonderland, Godspell (Turn Back, O Man), and Berry Gordy's Motown The Musical as Teena Marie. The latter set the stage for her to\nproperly launch her solo career. Gordy recognized the vocalist's immense talent, and introduced her to Doug Morris and L.A. Reid, opening the door for a deal with Epic Records in 2012.\n\nAround the same time, Morgan booked a landmark show at Dizzy’s Club Coca-Cola, where she paid tribute to Nina Simone with a set of songs that were closely associated with the legendary artist. The incendiary show was recorded and released as the critically acclaimed Morgan James Live on Epic Records. It also proved to be the perfect segue for her first studio album, released in June of 2014.\n\n\"I always knew to make a neo-soul pop record,\" Morgan says. \"The foundation is all real ingredients, and those roots of soul and R&B are pretty strong. It's the culmination of my musical life up to this point. The painful songs are straight out of a bad relationship with someone from my past. The joyful moments are wonderful memories. It's all coming from me. I've lived every one of these stories, and I love the genres I'm representing. It's one point-of-view—mine.\"\n\nThe title track and album opener \"Hunter\" boasts a seductive hook with cinematic noir flair. Flaunting the singer's immense delivery and dynamic presence, it's an undeniable and classy come-on that proves as animalistic as it does magnetic. \"From a woman's perspective, it's such an empowering and sexy song,\" she smiles. \"It totally makes me feel like a warrior! Music is so sensual and life-affirming. That's what I look for. You don't often see a girl take this position, and that's what I love about it!\"\n\nMorgan assumed co-writing duties on eight of the collection's fourteen tracks and even performed all of her own background vocals and harmonies. From the empowering farewell of \"Fed Up On You\" to the mournful rumination of \"You Never Lied\", she continually bares it all—both emotionally and musically. \"I sing like I'm never going to sing ever again,\" Morgan affirms. \"I wanted to capture that power and passion every time. At some moments, it might sound flawless; at others, it might sound like it's going to break. I'm revealing something about myself with\nevery song. You've got to do that. My favorite artists, whether Joni Mitchell or Michael Jackson, are and were, always honest.\"\n\nThere's a unique structure to the album. The first five songs boast electronic elements, while the last six don't have any. \"There's a gradient of the record that goes down,\" she says. \"By the time you get to the last song, it's just piano and voice. It starts with a song about power and ego, and it ends on one about surrender and selflessness. I have all of that in me. Maybe we all do.\"\n\nUltimately, her honesty permeates everything that Morgan James does, and it's why you'll always remember her voice. \"I want people to walk away from this album feeling fulfilled. That's the way it used to be. Often, I think I'm from another time,” she says, her voice trailing off. “I just want to bring back the power of the singular legacy voice.\"", "otherInfo": "No other event info available"}, {"Address": "123 W 43rd St, New York, NY 10036", "Artist": "The Magnetic Fields ", "ArtistImage": "https://photos.bandsintown.com/thumb/7487637.jpeg", "Coordinates": [-73.984563, 40.756023], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop", "Time": "5:45 PM", "Venue": "The Town Hall", "moreBioInfo": "Band. Likes ukuleles, chihuahuas. Official\nFacebook for The Magnetic Fields.", "otherInfo": "Live from Here with Chris Thile"}, {"Address": "17 Minneakoning Rd, Flemington, NJ 08822", "Artist": "The Infection ", "ArtistImage": "https://photos.bandsintown.com/thumb/9133218.jpeg", "Coordinates": [-74.849981, 40.530473], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Classic Rock, Heavy Rock, Heavy Metal, New Rock, Metal, Hard Rock", "Time": "6:00 PM", "Venue": "All Star Music Empire", "moreBioInfo": "The infection is spreading - heavy modern rock grooves with memorable hooks and melodies. The lineup is all NYC guts and talent.", "otherInfo": "Canceled due to COVID-19.\n\nLive Rock show in Flemington, NJ featuring Tantric, The New Black, Pierced and special guests The Infection!"}, {"Address": "New York City, NY", "Artist": "Branden & James ", "ArtistImage": "https://photos.bandsintown.com/thumb/10297211.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Branden James, James Clark", "Time": "7:00 PM", "Venue": "Our Living Room", "moreBioInfo": "Welcome to The Official Fan Page of BRANDEN & JAMES!", "otherInfo": "BRANDEN & JAMES continue their virtual concert series from their living room in New York City with \"The Phantom Of The Greatest Showman.\" Music from two of the greatest stories ever told, including Music of The Night, A Million Dreams, All I Ask Of You, This Is Me and Never Enough, and tons of fan favorites.\n\nThis is a PAY WHAT YOU WANT event. We want to keep our music accessible to everyone who would like to listen and watch. You can gift tickets to others who may be isolated."}, {"Address": "206 Stewart Ave, Garden City, NY 11530", "Artist": "Anthony Edley ", "ArtistImage": "https://photos.bandsintown.com/thumb/8851880.jpeg", "Coordinates": [-73.664597, 40.72412], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Garden City Country Club", "moreBioInfo": "Anthony Edley is a Musician and Teacher", "otherInfo": "No other event info available"}, {"Address": "380 N Wantagh Ave, Bethpage, NY 11714", "Artist": "Skyward Effect ", "ArtistImage": "https://photos.bandsintown.com/thumb/8011234.jpeg", "Coordinates": [-73.495464, 40.735039], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rock, Alternative Rock", "Time": "7:00 PM", "Venue": "One Eye Jacks", "moreBioInfo": "Alternative Rock band playing performances of all kinds including: Bars, Clubs, Restaurants, Charity Events and Private Parties.\n\nWe play classic rock covers!", "otherInfo": "Skyward Effect is supporting Stereo Jo's debut full length album premiere at One Eye Jack's. This will be an awesome night of high energy rock!\n\nScared20\nAll New Episode\nCrisis Crayons\nAgent 355\nSkyward Effect\nDJ J-Ro"}, {"Address": "18 Bleecker St, New York, NY 10012", "Artist": "Abigail Washburn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8282477.jpeg", "Coordinates": [-73.993239, 40.725416], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop, Blues, World & Chamber Music., Indie, Folk", "Time": "7:30 PM", "Venue": "The Sheen Center for Thought & Culture", "moreBioInfo": "\"A daring, definite talent, whose feel for the folk idiom results in moving material. Soulful is the word\"-- Wall Street Journal\n\n\"Washburn stomped and skipped through fiery Appalachian takes on the local songs of Sichuan. Her bilingualism's no gimmick; she nails the dips and peaks of pitch while leading her band in scorching variations on simple, repetitive traditional melodies…” – L.A. Times\n\n“{Abigail Washburn is} an artist who best embodies the notion of Americana as a worldwide musical language\" – The Tennessean\n\nBeijing. A smoke-filled club bustling with people, clanging of bottles, chatter. There is a woman on stage with her banjo. She begins to sing old-time Appalachian music in Chinese. The effect produced is entirely original, a cultural mash-up between two distant yet not so different worlds. The crowd quiets down to listen.\n\nAbigail Washburn never set out to be a songwriter, recording artist or a producer. Her performance at that smoke-filled Beijing club would prove to be an important step toward international acclaim and attention from discerning critics. Abigail has created a new sound – a sound that challenges traditional notions of culture and countries.\n\nAbigail planned to move to China after a road trip up the east coast, but instead she stumbled upon a professional music career. This east coast trip included a stop at the International Bluegrass Music Association conference in Louisville, KY where she intended to learn a few banjo tunes but walked away with a demo session for a record deal in Nashville, TN. She canceled her one-way ticket to China and moved to Nashville. Shortly thereafter in 2004 she joined Uncle Earl. The \"all G'earl\" group released two records on the Rounder label, She Waits for Night (2005) and Waterloo, TN, (2007) the latter of which was produced by John Paul Jones of Led Zeppelin.\n\nIn the midst of touring with Uncle Earl, Washburn released her first solo debut, and bilingual album, Song of the Traveling Daughter, (Nettwerk). At that point, Abigail joined cellist, Ben Sollee, in performing her music around the globe. In 2005 Abigail, Ben and a few talented friends (Béla Fleck on banjo and Casey Driessen on fiddle) formed the Sparrow Quartet and toured China. In 2006, the US State Department and the American Center for Educational Exchange requested that the group come back to lead the first official tour of a US band in Tibet.\n\nIn May 2008, the Sparrow Quartet released Abigail Washburn & the Sparrow Quartet (Nettwerk) which was praised by critics and appeared on several “best of” lists from prominent publications. Produced by Béla Fleck and composed/arranged by the unconventional foursome, Abigail Washburn & The Sparrow Quartet became an \"intimate exploration of crossing global and cultural lines,\" says Abigail, who feels a reverence for both American and Chinese cultures. The unprecedented combination of two banjos (clawhammer and three-finger-style), cello and five-string fiddle unfolds -live and on record- in a dreamlike chamber suite. From the flawless ‘Overture\" and harrowing revival, \"Strange Things,\" to the interplanetary, Puccini-inspired old-time fairy tale, \"Great Big Wall in China,\" this record highlights the brilliant musicianship of each individual, but is at the same time much larger than the sum of its parts.\n\nIn 2008 and 2009, Abigail Washburn and the Sparrow Quartet toured extensively throughout the US and Canada with appearances at festivals including New Orleans Jazz & Heritage, Merlefest, Bonnaroo Music and Arts Festival, Vancouver Folk Festival and many more. They were invited by the US State Department to play in China including several performances in Beijing during the 2008 Olympic games. In addition, the were filmed on National Geographic Live in Washington, DC and were invited to be a part of the Clearwater Concert, a benefit concert in celebration of Pete Seeger's 90th birthday along with a line-up of some of the most prominent, established musicians in the world. For Abigail and the Sparrow Quartet, 2008 was a year full of accomplishments and successes.\nBut Abigail does not stop. She is a force of nature that continually attracts others to become a part of her art. Enter The Shanghai Restoration Project (SRP) producer Dave Liang. Abigail and Dave first collaborated to produce two electronic remixes of Sparrow Quartet songs released in April 2009.\nIn December 2008, Abigail served as a resident teacher at the Sichuan University Art School teaching traditional US music. In the hours after school was finished, she volunteered for Sichuan Quake Relief performing at earthquake relocation schools. The experience with the students and teachers after the performances left her wanting to do something to help.\nIn early March, 2009, Abigail had the idea to create Afterquake, a benefit EP in memory of the May 12, 2008 Sichuan Earthquake which left more than 5 million people homeless and hundreds of thousands dead. Abigail and The Shanghai Restoration Project united again to go to Sichuan Province, to the relocation schools and into the disaster zone to capture the voices of those affected by the earthquake and sample sounds from the schools and the disaster zone. They sampled, recorded and produced Afterquake in two and a half weeks in Sichuan province. The final result is a beautiful, timeless, intelligent and accessible musical document that blends folk and electronic sounds with post-earthquake samples. A portion of all proceeds will go to the Sichuan Quake Relief organization.\nWhether playing her banjo, or producing an electronic album, there is an undeniable element of Abigail Washburn in every project she embraces. Abigail's spirit and philosophy translate from language to language and bind countries, cultures and genres.\n\"As more and more people engage in this struggle for a new direction for the human spirit, we'll recognize that we're morphing into a global species.\"\n---Abigail Washburn", "otherInfo": "No other event info available"}, {"Address": "29 Harvard Ave, Richmond County, NY 10301", "Artist": "Steve Poltz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9961547.jpeg", "Coordinates": [-74.090492, 40.642876], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Acoustic, Americana, Folk", "Time": "7:30 PM", "Venue": "Hamilton Park House Concerts", "moreBioInfo": "DISCLAIMER 1: The “official” Wikipedia for Steve Poltz describes the material contained therein as “contentious,” not to mention “unsourced or poorly sourced.” We can wholeheartedly assure you Steve remains sourced and rarely contends. Either way, allow us to present the real story from the horse’s (man’s) mouth…\n\nDISCLAIMER 2: (No animals were harmed in the making of this bio.)\n\nThroughout over three decades in music, Steve Poltz did it all and more—often shared by way of his rockin’ countrified folk slices of sardonic Americana (hatched in Halifax). Of course, he co-wrote Jewel’s multiplatinum Hot 100-topping megahit “You Were Meant For Me,” but he also went on a whale watch with her and a few federales that turned into a drug bust. The two still share the story at every festival they play together. He made his bones as the frontman for underground legends The Rugburns, who burned rubber crisscrossing the continent on marathon tours and still pop up once in a while for the rare and quickly sold out reunion gig.\n\nIn 20 years since his full-length solo debut, One Left Shoe, he blessed the world’s ears with twelve solo records, spanning the acclaimed 2010 Dreamhouse and most recently Folk Singer in 2015. NPR summed it up best, “Critics and fans alike now regard Poltz as a talented and prolific songwriter.” By 2016, he survived a stroke, endured anything the music industry could throw at him, and still performed like “280 days a year.”\n\nHowever, he still never lived in Nashville, which represents a turning point in the story and the genesis of his 2018 Red House Records debut, Shine On…\n\n“My girlfriend Sharon sold the condo we were living in, and I was ready to live in a van, which seemed like a good idea for one night—then I decided I wanted a kitchen and a closet,” he admits. “Sharon wanted to move to Nashville, because she thought it would be good for me. It caused a huge fight. I’d been in San Diego since 1980, and that’s where I cut my musical teeth. I thought I’d never leave. In fact, at the height of our fight, I said, ‘I’m not leaving San Diego. I am San Diego!’ This makes me laugh now. As soon as I got to Nashville, I immediately knew I wanted to make a record in ‘Music City’.”\nSo, the man who once protested “I am San Diego” made Shine On in his new home of Nashville with one of its elder statesman behind the board, Will Kimbrough [Emmylou Harris, Rodney Crowell]. Holing up in the studio at Kimbrough’s house, nothing would be off limits. Together, they unlocked the kind of creative chemistry you only hear about in band bios—but for real.\n\n“I respect Will so much, and I’d always wanted to work with him,” says Steve. “Like two mad scientists, we just took our time and had fun. We didn’t overthink things. Everything felt organic. We ate soul food and drank lots of really good coffee. We tried out weird sounds, and the songs always started with voice and guitar—no click track, just how I’d play them. I road tested many of them, and they were ripe for the picking when recording time came around.”\n\nEvoking themes of “hope, love, contemplation, celebration of Wednesday, pharmacists, and the fact that windows are not inanimate objects and they sometimes have conversations with each other,” the record represents Steve at his most inspired and insightful. The opener and title track “Shine On” pairs a delicate vocal with lithely plucked acoustic strings as he urges, “Shine on, shine on.”\n\n“The song was a gift,” he recalls. “I woke up really early in Encinitas, California at Sharon’s sister’s house. The sun was just coming up. I was all alone in perfect solitude. My guitar was there. The sky was gorgeous. I wrote it as a poem. Everyone always told me, ‘Never start a record with a really slow song.’ So, seeing that I have O.D.D. (Oppositional Defiance Disorder), I started my record with one. I love the mood it sets. It’s almost like my mission statement, trying to find some semblance of positivity and light in a sometimes ruthless world.”\n\nOn “Pharmacist,” rustling guitar and harmonica propel a tale of “this dude having a crush on his pharmacist.” It also serves as an extension of his friendship with neighbor Scot Sax—with whom he shares the podcast “One Hit Neighbors” (since they’ve both had one hit song). Meanwhile, he joined forces with Molly Tuttle on “4th of July,” which, of course, came to life on the 3rd of July. “Ballin On Wednesday” drew its title and chorus from a diner checkout girl (with a super cool gold tooth) who Steve paid with a $100 bill and she replied, “Oooh, ballin’ on a Wednsday.” The finale “All Things Shine” skips along on sparse instrumentation as Steve sends a message.\n\n“‘All Things Shine’ came about after one of the many mass shootings on this planet,” he sighs. “I was feeling overwhelmed. So, I wanted to put my feelings into words and melody. I was thinking that even if we’re feeling hopeless that there is still beauty. All things shine in their own way.”\nWho could contend that?\n\nIn the end, for everything you can call him “searcher, smartass, movie freak, lover of technology, news junkie, baseball fan to nth degree, lapsed catholic who still believes in god even though all his friends are atheists and think he’s an idiot, and maker of fun,” you might just call Steve that little light in the dark we all need in this day and age.\n\nOr Nashville’s Canadian Jiminy Cricket…\n\n“I hope Shine On makes listeners smile and feel welcome, and they want to share it with their friends,” he leaves off. “Music means energy to me. All things. It connects us, makes us move, helps us relax, and inspires us to change things up.”", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Svetlana ", "ArtistImage": "https://photos.bandsintown.com/thumb/9301408.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Jazz, Sophisti-pop, Swing", "Time": "8:00 PM", "Venue": "Center for the Arts at New Jersey City University  CANCELLED", "moreBioInfo": "\"Breakfast at Tiffany's Meets Some Like It Hot\" (Lucid Culture)\n\"Outstanding vocalist\" (Wall Street Journal)", "otherInfo": "No other event info available"}, {"Address": "201 Union Ln, Brielle, NJ 08730", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.052411, 40.107332], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Little Falls, New Jersey", "Time": "9:00 PM", "Venue": "The Pig & Parrot", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "1050 Wall St W, Lyndhurst, NJ 07071", "Artist": "DJ__Cam ", "ArtistImage": "https://photos.bandsintown.com/thumb/10264934.jpeg", "Coordinates": [-74.10438, 40.80649], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Hoboken, United States", "Time": "9:00 PM", "Venue": "Society Liquor Lounge and Cafe", "moreBioInfo": "Ledg.", "otherInfo": "No other event info available"}, {"Address": "350 Belleville Turnpike, North Arlington, NJ 07031", "Artist": "ROCK Kandy the 80's Experience ", "ArtistImage": "https://photos.bandsintown.com/thumb/10277289.jpeg", "Coordinates": [-74.133272, 40.778911], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "80s Tribute", "Time": "9:30 PM", "Venue": "Shawn's Crazy Saloon", "moreBioInfo": "..ROCK KANDY THE 80S EXPERIENCE\nAT A ROCK KANDY SHOW ITS ALWAYS\n\"NOTHIN BUT A GOOD TIME\" ®\nTHE ONLY AUTHENTIC 80'S TRIBUTE", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Jeff Taylor ", "ArtistImage": "https://photos.bandsintown.com/thumb/7816769.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Indie Rock", "Time": "10:00 PM", "Venue": "Rockwood Music Hall", "moreBioInfo": "Jeff Taylor is a singer-songwriter based in New York. His first album, Frustration in Time Travel was released in 2012 under the band name, Dumpster Hunter. This was followed by the EP, Organelle in 2014 as his first solo release. Jeff collaborated with Sean Kiely in 2017, releasing a split 7″ single, Willow, Texas.\n\nThis past year has seen Jeff working with Donny McCaslin (David Bowie’s Blackstar band) to co-write and record his latest album, “Blow”, and together they have been touring the world throughout 2018/2019 for the release. He also appeared on Donny’s previous album, Beyond Now, singing a cover of David Bowie’s “A Small Plot of Land”. Earlier in 2018, Marike van Dijk‘s The Stereography Project was released featuring arrangements of Jeff’s songs for a 12-piece wind and string ensemble. He also frequently sings with Mark Guiliana‘s Beat Music project, and has toured and recorded with the likes of Sara Bareillies, Trixie Whitley, and Kishi Bashi.\n\nIn 2013 Jeff joined a cast of brilliant actors and musicians at Walt Disney Concert Hall for the Los Angeles Philharmonic’s one-night-only, sold out performance of Frank Zappa’s 200 Motels, under the conducting of legendary Finish maestro Esa-Pekka Salonen.\n\nJeff has just completed recording of his debut full-length solo album, featuring the rhythm section of Matt Johnson (Jeff Buckley, Rufus Wainwright, St. Vincent) and Jesske Hume (Conor Oberst, Margaret Glaspy) with a release planned for 2019.", "otherInfo": "LIVE STREAM - Jeff Taylor"}, {"Address": "396 New York Ave, Huntington, NY 11743", "Artist": "Dan DelVecchio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9166815.jpeg", "Coordinates": [-73.425627, 40.868825], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rock, Indie, Blues, Pop Rock, Funk, R&b, Soul, Alternative, Pop, Jazz, Dance -", "Time": "10:00 PM", "Venue": "Nag's Head Ale House", "moreBioInfo": "Those who have found their life’s passion can usually pinpoint the exact moment they discovered it, loved it for the first time, and needed to learn everything about it.\n\nFor musician Dan DelVecchio, that moment was in daycare - many moons ago (5 years old), when he was scolded for trying to pick up an acoustic guitar sitting in the corner of the room. While other children dreamt of being astronauts or building rocket ships out of mega blocks, Dan was ready to jam on stage with the greatest of the great.\n\nWhen he got a bit older, he accompanied his brother Michael to Sam Ash music store, where he needed to pick up a saxophone for middle school band. They may have been at the store for his brother, but that day will forever be the one where Dan’s daycare dreams began to grow into a reality.\n\nThere, standing in the guitar department, Dan was encouraged to pick up and strum along to the beat inside his soul, and his passion began to take shape.\n\nAs years passed, Dan became more and more accustomed to the guitar, and fell more and more in love with performing. He surrounded himself with mentors from diverse backgrounds – Dennis DelGaudio (Billy Joel), Chris Justino (Broadway), Artie Blaurock (Sweet Revenge, Dorian Grey, Needulhed), & Rick Stone (Jazz Guitar at Hofstra University). Each of these amazing talents provided him with a unique perspective on guitar stylings and teachings.\n\nTaking that knowledge to the next level, Dan joined the likes of Indie/Alternative Rock band Face the King (CI Records) and performed across the continental US for a multitude of shows, including a full leg of Vans Warped Tour, Rockstar UPROAR Festival, the main stage at the CBGB Festival in Times Square, NY (with Billy Idol and Jane’s Addiction!), as well as the world’s largest music festival - Summerfest, in Milwaukee, WI.\n\nFace the King was chosen as a National Finalist for the Ernie Ball Vans Warped Tour competition alongside PVRIS, and are three-time winners of the Ernie Ball Battle of the Bands. Their full-length album, “Once More Is All I Am,” was released in November of 2017.\n\nDan is also collaborating on songwriting and performing with two up-and-coming Alt/Indie groups, Don’t Believe in Ghosts (Forward Thinking Records), and A Second Life. These bands have received high acclaim, as shown by their multiple plays on retail radio playlists and on Spotify, national plays on Sirius XM Radio, and a number of live shows including Bowery Ballroom, The Paramount, NYC Marathon, and an upcoming appearance at the world-famous South By Southwest (SXSW) in Austin, TX.\n\nIn 2017, Don’t Believe In Ghosts released their debut full-length album, “Give it Meaning”, and A Second Life released their first four singles, “Civil War”, “Just Whisper”, “Beautiful Distraction”, and “You’re Missing From Me”.\n\nTo take a listen to the alt-vibes of Face the King, Don’t Believe in Ghosts, and A Second Life, check them out on Spotify:\n\nFace the King: https://open.spotify.com/artist/4Rg22QdAlQc1KrhWuNwGWq\n\nDon’t Believe in Ghosts: https://open.spotify.com/artist/5uLKc9jyRkcyoTNF1JLWe1\n\nA Second Life: https://open.spotify.com/artist/1FJj42V3fVy1sdxs0OgTQ5\n\nAs a session musician, Dan has performed with countless artists from different Genres – Robbie Rosen (American Idol), MarissaAnn (The Voice), Alessandra Guercio (The Voice), The Frankel Sisters (X Factor), Julia Lambert, Nicoletta Slapo, Sammi Rae Murciano, The 00’s Band, and with Hank Lane Music Productions for weddings in the tri-state area. As a result he has shared the stage with those who top the charts today and in years past, some who include – Shawn Mendes, Ed Sheeran, Kings of Leon, Jake Miller, Coheed & Cambria, Shinedown, Staind, Billy Idol, Jane’s Addiction, and countless others.\n\nLiving a life of performance, especially that of music, means you never quite know what or where your next gig will be. To steal a line from Dan’s favorite movie, Forrest Gump – “I don’t know if we each have a destiny, or if we’re just floating around accidental – like on a breeze. But I think maybe it’s both.”\n\nIn Dan’s case, it is most definitely a touch of both. A destiny come true, thanks to years of training and mentorships, as well as a dream that started at the age of 5 and blossomed into today’s amazing career.\nBut the dream doesn’t stop here. Dan DelVecchio is always looking for new opportunities to expand his horizons in music, to follow the breeze and see where it takes him. Are you interested in learning from or playing with Dan? Contact him here today!\n\nBio written by Adina Perullo", "otherInfo": "No other event info available"}]