var nyc_events = [{"Address": "1468 Madison Ave, New York, NY 10029", "Artist": "Aeolus Quartet ", "ArtistImage": "https://photos.bandsintown.com/thumb/8569982.jpeg", "Coordinates": [-73.952097, 40.790311], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "String Quartet", "Time": "4:00 PM UTC", "Venue": "The Mount Sinai Hospital", "moreBioInfo": "Praised by Strad Magazine for their “high-octane” performance, the Aeolus Quartet is among the finest young string quartets performing today. Violinists Nicholas Tavani and Rachel Shapiro, violist Gregory Luce, and cellist Alan Richardson formed the Aeolus Quartet in 2008 at the Cleveland Institute of Music. Since its inception, the all-American quartet has been awarded prizes at nearly every major competition in the United States and performed across the globe with showings “worthy of a major-league quartet” (Scott Cantrell, Dallas Morning News). Luke Quinton of the Austin-American Statesman writes, “The Aeolus Quartet is a powerful and thoughtful group of young musicians who are plotting an ascending course…this vibrant group shows great promise.” They are currently the Graduate Resident String Quartet at the Juilliard School.\n\nThe Aeolus Quartet are Grand Prizewinners of the 2011 Plowman Chamber Music Competition and 2011 Chamber Music Yellow Springs Competition. They were awarded First Prize at the 2009 Coleman International Chamber Ensemble Competition, a Silver Medal at the 2011 Fischoff International Chamber Music Competition, and a Bronze Medal at the 2010 International Chamber Music Ensemble Competition in New England. The 16th Annual Austin Critics’ Table named the Aeolus Quartet their 2010-2011 “Best Ensemble.” The Aeolus Quartet has released two critically acclaimed albums of classical and contemporary works through the Longhorn/Naxos label which are available on iTunes, Amazon, and major retailers worldwide.\n\nThe Quartet has performed across North America, Europe, and Asia in venues such as Weill Recital Hall at Carnegie Hall, Reinberger Recital Hall at Severance Hall, Merkin Hall, The Library of Congress, Renwick Gallery, St. Martin-in-the-Fields, and the Shanghai Oriental Arts Center.\n\nDedicated to bringing music into the community, the Aeolus Quartet has been widely recognized for their highly innovative and engaging outreach programs. The Fischoff National Chamber Music Association awarded the Aeolus their 2013 Educator Award in acknowledgment of the positive impact their educational efforts have had in diverse communities. Additionally, they were awarded the 2012 Lad Prize which culminated in large-scale community engagement work, performing in the Stanford area, and a masterclass residency at Stanford University. The Aeolus Quartet has also served as teaching faculty at Stanford University’s Education Program for Gifted Youth (EPGY), the Austin Chamber Music Workshop, and Da Camera of Houston’s Music Encounters Program. Working in collaboration with the University of Texas through the Rural Chamber Music Outreach Initiative, the Quartet has presented educational programs and performances in communities throughout the state of Texas.\n\nThe Aeolus Quartet has studied extensively with the Miró, Guarneri, and Juilliard Quartets. Other mentors include artists such as William Preucil, Peter Salaff, Donald Weilerstein, Itzhak Perlman, Gerhard Schulz, and Mark Steinberg. Members of the Quartet hold degrees from the Peabody Conservatory, the Cleveland Institute of Music, and the University of Texas at Austin, where they served as the first Graduate String Quartet-in-Residence.\n\nThe Quartet’s 2013-2014 season includes multiple performances on the Smithsonian Institute’s rare instrument collection, an educational tour of the Midwest in conjunction with the Fischoff Competition, concert touring throughout the United States, and residencies in North Carolina and at the Austin Chamber Music Center’s Summer Festival.\n\nThe Quartet is named for the Greek god Aeolus, who governed the four winds. This idea of a single spirit uniting four individual forces serves as an inspiration to the members of the Aeolus Quartet as they pursue their art.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Brian Newman ", "ArtistImage": "https://photos.bandsintown.com/thumb/8284445.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Jazz", "Time": "9:00 PM UTC", "Venue": "StageIt Livestream", "moreBioInfo": "Performer, trumpeter, and vocalist, Brian Newman’s brand of jazz has tirelessly resurrected the magic of Old New York, refreshing the glamorous era with nuances of his own rock-n-roll edge. Whether performing with his own quartet or supporting Lady Gaga and Tony Bennett on tour, Newman’s expert trumpeteering and effervescent stage presence reignited a big band scene in New York City, and has since enticed a new generation of jazz fans across the globe. The Verve Recording artist continues to reign at his weekly residency in New York, as well as appear on television programs and in special performances across the United States and Europe.\nNewman is known for his impeccable horn playing and rendition of romantic favorites. But what sets him apart is his ability to command a room not only with his musical talent, but as a bandleader who makes each person in the audience feel as if they are a part of his performance. His fusion of music playing and easy going banter captures the vivacity of great bandleaders of the past. This exuberance is evident on Newman’s 2016 debut album, Eyes on the City, which pays tribute to his musical journey in New York.\nAlong with his Quartet, fellow musicians from Cincinnati’s College-Conservatory of Music, Newman has allured audiences during his residencies at some of New York’s most iconic venues. His first foray into creating an old school big band night was at the elegant Duane Park for “After Dark,” a jazz and burlesque revue on the downtown scene in Tribeca. “After Dark” lead to a weekly residency at the legendary Oak Room at The Plaza Hotel, a venue steeped in history which was frequented by the likes of Truman Capote, Gore Vidal, Frank Sinatra, Liza Minelli and countless others over its one hundred year history. Newman and his Quartet played each Wednesday to a mixed crowd seeking a slice of history, welcoming Lady Gaga as a surprise guest, until the venue closed in 2011. Currently, Newman performs every Tuesday and Thursday, as bandleader in a residency at Rose Bar at the Gramercy Park Hotel, and select Friday nights at NYC’s legendary Rainbow Room with his orchestra. Brian also routinely appears for special live performances with a diverse array of musical acts, which have included Tony Bennett, Jose Feliciano, Stevie Wonder, Mark Murphy, Dierks Bentley, Willie Nile, Molly Ringwald, David Loeb, Steve Wynn’s Orchestra, Ray Benson’s Asleep at the Wheel and Tommy London.\nNewman’s personal style, which meshes classic suits, vintage tattoos and rock-n-roll, has attracted commercial brands such as Jack Daniel’s, Marc Jacobs and Tiffany & Co., who have collaborated with Newman for special events and performances. The Jack Daniel’s partnership in 2012, which launched the brand’s Sinatra Select premium Tennessee Whiskey, brought Newman alongside Frank Sinatra Jr. himself, in a performance in Cannes, France.\nBrian married burlesque star, Angie Pontani of the World Famous Pontani Sisters in February 2013, with whom he most notably performs in connection with Pontani’s New York Burlesque Festival and Burlesque-a-Pades shows. The couple have a daughter, and reside in the neighborhood of Brooklyn.", "otherInfo": "No other event info available"}, {"Address": "127 E 23rd St, New York, NY 11226", "Artist": "Hot Chelle Rae ", "ArtistImage": "https://photos.bandsintown.com/thumb/9945290.jpeg", "Coordinates": [-73.98492, 40.7399], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Rock, Pop", "Time": "11:00 PM UTC", "Venue": "Gramercy Theatre", "moreBioInfo": "DON'T SAY GOODNIGHT: http://smarturl.it/DontSayGoodnight", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Casey Shea ", "ArtistImage": "https://photos.bandsintown.com/thumb/6323354.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Indie, Alternative, Folk, Classic Rock, Rock", "Time": "12:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Shea's riding high in the New York scene. One of many great young artists selling songs extremely cheap for fans at AmieStreet.com", "otherInfo": "Live Stream: http://instagram.com/rockwoodmusichall\nRockwood LiveStream Concerts are taking place at 8:00 and 10:00PM EST nightly as we strive to continue bringing you live music during this period of temporary closure.\n\nAll live streams can be found at @RockwoodMusicHall on Instagram Live and all donations given will be split between the Artist streaming, and the venue's staff until we can reopen. NOTE: Instagram Live is only available on mobile and tablets.\n\nPlease RSVP and consider donating. All RSVPs will receive an email reminder 10 minutes before the set is scheduled to begin."}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Marcia Ball ", "ArtistImage": "https://photos.bandsintown.com/thumb/9873048.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Americana, Boogie-woogie, Blues, Swamp Blues", "Time": "12:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "\"Fifty years have passed in a flash,\" says Texas-born, Louisiana-raised pianist, songwriter and vocalist Marcia Ball of her long and storied career. Ball, the 2018 Texas State Musician Of The Year, has won worldwide fame and countless fans for her ability to ignite a full-scale roadhouse rhythm and blues party every time she takes the stage. Her rollicking Texas boogies, swampy New Orleans ballads and groove-laden Gulf Coast blues have made her a one-of-a-kind favorite with music lovers all over the world. With each new release, her reputation as a profoundly soulful singer, a boundlessly talented pianist and a courageous, inventive songwriter continues to grow. Her love of the road has led to years of soul-satisfying performances at festivals, concert halls and clubs. The New York Times says, \"Marcia Ball plays two-fisted New Orleans barrelhouse piano and sings in a husky, knowing voice about all the trouble men and women can get into on the way to a good time.\" The Houston Chronicle says simply, \"She's as perfect as an artist can be.\"\n\nWith her new album, Shine Bright, Ball set out to, in her words, \"Make the best Marcia Ball record I could make.\" In doing so, she has put together the most musically substantial, hopeful and uplifting set of songs of her five-decade career. Produced by Steve Berlin (Los Lobos) and recorded in Texas and Louisiana, Shine Bright contains twelve songs (including nine originals), ranging from the title track's rousing appeal for public and private acts of courage to the upbeat call to action of \"Pots And Pans,\" a song inspired by renowned Texas political writer and humorist Molly Ivins. From the humorous advice of \"Life Of The Party\" to the poignantly optimistic \"World Full Of Love,\" the intensity of Ball's conviction never wavers while, simultaneously, the fun never stops. Shine Bright is exactly the album Ball set out to make. \"It is a ridiculously hopeful, cheerful record,\" she says, in light of some of the album's more serious subject matter. The secret, according to Ball \"is to set the political songs to a good dance beat.\"\n\nBorn in Orange, Texas in 1949 to a family whose female members all played piano, Ball grew up in the small town of Vinton, Louisiana, right across the border from Texas. She began taking piano lessons at age five, playing old Tin Pan Alley and popular music tunes from her grandmother's collection. But it wasn't until she was 13 that Marcia discovered the power of soul music. One day in New Orleans in 1962, she sat amazed as Irma Thomas delivered the most spirited and moving performance the young teenager had ever seen. A few years later she attended Louisiana State University, where she played some of her very first gigs with a blues-based rock band called Gum.\n\nIn 1970, Ball set out for San Francisco. Her car broke down in Austin, and while waiting for repairs she fell in love with the city and decided to stay. It wasn't long before she was performing in local clubs with a progressive country band called Freda And The Firedogs, while beginning to sharpen her songwriting skills. It was around this time that she delved deeply into the music of the great New Orleans piano players, especially Professor Longhair. \"Once I found out about Professor Longhair,\" recalls Ball, \"I knew I had found my direction.\"\n\nWhen Freda And The Firedogs broke up in 1974, Ball launched her solo career, playing clubs around Austin, Houston and Louisiana. She signed with Capitol Records in 1978, debuting with the country-rock album Circuit Queen. Creating and honing her own sound, she released six critically acclaimed titles on the Rounder label during the 1980s and 1990s. In 1990, Ball—collaborating with Angela Strehli and Lou Ann Barton—recorded the hugely successful Dreams Come True on the Antone's label. At the end of 1997, Marcia finished work on a similar \"three divas of the blues\" project for Rounder, this time in the distinguished company of Tracy Nelson and her longtime inspiration, Irma Thomas. The CD, Sing It!, was released in 1998 and was nominated for a Grammy Award.\n\nMarcia Ball has appeared many times on national television over the years, including the PBS special In Performance At The White House along with B.B. King and Della Reese, Austin City Limits and HBO's Treme. She performed in Piano Blues, the film directed by Clint Eastwood included in Martin Scorsese's The Blues series which aired on PBS television nationwide in 2003. Marcia also appeared on The Late Show With David Letterman with The New Orleans Social Club, where she not only reached millions of people, but also helped to benefit victims of Hurricane Katrina. In 2012, she had a role in the independent film Angels Sing starring Harry Connick, Jr., Lyle Lovett and Willie Nelson. In 2017 she performed on NPR's A Jazz Piano Christmas, live from The Kennedy Center in Washington, D.C.\n\nBall joined Alligator in 2001 with the release of the critically acclaimed Presumed Innocent. The CD won the 2002 Blues Music Award for Blues Album Of The Year. Her follow-up, So Many Rivers, was nominated for a Grammy Award, and won the 2004 Blues Music Award for Contemporary Blues Album Of The Year as well as the coveted Contemporary Blues Female Artist Of The Year award. Her next release, Live! Down The Road, released in 2005, also garnered a Grammy nomination, as did 2008's Peace, Love & BBQ (the album debuted at #1 on the Billboard Blues Chart). 2010's Grammy-nominated Roadside Attractions and 2014's The Tattooed Lady And The Alligator Man successfully grew her fan base even further. Altogether she holds ten Blues Music Awards, ten Living Blues Awards, and five Grammy Award nominations. She has been inducted into both the Gulf Coast Music Hall Of Fame and the Louisiana Music Hall Of Fame. The Texas State legislature named her the official 2018 Texas State Musician. As her hometown Austin Chronicle says, \"What's not to like about Marcia Ball?\"\n\nSince joining Alligator, Ball has blossomed as a songwriter. Each album has been filled with fresh, original songs, never more so than on Shine Bright. Ball easily draws her listeners deep into her music with instantly memorable melodies and imaginative imagery. Her songs paint vibrant musical pictures richly detailed with recognizable characters, regional flavors, universal themes and colorful scenes, both real and imagined. Living Blues declares, \"Her originals sound like timeless classics and southern soul masterpieces that no one else can imitate.\"\n\nNow, with Shine Bright, Ball's new, aggressively hopeful songs are energized by Steve Berlin's inventive and exciting production, creating electrifying music that is daring, inspired, poignant and timely. The Boston Globe calls Ball \"a compelling storyteller\" who plays \"an irresistible, celebratory blend of rollicking, two-fisted New Orleans piano, Louisiana swamp rock and smoldering Texas blues.\"\n\nOf course, Ball will bring the party on the road, playing her new songs and old favorites for fans around the globe. \"I still love the feel of the wheels rolling,\" she says, \"and the energy in a room full of people ready to go wherever it is we take them.\" With both her new album and her legendary live performances, Marcia Ball will shine a light into the darkness, making the world a brighter place one song at a time.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Svetlana ", "ArtistImage": "https://photos.bandsintown.com/thumb/9301408.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Jazz, Sophisti-pop, Swing", "Time": "1:00 AM UTC", "Venue": "Back Room - New York - CANCELLED", "moreBioInfo": "\"Breakfast at Tiffany's Meets Some Like It Hot\" (Lucid Culture)\n\"Outstanding vocalist\" (Wall Street Journal)", "otherInfo": "No other event info available"}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Marcia Ball ", "ArtistImage": "https://photos.bandsintown.com/thumb/9873050.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Americana, Boogie-woogie, Blues, Swamp Blues", "Time": "2:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "\"Fifty years have passed in a flash,\" says Texas-born, Louisiana-raised pianist, songwriter and vocalist Marcia Ball of her long and storied career. Ball, the 2018 Texas State Musician Of The Year, has won worldwide fame and countless fans for her ability to ignite a full-scale roadhouse rhythm and blues party every time she takes the stage. Her rollicking Texas boogies, swampy New Orleans ballads and groove-laden Gulf Coast blues have made her a one-of-a-kind favorite with music lovers all over the world. With each new release, her reputation as a profoundly soulful singer, a boundlessly talented pianist and a courageous, inventive songwriter continues to grow. Her love of the road has led to years of soul-satisfying performances at festivals, concert halls and clubs. The New York Times says, \"Marcia Ball plays two-fisted New Orleans barrelhouse piano and sings in a husky, knowing voice about all the trouble men and women can get into on the way to a good time.\" The Houston Chronicle says simply, \"She's as perfect as an artist can be.\"\n\nWith her new album, Shine Bright, Ball set out to, in her words, \"Make the best Marcia Ball record I could make.\" In doing so, she has put together the most musically substantial, hopeful and uplifting set of songs of her five-decade career. Produced by Steve Berlin (Los Lobos) and recorded in Texas and Louisiana, Shine Bright contains twelve songs (including nine originals), ranging from the title track's rousing appeal for public and private acts of courage to the upbeat call to action of \"Pots And Pans,\" a song inspired by renowned Texas political writer and humorist Molly Ivins. From the humorous advice of \"Life Of The Party\" to the poignantly optimistic \"World Full Of Love,\" the intensity of Ball's conviction never wavers while, simultaneously, the fun never stops. Shine Bright is exactly the album Ball set out to make. \"It is a ridiculously hopeful, cheerful record,\" she says, in light of some of the album's more serious subject matter. The secret, according to Ball \"is to set the political songs to a good dance beat.\"\n\nBorn in Orange, Texas in 1949 to a family whose female members all played piano, Ball grew up in the small town of Vinton, Louisiana, right across the border from Texas. She began taking piano lessons at age five, playing old Tin Pan Alley and popular music tunes from her grandmother's collection. But it wasn't until she was 13 that Marcia discovered the power of soul music. One day in New Orleans in 1962, she sat amazed as Irma Thomas delivered the most spirited and moving performance the young teenager had ever seen. A few years later she attended Louisiana State University, where she played some of her very first gigs with a blues-based rock band called Gum.\n\nIn 1970, Ball set out for San Francisco. Her car broke down in Austin, and while waiting for repairs she fell in love with the city and decided to stay. It wasn't long before she was performing in local clubs with a progressive country band called Freda And The Firedogs, while beginning to sharpen her songwriting skills. It was around this time that she delved deeply into the music of the great New Orleans piano players, especially Professor Longhair. \"Once I found out about Professor Longhair,\" recalls Ball, \"I knew I had found my direction.\"\n\nWhen Freda And The Firedogs broke up in 1974, Ball launched her solo career, playing clubs around Austin, Houston and Louisiana. She signed with Capitol Records in 1978, debuting with the country-rock album Circuit Queen. Creating and honing her own sound, she released six critically acclaimed titles on the Rounder label during the 1980s and 1990s. In 1990, Ball—collaborating with Angela Strehli and Lou Ann Barton—recorded the hugely successful Dreams Come True on the Antone's label. At the end of 1997, Marcia finished work on a similar \"three divas of the blues\" project for Rounder, this time in the distinguished company of Tracy Nelson and her longtime inspiration, Irma Thomas. The CD, Sing It!, was released in 1998 and was nominated for a Grammy Award.\n\nMarcia Ball has appeared many times on national television over the years, including the PBS special In Performance At The White House along with B.B. King and Della Reese, Austin City Limits and HBO's Treme. She performed in Piano Blues, the film directed by Clint Eastwood included in Martin Scorsese's The Blues series which aired on PBS television nationwide in 2003. Marcia also appeared on The Late Show With David Letterman with The New Orleans Social Club, where she not only reached millions of people, but also helped to benefit victims of Hurricane Katrina. In 2012, she had a role in the independent film Angels Sing starring Harry Connick, Jr., Lyle Lovett and Willie Nelson. In 2017 she performed on NPR's A Jazz Piano Christmas, live from The Kennedy Center in Washington, D.C.\n\nBall joined Alligator in 2001 with the release of the critically acclaimed Presumed Innocent. The CD won the 2002 Blues Music Award for Blues Album Of The Year. Her follow-up, So Many Rivers, was nominated for a Grammy Award, and won the 2004 Blues Music Award for Contemporary Blues Album Of The Year as well as the coveted Contemporary Blues Female Artist Of The Year award. Her next release, Live! Down The Road, released in 2005, also garnered a Grammy nomination, as did 2008's Peace, Love & BBQ (the album debuted at #1 on the Billboard Blues Chart). 2010's Grammy-nominated Roadside Attractions and 2014's The Tattooed Lady And The Alligator Man successfully grew her fan base even further. Altogether she holds ten Blues Music Awards, ten Living Blues Awards, and five Grammy Award nominations. She has been inducted into both the Gulf Coast Music Hall Of Fame and the Louisiana Music Hall Of Fame. The Texas State legislature named her the official 2018 Texas State Musician. As her hometown Austin Chronicle says, \"What's not to like about Marcia Ball?\"\n\nSince joining Alligator, Ball has blossomed as a songwriter. Each album has been filled with fresh, original songs, never more so than on Shine Bright. Ball easily draws her listeners deep into her music with instantly memorable melodies and imaginative imagery. Her songs paint vibrant musical pictures richly detailed with recognizable characters, regional flavors, universal themes and colorful scenes, both real and imagined. Living Blues declares, \"Her originals sound like timeless classics and southern soul masterpieces that no one else can imitate.\"\n\nNow, with Shine Bright, Ball's new, aggressively hopeful songs are energized by Steve Berlin's inventive and exciting production, creating electrifying music that is daring, inspired, poignant and timely. The Boston Globe calls Ball \"a compelling storyteller\" who plays \"an irresistible, celebratory blend of rollicking, two-fisted New Orleans piano, Louisiana swamp rock and smoldering Texas blues.\"\n\nOf course, Ball will bring the party on the road, playing her new songs and old favorites for fans around the globe. \"I still love the feel of the wheels rolling,\" she says, \"and the energy in a room full of people ready to go wherever it is we take them.\" With both her new album and her legendary live performances, Marcia Ball will shine a light into the darkness, making the world a brighter place one song at a time.", "otherInfo": "No other event info available"}, {"Address": "183 W 10th St, New York, NY 10014", "Artist": "Sean Mason ", "ArtistImage": "https://photos.bandsintown.com/thumb/8955464.jpeg", "Coordinates": [-74.002722, 40.734367], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Jazz", "Time": "3:00 AM UTC", "Venue": "Smalls Jazz Club", "moreBioInfo": "Pianist/Composer", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Aberdeen (the band) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9924510.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Instrumental, Jazz, Rock, Brass", "Time": "10:00 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Aberdeen is a jazz / indie rock brass band based out of Brooklyn, NY. They create a wall of sound with soaring, horn-driven melodies, supported by a bed of distorted guitars and raucous drums. Brian Plautz is the primary songwriter in the band, along with Alex Conroy and Shubh Saran. The band, featuring saxophones, trombone, trumpet, two guitars, bass and drums never ceases to fill a room with energy. Aberdeen's 2019 debut album Downpour showcases their massive, one-of-a-kind sound, featuring Grammy Award-winning saxophonist Bob Reynolds (John Mayer, Snarky Puppy) and bassist Adam Neely, who hosts a 900,000+ subscriber music channel on YouTube. Demonstrated during Aberdeen's 2019 U.S. State Department tour to Central Asia, Aberdeen's music is about community; a large collective of musicians with the hope of sharing its music to audiences throughout the world.", "otherInfo": "Aberdeen will be canceling/postponing our upcoming spring tour due to the COVID-19 pandemic. Let's stick together during this crazy time (emotionally, not physically) and follow the recommendations as laid out by the CDC.\nTuesday, April 7th, 2020\nTickets: $12\nAges: 21+\nDoors: 6:00pm\nShow: 8:00pm"}, {"Address": "1286 Hicksville Rd, Massapequa, NY 11758", "Artist": "Cuthbert Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/9298868.jpeg", "Coordinates": [-73.48267, 40.71377], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rock, Country And Soul., Pop", "Time": "11:30 PM UTC", "Venue": "Paddy's Loft", "moreBioInfo": "Paul C. Cuthbert is a singer/songwriter, covering multiple music genres.\n\nHe is also the owner of Rock Beach Music Co. where he fronts multiple music acts.", "otherInfo": "☘️Join Paul live every Tuesday night at Paddy's Loft - Irish Pub and Restaurant - Massapequa. New York. 7:30pm to 10:30pm.\n\nTwo for Tuesdays drinks and apps! Fine dining. Authentic Irish Pub. Best Pint of Guinness in New York! Sports on all Tv's.\n\nJoin us for a song and a pint! Slainte!🍻"}, {"Address": "80 N 6th St, Brooklyn, NY 11249", "Artist": "Jenny Hval ", "ArtistImage": "https://photos.bandsintown.com/thumb/9763268.jpeg", "Coordinates": [-73.961212, 40.718958], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Experimental Folk, Electronic, Avant-garde, Art Pop, Pop", "Time": "12:00 AM UTC", "Venue": "National Sawdust", "moreBioInfo": "Norwegian artist, musician and writer.", "otherInfo": "No other event info available"}, {"Address": "95 Stanton St, New York, NY 10002", "Artist": "Jeff Litman, Guitarist/Multi-Instrumentalist ", "ArtistImage": "https://photos.bandsintown.com/thumb/7414154.jpeg", "Coordinates": [-73.988383, 40.721329], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Arlene's Grocery", "moreBioInfo": "No artist bio available", "otherInfo": "Postponed due to Coronavirus. New date TBD."}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Noah Gundersen ", "ArtistImage": "https://photos.bandsintown.com/thumb/9170398.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Songwriter", "Time": "2:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Born to a devoutly religious family in Olympia, WA, Noah Gundersen has been writing and recording music since he was but 13, working his way from teenage hardcore and indie rock to the creation of his own distinctive strain of bold, genre-busting songcraft. A series of solo EPs – including 2011’s breakthrough FAMILY – eventually led to 2014’s self-produced full-length debut, LEDGES. CARRY THE GHOST arrived the following year, earning acclaim from the likes of NPR.\n\nNoah continued to gain popularity after his music was featured on television shows like Sons of Anarchy, The Vampire Diaries, One Tree Hill and Nashville. Ever searching, he impelled his music towards new terrain on 2017’s WHITE NOISE, melding his increasingly potent lyrical motifs with complex electronics and startling levels of sonic intensity. The album reaped a whirlwind of critical acclaim upon its 2017 release. Consequence of Sound wrote, “...the Seattle native has evolved to become an even more striking musician, his lyrics not only burning brighter, but his arrangements fuller and more intense to match their maker.”\n\nAlong with his recorded canon, Gundersen – who also maintains membership in Seattle indie rock heroes Young In The City and the all-star Americana collective known as Glorietta – has spent much of his adult life on the road, performing as headline act and support to like-minded artists spanning Emmylou Harris, Beck, City & Colour, and Josh Ritter.", "otherInfo": "Live Stream: https://www.eventbrite.com/e/live-stream-noah-gundersen-tickets-101896473094"}, {"Address": "New York City, NY", "Artist": "Morgan James ", "ArtistImage": "https://photos.bandsintown.com/thumb/9814141.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Pop, R&b, Soul", "Time": "9:00 PM UTC", "Venue": "Stageit Livestream", "moreBioInfo": "One voice is all it takes. The right vocalist can make you fall in love at first listen, elicit tears, or bring you back to a different era altogether. A microphone and a stage remain the only necessities. That holds true for New York-based singer and songwriter Morgan James. On her full-length debut for Epic Records, Hunter, she casts an unbreakable spell with a powerhouse voice equally inspired by smoky soul, swaggering R&B, theatrical swing, and a virtuosic classical poise.\n\nThe Idaho native discovered her passion for music early on and pursued it\nwholeheartedly at the prestigious Juilliard School. While in the midst of the institution's rigorous academic program, she soon realized that her path would diverge from the classical world. \"I didn't want a career in opera, but Juilliard still shaped me,\" she confesses. \"The traditional training really made me a disciplined singer. I carry that with me to this day.\"\n\nAfter graduating, Morgan spent the next few years facing the proverbial struggles of being a young artist in New York. Low on money, she bounced back and forth between bartending and restaurant gigs while fighting to survive. Immersed in classic sixties and seventies soul records, she concurrently experienced a pivotal revelation. \"Out of that frustration came this other voice,\" she says. \"It was my true voice, and I feel like I discovered it in the middle of so much hardship just trying to be heard. I embraced who I was at that very moment.\"\n\nSoon, she would be heard in a big way. In 2008, Morgan booked her first Broadway show—appearing in The Addams Family alongside Nathan Lane, as well as in prominent and leading roles in Wonderland, Godspell (Turn Back, O Man), and Berry Gordy's Motown The Musical as Teena Marie. The latter set the stage for her to\nproperly launch her solo career. Gordy recognized the vocalist's immense talent, and introduced her to Doug Morris and L.A. Reid, opening the door for a deal with Epic Records in 2012.\n\nAround the same time, Morgan booked a landmark show at Dizzy’s Club Coca-Cola, where she paid tribute to Nina Simone with a set of songs that were closely associated with the legendary artist. The incendiary show was recorded and released as the critically acclaimed Morgan James Live on Epic Records. It also proved to be the perfect segue for her first studio album, released in June of 2014.\n\n\"I always knew to make a neo-soul pop record,\" Morgan says. \"The foundation is all real ingredients, and those roots of soul and R&B are pretty strong. It's the culmination of my musical life up to this point. The painful songs are straight out of a bad relationship with someone from my past. The joyful moments are wonderful memories. It's all coming from me. I've lived every one of these stories, and I love the genres I'm representing. It's one point-of-view—mine.\"\n\nThe title track and album opener \"Hunter\" boasts a seductive hook with cinematic noir flair. Flaunting the singer's immense delivery and dynamic presence, it's an undeniable and classy come-on that proves as animalistic as it does magnetic. \"From a woman's perspective, it's such an empowering and sexy song,\" she smiles. \"It totally makes me feel like a warrior! Music is so sensual and life-affirming. That's what I look for. You don't often see a girl take this position, and that's what I love about it!\"\n\nMorgan assumed co-writing duties on eight of the collection's fourteen tracks and even performed all of her own background vocals and harmonies. From the empowering farewell of \"Fed Up On You\" to the mournful rumination of \"You Never Lied\", she continually bares it all—both emotionally and musically. \"I sing like I'm never going to sing ever again,\" Morgan affirms. \"I wanted to capture that power and passion every time. At some moments, it might sound flawless; at others, it might sound like it's going to break. I'm revealing something about myself with\nevery song. You've got to do that. My favorite artists, whether Joni Mitchell or Michael Jackson, are and were, always honest.\"\n\nThere's a unique structure to the album. The first five songs boast electronic elements, while the last six don't have any. \"There's a gradient of the record that goes down,\" she says. \"By the time you get to the last song, it's just piano and voice. It starts with a song about power and ego, and it ends on one about surrender and selflessness. I have all of that in me. Maybe we all do.\"\n\nUltimately, her honesty permeates everything that Morgan James does, and it's why you'll always remember her voice. \"I want people to walk away from this album feeling fulfilled. That's the way it used to be. Often, I think I'm from another time,” she says, her voice trailing off. “I just want to bring back the power of the singular legacy voice.\"", "otherInfo": "No other event info available"}, {"Address": "374 N Midland Ave, Saddle Brook, NJ 07663", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.107508, 40.910168], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Little Falls, New Jersey", "Time": "11:00 PM UTC", "Venue": "Midland Brew House", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Jeffrey Pepper Rodgers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8737520.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Acoustic", "Time": "11:30 PM UTC", "Venue": "Online songwriting workshop", "moreBioInfo": "Jeffrey Pepper Rodgers is a grand prize winner of the John Lennon Songwriting Contest, a contributor to NPR’s All Things Considered, and the founding editor of Acoustic Guitar magazine.\n\n“Jeffrey Pepper Rodgers’ songs ring true and new. Spot-on work from an American wordsmith.”\n—Patty Larkin", "otherInfo": "Songwriting Sessions Online workshop with Jeffrey Pepper Rodgers, meeting four consecutive Wednesdays 7:30 to 9:30 pm Eastern."}, {"Address": "158 Bleecker St, New York, NY 10012", "Artist": "Caspian ", "ArtistImage": "https://photos.bandsintown.com/thumb/8084007.jpeg", "Coordinates": [-73.999882, 40.728425], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Rock", "Time": "12:00 AM UTC", "Venue": "Le Poisson Rouge", "moreBioInfo": "Caspian is a rock band from Beverly, Massachusetts, a seaside town 20 minutes north of Boston. Most of the time no one sings. Sometimes we play heavy, other times quite soft. We always try to play with heart. So far we have recorded four albums. The process is always evolving - Thanks for exploring it with us.\n\nCASPIAN has performed over 800 concerts, bringing their music to 40+ countries stretching over 4 continents.\n\nThe band released their latest albim, Dust and Disquiet, in September 2015.", "otherInfo": "No other event info available"}, {"Address": "Point Pleasant Beach, NJ", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.048, 40.0917], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Little Falls, New Jersey", "Time": "10:00 PM UTC", "Venue": "Point Lobster Bar & Grill", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Jackopierce ", "ArtistImage": "https://photos.bandsintown.com/thumb/8280131.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Pop", "Time": "12:00 AM UTC", "Venue": "StageIt Live Show with Jack O'Neill", "moreBioInfo": "Jack O’Neill and Cary Pierce, the “Jack O” and “Pierce” who make up the seminal duo Jackopierce, are celebrating 30 years of making music that has amassed a loyal following of millions of fans across the country and the world with a super high-energy live show and what the Dallas Morning News has called “spotless harmonies.”\n\nHaving just released their first studio project 'Feel This Good' in 5 years, Jackopierce is poised and ready to get back on the road full-time.\n\nJackopierce formed in 1988 in Dallas as theater students at SMU. The duo steadily made a name for themselves, especially with two of their signature tracks, “Vineyard” and their version of the classic “Please Come to Boston.” They released ten studio albums (two for major label A&M), toured three continents, nine countries, and 45 states - amassing millions of loyal fans along the way . Over the years They have shared the stage with John Mayer, Dave Matthews Band, Matchbox20, Counting Crows, The Wallflowers, Sheryl Crow, Toad the Wet Sprocket - to name a few. After a five-year breakup, the guys reunited in 2002 to test out the waters. They were very warm and city by city, Jack & Cary got back out there to play for grateful fans that thought they would never see them again. The two now have a totally renewed creative vigor, mutual respect and deep gratitude for their fans.\n\nThese good vibes shine through on their 25th anniversary live album “Live 25.”\n\nIt’s definitely been a creative time for the duo, and celebrating the past inspires the guys to move forward in new, inventive ways. To freshen up the live show, Jackopierce started creating uniquely intimate “Destination Shows.” These shows are a whole new fan experience where people can enjoy gorgeous scenery, share delicious food & wine and have “campfire”-type access to their favorite band. It’s a vacation and concert in one. Each Destination Show provides a unique experience dedicated to the local culture: Napa/Sonoma vineyards at sunset, a ranch in Austin Hill Country, high society in Dallas, a two-mile-high a private club in Aspen, amazing history at the Biltmore in NC, a 14,000 square foot hacienda in San Miguel de Allende, MX - and the list goes on. July 27, Jackopierce will host their first 7th Destination Show in Martha’s Vineyard and they’ll be back for their fourth annual Destination Show in San Miguel in April 2020.\n\n“We have been doing destination events for 10 years now and they have been a huge hit with our fans and have allowed us to make so many great new ones along the way,” said Cary Pierce. “I think these events continue to grow and sell out because people want more than \"just a show” - they want an experience. They want to create lasting memories, explore a new place or visit an old favorite. In some cases, we're offering them a trip of a lifetime. We're finding there a lot of people that really value these experiences.”\n\nJackopierce has celebrated numerous career milestones including the T-Bone Burnett produced A&M debut album “Bringing on The Weather,” being a part of one of the world’s largest live events with close to 400K people in attendance at the 1997 Blockbuster RockFest at Texas Motor Speedway alongside artists No Doubt, Counting Crows, and Matchbox Twenty, performing on Conan O’Brien in 1992 with the Max Weinberg Band backing them up and sitting in the chairs on the Rosie O'Donnell Show.\n\n“Even after 30 years I feel like we're just getting started,” said Cary Pierce.", "otherInfo": "No other event info available"}, {"Address": "47 Easton Ave, New Brunswick, NJ 08901", "Artist": "Nathan Bohach ", "ArtistImage": "https://photos.bandsintown.com/thumb/8872197.jpeg", "Coordinates": [-74.448888, 40.497958], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Funk, Rock, R&b, Blues, Hip Hop, Country, Jazz, Fusion", "Time": "12:30 AM UTC", "Venue": "Barça City Cafe & Bar", "moreBioInfo": "Nathan Bohach is an artist in the New York City jazz scene. Raised just outside of Pittsburgh, it is there that he got his introduction to jazz music. Nathan had an affinity for music from an early age, which manifested itself in his participating in marching percussion. Thanks to a twist of fate he was introduced to the vibraphone while performing in these groups. His future became clear after being exposed to the music of Lionel Hampton, Milt Jackson and Stefon Harris but his greatest influence came from producer, recording artist and professor at Juilliard, Mark Sherman.\n\nNathan had the good fortune of meeting Sherman while an Undergraduate student at Marshall University. It was then that he began studying jazz vibraphone, with Sherman, in the tradition of the greats. This relationship with Sherman led him to Jersey City University as a graduate assistant where he will graduate in a few months. Now a resident of New Jersey, Bohach performs in the NYC metro area with various groups on both vibraphone and drum set a second instrument on which he is also quite accomplished. In addition to Sherman, Nathan has studied with Dr. Ben Miller, Rusty Burge and Ben Gillece. He has studied drum set with Jay Ware, Steve Hall and Tim Horner.\n\nNathan favors the styles of Jazz, Funk and Fusion and his playing and writing has been greatly influenced by the afore mentioned artists along with the music and playing of Bobby Hutcherson, Robert Glasper, Snarky Puppy, Roy Haynes, Staton Moore, and Stefon Harris.\n\nNathan has performed shows at venues such as The Stanhope House (NJ), Silvana (NY), Tomi Jazz (NY), The Empty Glass (WV), and more. In addition to this, Nathan has opened for The Mike Dillon Band and Milo Z.", "otherInfo": "No other event info available"}, {"Address": "1411 Kingsley St, Asbury Park, NJ 07712", "Artist": "Sean Tobin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9146897.jpeg", "Coordinates": [-74.000362, 40.225617], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Acoustic, Indie, Punk, Folk Rock, Americana, Indie Rock, Rockabilly, Punk Americana, Indie Folk, Rock", "Time": "2:00 AM UTC", "Venue": "Kim Marie's Eat n Drink Away", "moreBioInfo": "Born and raised on the New Jersey shore, Sean Tobin grew up surrounded by salt, surf, and incredible music. After getting in some trouble in high school, Tobin decided to put his downtime into teaching himself the guitar. A poet in his own right, songwriting soon followed.\n\nIn 2017, Tobin traveled to Europe to walk El Camino de Santiago, a 500-mile trail through the north of Spain. He walked to discover himself and how he should spend his life. Tobin tied his guitar to his 30-pound pack, and each day, walked 20km toward Santiago de Compostela. Upon his arrival, it became obvious that his commitment to his music was how he would spend his days.\n\nSean returned to New Jersey in the fall of 2017 where he worked a white collar job to fund his independent music. He released his first album, This Midnight, in the summer of 2018. He began to build a name for himself in his home state, and in 2019, he played Frank Turner's Lost Evenings III Festival at the House of Blues in Boston.\n\nSean currently lives in Jersey City, NJ.", "otherInfo": "10:00 - Midnight Every Thursday Night!"}]