var nyc_events = [{"Address": "New York City, NY", "Artist": "SPACE CADE7S ", "ArtistImage": "https://photos.bandsintown.com/thumb/9067399.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rap, R&b, Hip Hop, Soul", "Time": "2:00 PM UTC", "Venue": "SoFar NYC (INSTAGRAM TAKEOVER)", "moreBioInfo": "East Coast Hip-Hop/Soul Collective - WWW.SPACECADE7S.COM", "otherInfo": "Live Stream: https://www.instagram.com/sofarnyc"}, {"Address": "New York City, NY", "Artist": "Morgan James ", "ArtistImage": "https://photos.bandsintown.com/thumb/9814141.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop, R&b, Soul", "Time": "9:00 PM UTC", "Venue": "Stageit Livestream", "moreBioInfo": "One voice is all it takes. The right vocalist can make you fall in love at first listen, elicit tears, or bring you back to a different era altogether. A microphone and a stage remain the only necessities. That holds true for New York-based singer and songwriter Morgan James. On her full-length debut for Epic Records, Hunter, she casts an unbreakable spell with a powerhouse voice equally inspired by smoky soul, swaggering R&B, theatrical swing, and a virtuosic classical poise.\n\nThe Idaho native discovered her passion for music early on and pursued it\nwholeheartedly at the prestigious Juilliard School. While in the midst of the institution's rigorous academic program, she soon realized that her path would diverge from the classical world. \"I didn't want a career in opera, but Juilliard still shaped me,\" she confesses. \"The traditional training really made me a disciplined singer. I carry that with me to this day.\"\n\nAfter graduating, Morgan spent the next few years facing the proverbial struggles of being a young artist in New York. Low on money, she bounced back and forth between bartending and restaurant gigs while fighting to survive. Immersed in classic sixties and seventies soul records, she concurrently experienced a pivotal revelation. \"Out of that frustration came this other voice,\" she says. \"It was my true voice, and I feel like I discovered it in the middle of so much hardship just trying to be heard. I embraced who I was at that very moment.\"\n\nSoon, she would be heard in a big way. In 2008, Morgan booked her first Broadway show—appearing in The Addams Family alongside Nathan Lane, as well as in prominent and leading roles in Wonderland, Godspell (Turn Back, O Man), and Berry Gordy's Motown The Musical as Teena Marie. The latter set the stage for her to\nproperly launch her solo career. Gordy recognized the vocalist's immense talent, and introduced her to Doug Morris and L.A. Reid, opening the door for a deal with Epic Records in 2012.\n\nAround the same time, Morgan booked a landmark show at Dizzy’s Club Coca-Cola, where she paid tribute to Nina Simone with a set of songs that were closely associated with the legendary artist. The incendiary show was recorded and released as the critically acclaimed Morgan James Live on Epic Records. It also proved to be the perfect segue for her first studio album, released in June of 2014.\n\n\"I always knew to make a neo-soul pop record,\" Morgan says. \"The foundation is all real ingredients, and those roots of soul and R&B are pretty strong. It's the culmination of my musical life up to this point. The painful songs are straight out of a bad relationship with someone from my past. The joyful moments are wonderful memories. It's all coming from me. I've lived every one of these stories, and I love the genres I'm representing. It's one point-of-view—mine.\"\n\nThe title track and album opener \"Hunter\" boasts a seductive hook with cinematic noir flair. Flaunting the singer's immense delivery and dynamic presence, it's an undeniable and classy come-on that proves as animalistic as it does magnetic. \"From a woman's perspective, it's such an empowering and sexy song,\" she smiles. \"It totally makes me feel like a warrior! Music is so sensual and life-affirming. That's what I look for. You don't often see a girl take this position, and that's what I love about it!\"\n\nMorgan assumed co-writing duties on eight of the collection's fourteen tracks and even performed all of her own background vocals and harmonies. From the empowering farewell of \"Fed Up On You\" to the mournful rumination of \"You Never Lied\", she continually bares it all—both emotionally and musically. \"I sing like I'm never going to sing ever again,\" Morgan affirms. \"I wanted to capture that power and passion every time. At some moments, it might sound flawless; at others, it might sound like it's going to break. I'm revealing something about myself with\nevery song. You've got to do that. My favorite artists, whether Joni Mitchell or Michael Jackson, are and were, always honest.\"\n\nThere's a unique structure to the album. The first five songs boast electronic elements, while the last six don't have any. \"There's a gradient of the record that goes down,\" she says. \"By the time you get to the last song, it's just piano and voice. It starts with a song about power and ego, and it ends on one about surrender and selflessness. I have all of that in me. Maybe we all do.\"\n\nUltimately, her honesty permeates everything that Morgan James does, and it's why you'll always remember her voice. \"I want people to walk away from this album feeling fulfilled. That's the way it used to be. Often, I think I'm from another time,” she says, her voice trailing off. “I just want to bring back the power of the singular legacy voice.\"", "otherInfo": "No other event info available"}, {"Address": "123 W 43rd St, New York, NY 10036", "Artist": "The Magnetic Fields ", "ArtistImage": "https://photos.bandsintown.com/thumb/7487637.jpeg", "Coordinates": [-73.984563, 40.756023], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop", "Time": "9:45 PM UTC", "Venue": "The Town Hall", "moreBioInfo": "Band. Likes ukuleles, chihuahuas. Official\nFacebook for The Magnetic Fields.", "otherInfo": "Live from Here with Chris Thile"}, {"Address": "17 Minneakoning Rd, Flemington, NJ 08822", "Artist": "The Infection ", "ArtistImage": "https://photos.bandsintown.com/thumb/9133218.jpeg", "Coordinates": [-74.849981, 40.530473], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Classic Rock, Heavy Metal, Heavy Rock, New Rock, Metal, Hard Rock", "Time": "10:00 PM UTC", "Venue": "All Star Music Empire", "moreBioInfo": "The infection is spreading - heavy modern rock grooves with memorable hooks and melodies. The lineup is all NYC guts and talent.", "otherInfo": "Canceled due to COVID-19.\n\nLive Rock show in Flemington, NJ featuring Tantric, The New Black, Pierced and special guests The Infection!"}, {"Address": "206 Stewart Ave, Garden City, NY 11530", "Artist": "Anthony Edley ", "ArtistImage": "https://photos.bandsintown.com/thumb/8851880.jpeg", "Coordinates": [-73.664597, 40.72412], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "Garden City Country Club", "moreBioInfo": "Anthony Edley is a Musician and Teacher", "otherInfo": "No other event info available"}, {"Address": "380 N Wantagh Ave, Bethpage, NY 11714", "Artist": "Skyward Effect ", "ArtistImage": "https://photos.bandsintown.com/thumb/8011234.jpeg", "Coordinates": [-73.495464, 40.735039], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rock, Alternative Rock", "Time": "11:00 PM UTC", "Venue": "One Eye Jacks", "moreBioInfo": "Alternative Rock band playing performances of all kinds including: Bars, Clubs, Restaurants, Charity Events and Private Parties.\n\nWe play classic rock covers!", "otherInfo": "Skyward Effect is supporting Stereo Jo's debut full length album premiere at One Eye Jack's. This will be an awesome night of high energy rock!\n\nScared20\nAll New Episode\nCrisis Crayons\nAgent 355\nSkyward Effect\nDJ J-Ro"}, {"Address": "New York City, NY", "Artist": "Branden & James ", "ArtistImage": "https://photos.bandsintown.com/thumb/10297211.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "James Clark, Branden James", "Time": "11:00 PM UTC", "Venue": "Our Living Room", "moreBioInfo": "Welcome to The Official Fan Page of BRANDEN & JAMES!", "otherInfo": "BRANDEN & JAMES continue their virtual concert series from their living room in New York City with \"The Phantom Of The Greatest Showman.\" Music from two of the greatest stories ever told, including Music of The Night, A Million Dreams, All I Ask Of You, This Is Me and Never Enough, and tons of fan favorites.\n\nThis is a PAY WHAT YOU WANT event. We want to keep our music accessible to everyone who would like to listen and watch. You can gift tickets to others who may be isolated."}, {"Address": "29 Harvard Ave, Richmond County, NY 10301", "Artist": "Steve Poltz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9961547.jpeg", "Coordinates": [-74.090492, 40.642876], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Acoustic, Americana, Folk", "Time": "11:30 PM UTC", "Venue": "Hamilton Park House Concerts", "moreBioInfo": "DISCLAIMER 1: The “official” Wikipedia for Steve Poltz describes the material contained therein as “contentious,” not to mention “unsourced or poorly sourced.” We can wholeheartedly assure you Steve remains sourced and rarely contends. Either way, allow us to present the real story from the horse’s (man’s) mouth…\n\nDISCLAIMER 2: (No animals were harmed in the making of this bio.)\n\nThroughout over three decades in music, Steve Poltz did it all and more—often shared by way of his rockin’ countrified folk slices of sardonic Americana (hatched in Halifax). Of course, he co-wrote Jewel’s multiplatinum Hot 100-topping megahit “You Were Meant For Me,” but he also went on a whale watch with her and a few federales that turned into a drug bust. The two still share the story at every festival they play together. He made his bones as the frontman for underground legends The Rugburns, who burned rubber crisscrossing the continent on marathon tours and still pop up once in a while for the rare and quickly sold out reunion gig.\n\nIn 20 years since his full-length solo debut, One Left Shoe, he blessed the world’s ears with twelve solo records, spanning the acclaimed 2010 Dreamhouse and most recently Folk Singer in 2015. NPR summed it up best, “Critics and fans alike now regard Poltz as a talented and prolific songwriter.” By 2016, he survived a stroke, endured anything the music industry could throw at him, and still performed like “280 days a year.”\n\nHowever, he still never lived in Nashville, which represents a turning point in the story and the genesis of his 2018 Red House Records debut, Shine On…\n\n“My girlfriend Sharon sold the condo we were living in, and I was ready to live in a van, which seemed like a good idea for one night—then I decided I wanted a kitchen and a closet,” he admits. “Sharon wanted to move to Nashville, because she thought it would be good for me. It caused a huge fight. I’d been in San Diego since 1980, and that’s where I cut my musical teeth. I thought I’d never leave. In fact, at the height of our fight, I said, ‘I’m not leaving San Diego. I am San Diego!’ This makes me laugh now. As soon as I got to Nashville, I immediately knew I wanted to make a record in ‘Music City’.”\nSo, the man who once protested “I am San Diego” made Shine On in his new home of Nashville with one of its elder statesman behind the board, Will Kimbrough [Emmylou Harris, Rodney Crowell]. Holing up in the studio at Kimbrough’s house, nothing would be off limits. Together, they unlocked the kind of creative chemistry you only hear about in band bios—but for real.\n\n“I respect Will so much, and I’d always wanted to work with him,” says Steve. “Like two mad scientists, we just took our time and had fun. We didn’t overthink things. Everything felt organic. We ate soul food and drank lots of really good coffee. We tried out weird sounds, and the songs always started with voice and guitar—no click track, just how I’d play them. I road tested many of them, and they were ripe for the picking when recording time came around.”\n\nEvoking themes of “hope, love, contemplation, celebration of Wednesday, pharmacists, and the fact that windows are not inanimate objects and they sometimes have conversations with each other,” the record represents Steve at his most inspired and insightful. The opener and title track “Shine On” pairs a delicate vocal with lithely plucked acoustic strings as he urges, “Shine on, shine on.”\n\n“The song was a gift,” he recalls. “I woke up really early in Encinitas, California at Sharon’s sister’s house. The sun was just coming up. I was all alone in perfect solitude. My guitar was there. The sky was gorgeous. I wrote it as a poem. Everyone always told me, ‘Never start a record with a really slow song.’ So, seeing that I have O.D.D. (Oppositional Defiance Disorder), I started my record with one. I love the mood it sets. It’s almost like my mission statement, trying to find some semblance of positivity and light in a sometimes ruthless world.”\n\nOn “Pharmacist,” rustling guitar and harmonica propel a tale of “this dude having a crush on his pharmacist.” It also serves as an extension of his friendship with neighbor Scot Sax—with whom he shares the podcast “One Hit Neighbors” (since they’ve both had one hit song). Meanwhile, he joined forces with Molly Tuttle on “4th of July,” which, of course, came to life on the 3rd of July. “Ballin On Wednesday” drew its title and chorus from a diner checkout girl (with a super cool gold tooth) who Steve paid with a $100 bill and she replied, “Oooh, ballin’ on a Wednsday.” The finale “All Things Shine” skips along on sparse instrumentation as Steve sends a message.\n\n“‘All Things Shine’ came about after one of the many mass shootings on this planet,” he sighs. “I was feeling overwhelmed. So, I wanted to put my feelings into words and melody. I was thinking that even if we’re feeling hopeless that there is still beauty. All things shine in their own way.”\nWho could contend that?\n\nIn the end, for everything you can call him “searcher, smartass, movie freak, lover of technology, news junkie, baseball fan to nth degree, lapsed catholic who still believes in god even though all his friends are atheists and think he’s an idiot, and maker of fun,” you might just call Steve that little light in the dark we all need in this day and age.\n\nOr Nashville’s Canadian Jiminy Cricket…\n\n“I hope Shine On makes listeners smile and feel welcome, and they want to share it with their friends,” he leaves off. “Music means energy to me. All things. It connects us, makes us move, helps us relax, and inspires us to change things up.”", "otherInfo": "No other event info available"}, {"Address": "18 Bleecker St, New York, NY 10012", "Artist": "Abigail Washburn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8282477.jpeg", "Coordinates": [-73.993239, 40.725416], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Pop, Indie, World & Chamber Music., Blues, Folk", "Time": "11:30 PM UTC", "Venue": "The Sheen Center for Thought & Culture", "moreBioInfo": "\"A daring, definite talent, whose feel for the folk idiom results in moving material. Soulful is the word\"-- Wall Street Journal\n\n\"Washburn stomped and skipped through fiery Appalachian takes on the local songs of Sichuan. Her bilingualism's no gimmick; she nails the dips and peaks of pitch while leading her band in scorching variations on simple, repetitive traditional melodies…” – L.A. Times\n\n“{Abigail Washburn is} an artist who best embodies the notion of Americana as a worldwide musical language\" – The Tennessean\n\nBeijing. A smoke-filled club bustling with people, clanging of bottles, chatter. There is a woman on stage with her banjo. She begins to sing old-time Appalachian music in Chinese. The effect produced is entirely original, a cultural mash-up between two distant yet not so different worlds. The crowd quiets down to listen.\n\nAbigail Washburn never set out to be a songwriter, recording artist or a producer. Her performance at that smoke-filled Beijing club would prove to be an important step toward international acclaim and attention from discerning critics. Abigail has created a new sound – a sound that challenges traditional notions of culture and countries.\n\nAbigail planned to move to China after a road trip up the east coast, but instead she stumbled upon a professional music career. This east coast trip included a stop at the International Bluegrass Music Association conference in Louisville, KY where she intended to learn a few banjo tunes but walked away with a demo session for a record deal in Nashville, TN. She canceled her one-way ticket to China and moved to Nashville. Shortly thereafter in 2004 she joined Uncle Earl. The \"all G'earl\" group released two records on the Rounder label, She Waits for Night (2005) and Waterloo, TN, (2007) the latter of which was produced by John Paul Jones of Led Zeppelin.\n\nIn the midst of touring with Uncle Earl, Washburn released her first solo debut, and bilingual album, Song of the Traveling Daughter, (Nettwerk). At that point, Abigail joined cellist, Ben Sollee, in performing her music around the globe. In 2005 Abigail, Ben and a few talented friends (Béla Fleck on banjo and Casey Driessen on fiddle) formed the Sparrow Quartet and toured China. In 2006, the US State Department and the American Center for Educational Exchange requested that the group come back to lead the first official tour of a US band in Tibet.\n\nIn May 2008, the Sparrow Quartet released Abigail Washburn & the Sparrow Quartet (Nettwerk) which was praised by critics and appeared on several “best of” lists from prominent publications. Produced by Béla Fleck and composed/arranged by the unconventional foursome, Abigail Washburn & The Sparrow Quartet became an \"intimate exploration of crossing global and cultural lines,\" says Abigail, who feels a reverence for both American and Chinese cultures. The unprecedented combination of two banjos (clawhammer and three-finger-style), cello and five-string fiddle unfolds -live and on record- in a dreamlike chamber suite. From the flawless ‘Overture\" and harrowing revival, \"Strange Things,\" to the interplanetary, Puccini-inspired old-time fairy tale, \"Great Big Wall in China,\" this record highlights the brilliant musicianship of each individual, but is at the same time much larger than the sum of its parts.\n\nIn 2008 and 2009, Abigail Washburn and the Sparrow Quartet toured extensively throughout the US and Canada with appearances at festivals including New Orleans Jazz & Heritage, Merlefest, Bonnaroo Music and Arts Festival, Vancouver Folk Festival and many more. They were invited by the US State Department to play in China including several performances in Beijing during the 2008 Olympic games. In addition, the were filmed on National Geographic Live in Washington, DC and were invited to be a part of the Clearwater Concert, a benefit concert in celebration of Pete Seeger's 90th birthday along with a line-up of some of the most prominent, established musicians in the world. For Abigail and the Sparrow Quartet, 2008 was a year full of accomplishments and successes.\nBut Abigail does not stop. She is a force of nature that continually attracts others to become a part of her art. Enter The Shanghai Restoration Project (SRP) producer Dave Liang. Abigail and Dave first collaborated to produce two electronic remixes of Sparrow Quartet songs released in April 2009.\nIn December 2008, Abigail served as a resident teacher at the Sichuan University Art School teaching traditional US music. In the hours after school was finished, she volunteered for Sichuan Quake Relief performing at earthquake relocation schools. The experience with the students and teachers after the performances left her wanting to do something to help.\nIn early March, 2009, Abigail had the idea to create Afterquake, a benefit EP in memory of the May 12, 2008 Sichuan Earthquake which left more than 5 million people homeless and hundreds of thousands dead. Abigail and The Shanghai Restoration Project united again to go to Sichuan Province, to the relocation schools and into the disaster zone to capture the voices of those affected by the earthquake and sample sounds from the schools and the disaster zone. They sampled, recorded and produced Afterquake in two and a half weeks in Sichuan province. The final result is a beautiful, timeless, intelligent and accessible musical document that blends folk and electronic sounds with post-earthquake samples. A portion of all proceeds will go to the Sichuan Quake Relief organization.\nWhether playing her banjo, or producing an electronic album, there is an undeniable element of Abigail Washburn in every project she embraces. Abigail's spirit and philosophy translate from language to language and bind countries, cultures and genres.\n\"As more and more people engage in this struggle for a new direction for the human spirit, we'll recognize that we're morphing into a global species.\"\n---Abigail Washburn", "otherInfo": "No other event info available"}, {"Address": "1 Media Crossways, Woodbury, NY 11797", "Artist": "Rob Appelblatt (Splatt) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9147449.jpeg", "Coordinates": [-73.489258, 40.805829], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Folk, Country, Americana, Blues, Classic Rock", "Time": "12:00 AM UTC", "Venue": "News 12", "moreBioInfo": "Rob aka “Splatt” by his friends is a New Yorker living on Long Island. He picked up the guitar a bit later in life after college however, a demanding career in TV commercial production kept him way too busy to focus on music. In 2017 Rob attended Steve Earle’s week-long songwriting retreat “Camp Copperhead” in beautiful Big Indian, NY and shortly after found a newly fueled passion for songwriting and performing. Rob’s songs are a soulful blend of rock, country, folk and blues known collectively as “Americana” music. Among others he credits Bruce Springsteen, John Prine, Hank Williams, Guy Clarke + Steve Earle as his greatest influences.\nHis debut album “Weathervane” was recorded in Nashville, Tennessee earlier this year and is due to release in the summer of 2019.", "otherInfo": "Live Stream: https://www.facebook.com/News12LI"}, {"Address": "New York City, NY", "Artist": "Svetlana ", "ArtistImage": "https://photos.bandsintown.com/thumb/9301408.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Swing, Jazz, Sophisti-pop", "Time": "12:00 AM UTC", "Venue": "Center for the Arts at New Jersey City University  CANCELLED", "moreBioInfo": "\"Breakfast at Tiffany's Meets Some Like It Hot\" (Lucid Culture)\n\"Outstanding vocalist\" (Wall Street Journal)", "otherInfo": "No other event info available"}, {"Address": "1050 Wall St W, Lyndhurst, NJ 07071", "Artist": "DJ__Cam ", "ArtistImage": "https://photos.bandsintown.com/thumb/10264934.jpeg", "Coordinates": [-74.10438, 40.80649], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Hoboken, United States", "Time": "1:00 AM UTC", "Venue": "Society Liquor Lounge and Cafe", "moreBioInfo": "Ledg.", "otherInfo": "No other event info available"}, {"Address": "201 Union Ln, Brielle, NJ 08730", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.052411, 40.107332], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Little Falls, New Jersey", "Time": "1:00 AM UTC", "Venue": "The Pig & Parrot", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "396 New York Ave, Huntington, NY 11743", "Artist": "Dan DelVecchio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9166815.jpeg", "Coordinates": [-73.425627, 40.868825], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rock, Indie, R&b, Soul, Alternative, Blues, Pop Rock, Pop, Jazz, Dance -, Funk", "Time": "2:00 AM UTC", "Venue": "Nag's Head Ale House", "moreBioInfo": "Those who have found their life’s passion can usually pinpoint the exact moment they discovered it, loved it for the first time, and needed to learn everything about it.\n\nFor musician Dan DelVecchio, that moment was in daycare - many moons ago (5 years old), when he was scolded for trying to pick up an acoustic guitar sitting in the corner of the room. While other children dreamt of being astronauts or building rocket ships out of mega blocks, Dan was ready to jam on stage with the greatest of the great.\n\nWhen he got a bit older, he accompanied his brother Michael to Sam Ash music store, where he needed to pick up a saxophone for middle school band. They may have been at the store for his brother, but that day will forever be the one where Dan’s daycare dreams began to grow into a reality.\n\nThere, standing in the guitar department, Dan was encouraged to pick up and strum along to the beat inside his soul, and his passion began to take shape.\n\nAs years passed, Dan became more and more accustomed to the guitar, and fell more and more in love with performing. He surrounded himself with mentors from diverse backgrounds – Dennis DelGaudio (Billy Joel), Chris Justino (Broadway), Artie Blaurock (Sweet Revenge, Dorian Grey, Needulhed), & Rick Stone (Jazz Guitar at Hofstra University). Each of these amazing talents provided him with a unique perspective on guitar stylings and teachings.\n\nTaking that knowledge to the next level, Dan joined the likes of Indie/Alternative Rock band Face the King (CI Records) and performed across the continental US for a multitude of shows, including a full leg of Vans Warped Tour, Rockstar UPROAR Festival, the main stage at the CBGB Festival in Times Square, NY (with Billy Idol and Jane’s Addiction!), as well as the world’s largest music festival - Summerfest, in Milwaukee, WI.\n\nFace the King was chosen as a National Finalist for the Ernie Ball Vans Warped Tour competition alongside PVRIS, and are three-time winners of the Ernie Ball Battle of the Bands. Their full-length album, “Once More Is All I Am,” was released in November of 2017.\n\nDan is also collaborating on songwriting and performing with two up-and-coming Alt/Indie groups, Don’t Believe in Ghosts (Forward Thinking Records), and A Second Life. These bands have received high acclaim, as shown by their multiple plays on retail radio playlists and on Spotify, national plays on Sirius XM Radio, and a number of live shows including Bowery Ballroom, The Paramount, NYC Marathon, and an upcoming appearance at the world-famous South By Southwest (SXSW) in Austin, TX.\n\nIn 2017, Don’t Believe In Ghosts released their debut full-length album, “Give it Meaning”, and A Second Life released their first four singles, “Civil War”, “Just Whisper”, “Beautiful Distraction”, and “You’re Missing From Me”.\n\nTo take a listen to the alt-vibes of Face the King, Don’t Believe in Ghosts, and A Second Life, check them out on Spotify:\n\nFace the King: https://open.spotify.com/artist/4Rg22QdAlQc1KrhWuNwGWq\n\nDon’t Believe in Ghosts: https://open.spotify.com/artist/5uLKc9jyRkcyoTNF1JLWe1\n\nA Second Life: https://open.spotify.com/artist/1FJj42V3fVy1sdxs0OgTQ5\n\nAs a session musician, Dan has performed with countless artists from different Genres – Robbie Rosen (American Idol), MarissaAnn (The Voice), Alessandra Guercio (The Voice), The Frankel Sisters (X Factor), Julia Lambert, Nicoletta Slapo, Sammi Rae Murciano, The 00’s Band, and with Hank Lane Music Productions for weddings in the tri-state area. As a result he has shared the stage with those who top the charts today and in years past, some who include – Shawn Mendes, Ed Sheeran, Kings of Leon, Jake Miller, Coheed & Cambria, Shinedown, Staind, Billy Idol, Jane’s Addiction, and countless others.\n\nLiving a life of performance, especially that of music, means you never quite know what or where your next gig will be. To steal a line from Dan’s favorite movie, Forrest Gump – “I don’t know if we each have a destiny, or if we’re just floating around accidental – like on a breeze. But I think maybe it’s both.”\n\nIn Dan’s case, it is most definitely a touch of both. A destiny come true, thanks to years of training and mentorships, as well as a dream that started at the age of 5 and blossomed into today’s amazing career.\nBut the dream doesn’t stop here. Dan DelVecchio is always looking for new opportunities to expand his horizons in music, to follow the breeze and see where it takes him. Are you interested in learning from or playing with Dan? Contact him here today!\n\nBio written by Adina Perullo", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Jeff Taylor ", "ArtistImage": "https://photos.bandsintown.com/thumb/7816769.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Indie Rock", "Time": "2:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Jeff Taylor is a singer-songwriter based in New York. His first album, Frustration in Time Travel was released in 2012 under the band name, Dumpster Hunter. This was followed by the EP, Organelle in 2014 as his first solo release. Jeff collaborated with Sean Kiely in 2017, releasing a split 7″ single, Willow, Texas.\n\nThis past year has seen Jeff working with Donny McCaslin (David Bowie’s Blackstar band) to co-write and record his latest album, “Blow”, and together they have been touring the world throughout 2018/2019 for the release. He also appeared on Donny’s previous album, Beyond Now, singing a cover of David Bowie’s “A Small Plot of Land”. Earlier in 2018, Marike van Dijk‘s The Stereography Project was released featuring arrangements of Jeff’s songs for a 12-piece wind and string ensemble. He also frequently sings with Mark Guiliana‘s Beat Music project, and has toured and recorded with the likes of Sara Bareillies, Trixie Whitley, and Kishi Bashi.\n\nIn 2013 Jeff joined a cast of brilliant actors and musicians at Walt Disney Concert Hall for the Los Angeles Philharmonic’s one-night-only, sold out performance of Frank Zappa’s 200 Motels, under the conducting of legendary Finish maestro Esa-Pekka Salonen.\n\nJeff has just completed recording of his debut full-length solo album, featuring the rhythm section of Matt Johnson (Jeff Buckley, Rufus Wainwright, St. Vincent) and Jesske Hume (Conor Oberst, Margaret Glaspy) with a release planned for 2019.", "otherInfo": "LIVE STREAM - Jeff Taylor"}, {"Address": "205 11th Ave, Roselle, NJ 07203", "Artist": "BRETT NEWSKI ", "ArtistImage": "https://photos.bandsintown.com/thumb/9956837.jpeg", "Coordinates": [-74.257319, 40.648365], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Dork Rock, Folk Punk, Power Pop, 90s, Geek Rock, Punk, Garage, Indie Rock, Satire, Rock, Alternative Rock, Alternative", "Time": "5:00 PM UTC", "Venue": "Superfine Online Inc.", "moreBioInfo": "NOTABLE FESTIVAL APPEARANCES: Rolling Stone Festival, Iceland Airwaves, Reeperbahn Germany, SXSW official\n\nBRETT NEWSKI supports and tours:\nCourtney Barnett, Pixies, Violent Femmes, Manchester Orchestra, New Pornographers, Chuck Ragan, Rocky Votolato, Ezra Furman, Better than Ezra\n\n\nHow do you feel when someone starts playing on their phone while you’re talking to them? It’s a dark moment. It’s a seemingly small, yet significant moment when we realize we’ve got work to do as both individuals, and as a species.\n\nBRETT NEWSKI’s fourth studio album Don’t Let the Bastards Get you Down is a call to arms against whatever destructive forces we may find ourselves battling, from our individual struggles with toxic relationships, low self esteem, loneliness, and apathy to the more global challenges facing us in 2020: The erosion of face-to-face human connection, the breakdown of the proverbial village, the destruction of the planet, and the myriad ways in which our social media addictions amplify these problems. Depression and anxiety are at all time highs, with many, if not most of us, struggling to preserve our optimism.\n\nSo how do we regain control and stay hopeful in the face of these challenges? Perhaps it’s less screen time. Perhaps it’s changing the way we approach our tiny pocket TVs. Perhaps it’s discovering or recommitting to our passions. Perhaps it’s getting our hands dirty in pursuit of real solutions to our problems (instead of just complaining online). Perhaps Don’t Let the Bastards Get You Down can shed some positive insight.\n\nIn Last Dance (cowritten with Grammy nominated songwriter Pat Macdonald, ‘Future’s So Bright I Gotta Wear Shades’), Newski lays bare the highly relatable challenge of trying to stay informed and engaged while simultaneously staying afloat psychologically: “I ain’t trying to build the ark, I just really wanna learn how to swim / Thru a sea of plastic bottles, all the refuse, the mess we are in.” In Grow Your Garden, Newski issues a wake-up call from the hypnotic, numbing effects of living with our eyes glued to our screens: “If I was the dirt beneath the sneakers on your soulless feet / I’d nudge you far from the mirage so you could see the water”.\nIn Lousy T-Shirt, Newski describes the traps of social comparison in these “tiny TV times”, in which we so often compare ourselves to the “greatest hits” of others’ lives. (“I ain’t making any headlines / It’s a failures parade / I drove all the way to Hollywood and all I got’s this lousy t-shirt.”) He doubles down on this theme in Buy Me a Soul, singing “Step out from behind these little screens that rule our lives / I’m sick of highlights / Cause we’re an empty shell and we’re on earth but we’re in hell / Can anybody hear me? / Is this a permanent bad dream? Or is it too much reality?”\n\nWhat could topically threaten to amount to “too much reality” for the listener is buoyed by Newski and collaborator Spatola’s signature blend of largely up-tempo, guitar-driven alternative with splashes of what they describe as “Geek Rock”, “Happy Punk”, and “Diet Grunge”. The band has had a busy few years, playing alongside acts like PIXIES, Courtney Barnett, Violent Femmes, Better than Ezra and Manchester Orchestra, and will be touring extensively in support of this release.\n\n“Newski's live shows are part rock n' roll, part stand up, and part therapy. In the end, the room is won over,” says Jim McGuinn of The Current in Minneapolis.", "otherInfo": "Online show! Limited to 40 households so everyone can ask questions and interact easier. You’ll be invited via email to a private fb group Sunday morning. We go live at 1pm central US 4/5. 8pm europe"}, {"Address": "64 N 9th St, Brooklyn, NY 11249", "Artist": "The Reign of Kindo ", "ArtistImage": "https://photos.bandsintown.com/thumb/9128990.jpeg", "Coordinates": [-73.95987, 40.720886], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Music With Words", "Time": "10:30 PM UTC", "Venue": "Rough Trade NYC", "moreBioInfo": "Makers of music.", "otherInfo": "Due to the Corona Virus, and our desire to keep our fans and the community healthy, we are postponing our shows. This show is rescheduled to 8/22. All tickets purchased for the 4/5 show will be valid at the 8/22 show. As more information becomes available, we will update you!\n\nThe Reign of Kindo\n\nPlaying the fan favorite 'Rhythm, Chord & Melody' in its entirety.\n\nPlus other Kindo Classics.\nDon't Miss The Experience!"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Antoine Dufour ", "ArtistImage": "https://photos.bandsintown.com/thumb/7844568.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Instrumental, Progressive Acoustic Instrumental, Instrumental Music, Instrumental Acoustic Guitar, Fingerstyle Guitar, Acoustic", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Antoine Dufour Bio\n\n\n37 year old Montreal, Canada based guitarist Antoine Dufour is known colloquially among the best guitar players in the world as a musician’s musician. To fans of popular music, he deftly combines jaw-dropping guitar playing skills and an artistic soul in crafting instrumental compositions that reflect ambient and progressive music that transcends global cultures and languages. That he does this in an incredibly visual and entertaining style has endeared him to a broad spectrum of fans of popular music.\n\nVia his six albums of original material released to critical acclaim, two live performance DVDs, 6 years of global touring and more than 50 million cumulative views on YouTube, Antoine Dufour has emerged as a young star of fingerstyle acoustic guitar, building a worldwide reputation for innovation and creativity. 2014 will showcase his abilities as he tours global markets including Canada, Germany, USA, China, UK, France Netherlands, and many others. He has recorded a new album of material that is slated for a fall 2014 release.\n\nAntoine’s records of accomplishment include winning First place at the Canadian Fingerstyle Guitar Championships, Third place at the ultra-prestigious international guitar championships at Winfield, recording for the leading Instrumental music record label Candyrat, plus touring and playing with luminary guitar players such as Andy McKee and Don Ross.\n\nThrough his active schedule of post show meet and greets with every fan after gigs, holding seminars, workshops and masterclasses as part of his tour schedule he truly loves engaging fans on a one-to-one level – however, it is via social media that he has connected with millions of fans spread out all over the globe. His fans have recorded countless covers of his music on YouTube and his fan base is as loyal and ravenous to see him perform as any artist out there today.\n\nClearly, fans are attracted to his technical prowess in the progressive Acoustic Guitarist as trail-blazed by such geniuses as Michael Hedges and Preston Reed; yet, it is a solid reflection of his ability and persona that he is simultaneously hailed by reviewers and critics alike.\n\nHe has been described within traditional media and press with accolades such as:\n\n“… (Antoine is a) wonderland of fingerpicking and highly intricate compositions soothing the soul as they engage the mind. Dufour's riffs are incredible, never-ending, and at times seemingly impossible for human fingers to pull off.”\n\nAnd\n\n”The youthful Antoine Dufour's million views on Youtube are easily understood. His style packs a rock band's punch behind extraordinary fluency and features highly effective flamenco-like percussion and deftly reflective melodies as well as urgent, nimble picking.”\n\nwww.antoinedufourmusic.com", "otherInfo": "Candyrat Guitar Night Presents Antoine Dufour & Gareth Pearsoni - Rockwood Stage 2"}, {"Address": "New York City, NY", "Artist": "Owen Broder ", "ArtistImage": "https://photos.bandsintown.com/thumb/9080008.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Jazz", "Time": "11:00 PM UTC", "Venue": "Live From Our Living Rooms", "moreBioInfo": "Owen Broder is a saxophonist based in New York City. He runs in a variety of musical circles, leading his own groups and participating in others. Broder’s American Roots Project’s album Heritage (2018) is a featured project on ArtistShare®, and earned him a 2018 Herb Alpert Young Jazz Composer Award. The album was praised by DownBeat Magazine as a “transcendental work of art,” and listed as #5 among the Best Music of 2018 [Francis Davis, NPR]. His quintet, Cowboys & Frenchmen, has enjoyed multiple US tours, seen success in international competitions, and received critical acclaim for their recordings, including a four-star review from DownBeat Magazine for their latest release, Bluer Than You Think (2017).\n\nBroder is a member of the Anat Cohen Tentet, and has performed with internationally respected artists such as Ryan Truesdell’s Gil Evans Project, Trio Globo, and YouTube sensation Postmodern Jukebox. In musical theater, he was a member of the pit orchestras for the German tour of Grease and off-Broadway production For the Last Time, appeared with the band in David Bowie’s Lazarus, and originated the woodwind chair in the U.S. Premier tour of The Bodyguard the Musical.\n\nBroder grew up in Jacksonville, FL, and also has hometown ties to Detroit, MI, and Washington, D.C. He holds a Bachelor’s degree from the Eastman School of Music, and a Master’s from the Manhattan School of Music.", "otherInfo": "Live Stream: https://www.crowdcast.io/e/ethan_owen/register?utm_campaign=profile&utm_medium=profile_web&utm_source=profile"}, {"Address": "327 Bowery, New York, NY 10012", "Artist": "Kate Vargas ", "ArtistImage": "https://photos.bandsintown.com/thumb/8758970.jpeg", "Coordinates": [-73.991787, 40.725751], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Folk Rock, Americana, Folk-blues", "Time": "11:00 PM UTC", "Venue": "The Bowery Electric", "moreBioInfo": "A reformed wild child, in recent years Kate Vargas has traded the party for meditation, yoga, clean eating and a renewed focus on what she values most—her music. The New Mexico-raised, NYC-based artist is building ever more mindfully on her sound, and the music press is taking notice, Vargas receiving praise from a variety of respected outlets including Billboard, NPR, and the Huffington Post, the latter assessing, “There is an unlimited amount of potential in this superstar on the rise.”\n\nVargas has packed houses from Ireland’s Westport Folk and Bluegrass Festival to The Troubadour in London, The Mansion on O Street in Washington D.C. to New York’s Bowery Electric. Her recent release, For The Wolfish & Wandering (out July 27), features her singular folk-style storytelling. The songs are grounded in a darkly melodic, reverb-washed sonic palette of dreampop, dusty folk and junkyard blues, all carried by Vargas’ rough-hewn vocals and guitar playing. In equal measure, she channels a surprising array of artists, from Tom Waits and 16 Horsepower to Lana Del Rey and K. Flay.", "otherInfo": "Brett Newski with Pete Donnelly and Kate Vargas!"}, {"Address": "881 7th Ave, New York, NY 10019", "Artist": "Jean Rohe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8355477.jpeg", "Coordinates": [-73.980276, 40.764881], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Brooklyn, New York", "Time": "11:00 PM UTC", "Venue": "Zankel Hall at Carnegie Hall", "moreBioInfo": "“There are plenty of talented artists out there, but what sets Jean Rohe apart are the suppleness of her voice, the integrity of her vision, and the grace she shows in her wide-ranging journeys across the musical landscape.” --John Platt, WFUV New York Jean Rohe sings and plays multi-lingual original music of the Americas, North and South. Whether solo or with her genre-bending trio, Jean brings the full breadth of her stylistic attractions to bear, exploring the intersections of American folk music, jazz, Brazilian and Afro-Peruvian traditions. The product of both a nurturing folk music community in her childhood, as well as the vibrant New York improvised music scene, it is not unusual to find Jean and her band in a downtown jazz club inviting a disarmed audience to sing boisterous choruses. Likewise, her sophisticated songwriting and arranging has found a home at folk music festivals around the country. Jean has performed everywhere from the Birdland to the National Theater in Cuba; from New York City's own Living Room to the Montreux Jazz Festival, where her refreshingly earnest performance won her the audience prize in 2006. She has appeared as a special guest with the Billboard-charting alt-country group Calexico and performs with Liam Robinson in the American/Irish traditional duo, Robinson & Rohe. \"Jean has the remarkable ability, typical of all true artists, to hold her vast palette of technical virtuosity in check and only bring what's needed at any given moment. Hardly the aloof jazz musician we've grown accustomed to, she brings her listeners along for a joyful ride through her soundworld, while challenging them with questions about what it means to be a global citizen.\" --William R. Bauer, Ph.D, author of Open the Door: The Life and Music of Betty Carter Songwriter & performer, Brooklyn, NY.", "otherInfo": "Songs for Joy [CANCELLED]\n\nInspired by personal narrative and a new translation of Friedrich Schiller’s “Ode to Joy”—reimagined for our contemporary moment by former poet laureate Tracy K. Smith—performers explore their bold visions for joy through new and original songs.\n\nJean will perform her piece, \"Let It Shine,\" written for this concert and arranged by Jean for the chamber orchestra, Ensemble Connect."}, {"Address": "327 Bowery, New York, NY 10012", "Artist": "BRETT NEWSKI ", "ArtistImage": "https://photos.bandsintown.com/thumb/8988817.jpeg", "Coordinates": [-73.991787, 40.725751], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Dork Rock, Folk Punk, Power Pop, 90s, Geek Rock, Punk, Garage, Indie Rock, Satire, Rock, Alternative Rock, Alternative", "Time": "11:30 PM UTC", "Venue": "The Bowery Electric", "moreBioInfo": "NOTABLE FESTIVAL APPEARANCES: Rolling Stone Festival, Iceland Airwaves, Reeperbahn Germany, SXSW official\n\nBRETT NEWSKI supports and tours:\nCourtney Barnett, Pixies, Violent Femmes, Manchester Orchestra, New Pornographers, Chuck Ragan, Rocky Votolato, Ezra Furman, Better than Ezra\n\n\nHow do you feel when someone starts playing on their phone while you’re talking to them? It’s a dark moment. It’s a seemingly small, yet significant moment when we realize we’ve got work to do as both individuals, and as a species.\n\nBRETT NEWSKI’s fourth studio album Don’t Let the Bastards Get you Down is a call to arms against whatever destructive forces we may find ourselves battling, from our individual struggles with toxic relationships, low self esteem, loneliness, and apathy to the more global challenges facing us in 2020: The erosion of face-to-face human connection, the breakdown of the proverbial village, the destruction of the planet, and the myriad ways in which our social media addictions amplify these problems. Depression and anxiety are at all time highs, with many, if not most of us, struggling to preserve our optimism.\n\nSo how do we regain control and stay hopeful in the face of these challenges? Perhaps it’s less screen time. Perhaps it’s changing the way we approach our tiny pocket TVs. Perhaps it’s discovering or recommitting to our passions. Perhaps it’s getting our hands dirty in pursuit of real solutions to our problems (instead of just complaining online). Perhaps Don’t Let the Bastards Get You Down can shed some positive insight.\n\nIn Last Dance (cowritten with Grammy nominated songwriter Pat Macdonald, ‘Future’s So Bright I Gotta Wear Shades’), Newski lays bare the highly relatable challenge of trying to stay informed and engaged while simultaneously staying afloat psychologically: “I ain’t trying to build the ark, I just really wanna learn how to swim / Thru a sea of plastic bottles, all the refuse, the mess we are in.” In Grow Your Garden, Newski issues a wake-up call from the hypnotic, numbing effects of living with our eyes glued to our screens: “If I was the dirt beneath the sneakers on your soulless feet / I’d nudge you far from the mirage so you could see the water”.\nIn Lousy T-Shirt, Newski describes the traps of social comparison in these “tiny TV times”, in which we so often compare ourselves to the “greatest hits” of others’ lives. (“I ain’t making any headlines / It’s a failures parade / I drove all the way to Hollywood and all I got’s this lousy t-shirt.”) He doubles down on this theme in Buy Me a Soul, singing “Step out from behind these little screens that rule our lives / I’m sick of highlights / Cause we’re an empty shell and we’re on earth but we’re in hell / Can anybody hear me? / Is this a permanent bad dream? Or is it too much reality?”\n\nWhat could topically threaten to amount to “too much reality” for the listener is buoyed by Newski and collaborator Spatola’s signature blend of largely up-tempo, guitar-driven alternative with splashes of what they describe as “Geek Rock”, “Happy Punk”, and “Diet Grunge”. The band has had a busy few years, playing alongside acts like PIXIES, Courtney Barnett, Violent Femmes, Better than Ezra and Manchester Orchestra, and will be touring extensively in support of this release.\n\n“Newski's live shows are part rock n' roll, part stand up, and part therapy. In the end, the room is won over,” says Jim McGuinn of The Current in Minneapolis.", "otherInfo": "No other event info available"}, {"Address": "799 NJ-70, Brick Township, NJ 08723", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.134794, 40.064709], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Little Falls, New Jersey", "Time": "12:00 AM UTC", "Venue": "Beacon 70", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "1468 Madison Ave, New York, NY 10029", "Artist": "Aeolus Quartet ", "ArtistImage": "https://photos.bandsintown.com/thumb/8569982.jpeg", "Coordinates": [-73.952097, 40.790311], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "String Quartet", "Time": "4:00 PM UTC", "Venue": "The Mount Sinai Hospital", "moreBioInfo": "Praised by Strad Magazine for their “high-octane” performance, the Aeolus Quartet is among the finest young string quartets performing today. Violinists Nicholas Tavani and Rachel Shapiro, violist Gregory Luce, and cellist Alan Richardson formed the Aeolus Quartet in 2008 at the Cleveland Institute of Music. Since its inception, the all-American quartet has been awarded prizes at nearly every major competition in the United States and performed across the globe with showings “worthy of a major-league quartet” (Scott Cantrell, Dallas Morning News). Luke Quinton of the Austin-American Statesman writes, “The Aeolus Quartet is a powerful and thoughtful group of young musicians who are plotting an ascending course…this vibrant group shows great promise.” They are currently the Graduate Resident String Quartet at the Juilliard School.\n\nThe Aeolus Quartet are Grand Prizewinners of the 2011 Plowman Chamber Music Competition and 2011 Chamber Music Yellow Springs Competition. They were awarded First Prize at the 2009 Coleman International Chamber Ensemble Competition, a Silver Medal at the 2011 Fischoff International Chamber Music Competition, and a Bronze Medal at the 2010 International Chamber Music Ensemble Competition in New England. The 16th Annual Austin Critics’ Table named the Aeolus Quartet their 2010-2011 “Best Ensemble.” The Aeolus Quartet has released two critically acclaimed albums of classical and contemporary works through the Longhorn/Naxos label which are available on iTunes, Amazon, and major retailers worldwide.\n\nThe Quartet has performed across North America, Europe, and Asia in venues such as Weill Recital Hall at Carnegie Hall, Reinberger Recital Hall at Severance Hall, Merkin Hall, The Library of Congress, Renwick Gallery, St. Martin-in-the-Fields, and the Shanghai Oriental Arts Center.\n\nDedicated to bringing music into the community, the Aeolus Quartet has been widely recognized for their highly innovative and engaging outreach programs. The Fischoff National Chamber Music Association awarded the Aeolus their 2013 Educator Award in acknowledgment of the positive impact their educational efforts have had in diverse communities. Additionally, they were awarded the 2012 Lad Prize which culminated in large-scale community engagement work, performing in the Stanford area, and a masterclass residency at Stanford University. The Aeolus Quartet has also served as teaching faculty at Stanford University’s Education Program for Gifted Youth (EPGY), the Austin Chamber Music Workshop, and Da Camera of Houston’s Music Encounters Program. Working in collaboration with the University of Texas through the Rural Chamber Music Outreach Initiative, the Quartet has presented educational programs and performances in communities throughout the state of Texas.\n\nThe Aeolus Quartet has studied extensively with the Miró, Guarneri, and Juilliard Quartets. Other mentors include artists such as William Preucil, Peter Salaff, Donald Weilerstein, Itzhak Perlman, Gerhard Schulz, and Mark Steinberg. Members of the Quartet hold degrees from the Peabody Conservatory, the Cleveland Institute of Music, and the University of Texas at Austin, where they served as the first Graduate String Quartet-in-Residence.\n\nThe Quartet’s 2013-2014 season includes multiple performances on the Smithsonian Institute’s rare instrument collection, an educational tour of the Midwest in conjunction with the Fischoff Competition, concert touring throughout the United States, and residencies in North Carolina and at the Austin Chamber Music Center’s Summer Festival.\n\nThe Quartet is named for the Greek god Aeolus, who governed the four winds. This idea of a single spirit uniting four individual forces serves as an inspiration to the members of the Aeolus Quartet as they pursue their art.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Brian Newman ", "ArtistImage": "https://photos.bandsintown.com/thumb/8284445.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Jazz", "Time": "9:00 PM UTC", "Venue": "StageIt Livestream", "moreBioInfo": "Performer, trumpeter, and vocalist, Brian Newman’s brand of jazz has tirelessly resurrected the magic of Old New York, refreshing the glamorous era with nuances of his own rock-n-roll edge. Whether performing with his own quartet or supporting Lady Gaga and Tony Bennett on tour, Newman’s expert trumpeteering and effervescent stage presence reignited a big band scene in New York City, and has since enticed a new generation of jazz fans across the globe. The Verve Recording artist continues to reign at his weekly residency in New York, as well as appear on television programs and in special performances across the United States and Europe.\nNewman is known for his impeccable horn playing and rendition of romantic favorites. But what sets him apart is his ability to command a room not only with his musical talent, but as a bandleader who makes each person in the audience feel as if they are a part of his performance. His fusion of music playing and easy going banter captures the vivacity of great bandleaders of the past. This exuberance is evident on Newman’s 2016 debut album, Eyes on the City, which pays tribute to his musical journey in New York.\nAlong with his Quartet, fellow musicians from Cincinnati’s College-Conservatory of Music, Newman has allured audiences during his residencies at some of New York’s most iconic venues. His first foray into creating an old school big band night was at the elegant Duane Park for “After Dark,” a jazz and burlesque revue on the downtown scene in Tribeca. “After Dark” lead to a weekly residency at the legendary Oak Room at The Plaza Hotel, a venue steeped in history which was frequented by the likes of Truman Capote, Gore Vidal, Frank Sinatra, Liza Minelli and countless others over its one hundred year history. Newman and his Quartet played each Wednesday to a mixed crowd seeking a slice of history, welcoming Lady Gaga as a surprise guest, until the venue closed in 2011. Currently, Newman performs every Tuesday and Thursday, as bandleader in a residency at Rose Bar at the Gramercy Park Hotel, and select Friday nights at NYC’s legendary Rainbow Room with his orchestra. Brian also routinely appears for special live performances with a diverse array of musical acts, which have included Tony Bennett, Jose Feliciano, Stevie Wonder, Mark Murphy, Dierks Bentley, Willie Nile, Molly Ringwald, David Loeb, Steve Wynn’s Orchestra, Ray Benson’s Asleep at the Wheel and Tommy London.\nNewman’s personal style, which meshes classic suits, vintage tattoos and rock-n-roll, has attracted commercial brands such as Jack Daniel’s, Marc Jacobs and Tiffany & Co., who have collaborated with Newman for special events and performances. The Jack Daniel’s partnership in 2012, which launched the brand’s Sinatra Select premium Tennessee Whiskey, brought Newman alongside Frank Sinatra Jr. himself, in a performance in Cannes, France.\nBrian married burlesque star, Angie Pontani of the World Famous Pontani Sisters in February 2013, with whom he most notably performs in connection with Pontani’s New York Burlesque Festival and Burlesque-a-Pades shows. The couple have a daughter, and reside in the neighborhood of Brooklyn.", "otherInfo": "No other event info available"}, {"Address": "127 E 23rd St, New York, NY 11226", "Artist": "Hot Chelle Rae ", "ArtistImage": "https://photos.bandsintown.com/thumb/9945290.jpeg", "Coordinates": [-73.98492, 40.7399], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Rock, Pop", "Time": "11:00 PM UTC", "Venue": "Gramercy Theatre", "moreBioInfo": "DON'T SAY GOODNIGHT: http://smarturl.it/DontSayGoodnight", "otherInfo": "No other event info available"}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Marcia Ball ", "ArtistImage": "https://photos.bandsintown.com/thumb/9873048.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Americana, Boogie-woogie, Blues, Swamp Blues", "Time": "12:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "\"Fifty years have passed in a flash,\" says Texas-born, Louisiana-raised pianist, songwriter and vocalist Marcia Ball of her long and storied career. Ball, the 2018 Texas State Musician Of The Year, has won worldwide fame and countless fans for her ability to ignite a full-scale roadhouse rhythm and blues party every time she takes the stage. Her rollicking Texas boogies, swampy New Orleans ballads and groove-laden Gulf Coast blues have made her a one-of-a-kind favorite with music lovers all over the world. With each new release, her reputation as a profoundly soulful singer, a boundlessly talented pianist and a courageous, inventive songwriter continues to grow. Her love of the road has led to years of soul-satisfying performances at festivals, concert halls and clubs. The New York Times says, \"Marcia Ball plays two-fisted New Orleans barrelhouse piano and sings in a husky, knowing voice about all the trouble men and women can get into on the way to a good time.\" The Houston Chronicle says simply, \"She's as perfect as an artist can be.\"\n\nWith her new album, Shine Bright, Ball set out to, in her words, \"Make the best Marcia Ball record I could make.\" In doing so, she has put together the most musically substantial, hopeful and uplifting set of songs of her five-decade career. Produced by Steve Berlin (Los Lobos) and recorded in Texas and Louisiana, Shine Bright contains twelve songs (including nine originals), ranging from the title track's rousing appeal for public and private acts of courage to the upbeat call to action of \"Pots And Pans,\" a song inspired by renowned Texas political writer and humorist Molly Ivins. From the humorous advice of \"Life Of The Party\" to the poignantly optimistic \"World Full Of Love,\" the intensity of Ball's conviction never wavers while, simultaneously, the fun never stops. Shine Bright is exactly the album Ball set out to make. \"It is a ridiculously hopeful, cheerful record,\" she says, in light of some of the album's more serious subject matter. The secret, according to Ball \"is to set the political songs to a good dance beat.\"\n\nBorn in Orange, Texas in 1949 to a family whose female members all played piano, Ball grew up in the small town of Vinton, Louisiana, right across the border from Texas. She began taking piano lessons at age five, playing old Tin Pan Alley and popular music tunes from her grandmother's collection. But it wasn't until she was 13 that Marcia discovered the power of soul music. One day in New Orleans in 1962, she sat amazed as Irma Thomas delivered the most spirited and moving performance the young teenager had ever seen. A few years later she attended Louisiana State University, where she played some of her very first gigs with a blues-based rock band called Gum.\n\nIn 1970, Ball set out for San Francisco. Her car broke down in Austin, and while waiting for repairs she fell in love with the city and decided to stay. It wasn't long before she was performing in local clubs with a progressive country band called Freda And The Firedogs, while beginning to sharpen her songwriting skills. It was around this time that she delved deeply into the music of the great New Orleans piano players, especially Professor Longhair. \"Once I found out about Professor Longhair,\" recalls Ball, \"I knew I had found my direction.\"\n\nWhen Freda And The Firedogs broke up in 1974, Ball launched her solo career, playing clubs around Austin, Houston and Louisiana. She signed with Capitol Records in 1978, debuting with the country-rock album Circuit Queen. Creating and honing her own sound, she released six critically acclaimed titles on the Rounder label during the 1980s and 1990s. In 1990, Ball—collaborating with Angela Strehli and Lou Ann Barton—recorded the hugely successful Dreams Come True on the Antone's label. At the end of 1997, Marcia finished work on a similar \"three divas of the blues\" project for Rounder, this time in the distinguished company of Tracy Nelson and her longtime inspiration, Irma Thomas. The CD, Sing It!, was released in 1998 and was nominated for a Grammy Award.\n\nMarcia Ball has appeared many times on national television over the years, including the PBS special In Performance At The White House along with B.B. King and Della Reese, Austin City Limits and HBO's Treme. She performed in Piano Blues, the film directed by Clint Eastwood included in Martin Scorsese's The Blues series which aired on PBS television nationwide in 2003. Marcia also appeared on The Late Show With David Letterman with The New Orleans Social Club, where she not only reached millions of people, but also helped to benefit victims of Hurricane Katrina. In 2012, she had a role in the independent film Angels Sing starring Harry Connick, Jr., Lyle Lovett and Willie Nelson. In 2017 she performed on NPR's A Jazz Piano Christmas, live from The Kennedy Center in Washington, D.C.\n\nBall joined Alligator in 2001 with the release of the critically acclaimed Presumed Innocent. The CD won the 2002 Blues Music Award for Blues Album Of The Year. Her follow-up, So Many Rivers, was nominated for a Grammy Award, and won the 2004 Blues Music Award for Contemporary Blues Album Of The Year as well as the coveted Contemporary Blues Female Artist Of The Year award. Her next release, Live! Down The Road, released in 2005, also garnered a Grammy nomination, as did 2008's Peace, Love & BBQ (the album debuted at #1 on the Billboard Blues Chart). 2010's Grammy-nominated Roadside Attractions and 2014's The Tattooed Lady And The Alligator Man successfully grew her fan base even further. Altogether she holds ten Blues Music Awards, ten Living Blues Awards, and five Grammy Award nominations. She has been inducted into both the Gulf Coast Music Hall Of Fame and the Louisiana Music Hall Of Fame. The Texas State legislature named her the official 2018 Texas State Musician. As her hometown Austin Chronicle says, \"What's not to like about Marcia Ball?\"\n\nSince joining Alligator, Ball has blossomed as a songwriter. Each album has been filled with fresh, original songs, never more so than on Shine Bright. Ball easily draws her listeners deep into her music with instantly memorable melodies and imaginative imagery. Her songs paint vibrant musical pictures richly detailed with recognizable characters, regional flavors, universal themes and colorful scenes, both real and imagined. Living Blues declares, \"Her originals sound like timeless classics and southern soul masterpieces that no one else can imitate.\"\n\nNow, with Shine Bright, Ball's new, aggressively hopeful songs are energized by Steve Berlin's inventive and exciting production, creating electrifying music that is daring, inspired, poignant and timely. The Boston Globe calls Ball \"a compelling storyteller\" who plays \"an irresistible, celebratory blend of rollicking, two-fisted New Orleans piano, Louisiana swamp rock and smoldering Texas blues.\"\n\nOf course, Ball will bring the party on the road, playing her new songs and old favorites for fans around the globe. \"I still love the feel of the wheels rolling,\" she says, \"and the energy in a room full of people ready to go wherever it is we take them.\" With both her new album and her legendary live performances, Marcia Ball will shine a light into the darkness, making the world a brighter place one song at a time.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Svetlana ", "ArtistImage": "https://photos.bandsintown.com/thumb/9301408.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Swing, Jazz, Sophisti-pop", "Time": "1:00 AM UTC", "Venue": "Back Room - New York - CANCELLED", "moreBioInfo": "\"Breakfast at Tiffany's Meets Some Like It Hot\" (Lucid Culture)\n\"Outstanding vocalist\" (Wall Street Journal)", "otherInfo": "No other event info available"}, {"Address": "1650 Broadway, New York, NY 10019", "Artist": "Marcia Ball ", "ArtistImage": "https://photos.bandsintown.com/thumb/9873050.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Americana, Boogie-woogie, Blues, Swamp Blues", "Time": "2:30 AM UTC", "Venue": "The Iridium", "moreBioInfo": "\"Fifty years have passed in a flash,\" says Texas-born, Louisiana-raised pianist, songwriter and vocalist Marcia Ball of her long and storied career. Ball, the 2018 Texas State Musician Of The Year, has won worldwide fame and countless fans for her ability to ignite a full-scale roadhouse rhythm and blues party every time she takes the stage. Her rollicking Texas boogies, swampy New Orleans ballads and groove-laden Gulf Coast blues have made her a one-of-a-kind favorite with music lovers all over the world. With each new release, her reputation as a profoundly soulful singer, a boundlessly talented pianist and a courageous, inventive songwriter continues to grow. Her love of the road has led to years of soul-satisfying performances at festivals, concert halls and clubs. The New York Times says, \"Marcia Ball plays two-fisted New Orleans barrelhouse piano and sings in a husky, knowing voice about all the trouble men and women can get into on the way to a good time.\" The Houston Chronicle says simply, \"She's as perfect as an artist can be.\"\n\nWith her new album, Shine Bright, Ball set out to, in her words, \"Make the best Marcia Ball record I could make.\" In doing so, she has put together the most musically substantial, hopeful and uplifting set of songs of her five-decade career. Produced by Steve Berlin (Los Lobos) and recorded in Texas and Louisiana, Shine Bright contains twelve songs (including nine originals), ranging from the title track's rousing appeal for public and private acts of courage to the upbeat call to action of \"Pots And Pans,\" a song inspired by renowned Texas political writer and humorist Molly Ivins. From the humorous advice of \"Life Of The Party\" to the poignantly optimistic \"World Full Of Love,\" the intensity of Ball's conviction never wavers while, simultaneously, the fun never stops. Shine Bright is exactly the album Ball set out to make. \"It is a ridiculously hopeful, cheerful record,\" she says, in light of some of the album's more serious subject matter. The secret, according to Ball \"is to set the political songs to a good dance beat.\"\n\nBorn in Orange, Texas in 1949 to a family whose female members all played piano, Ball grew up in the small town of Vinton, Louisiana, right across the border from Texas. She began taking piano lessons at age five, playing old Tin Pan Alley and popular music tunes from her grandmother's collection. But it wasn't until she was 13 that Marcia discovered the power of soul music. One day in New Orleans in 1962, she sat amazed as Irma Thomas delivered the most spirited and moving performance the young teenager had ever seen. A few years later she attended Louisiana State University, where she played some of her very first gigs with a blues-based rock band called Gum.\n\nIn 1970, Ball set out for San Francisco. Her car broke down in Austin, and while waiting for repairs she fell in love with the city and decided to stay. It wasn't long before she was performing in local clubs with a progressive country band called Freda And The Firedogs, while beginning to sharpen her songwriting skills. It was around this time that she delved deeply into the music of the great New Orleans piano players, especially Professor Longhair. \"Once I found out about Professor Longhair,\" recalls Ball, \"I knew I had found my direction.\"\n\nWhen Freda And The Firedogs broke up in 1974, Ball launched her solo career, playing clubs around Austin, Houston and Louisiana. She signed with Capitol Records in 1978, debuting with the country-rock album Circuit Queen. Creating and honing her own sound, she released six critically acclaimed titles on the Rounder label during the 1980s and 1990s. In 1990, Ball—collaborating with Angela Strehli and Lou Ann Barton—recorded the hugely successful Dreams Come True on the Antone's label. At the end of 1997, Marcia finished work on a similar \"three divas of the blues\" project for Rounder, this time in the distinguished company of Tracy Nelson and her longtime inspiration, Irma Thomas. The CD, Sing It!, was released in 1998 and was nominated for a Grammy Award.\n\nMarcia Ball has appeared many times on national television over the years, including the PBS special In Performance At The White House along with B.B. King and Della Reese, Austin City Limits and HBO's Treme. She performed in Piano Blues, the film directed by Clint Eastwood included in Martin Scorsese's The Blues series which aired on PBS television nationwide in 2003. Marcia also appeared on The Late Show With David Letterman with The New Orleans Social Club, where she not only reached millions of people, but also helped to benefit victims of Hurricane Katrina. In 2012, she had a role in the independent film Angels Sing starring Harry Connick, Jr., Lyle Lovett and Willie Nelson. In 2017 she performed on NPR's A Jazz Piano Christmas, live from The Kennedy Center in Washington, D.C.\n\nBall joined Alligator in 2001 with the release of the critically acclaimed Presumed Innocent. The CD won the 2002 Blues Music Award for Blues Album Of The Year. Her follow-up, So Many Rivers, was nominated for a Grammy Award, and won the 2004 Blues Music Award for Contemporary Blues Album Of The Year as well as the coveted Contemporary Blues Female Artist Of The Year award. Her next release, Live! Down The Road, released in 2005, also garnered a Grammy nomination, as did 2008's Peace, Love & BBQ (the album debuted at #1 on the Billboard Blues Chart). 2010's Grammy-nominated Roadside Attractions and 2014's The Tattooed Lady And The Alligator Man successfully grew her fan base even further. Altogether she holds ten Blues Music Awards, ten Living Blues Awards, and five Grammy Award nominations. She has been inducted into both the Gulf Coast Music Hall Of Fame and the Louisiana Music Hall Of Fame. The Texas State legislature named her the official 2018 Texas State Musician. As her hometown Austin Chronicle says, \"What's not to like about Marcia Ball?\"\n\nSince joining Alligator, Ball has blossomed as a songwriter. Each album has been filled with fresh, original songs, never more so than on Shine Bright. Ball easily draws her listeners deep into her music with instantly memorable melodies and imaginative imagery. Her songs paint vibrant musical pictures richly detailed with recognizable characters, regional flavors, universal themes and colorful scenes, both real and imagined. Living Blues declares, \"Her originals sound like timeless classics and southern soul masterpieces that no one else can imitate.\"\n\nNow, with Shine Bright, Ball's new, aggressively hopeful songs are energized by Steve Berlin's inventive and exciting production, creating electrifying music that is daring, inspired, poignant and timely. The Boston Globe calls Ball \"a compelling storyteller\" who plays \"an irresistible, celebratory blend of rollicking, two-fisted New Orleans piano, Louisiana swamp rock and smoldering Texas blues.\"\n\nOf course, Ball will bring the party on the road, playing her new songs and old favorites for fans around the globe. \"I still love the feel of the wheels rolling,\" she says, \"and the energy in a room full of people ready to go wherever it is we take them.\" With both her new album and her legendary live performances, Marcia Ball will shine a light into the darkness, making the world a brighter place one song at a time.", "otherInfo": "No other event info available"}, {"Address": "183 W 10th St, New York, NY 10014", "Artist": "Sean Mason ", "ArtistImage": "https://photos.bandsintown.com/thumb/8955464.jpeg", "Coordinates": [-74.002722, 40.734367], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Jazz", "Time": "3:00 AM UTC", "Venue": "Smalls Jazz Club", "moreBioInfo": "Pianist/Composer", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "Aberdeen (the band) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9924510.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Instrumental, Jazz, Rock, Brass", "Time": "10:00 PM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "Aberdeen is a jazz / indie rock brass band based out of Brooklyn, NY. They create a wall of sound with soaring, horn-driven melodies, supported by a bed of distorted guitars and raucous drums. Brian Plautz is the primary songwriter in the band, along with Alex Conroy and Shubh Saran. The band, featuring saxophones, trombone, trumpet, two guitars, bass and drums never ceases to fill a room with energy. Aberdeen's 2019 debut album Downpour showcases their massive, one-of-a-kind sound, featuring Grammy Award-winning saxophonist Bob Reynolds (John Mayer, Snarky Puppy) and bassist Adam Neely, who hosts a 900,000+ subscriber music channel on YouTube. Demonstrated during Aberdeen's 2019 U.S. State Department tour to Central Asia, Aberdeen's music is about community; a large collective of musicians with the hope of sharing its music to audiences throughout the world.", "otherInfo": "Aberdeen will be canceling/postponing our upcoming spring tour due to the COVID-19 pandemic. Let's stick together during this crazy time (emotionally, not physically) and follow the recommendations as laid out by the CDC.\nTuesday, April 7th, 2020\nTickets: $12\nAges: 21+\nDoors: 6:00pm\nShow: 8:00pm"}, {"Address": "1286 Hicksville Rd, Massapequa, NY 11758", "Artist": "Cuthbert Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/9298868.jpeg", "Coordinates": [-73.48267, 40.71377], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rock, Country And Soul., Pop", "Time": "11:30 PM UTC", "Venue": "Paddy's Loft", "moreBioInfo": "Paul C. Cuthbert is a singer/songwriter, covering multiple music genres.\n\nHe is also the owner of Rock Beach Music Co. where he fronts multiple music acts.", "otherInfo": "☘️Join Paul live every Tuesday night at Paddy's Loft - Irish Pub and Restaurant - Massapequa. New York. 7:30pm to 10:30pm.\n\nTwo for Tuesdays drinks and apps! Fine dining. Authentic Irish Pub. Best Pint of Guinness in New York! Sports on all Tv's.\n\nJoin us for a song and a pint! Slainte!🍻"}, {"Address": "95 Stanton St, New York, NY 10002", "Artist": "Jeff Litman, Guitarist/Multi-Instrumentalist ", "ArtistImage": "https://photos.bandsintown.com/thumb/7414154.jpeg", "Coordinates": [-73.988383, 40.721329], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Arlene's Grocery", "moreBioInfo": "No artist bio available", "otherInfo": "Postponed due to Coronavirus. New date TBD."}, {"Address": "80 N 6th St, Brooklyn, NY 11249", "Artist": "Jenny Hval ", "ArtistImage": "https://photos.bandsintown.com/thumb/9763268.jpeg", "Coordinates": [-73.961212, 40.718958], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Experimental Folk, Electronic, Avant-garde, Art Pop, Pop", "Time": "12:00 AM UTC", "Venue": "National Sawdust", "moreBioInfo": "Norwegian artist, musician and writer.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Noah Gundersen ", "ArtistImage": "https://photos.bandsintown.com/thumb/9170398.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Songwriter", "Time": "2:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Born to a devoutly religious family in Olympia, WA, Noah Gundersen has been writing and recording music since he was but 13, working his way from teenage hardcore and indie rock to the creation of his own distinctive strain of bold, genre-busting songcraft. A series of solo EPs – including 2011’s breakthrough FAMILY – eventually led to 2014’s self-produced full-length debut, LEDGES. CARRY THE GHOST arrived the following year, earning acclaim from the likes of NPR.\n\nNoah continued to gain popularity after his music was featured on television shows like Sons of Anarchy, The Vampire Diaries, One Tree Hill and Nashville. Ever searching, he impelled his music towards new terrain on 2017’s WHITE NOISE, melding his increasingly potent lyrical motifs with complex electronics and startling levels of sonic intensity. The album reaped a whirlwind of critical acclaim upon its 2017 release. Consequence of Sound wrote, “...the Seattle native has evolved to become an even more striking musician, his lyrics not only burning brighter, but his arrangements fuller and more intense to match their maker.”\n\nAlong with his recorded canon, Gundersen – who also maintains membership in Seattle indie rock heroes Young In The City and the all-star Americana collective known as Glorietta – has spent much of his adult life on the road, performing as headline act and support to like-minded artists spanning Emmylou Harris, Beck, City & Colour, and Josh Ritter.", "otherInfo": "Live Stream: https://www.eventbrite.com/e/live-stream-noah-gundersen-tickets-101896473094"}]