var sf_events = [{"Address": "44 Race St, San Jose, CA 95126", "Artist": "Late for the Train ", "ArtistImage": "https://photos.bandsintown.com/thumb/11196924.jpeg", "Coordinates": [37.32993087316267, -121.91175789920396], "Date": "2021-07-07", "EventDate": "Jul. 7th, 2021", "Genre": "No genre availableTraditional Celtic,Folk Revival,Bluegrass,Folk,Folk-blues,Traditional Bluegrass,Indie Folk,,,,,,,", "Time": "8:30 PM", "Venue": "Art Boutiki Music Hall", "moreBioInfo": "Late for the Train is a modern string band that feels both fresh and familiar. Drawing heavily from American folk & bluegrass, the San Francisco-based group delivers soulful and articulate arrangements of original and traditional music. The core ensemble consists of songwriters and multi-instrumentalists David Pascoe (guitar/mandolin), Laura Benson (fiddle), and Thom Beneduci (stand-up bass).", "otherInfo": "Late for the Train is an indie-folk string trio rooted in American folk and bluegrass music. Infused with the honest depth of the coastal redwood forests and the heartfel..."}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Rick Preston ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.78097205, -122.40833445460233], "Date": "2021-07-07", "EventDate": "Jul. 7th, 2021", "Genre": "No genre availabl", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "Rick is a great composer, musician and producer, i just love it, im a huge fan a hugeee, for me the greastest song i've ever heard is Chasing the Sun, excellent in many many ways, inspiring and relaxing you have to listen it.", "otherInfo": "The Housepit crew is excited to host the LDP crew for a night of thick vibes, beats for days and all the hugs! ***BOTH FLOORS OPEN***"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Mark Johns ", "ArtistImage": "https://photos.bandsintown.com/thumb/8016746.jpeg", "Coordinates": [37.78097205, -122.40833445460233], "Date": "2021-07-07", "EventDate": "Jul. 7th, 2021", "Genre": "No genre availableWatermelon,", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "The Housepit crew is excited to host the LDP crew for a night of thick vibes, beats for days and all the hugs! ***BOTH FLOORS OPEN***"}, {"Address": "765 Laurel St, San Carlos, CA 94070", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.504345067680404, -122.2584649513785], "Date": "2021-07-07", "EventDate": "Jul. 7th, 2021", "Genre": "No genre availableSinger Songwriter,Cabaret,Broadway,Cover Songs,,,,", "Time": "9:00 PM", "Venue": "Faith & Spirits", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No other event info available"}, {"Address": "701 Jefferson St, Fairfield, CA 94533", "Artist": "Gaby Castro ", "ArtistImage": "https://photos.bandsintown.com/thumb/11473806.jpeg", "Coordinates": [38.249349, -122.042004], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableIndie,Indie Pop,Folk,Country,Folk Rock,Indie Folk,Americana,,,,,,,", "Time": "4:00 PM", "Venue": "Fairfield Farmers Market", "moreBioInfo": "Gaby Castro is an Americana/folk singer-songwriter and San Francisco Bay Area native. Her latest project, La Guerrera//The Warrior EP, was released in March of 2019 and touches on themes such as feminism, self-empowerment, mental health, and overcoming adversity. Her songwriting incorporates the lyrical power of Carole King, infectious hooks of Taylor Swift, and storytelling feel of Jewel. Her latest plans include writing and recording her next album, touring the United States, and continuing to advocate for mental health, women’s rights, and disability rights. Let her music tell the stories.", "otherInfo": "No other event info available"}, {"Address": "6 Petaluma Blvd N a1, Petaluma, CA 94952", "Artist": "Michelle Lambert ", "ArtistImage": "https://photos.bandsintown.com/thumb/11374237.jpeg", "Coordinates": [38.249349, -122.042004], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availablePop,Acoustic Folk Pop,Female Vocals,,,", "Time": "4:30 PM", "Venue": "Michelle at Adobe Road Winery", "moreBioInfo": "“Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!” - Dennis Willis, Soundwaves TV", "otherInfo": "~Reservations Recommended~ Join Michelle at Petaluma's own Adobe Road Winery for an evening of music and award winning wine!\n\nRising star, Michelle Lambert, brings a worl..."}, {"Address": "951 Mariners Island Blvd Suite 300, San Mateo, CA 94404", "Artist": "Seth Kaminsky ", "ArtistImage": "https://photos.bandsintown.com/thumb/8545465.jpeg", "Coordinates": [38.249349, -122.042004], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableAlternative,Pop,,", "Time": "5:00 PM", "Venue": "Thursday Night Makers Market", "moreBioInfo": "Seth Kaminsky is a singer/songwriter from Savannah, Georgia who describes himself as, “just a guy wanting to encourage, relate, and entertain others through some honest acoustic- driven music.\" Originally starting out as a drummer in his middle school band, he quickly developed a love for music and eventually took on the guitar as well as singing while he progressed through high school.   “Creating just always made sense to me as musician,” he says. \"From the very beginning, I saw learning music as a means to create something I could call my own.” Combining his love for honest, relatable lyrics with a desire to engage and connect with people, Seth works relentlessly to create and share his music in an intimate, yet entertaining, way all with a guitar and his voice.  Over the years as he has continued to refine this idea, he has also stayed active in the drumming community. Often times this gift has acted as a door toward finding a platform to share his songs. Today, Seth resides in the Sacramento, California area where he teaches drums and continues sharing his music. His first EP is set to release March 20th.", "otherInfo": "No other event info available"}, {"Address": "45Z90, Livermore, CA 94550", "Artist": "Josh Broom ", "ArtistImage": "https://photos.bandsintown.com/thumb/11493062.jpeg", "Coordinates": [38.249349, -122.042004], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "5:00 PM", "Venue": "Ava Grace Trio @ Concannon Vineyard", "moreBioInfo": "No artist bio available", "otherInfo": "The Ava Grace Trio features Oakdale, California’s Ava Grace, a talented young vocalist who sings in a wide range of styles, including folk, R&B, and indie. Joined by Josh..."}, {"Address": "100 Hooper St Ste. 4, San Francisco, CA 94107", "Artist": "19th Street Station ", "ArtistImage": "https://photos.bandsintown.com/thumb/9021838.jpeg", "Coordinates": [38.249349, -122.042004], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "5:30 PM", "Venue": "Seven Stills Brewery & Distillery gig 5:30-7:30pm", "moreBioInfo": "19th Street Station delicately blends rock, Americana playing original songs and a wide variety of acoustic/electric cover songs.", "otherInfo": "No other event info available"}, {"Address": "1601 Civic Dr, Walnut Creek, CA 94596", "Artist": "Chris Cain ", "ArtistImage": "https://photos.bandsintown.com/thumb/9867583.jpeg", "Coordinates": [37.900911949999994, -122.06345691507288], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableBlues,", "Time": "5:30 PM", "Venue": "Lesher Center for the Arts", "moreBioInfo": "Chris Cain was born in San Jose, California in 1955. His parents were huge music fans and shared their love of blues, jazz and popular music with Chris. His African American father and Greek mother both loved music and had a huge record collection. His father first took Chris to see B.B. King when Chris was three, and, says Cain, “we never missed another show.” Thanks to his parents’ musical passion, young Chris saw almost every blues, jazz and rock artist that came through town, many of them repeatedly -- James Brown, Albert King, Johnny Winter, Jimi Hendrix, even The Beatles. He picked up his first guitar at age eight and learned lick after lick, song after song. He listened to his father’s records over and over until the music had seeped into his soul. Cain formed his first band in 1986, and released his first album in 1987, Late Night City Blues, on the locally-based Blue Rock’It label. Almost immediately, booking agents came calling. Incredibly, he was touring Europe even before he started barnstorming the U.S. The album received four W.C Handy Award nominations (now the Blues Music Awards) and the offers to perform kept rolling in. He even opened for his heroes Albert King and Albert Collins, who both asked Chris to jam on stage. The more Cain toured and recorded, the greater his reputation grew. His releases include four albums on Blue Rock’It and three on Blind Pig Records, and his live performances number in the thousands. Cain has toured all over North America and made repeated trips around the world. He’s performed at the Chicago Blues Festival, The Doheny Blues Festival, The Philadelphia Blues Festival, The Waterfront Blues Festival in Portland, and many others. He’s played concerts and festivals in Argentina, Uruguay, Italy, Spain, France, Belgium, The Netherlands, Sweden, Norway, Switzerland, Australia, New Zealand, Austria, Brazil, Belarus, Canada, Czech Republic, Estonia, Finland, Georgia, Latvia, Lithuania, Romania, Russia and Ukraine.", "otherInfo": "No other event info available"}, {"Address": "4201 Central Pkwy, Dublin, CA 94568", "Artist": "Neon Velvet ", "ArtistImage": "https://photos.bandsintown.com/thumb/6128653.jpeg", "Coordinates": [37.710239, -121.87542987085226], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableYour Red Carpet Dance Party,", "Time": "6:00 PM", "Venue": "Summer Concert Series", "moreBioInfo": "Smoochy The very best new and classic dance hits. Alt Dance & New Wave from the 80s, 90s, and 2000s... sprinkled with a fresh mix of funk and glam.", "otherInfo": "No other event info available"}, {"Address": "4201 Central Pkwy, Dublin, CA 94568", "Artist": "Bray ", "ArtistImage": "https://photos.bandsintown.com/thumb/11002146.jpeg", "Coordinates": [37.710239, -121.87542987085226], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableIndie Pop Rock,", "Time": "6:00 PM", "Venue": "(with Neon Velvet) --- Summer Concert Series", "moreBioInfo": "Bray is a San Francisco-based singer songwriter with the fire and strut of the quintessential rock front-man, the moves and voice of the classic soul-man and the quick self-effacing humor of a beloved talk show host. Ignited by slinky grooves, ultra-catchy pop rock hooks, and a kinetic live performance style, Bray fuels audiences into a feel-good frenzy with every show. Along with his world class backing band, Bray has performed for crowds as large as 50,000 in ten countries around the world, sharing stages with Train, Slash, Scott Weiland and members of The Doors, the Sex Pistols and Prince's Revolution. Named “Best Live Band” by the San Francisco Herald, He and his band were featured in the NARAS (Grammy) San Francisco New Artist Showcase and have gone on to rank in the final 10 for the national Guitar Center contest to perform on the Jimmy Kimmel Show in 2015. While Bray is enjoying his success, he has been honing his craft for years; tracks from his four studio album releases have enjoyed heavy rotation on over 150 CMJ stations nationwide, charting as high as #3. His tunes have appeared in over half a dozen national television shows, as well as MTV Road Rules, VH1 Old Skool and the syndicated reality series Bad Girls Club. Perhaps even more impressively, his cinematic videos (www.youtube.com/braymusic) have garnered more then 4,000,000 views on YouTube. Bray has rocked arenas, festivals, back-rooms and bars during his whirlwind career which includes four European tours), and loved every minute of it!", "otherInfo": "Neon Velvet plays Summer Concert Series in Dublin, CA"}, {"Address": "510 Stevenson St, San Francisco, CA 94103", "Artist": "Tawnee Kendall ", "ArtistImage": "https://photos.bandsintown.com/thumb/11258788.jpeg", "Coordinates": [37.781397874999996, -122.41029741666667], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableCountry,Folk,Americana,Bluegrass,,,,", "Time": "6:00 PM", "Venue": "Tawnee + Kevin: Montesacro", "moreBioInfo": "Tawnee Kendall is a Nashville-sounding independent Folk musician born and raised in the San Francisco Bay Area. Her 2017 EP, Release The Ghost, was dubbed \"heart-on-your-sleeve artistry\" by Huffington Post. Kendall is known for delivering gritty, sultry, and commanding folk melodies which emotionally arrest listeners. Kendall's heartfelt songs and electric live performances are not to be missed. Release The Ghost is available everywhere you stream and download music. Her upcoming EP \"Whale Fall\" is set to release June 2019. LINKS: www.tawneekendall.com YouTube: www.youtube.com/tawneekendall Instagram: www.instagram.com/tawneemusic Facebook: www.facebook.com/tawneemusic Spotify: https://open.spotify.com/user/nixrue/playlist/45uvvA2nz9i5tfujRVlzJx?si=wRHt5E_yR0O4NFR1sD3d2w", "otherInfo": "My FAVORITE restaurant in San Francisco! Come in for some of the best food, incredible wine selection, and top-notch service. Kevin Florian and I will be entertaining you..."}, {"Address": "1 Main St, Los Altos, CA 94022", "Artist": "The Song Gardeners ", "ArtistImage": "https://photos.bandsintown.com/thumb/11461163.jpeg", "Coordinates": [37.380782749999995, -122.11442896439314], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availableIndie,New Age,,", "Time": "6:00 PM", "Venue": "The Song Gardeners @ Enchanté Boutique Hotel", "moreBioInfo": "The Song Gardeners are at the forefront of the New Age Pop genre – creating well-crafted contemporary #chill, #groove, #pop songs with positive, empowering messages. The band includes singer/songwriters and multi-instrumentalists Corrie Dunn and Mary Gospe. Time to Soar, Mary Gospe's debut album of 12 original songs with multi-instrumentalist/producer David Vito Gregoli of Dharmapala Records was released on November 15, 2019. The band has performed at private concerts, retreats, churches, fundraising events, wineries and in cafes and retail businesses. For booking information, email thesonggardeners@gospe.com.", "otherInfo": "Enjoy the New Age pop duo, The Song Gardeners (Corrie Dunn & Mary Gospe), as they perform a two-hour set of original songs with positive, empowering messages and a chill,..."}, {"Address": "4 Valencia St, San Francisco, CA 94103", "Artist": "John Elliott ", "ArtistImage": "https://photos.bandsintown.com/thumb/8687595.jpeg", "Coordinates": [37.7721282, -122.4227728], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "6:30 PM", "Venue": "Martuni's", "moreBioInfo": "http://www.thehereafterishere.com", "otherInfo": "No other event info available"}, {"Address": "100 Boyes Blvd, Sonoma, CA 95476", "Artist": "Clay Bell Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/11435084.jpeg", "Coordinates": [38.31334055, -122.4825827128851], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "6:30 PM", "Venue": "Sonoma Mission Inn, Clay Bell Solo ", "moreBioInfo": "Keeping live music alive", "otherInfo": "Pool side performance"}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "Joey Avery ", "ArtistImage": "https://photos.bandsintown.com/thumb/9508261.jpeg", "Coordinates": [37.7831255, -122.4637116], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "7:00 PM", "Venue": "Neck Of the Woods", "moreBioInfo": "After starting his career in Cape Town, South Africa Joey Avery brought his positive and energetic brand of comedy to San Francisco and received the Jimmy Gunn award for Best Newcomer to the Bay Area comedy scene. He was recently honored by the SF Chronicle as one of the Bay Area's Comics to catch and his 2019 album, Pier 69: Junior Varsity debuted at #1 on iTunes and was featured on the Late Late show with James Corden. Joey has appeared on Fox and AJ+ as well as comedy festivals across the country. He hosts the Chubbies Podcast, is a regular on Uproxx's Filmdrunk podcast, and creates content for Chubbies Entertainment.", "otherInfo": "No other event info available"}, {"Address": "1160 Polk St, San Francisco, CA 94109", "Artist": "Gaucho ", "ArtistImage": "https://photos.bandsintown.com/thumb/11463596.jpeg", "Coordinates": [37.7875516, -122.4199558], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "No genre availabl", "Time": "7:00 PM", "Venue": "Gaucho live at DecoDance", "moreBioInfo": "Gaucho is a masterful Bay Area band that combines the influence of gypsy jazz of 1930’s Europe with the rhythmic drive and collective improvisation of New Orleans swing music, gutbucket blues and elements of ragtime. Their sound, a uniquely American concoction, blends instrumental acuity and lighthearted humor that keep their audience coming back for more. As founder, guitarist, and main composer Dave Ricketts says, the band is “in love with the music of Louis Armstrong, Fats Waller and Jimmie Rodgers, as well as the stories, the life styles and the foot steps of hundreds of other great jazz, blues, country and rock musicians that created the sound of American Music from roughly 1900-1950’s” Led by eminent guitarist, Dave Ricketts, the group has been a San Francisco mainstay for over fifteen years, and one of the busiest bands in the bay area playing 5 to 10 gigs a week. Together with virtuosos Rob Reich–accordion and Craig Venetresco–guitar, superlative bassist Ari Munkres and versatile percussionist Steve Apple, these guys keep crowds moving with their beats and complex rhythms. Gaucho has recorded seven albums, tours regularly, and has an increasing repertoire of over forty original tunes. Seven of their tunes are featured in the 2012 film \"Trattoria\"; one was chosen by the Metropolitan Museum of Art for their website; and another is featured in the outtakes section of the Pixar DVD CARS 2.", "otherInfo": "No other event info available"}]