var nyc_events = [{"Address": "Santa Rosa , CA", "Artist": "KINGSBOROUGH ", "ArtistImage": "https://photos.bandsintown.com/thumb/9307673.jpeg", "Coordinates": [-122.7144, 38.4405], "Date": "Thu Apr 23 2020", "EventDate": "2020-04-23", "Genre": "Rock, Rock Blues, Alternative, Southern Rock", "Time": "2:00 AM UTC", "Venue": "Kingsborough at the Nest", "moreBioInfo": "Frontman Billy Kingsborough and lead guitarist Alex Leach of San Francisco’s Kingsborough are determined to connect with audiences both on record and on stage. Influenced by the sounds and songwriting of The Beatles, The Black Keys, and Led Zeppelin, Kingsborough form a bond with fans by unleashing a brand of potent rock n’ roll that No Depression calls “laced with a vintage elegance that appeals to an ever-changing audience.”\n\nProduced by Grammy-nominated producer Damien Page Lewis (Rihanna, Katy Perry), Kingsborough’s second album, 1544, turned out the singles “Low Down\" and “Subtle Lies.” Both tracks spent six weeks in the top 200 of American college radio and as featured tracks on Spotify’s Blues & Roots Rock playlist.\n\nKingsborough match the radio success of 1544 with an equally compelling live show. With lead singer Kingsborough projecting what The Bay Bridged describes as “the animation of a live wire,” the rest of the band more than hold their own on stage via heavy grooves, classic riffs, and soaring solos.\n\nAccording to Leach, Kingsborough views each live performance as an opportunity to break down the walls that often separate artists and audiences:\n\n“On stage, we try to recreate the energy and emotion that inspired the songs, all with the hope that we can connect with people. We want our shows to be a conversation with our audience, a back and forth flow of energy. If we can allow them to escape for a few hours, we feel good about what we’ve done.”\n\nThis purposeful plan of action for the stage has paid great dividends: Kingsborough’s infectious live energy has earned them opening slots for Dorothy, Joan Jett, Robert Cray, and ZZ Top.\n\nBilly Kingsborough and Leach formed Kingsborough in 2010 as a gritty rock n’ roll band with roots in the blues. Inspired by their musical heroes of yesteryear and countless voyages across the Golden Gate Bridge, Kingsborough and Leach immediately began penning songs about love, loss, and lost identities.\n\nNever ones to tolerate complacency, the band are now prepared to take Kingsborough to new places. They will enter the studio in 2019 to record an album that Leach calls “evidence of our sonic evolution.” Their tour of Europe in early 2020 will support that album. All the while, Kingsborough intend to soak up new inspirations and influences by collaborating with some of the Bay Area’s most accomplished musicians.\n\nKingsborough and Leach are eager to embrace the bliss and the blues that come from running headfirst into the unknown. They are, however, most excited about the countless new faces and stories that await them on their journey.", "otherInfo": "Join Billy Kingsborough and Alex Leach of Kingsborough for Kingsborough Thirsty Thursday's! Pour a cocktail and watch Billy and Al spin their favorite albums, talk about their favorite local brews and maybe a few songs! CDs, Vinyl and T-shirts are available!\n\n\nLink to MERCH\nhttps://bit.ly/2JFy7uA\n\nVenmo: @billy-kingsborough\n\nPaypal:\nhttps://www.paypal.me/kingsboroughmusic"}]