var nyc_events = [{"Address": "222 Summer St, Stamford, CT 06901", "Artist": "Acoustic Mafia ", "ArtistImage": "https://photos.bandsintown.com/thumb/8644732.jpeg", "Coordinates": [-73.540816, 41.054948], "Date": "Sun Apr 12 2020", "EventDate": "2020-04-12", "Genre": "Pop, Acoustic, Rock", "Time": "11:00 PM UTC", "Venue": "Barcelona Wine Bar", "moreBioInfo": "CT duo. Listen on Spotify, Apple Music & SiriusXM!", "otherInfo": "No other event info available"}, {"Address": "216 Central Ave, White Plains, NY 10606", "Artist": "Dario Chiazzolino ", "ArtistImage": "https://photos.bandsintown.com/thumb/9166210.jpeg", "Coordinates": [-73.780652, 41.036251], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Progressive Jazz, World Fusion, Jazz", "Time": "8:00 PM UTC", "Venue": "Music Conservatory Of Westchester", "moreBioInfo": "Internationally acclaimed artist Dario Chiazzolino is deemed as one of the most considerable today's jazz guitarists. Well- known as phenomenal player with a significant musical personality, he has performed all over the world both as band leader and side man with many of the top American and European jazz artists including Yellow Jackets, Billy Cobham, Bob Mintzer, Horacio \"El Negro\" Hernandez, Andy Sheppard, Dominique Di Piazza, Jason Rebello and many others. According to famous USA Magazine Guitar World, Dario particularly impresses thanks to his innovative improvisational skill. His phrasing is unpredictable and looks forward into the future.\nThe young guitarist/composer is one of the biggest breakout musicians of the new generation - not just in jazz, but in all genres of music.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "T O S H ", "ArtistImage": "https://photos.bandsintown.com/thumb/10013227.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Jam Rock, Roots Rock", "Time": "10:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "TOSH is an original roots rock band led by Tosh Sheridan from New York City. Their sound is a mix of Tom Petty, Neil Young and Dire Straits. The band formed in 2014 as an instrumental blues/rock band. They released an EP entitled Tosh Sheridan Trio and performed throughout the tri-state area playing clubs and festivals.\nAs the band developed Tosh started adding vocals and the band grew into a roots rock group that has powerful melodic hooks with a raw edge.\n\nTheir full length, debut self-titled album TOSH is a mix of tightly crafted rock songs with a taste of jam band improvisation.", "otherInfo": "Stage 1"}, {"Address": "New York City, NY", "Artist": "Nick Finzer ", "ArtistImage": "https://photos.bandsintown.com/thumb/4913357.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Post Bop, Modern Jazz, Trombone Jazz, Jazz, Trombone", "Time": "11:00 PM UTC", "Venue": "Facebook Live", "moreBioInfo": "NICK FINZER...\n\n...is one of the most dynamic musicians of the millennial generation.\n\nAn award-winning composer, arranger, and trombonist, Finzer is bringing the joy and power of Jazz to both traditional fans and the most modern 21st century audiences. He’s on a mission to be a passionate voice defining the sound of Jazz in this age while also bringing street cred to the trombone with a bold, tight sound.\n\nBorn into the musical world (Mom Sherry Finzer is an international flutist), Finzer developed a fascination for the music of Duke Ellington and found himself, in high school, performing at the annual Essentially Ellington competition of Jazz at Lincoln Center. It was then that he decided to pursue a life in music himself. His budding talent was recognized by Wycliffe Gordon who began a life-long mentorship by writing four pieces for the young Finzer while he attended the Eastman School of Music. Nick went on to get his masters at Juilliard’s prestigious Jazz program where he was mentored by the trombone legend Steve Turre.\n\nIn 2011 Nick was the winner of the Eastern Trombone Workshop’s National Jazz Trombone Competition and was a finalist in the 2010 International Trombone Association’s Carl Fontana Jazz Trombone Competition.\n\nIn January of 2013 Nick released his recording debut as a bandleader and composer with “Exposition” (Outside In Music). Two tracks appearing on the album garnered Finzer a pair of accolades: The prestigious American Society of Composers and Performers (ASCAP)’s Herb Alpert Award for young composers (2013 & 2015)\n\nIn 2014, Nick composed a new album-length work, “The Chase.” Nick's sophomore album debuted in July of 2015 on Origin Records to rave reviews, a feature article in Downbeat Magazine, and peaked at #6 on the JazzWeek Charts.\n\nFamed trombonist and mentor Wycliffe Gordon called Finzer “a new voice [in] the pantheon of upcoming trombone greats in the making” and added “Nick's CD is a glowing example of things to come.”\n\nWhen away from NYC, Finzer can be found touring the globe not only with his own projects, but as part of YouTube sensation, Scott Bradlee’s Postmodern Jukebox. Finzer has joined the group on television, in viral videos with millions of views, and on tours across North America, Australia, New Zealand and Europe.\n\nFinzer has performed at top Jazz clubs and concert halls with Wynton Marsalis’ Jazz at Lincoln Center Orchestra, Lucas Pino’s No Net Nonet, Ryan Truesdell's Gil Evans Project, Bob Stewart’s Double Quartet, Frank Wess, Terrell Stafford, Lewis Nash, the Tommy Dorsey Orchestra, Walt Weiskopf, Slide Hampton, Frank Kimbrough, Carl Allen, Steve Turre and many more.", "otherInfo": "Live Stream: https://www.outsideinmusic.com/live"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "The Head (Official) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9501307.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Atlanta, Georgia", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "155 Varick St, New York, NY 10013", "Artist": "Sinéad O'Connor ", "ArtistImage": "https://photos.bandsintown.com/thumb/10272124.jpeg", "Coordinates": [-74.00575, 40.72642], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "City Winery", "moreBioInfo": "Sinéad Marie Bernadette O'Connor (born December 8, 1966) is a Grammy Award-winning Irish singer and songwriter. Brash and outspoken — her shaven head, angry visage, and shapeless wardrobe a direct challenge to the popular culture's long-prevailing notions of femininity and sexuality — O'Connor irrevocably altered the image of women in rock; railing against long-standing stereotypes simply by asserting herself not as a sex object but as a serious artist, she kick-started a revolt which led the way for many female performers. O'Connor ranked among the most distinctive and controversial popular music stars of the 1990s, the first and in many ways the most influential of the numerous female performers whose music dominated airwaves throughout the decade. Her first album, The Lion and The Cobra, was released in 1987, and its popular and critical acclaim made her a star of pop music. She produced her second album, I Do Not Want What I Haven't Got, a critical success that included her hit single \"Nothing Compares 2 U,\" a song written by Prince. O'Connor was as well-known for her political beliefs as for her music (she once shredded a photo of Pope John Paul II on U.S. television), but in recent years she has been less publicly controversial. In 2003 she announced her retirement from the music business. In 2000 released her album \"Faith and Courage\". Another album, Throw Down Your Arms was released in 2005. Her newest release is a double CD, Theology, being released in June 2007.\n\nCurrently working with Ian Brown (former The Stone Roses frontman).", "otherInfo": "It is with deep regret that we must inform you that the Sinead O’Connor City Winery shows scheduled for March and April 2020 have been postponed due to all our concerns with the recent developments concerning the spread of COVID-19. City Winery did everything possible to keep the shows running but priority for them as well as us is the safety and well-being of guests, artists, and staff. With recommendations that there be no gatherings of more than 250 people, even with their social distancing venue layout, we have collectively taken it under advisement that a rescheduling is in the benefit of the public good. We apologize for the notice, as the situation has changed rapidly and we are responding accordingly. We are diligently working to provide new upcoming future dates and will update as soon as it’s finalized.\n\nAlso, due to the current corona virus emergency, the 4/7/20 concert with Sinead O’Connor has been postponed. The Birchmere and Ticketmaster will notify patrons as to the rescheduled date. Please hang on to your tickets until we have more info. We appreciate your patience during these difficult time.\n\n\nWhile this decision comes at a time of universal uncertainty, we take the safety and health of all involved with Sinead O'Connor very seriously.\n\nWe would like to thank all at City Winery, The Birchmere, ICM Partners, and Ms O'Connor's band and crew for their honourable and consummate professionalism under the most challenging of circumstances - and to Sinead O'Connor for doing all in her power to assure the safety & well being of her band, crew and in assuring her fans that the show will go on...\n\n\n\n67 Management"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Mipso ", "ArtistImage": "https://photos.bandsintown.com/thumb/9951851.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Americana, Folk, Bluegrass", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Chapel Hill’s indie Americana quartet Mipso – Jacob Sharp (mandolin, vocals), Wood Robinson (bass, vocals), Joseph Terrell (guitar, vocals), and Libby Rodenbough (fiddle, vocals) – release their fifth album, Edges Run, on April 6th, 2018 via a newly inked record deal with AntiFragile Music. Influenced by the contradiction of its progressive home and the surrounding rural southern landscapes, Mipso has been hailed as “hewing surprisingly close to gospel and folk while still sounding modern and secular” (Acoustic Guitar) and was recently recognized by Rolling Stone as an “ Artist You Need to Know.” The band brings a distinctly unique sound – full of wistful beauty, hopeful undercurrents, and panoramic soundscapes. Venturing ever-further from its string-band pedigree to discover a broader Americana where classic folk-rock and modern alt-country sounds mingle easily with Appalachian tradition, Mipso’s music is lush and forward moving, with lyrics that sear and salve in turn. Look for Mipso on tour across the U.S. and Canada this summer.", "otherInfo": "Mipso w/ Taylor Ashton\nand guests Steph Coleman and Alec Spiegleman\n\nMipso is born from North Carolina’s broad range of disparate musical influences, their distinctly unique sound an undeniable alchemy of the historical musical traditions of the rural south and their progressive home of Chapel Hill.\n\nA discernible and rising force in the upstart musical genre known as Americana, Mipso’s music is lush and forward moving. A tender, harmony-laden river runs through the band’s core, but the rocky outcroppings change with every album outing. Appalachia melds with modern alt-country, hints of folk-rock are leavened with a sly and subversive sense of humor, and underneath it all is a genuine and moving passion for the ever-evolving traditions of Americana."}, {"Address": "4 Pennsylvania Plz, New York, NY 10001", "Artist": "Alan Darcy Music! ", "ArtistImage": "https://photos.bandsintown.com/thumb/6076824.jpeg", "Coordinates": [-73.99, 40.75], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Flute, Jazz, Vocals, Pop, Sax", "Time": "11:00 PM UTC", "Venue": "Madison Square Garden", "moreBioInfo": "A talent inspired by the likes of Eric Marienthal, David Sanborn, Billy Joel, Sting and Harry Connick, Jr., the New York native has a vision and passion for all that is music-especially jazz. This passion is continually reflected in his eclectic and exciting performances, compositions and recordings. Alan’s saxophone speaks to the hearts of his listeners and his melodies elicit the full spectrum of emotions – inspiring the soul and leaving fans wanting more. Known for his innovative spirit and broad musical scope, Alan is equally at home on the stages of the country’s notable venues, ranging from the famous “Birdland” in NYC to the Historic Tampa Theater. He has released four CD's with Rebel Records and is currently in the recording studio working on his 5th album, \"MOMENTUM\" to be released in 2012. Alan has been honored to be one of the fan favorite saxophonists invited to perform at \"Saxes Gone Wild\" two years in a row! He makes regular appearances on local television and radio wherever he performs, and is always expanding his skills as an instrumentalist, composer and performer. Alan is also committed to furthering the future of music in the classroom and has dedicated much of his time to music education and community activities. In 2004 Alan worked closely with the Florida Chapter of the National Academy of Recording Arts and Sciences on its annual Grammy in the Schools High School program as a featured performer. For several years, beginning in 1990 Alan joined Tampa’s Artists in the Schools Program and spearheaded the wildly popular “Santa Claus and Saxophones,” concerts to further music interest and education. Alan performed for several hundred elementary school students during the holiday season where he was able to inspire and enlighten young musicians from across the region. Whether on the stage, in the recording studio, in the classroom or in the community Alan Darcy represents a commitment to musical excellence and a steadfast determination to keep the music at the forefront. www.alandarcy.com Rebel Records/813-997-7299/Saxophonist, Flutist, Vocalist. Songwriter/Recording Artist. Entertainer. Life IS Good! All is Well. www.AlanDarcy.com", "otherInfo": "No other event info available"}, {"Address": "20 Lincoln Ctr Plaza, New York, NY 10023", "Artist": "Alison Clancy ", "ArtistImage": "https://photos.bandsintown.com/thumb/7185169.jpeg", "Coordinates": [-73.98109, 40.77084], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Electro Rock, Altpop, Psychadelic Disco, Dream Pop, Alternative", "Time": "11:30 PM UTC", "Venue": "Metropolitan Opera", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "183 W 10th St, New York, NY 10014", "Artist": "Ari Hoenig ", "ArtistImage": "https://photos.bandsintown.com/thumb/8224716.jpeg", "Coordinates": [-74.002722, 40.734367], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Brooklyn, New York", "Time": "11:30 PM UTC", "Venue": "Smalls Jazz Club", "moreBioInfo": "Ari Hoenig (born on November 13, 1973 in Philadelphia, Pennsylvania), is a New York based jazz drummer, composer and educator known for his unusual and intense approach to drumming emphasizing complex rhythms in direct harmony with other group members. Ari is widely noted particularly for his drumming not being relegated to just keeping tempo, or being a side issue to the music he plays in, but rather for elevating drumming as an indispensable part of the performance.", "otherInfo": "No other event info available"}, {"Address": "66 North 6th St, Brooklyn, NY 11211", "Artist": "Laura Marling ", "ArtistImage": "https://photos.bandsintown.com/thumb/7211557.jpeg", "Coordinates": [-73.96168, 40.71925], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Folk", "Time": "12:00 AM UTC", "Venue": "Music Hall of Williamsburg", "moreBioInfo": "There is a line from Virgil’s epic poem The Aeneid that nearly a decade ago Laura Marling decided to have tattooed on her leg: “Varium et mutabile semper femina” it runs, translating roughly as “A woman is an ever fickle and changeable thing.” Realizing that the line was a little long for the limb, at the very last moment she opted instead for an abbreviation: “Semper femina” she chose: “Always a woman.” It makes a fitting and fascinating title for Marling’s sixth album — an intimate, devoted exploration of femininity and female relationships, and among her finest work to date. Written largely on the tour that followed 2015’s Short Movie and recorded in Los Angeles with production from Blake Mills, it is at once a distinctive and musically compelling collection of songs, run through with Marling’s fierce intelligence; a keen, beautiful and unparalleled take on womanhood.\n\n“I started out writing it as if a man was writing about a woman,” Marling says. “And then I thought it’s not a man, it’s me — I don’t need to pretend it’s a man to justify the intimacy of the way I’m looking and feeling about women. It’s me looking specifically at women and feeling great empathy towards them and by proxy towards myself.”\n\nThe songs grew out of what Marling regards as “a masculine time” in her life. “A certain time when I’d sort of gone on this trip of abandoning any sexuality,” she says. “Now in retrospect I was hopped up on the times, but I was living in LA, and LA does have an amazing knack for removing sexuality. I found it quite scary; I was scared of what I perceived to be the disappearance of my feminine side. But it gave me an ability to look at women in a different way and consider how I’d been looked at.”\n\nIn retrospect there was a precursor to this strange period of her life — Short Movie had been concerned with the breaking down of the ego, “And then I guess piecing back together an ego you get to see it in all its parts,” she says. “And tied in with this was the magical realism of living in LA.” Having spent several years in Los Angeles, Marling now splits her time between the UK and California. “And LA makes me feel very different to England,” she says. “Now my love affair with LA is at a point where I don’t really leave my house and all my friends are English. It’s a great place to be, but it’s not an enticing fantastical adventure anymore, and I think the election has brought that home.”\n\nMarling’s exploration of femininity is as broad as it is tender. On tracks such as Wild Once she was interested in the archetype of the wild woman and her unrestrained physicality. “In the more masculine phase of my life I got really into hiking and bouldering, scrambling up trees or whatever,” she explains. “And I just hadn’t exercised that part of myself for such a long time, and it was felt fantastic. It touched something that was really sweet and innocent. At a time when I couldn’t really find that center, I was touching on it running through a forest by Big Sur with no shoes on.”\n\nElsewhere she’s looking at “What’s been forbidden to me in female relationships in all forms, and at female empathy between each other, and friendships that have been really intense.” On The Valley, for instance, a track she calls “a bit of an English nostalgia trip” she writes about “broken female friendships, and how that feels to be betrayed or betray a friend or a woman in any way.”\n\nThe nature of female friendship has been a long-standing interest for Marling. “And again it’s blurred as you open up the boundaries more,” she says. “But the falling in love that you experience with friendship is so less defined than romantic or sexual love. I’ve been obsessed with that always I think,” she says. “Because I have sisters maybe, and a mother. And I think because of that there’s a high standard of trust and care that I place on myself and that I feel in my female friends as well — we have quite a high empathetic standard for each other. So I feel when that’s broken it’s so powerful. And I’m guilty of that in many respects because I’m so absent-minded. Until now I just hadn’t really thought about that being a subject matter for a song, but when I tapped into the sadness of that, or the regret, or the feeling of being on the other side of that, I found that quite a fruitful well of stuff. So there’s a lot of that on this record, that trying to make amends for those sort of broken channels.”\n\nShe also became fascinated by the life of the psychoanalyst Lou Andreas-Salome. “I came across her by accident through a love letter that [Rainer Maria] Rilke wrote,” Marling says. “I was obsessed with Rilke, and he wrote about her being the only tangible thing that he’d ever encountered in his life — the famous quote is ‘You alone are real to me’.” Marling read about Andreas-Salome extensively — from her upbringing in Russia, through her intellectual and romantic relationships with figures such as Paul Ree, Friedrich Nietzsche and Sigmund Freud, her unconsummated marriage to Friedrich Carl Andreas, and her passionate affair with Rilke which led to his Duino elegies.\n\nRather than her relationships with famous male figures it was Andreas-Salome’s own psychoanalytic research that Marling found particularly interesting: “Just before Freud died she wrote him a letter saying ‘I’ve been doing some research into the feminine psyche and I think you’ve got it completely wrong. Penis envy is an invention of man because women’s sexuality by its nature is internal and self-perpetuating, so there’s no lack of this or need of that. It’s this internal, inherently creative thing without men.’ And Freud wrote to her and said this is amazing and this is true, but he died two months later so it never got published. And that blew my mind. Imagine! It would’ve changed the entire psyche of the western world.”\n\nThese thoughts were shaped further by Marling’s ongoing podcast project Reversal of the Muse which saw her interviewing women from across the music industry — from famed singers such as Dolly Parton and Emmylou Harris to female sound engineers, and guitar shop owners, discussing the nature and shape of female creativity. “I would say that feminine creativity, the feminine part of the brain is in both sexes, but is inherently different to the masculine,” she says, “I had a lot of chats with Blake about how we started playing guitar,” she says, “and he said ‘I started playing because I wanted to impress girls- though I suspect that was a flippant remark rather than the whole truth. But it worked as an example as that was obviously so different to why I started playing guitar — that was never in my brain to impress boys; “and for me, playing guitar has always been tied up with my identity, it’s always been involved in myself, rather than enticing people in.”\n\nHaving produced Short Movie herself, Marling decided to enlist Mills as producer for Semper Femina. “I really enjoyed producing but it’s just not my calling,” she says. “I’d love to do it for someone else, but for myself it was too difficult to play both roles. Making the podcasts I discovered I play off the vulnerability of being a solo human being, playing a very vulnerable song in front of a microphone with six people in a control room. It’s a weird dynamic, but it has always worked for me. A lot of songwriters I know can’t bear to be overheard when they’re songwriting, but I quite like it — I write in venues or dressing rooms when there are eight people in the room. There’s something thrilling and weirdly voyeuristic about it. But I like the idea that it will be heard, and if I’m producing it feels like it might only be heard by me.”\n\nLooking for a producer, and already a fan of his music, she was told that Mills had written a list of people he wanted to work with and that her name was on it. This is not to say recording was always straightforward, and working with a new, male producer brought familiar challenges for Marling. “I think Blake was very sweetly not sure what to do with an English girl,” she says. “It took a week or two to shake off the very set image of what I was in his mind — a very romping through the countryside delicate character from Emma. And I’ve had that so many times. And in some ways I’m think you can keep that image of me, but in other ways I have to break it in order to get work done, because it’s a really heavy block between you and what you want to get done. And also because I’d just come from producing a record myself I had to get rid of that idea of delicacy.”\n\nMore than anything on Semper Femina Marling addresses the space between the perceptions and realities of being a woman, the space in which women are not frail but powerful, creative and abundant figures. “When I was a teenager in my head you were either this delicate tragedy or you were a muse,” she says. “And they’re both such horrifyingly subjugated roles. But our culture loves female tragedy. That’s just been so ingrained over and over again, and there haven’t been enough examples of a written alternative. My main focus is re-writing the idea of tragic woman.”\n\nIf Marling sounds galvanized it’s because this album marks a shift in her career. “The time and the political climate that we live in, we’re coming to a point where there’s no need for this sort of artistic expression that I’ve been a part of,” she says. “Innocent creativity had a little flourish in the last ten years. But also I’m getting older and now I think ‘What use is that?’ It’s not rooted, not pointed, not political. For me right now I feel like it’s more important that I have a practical use.”", "otherInfo": "Laura Marling"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "The Swayzees ", "ArtistImage": "https://photos.bandsintown.com/thumb/9196258.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Soul, Surf, Rockabilly, Rock-n-roll", "Time": "12:00 AM UTC", "Venue": "Pianos", "moreBioInfo": "From surf rock to doo wop, rockabilly to beach music, Patrick & The Swayzees have created a current, yet still wholly nostalgic blend of early rock ‘n’ roll sounds that bring crowds to their feet from opening to encore. Their sets include original songs and instrumentals as well as a mix of well-known, crowd favorite cover tunes, so there’s something for everyone.\n\nThe Swayzees have taken the local Key West music scene by storm in a matter of only months — playing regular gigs at some of the most famous music establishments on the island. Now you can catch them performing from Miami to NYC!", "otherInfo": "No other event info available"}, {"Address": "442 Amsterdam Ave, New York, NY 10024", "Artist": "Benny Benack Jazz ", "ArtistImage": "https://photos.bandsintown.com/thumb/8541231.jpeg", "Coordinates": [-73.97741, 40.784702], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Jazz", "Time": "12:30 AM UTC", "Venue": "The Gin Mill", "moreBioInfo": "At the age of 25, Pittsburgh-born musician Benny Benack III has been hailed by Nate Chinen of the New York Times as “a charismatic young trumpeter who maintains an earnest sideline as a singer”. As a dual-threat, he’s quickly established himself as one of the most versatile and virtuosic voices of his generation.\n\nHe first made his mark internationally through competitions, winning the Carmine Caruso International Jazz Trumpet Soloist Competition (2011), National Trumpet Competition for Jazz (2010), International Trumpet Guild Jazz Competition (2010), and was most recently a Finalist for the prestigious Thelonius Monk International Jazz Competition (2014). Demonstrating his versatility, he also was a Finalist in two vocal competitions, the Gentlemen Sing Competition (2013) and the Mid-Atlantic Jazz Festival Vocalist Competition (2014).\n\nDelivering on the promise of his early career, he has since recorded albums as a sideman for musicians such as Ulysses Owens Jr., Michael Dease, and Chihiro Yamanaka, the latter on the iconic Blue Note Records label. Sought after as a trumpet soloist, he's played in nearly every major big band, including the Christian McBride Big Band, Mingus Big Band, Dizzy Gillespie Alumni All-Stars, Jimmy Heath Big Band, and Bobby Sanabria's Afro-Cuban Jazz Orchestra. An international touring schedule includes frequent engagements in Japan, Mexico, Russia, and most recently, Italy. When not on the road, he calls NYC home, and remains in-demand at the finest jazz venues in town, leading engagements at Jazz @ Lincoln Center’s “Dizzy’s Club Coca-Cola”, The Blue Note, Birdland, SMOKE, Small’s, Fat Cat & the Iridium to name a few.\n\nHe is featured as a vocalist during Jazz @ Lincoln Center’s upcoming 2016 Concert Series in the Appel Room, as a part of “Crooners” celebrating Bing Crosby, Mel Torme & Nat King Cole. He will soon be making his television debut, featured live on-air in the band for NBC's upcoming variety/comedy show \"Maya & Martin\" in June 2016.\n\nAs an educator, Benack is highly sought after around the country as a clinician and masterclass presenter, known for his engaging and enthusiastic style with students. Throughout many schools, he leads The Benny Benack Band on behalf of Jazz @ Lincoln Center’s “Jazz For Young People” outreach program, as well as programs at the National Jazz Museum in Harlem, and is currently a Teaching Artist for the NY Pops Education Outreach Program.\n\nHe is a two-time graduate of the Manhattan School of Music, obtaining his Master of Music degree in (2015). He is endorsed by Torpedo Bag cases, and Carol Brass flugelhorns.", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Svetlana ", "ArtistImage": "https://photos.bandsintown.com/thumb/9301408.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Jazz, Sophisti-pop, Swing", "Time": "1:00 AM UTC", "Venue": "Back Room - CANCELLED", "moreBioInfo": "\"Breakfast at Tiffany's Meets Some Like It Hot\" (Lucid Culture)\n\"Outstanding vocalist\" (Wall Street Journal)", "otherInfo": "No other event info available"}, {"Address": "1000 Morris Ave, Union, NJ 07083", "Artist": "Mark Toland ", "ArtistImage": "https://photos.bandsintown.com/thumb/8645060.jpeg", "Coordinates": [-74.233109, 40.680565], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Variety", "Time": "6:00 PM UTC", "Venue": "Kean University", "moreBioInfo": "Mind Reader\n\n\"Mind Blowing!\" - The Chicago Tribune\n\"The best we've ever seen!\" - Windy City Live\n\"He must be THE DEVIL.\" - WGN TV\n\n2-Time TEDx Speaker\nAs Seen On: NBC, ABC, WGN, CBS, NPR, Sirius XM, and more\n\"Chicago Theater Award - Best Special Event\"\n\"Best of Fringe\" - FRIGID NYC\n\"Audience Choice\" - FRIGIC NYC\n\"Pick of Fringe\" - Orlando Fringe\n\"Best of Fringe\" - KC Fringe\n\"Top Selling Show\" - Chicago Fringe", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Grace Minnick ", "ArtistImage": "https://photos.bandsintown.com/thumb/10105490.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Folk, Cobalt", "Time": "10:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Grace Minnick’s crafted, story-centered lyrics move people to laugh, cry, and sing along. Her cobalt-Blues soprano voice floats over warm acoustic instruments. Her musical influences – The Beatles, Joni Mitchell, choral music, and Blues rock – infuse her Folk sound with elements of the 60’s and 70’s. Grace currently writes, creates, and performs new songs around Indiana, leading her own band as well as adding harmonies and instrumentation to the Addison Agen Band and the Jenn Cristy Band. Grace recently released a music video for her song “Eyes” from her latest album Mostly Home. https://youtu.be/d-1g7qMi86g", "otherInfo": "No other event info available"}, {"Address": "18 W 18th St, New York, NY 10011", "Artist": "Samuel Miller ", "ArtistImage": "https://photos.bandsintown.com/thumb/10251295.jpeg", "Coordinates": [-73.993278, 40.739003], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "10:00 PM UTC", "Venue": "Books of Wonder", "moreBioInfo": "author - a lite too bright (harper-collins, 2018)", "otherInfo": "Samuel Miller, along with Cole and Jordan of Paradise Fears, bring the Redemption Prep Book Tour to Books of Wonder in New York City!"}, {"Address": "6 Delancey St, New York, NY 10002", "Artist": "Lime Cordiale ", "ArtistImage": "https://photos.bandsintown.com/thumb/9055034.jpeg", "Coordinates": [-73.993383, 40.720353], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Indie, Alternative", "Time": "10:00 PM UTC", "Venue": "Bowery Ballroom", "moreBioInfo": "Hailing from Sydney’s northern beaches, brothers Oli and Louis Leimbach of Lime Cordiale command legions of dedicated fans with their incredible live set. They say there’s an innate bond between siblings, a relationship is forged that can last a lifetime. Now, take that intuitive understanding and translate it into music; magic can happen. This is exactly the case for the brothers of Lime Cordiale, whom growing up within a creative, musical family on Sydney’s Northern Beaches, it was natural for the pair to make music together.\n\nLime Cordiale express their feelings that people need to break the rules in order to progress, with Oli stating “you don't have to take the conservative route. You don't need to necessarily plan out your life in your twenties or thirties”. With the brothers compassionate and progressive awareness, the band are focussed on using their love of music to keep Sydney’s music scene alive, along with the support from their surrounding communities and the Australian community as a whole.\nIt’s no surprise that the pair are passionate, and overly sensitive to the effect humans have on Australia’s environment after being raised on an island home and in coastal areas while growing up. The band’s vegan lifestyle and plastic free rider may not be to everyone’s tastes, but their response is simply - “fuck ‘em”.\nIn addition to the hectic schedule and life-band balance, Louis is an avid artist holding regular showcases, but notes that whether he is cutting lino or painting, this side of his life is kept secluded, “Lino cutting is a very time-consuming art form, requires a lot of attention and I find myself doing it alone” says Louis. His art form though does cross over to band-life, with Louis designing all album art, posters and merchandise and states that the creative process can take time to think up ideas and sometimes his work can get so out of control he has to go into hiding, but he calls it “meditative and an escape” and likes the process itself over the end result.\n\nWhen they aren’t busy playing shows, cutting footage for films or designing some form of artwork, Oli and Louis return to their roots, the ocean. Though they love being close to the CBD, sometimes the inner-city pressure means they need to get back to the freedom that the ocean can give, Oli tells “you can be working in the dirt and grind of the city just behind you, but out there on the waves the world is yours”.\n\nLime Cordiale received no airplay from triple j, FBI or commercial radio with the release of their debut album “Permanent Vacation” in Oct 2017, but this essentially underground band was in no need of the tastemaker radios support. Lime Cordiale were happy touring Australia, brewing a strong following along the way. With the release of their single “Dirt Cheap” (Nov – 18) the band exploded to the charts of triple j, then after only 3 short months the single placed #86 on triple j’s infamous Hottest 100 countdown.\n\nIn Feb 2019, Lime Cordiale released their latest single “Money” to accompany their fast selling tour of the same name. The extensive run of shows includes Melbourne, New Zealand and Sydney, and will continue in April to Tasmania, Adelaide, Western Australia and regional New South Wales. So far selling out every show (bar one) they’ve performed (14/20 sold out) and over 5300+ tickets sold. Meanwhile the single was succeeding by its own right, featuring on Spotify’s New Music Friday, iTunes’ Best of the Week and by week 2 was #1 most played on triple j.\n\nThe road ahead looks bright and busy for Sydney based band Lime Cordiale, with a new album just over the horizon and a long-awaited European tour set to unite their international audiences.", "otherInfo": "No other event info available"}, {"Address": "95 Stanton St, New York, NY 10002", "Artist": "Added Color ", "ArtistImage": "https://photos.bandsintown.com/thumb/8970633.jpeg", "Coordinates": [-73.988383, 40.721329], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Daniel Freiberg - drums/vocals, Danny Dahan- bass, Tim Haggerty- guitar/vocals, Kiko Freiberg - guitar/vocals", "Time": "11:00 PM UTC", "Venue": "Arlene's Grocery", "moreBioInfo": "ADDED COLOR is a Brazilian/American rock band formed in Brooklyn, NY and is comprised of brothers Daniel and Kiko Freiberg (São Paulo), Tim Haggerty (Boston), and Danny Dahan (Washington DC). Added Color has played close to 200 shows in over 20 states in the USA, and toured internationally playing a mini-tour in Canada, a two week tour in Morocco and major festivals in Brazil such as Porão do Rock, which has featured Muse, Eagles of Death Metal, among others. The Monsters of Rock Festival officially nominated them as one of five of Brazil’s upcoming rock bands. The band has received critical praise from PureVolume, Red Bull Music, The Huffington Post, AOL Noisecreep, and was chosen as a \"must see show\" by The Village Voice.", "otherInfo": "Added Color, Paragnosis, Aaron Waldman, and Ciggy at Arlene's Grocery (NYC)"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Whitacre ", "ArtistImage": "https://photos.bandsintown.com/thumb/9927306.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Folk Rock, Folk", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "With over 500,000 streams on Spotify, sold out shows with Mt. Joy, Susto and Birdtalker in 2018 alone and 100+ other performances under their belt, Whitacre is a group blurring the lines of folk, indie rock and bluegrass music. Their brand of folk-rock combines thought-provoking lyrics and high-energy live performances that led to tours with Family and Friends, Wilderado and Wild Rivers. Whitacre recently partnered with Denver producer, Joe Richmond (of Tennis, Churchill) on a 5 song EP ‘Within The Mountains’ Shadows’ out October 26th, 2018.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Alisa Amador ", "ArtistImage": "https://photos.bandsintown.com/thumb/9499139.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Folk, Folk Jazz, Funk, Latin, Latin Folk, Folk Rock, Indie, Jazz, Blues", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Alisa Amador’s music is a synthesis of the many styles she’s voraciously absorbed: rock, jazz, funk and alternative folk, all wrapped in the spirit of the Latin music she grew up with. With a sound described by Vance Gilbert as, “Shawn Colvin meets Joni Mitchell has lunch with Amy Winehouse meets Suzanne Vega and Diana Krall,” and NPR calls, “a pitch-perfect rendition of my wildest dreams,” her soulful singing, poetically incisive lyrics, and syncopated rhythms, are likely to make you cry, laugh and dance all within one set.", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Mipso ", "ArtistImage": "https://photos.bandsintown.com/thumb/9951851.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Americana, Folk, Bluegrass", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Chapel Hill’s indie Americana quartet Mipso – Jacob Sharp (mandolin, vocals), Wood Robinson (bass, vocals), Joseph Terrell (guitar, vocals), and Libby Rodenbough (fiddle, vocals) – release their fifth album, Edges Run, on April 6th, 2018 via a newly inked record deal with AntiFragile Music. Influenced by the contradiction of its progressive home and the surrounding rural southern landscapes, Mipso has been hailed as “hewing surprisingly close to gospel and folk while still sounding modern and secular” (Acoustic Guitar) and was recently recognized by Rolling Stone as an “ Artist You Need to Know.” The band brings a distinctly unique sound – full of wistful beauty, hopeful undercurrents, and panoramic soundscapes. Venturing ever-further from its string-band pedigree to discover a broader Americana where classic folk-rock and modern alt-country sounds mingle easily with Appalachian tradition, Mipso’s music is lush and forward moving, with lyrics that sear and salve in turn. Look for Mipso on tour across the U.S. and Canada this summer.", "otherInfo": "Mipso w/ Taylor Ashton\nand guests Steph Coleman and Alec Spiegleman\n\nMipso is born from North Carolina’s broad range of disparate musical influences, their distinctly unique sound an undeniable alchemy of the historical musical traditions of the rural south and their progressive home of Chapel Hill.\n\n\nA discernible and rising force in the upstart musical genre known as Americana, Mipso’s music is lush and forward moving. A tender, harmony-laden river runs through the band’s core, but the rocky outcroppings change with every album outing. Appalachia melds with modern alt-country, hints of folk-rock are leavened with a sly and subversive sense of humor, and underneath it all is a genuine and moving passion for the ever-evolving traditions of Americana."}, {"Address": "Montclair, Montclair, NJ 07042", "Artist": "Ted Chubb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8557608.jpeg", "Coordinates": [-74.221544, 40.816008], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Jazz", "Time": "11:00 PM UTC", "Venue": "MC Hotel", "moreBioInfo": "Ted Chubb began his career performing in his native Ohio with mid-west legends, B3 organist Bobby Floyd and saxophonist Gene Walker. Ted received his MM from Rutgers University and studied with master trumpet teacher William “Prof.” Fielder. From 2006-2011, he toured with the Tony award-winning show \"Jersey Boys\". Ted co-led the critically acclaimed quartet “New Tricks” which released two recordings and toured extensively throughout the U.S. Ted has performed with artists such as Wallace Roney, Christian McBride, Winard Harper, Don Braden, Melissa Walker, Bruce Williams, Billy Hart, Tia Fuller, Vincent Gardner, Dave Stryker, Josh Evans, Lenny White, Jerome Jennings, and Cecil Brooks III. Ted has performed across the globe from NYC jazz clubs Smalls, Fat Cat, The Jazz Standard, Minton's, and Dizzy's at Jazz at Lincoln Center, to Jazz Festivals across North America and Europe, and even The \"Tonight Show\". Ted served as a teaching artist, faculty member and Jazz House Director of Music from 2012 -2015 for the nationally recognized music education program Jazz House Kids. He currently resides in New York City and Luzern Switzerland, focusing on his own projects both internationally and in NYC. In addition, Ted continues to be involved at Jazz House Kids as the Director of the Jazz House Summer Workshop and Special Programs.", "otherInfo": "No other event info available"}, {"Address": "155 Varick St, New York, NY 10013", "Artist": "Sinéad O'Connor ", "ArtistImage": "https://photos.bandsintown.com/thumb/10272119.jpeg", "Coordinates": [-74.00575, 40.72642], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "City Winery", "moreBioInfo": "Sinéad Marie Bernadette O'Connor (born December 8, 1966) is a Grammy Award-winning Irish singer and songwriter. Brash and outspoken — her shaven head, angry visage, and shapeless wardrobe a direct challenge to the popular culture's long-prevailing notions of femininity and sexuality — O'Connor irrevocably altered the image of women in rock; railing against long-standing stereotypes simply by asserting herself not as a sex object but as a serious artist, she kick-started a revolt which led the way for many female performers. O'Connor ranked among the most distinctive and controversial popular music stars of the 1990s, the first and in many ways the most influential of the numerous female performers whose music dominated airwaves throughout the decade. Her first album, The Lion and The Cobra, was released in 1987, and its popular and critical acclaim made her a star of pop music. She produced her second album, I Do Not Want What I Haven't Got, a critical success that included her hit single \"Nothing Compares 2 U,\" a song written by Prince. O'Connor was as well-known for her political beliefs as for her music (she once shredded a photo of Pope John Paul II on U.S. television), but in recent years she has been less publicly controversial. In 2003 she announced her retirement from the music business. In 2000 released her album \"Faith and Courage\". Another album, Throw Down Your Arms was released in 2005. Her newest release is a double CD, Theology, being released in June 2007.\n\nCurrently working with Ian Brown (former The Stone Roses frontman).", "otherInfo": "It is with deep regret that we must inform you that the Sinead O’Connor City Winery shows scheduled for March and April 2020 have been postponed due to all our concerns with the recent developments concerning the spread of COVID-19. City Winery did everything possible to keep the shows running but priority for them as well as us is the safety and well-being of guests, artists, and staff. With recommendations that there be no gatherings of more than 250 people, even with their social distancing venue layout, we have collectively taken it under advisement that a rescheduling is in the benefit of the public good. We apologize for the notice, as the situation has changed rapidly and we are responding accordingly. We are diligently working to provide new upcoming future dates and will update as soon as it’s finalized.\n\nAlso, due to the current corona virus emergency, the 4/7/20 concert with Sinead O’Connor has been postponed. The Birchmere and Ticketmaster will notify patrons as to the rescheduled date. Please hang on to your tickets until we have more info. We appreciate your patience during these difficult time.\n\n\nWhile this decision comes at a time of universal uncertainty, we take the safety and health of all involved with Sinead O'Connor very seriously.\n\nWe would like to thank all at City Winery, The Birchmere, ICM Partners, and Ms O'Connor's band and crew for their honourable and consummate professionalism under the most challenging of circumstances - and to Sinead O'Connor for doing all in her power to assure the safety & well being of her band, crew and in assuring her fans that the show will go on...\n\n\n\n67 Management"}, {"Address": "50 Monroe Place, Brooklyn, NY 11201", "Artist": "Rachael Kilgour ", "ArtistImage": "https://photos.bandsintown.com/thumb/8641865.jpeg", "Coordinates": [-73.992763, 40.695512], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Indie Folk", "Time": "11:30 PM UTC", "Venue": "Voices In The Heights", "moreBioInfo": "Rachael Kilgour is an award-winning songwriter and performing artist whose sincere, lyric-driven work has been called both brave and humane. The 2015 grand prize winner of the esteemed international NewSong Music Performance & Songwriting Competition, Kilgour has been featured at NYC’s Lincoln Center, the Kennedy Center in Washington D.C., and at the Sundance Film Festival. She was also chosen as a winner in the 2017 Kerrville New Folk Contest.\n\n\"...a heartfelt slice of master crafted indie folk brimming with the battle-tested capacity to endure the worst in others.\" -- Billboard", "otherInfo": "Live Stream: https://www.musae.me/riverspiritmusic/experiences/743/the-rachael-kilgour-hd-%2b-360-vr-event\nPresented in partnership with NY-based concert series Voices in the Heights and River Spirit Music.\n\nTHE IMMERSIVE 360° VIRTUAL REALITY EXPERIENCE\nThis will be the first in a series of concert events sponsored by River Spirit Music and Voices in the Heights in association with MUSAE offered through their new 360°/VR platform. The live events will include extra features provided by the artist to make the show an unforgettable experience.\n\nWith the Virtual Reality (VR) package, you can watch the show from the stage, the sides or the front row. We will ship you a VR headset along with plug and play setup so you can experience concerts in a completely new way.\n\nWe will ship VR headsets via 2-day mail, but cannot guarantee arrival times. If for any reason you don’t get it in time or have technical difficulties, return it and we’ll issue a full refund.\n\nIf you’re truly struggling due to the Coronavirus situation, take advantage of our \"Pay What You Can\" offer (minimum $5). If you’re able to pay more, to help someone else pay less, please do!\n\nTICKET / CONTRIBUTION LEVELS\n$5 — I Just Need to Smile Right Now\n$10 – Fan of Rachael Kilgour\n$15 – Lover of Rachael Kilgour\n$20 – Supporter of Rachael Kilgour\n$50 – Patron of Rachael Kilgour"}, {"Address": "64 N 9th St, Brooklyn, NY 11249", "Artist": "THE WLDLFE ", "ArtistImage": "https://photos.bandsintown.com/thumb/9147972.jpeg", "Coordinates": [-73.95987, 40.720886], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Pop Rock, Indie Pop, Pop, Alternative, Indie", "Time": "11:30 PM UTC", "Venue": "Rough Trade NYC", "moreBioInfo": "THE WLDLFE is an indie-alternative/pop band out of Indianapolis, IN who made their debut on March 3rd, 2016 when they released their first EP entitled \"NEW\". THE WLDLFE quickly became a familiar name in the music community as they would go on to release their follow up EP (ILY) in February of 2017 and their debut full length album (I'm Not Worried Anymore) in the fall of 2018 all while touring across the United States opening for acts such as Halsey, The Band CAMINO, COIN, Nightly and more. THE WLDLFE have accumulated over 17 million total streams on Spotify alone and have been featured in multiple online publications such as Billboard, Ones To Watch, Local Wolves, and more.", "otherInfo": "THE WLDLFE, Betcha"}, {"Address": "1286 Hicksville Rd, Massapequa, NY 11758", "Artist": "Cuthbert Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/9298868.jpeg", "Coordinates": [-73.48267, 40.71377], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Rock, Country And Soul., Pop", "Time": "11:30 PM UTC", "Venue": "Paddy's Loft", "moreBioInfo": "Paul C. Cuthbert is a singer/songwriter, covering multiple music genres.\n\nHe is also the owner of Rock Beach Music Co. where he fronts multiple music acts.", "otherInfo": "☘️Join Paul live every Tuesday night at Paddy's Loft - Irish Pub and Restaurant - Massapequa. New York. 7:30pm to 10:30pm.\n\nTwo for Tuesdays drinks and apps! Fine dining. Authentic Irish Pub. Best Pint of Guinness in New York! Sports on all Tv's.\n\nJoin us for a song and a pint! Slainte!🍻"}, {"Address": "149 7th St, Brooklyn, NY 11215", "Artist": "Margaret Glaspy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8587088.jpeg", "Coordinates": [-73.991761, 40.673627], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Rock, Indie Rock, Alternative", "Time": "12:00 AM UTC", "Venue": "The Bell House", "moreBioInfo": "‘Devotion’ is a very different record from the last. It’s not about being righteous or all-knowing, it's about letting love in even when you don't know what will happen when you do. It's about devoting your heart to someone or something, against all odds. 'Devotion' is out March 27 on ATO. Pre-order here: https://smarturl.it/MG_Devotion", "otherInfo": "No other event info available"}, {"Address": "61 Wythe Ave, New York, NY 11249", "Artist": "King Solomon Hicks ", "ArtistImage": "https://photos.bandsintown.com/thumb/9715111.jpeg", "Coordinates": [-73.957549, 40.722053], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Blues", "Time": "12:00 AM UTC", "Venue": "Brooklyn Bowl", "moreBioInfo": "\"King\" Solomon Hicks is an American blues guitarist born in Harlem, NY. His style of music ranges from jazz, blues, classical, gospel, R&B, funk, Afro-Cuban, and classic rock. His first recording was when he was 14 with the Cotton Club All-Star Band. He has toured in Spain, Denmark, Germany, Mexico, Japan, Bahamas, Bermuda, Barbados, and the United States. His debut album, Harlem, will be released by Provogue Records in March 2020.", "otherInfo": "No other event info available"}, {"Address": "64 N 9th St, Brooklyn, NY 11249", "Artist": "Betcha ", "ArtistImage": "https://photos.bandsintown.com/thumb/9312978.jpeg", "Coordinates": [-73.95987, 40.720886], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Alternative Folk-rock", "Time": "12:00 AM UTC", "Venue": "Rough Trade NYC", "moreBioInfo": "No artist bio available", "otherInfo": "THEWLDLFE and Betcha Co-headline tour"}, {"Address": "80 E Ridge Rd, Ridgefield, CT 06877", "Artist": "Kofi Baker ", "ArtistImage": "https://photos.bandsintown.com/thumb/8981258.jpeg", "Coordinates": [-73.49241, 41.28225], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Kofi Baker", "Time": "12:00 AM UTC", "Venue": "Ridgefield Playhouse", "moreBioInfo": "Kofi Baker made his first appearance with his father Ginger Baker in 1975 on the live UK TV show The Old Grey Whistle Test, he’s been playing before the public ever since.\nThe early 80’s found Kofi and his father playing drum duets throughout Europe. Later Kofi toured with John Ethridge (Soft Machine), gigged in London with Steve Waller (Manfred Mann) and with Randy California (Spirit). He joined Steve Marriot after Humble Pie and toured Europe.\nHighlights of the 1990’s for Kofi were a Budapest tour with Jack Bruce, signing to Scotty Brothers Records and recording the album Lost City in ‘92, followed by the album “Abstract Logic” with Jonas Hellborg and Shawn Lane in 1994. This was followed by a variety of tours including more drum duets with Ginger Baker.\nNow living in L.A., Kofi formed Mojo with Ric Fierabracci and Brett Garsed. Kofi then played in OHM, a jazz fusion outfit with Chris Poland (of Megadeth) on guitar and Robert Pagliari on bass, he has also toured in support on Joe Satriani's European Tour\nMore recently Kofi has completed The Extreme Guitar Tour with Uli Jon Roth -Former Scorpions lead guitarist, Vinny Appice - DIO, Black Sabbath, Rick Derringer, John Lennon ect. Vinnie Moore - Lead guitarist with UFO.\n\nKofi is now living in Hobart IN. Kofi Baker's Cream Experience is his latest inspiration - a powerful trio that rivals that of Cream.", "otherInfo": "No other event info available"}, {"Address": "151 Avenue C, New York, NY 10009", "Artist": "Keith Loftis ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.977924, 40.72561], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Nublu 151", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "45 Main St, Stanhope, NJ 07874", "Artist": "Red Handed Denial ", "ArtistImage": "https://photos.bandsintown.com/thumb/10227760.jpeg", "Coordinates": [-74.7085, 40.90277], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Progressive Metal, Progressive, Metalcore, Rock, Metal", "Time": "11:00 PM UTC", "Venue": "The Stanhope House", "moreBioInfo": "Red Handed Denial is a metal band from Toronto, Ontario, Canada known for fusing technical metal elements with melodic pop sensibility. Their new full-length concept album 'Redeemer' comes out on March 29th.", "otherInfo": "No other event info available"}, {"Address": "149 7th St, Brooklyn, NY 11215", "Artist": "Kate Davis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9145651.jpeg", "Coordinates": [-73.991761, 40.673627], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Alternative, Rock, Pop", "Time": "12:00 AM UTC", "Venue": "The Bell House", "moreBioInfo": "Kate Davis’s triumphant debut album, Trophy, blends precise pop melodies with raw, emotive lyrics, and a sonic edge. With its sparkling hooks and gritty guitars, Trophy shows Davis throwing off the trappings of her jazz training in favor of a lush, contemporary sound. Having written the entirety of Trophy in her Harlem bedroom over a four-year period, Davis launched a Kickstarter campaign in 2017 to fund the album’s recording and production, crowd-sourcing nearly double her fundraising goal in less than a month. The resulting album, which explores the loss of Davis’s father and the growing pains of early adulthood, marks the emergence of a masterly and propulsive new talent.", "otherInfo": "Margaret Glaspy\nThe Devotion Tour\nwith Kate Davis"}, {"Address": "327 Bowery, New York, NY 10012", "Artist": "Reed Stewart ", "ArtistImage": "https://photos.bandsintown.com/thumb/9732751.jpeg", "Coordinates": [-73.991787, 40.725751], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Electronic Rock", "Time": "12:00 AM UTC", "Venue": "The Bowery Electric", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "146 Broadway, Brooklyn, NY 11211", "Artist": "Arlo Parks ", "ArtistImage": "https://photos.bandsintown.com/thumb/9202180.jpeg", "Coordinates": [-73.963479, 40.7101], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Alternative, Neo-soul, Poetry, Soul, R&b, Hip Hop", "Time": "1:00 AM UTC", "Venue": "Baby's All Right", "moreBioInfo": "Arlo Parks is an 18 year old poet/singer from London. In her words she spent most of school feeling like that black kid who couldn't dance for shit, listening to too much emo music and crushing on some girl in her Spanish class. Her songs are confessional and tender, mainly inspired by Portishead and Earl Sweatshirt.", "otherInfo": "No other event info available"}, {"Address": "315 West 44th St, New York, NY 10036", "Artist": "Emily Braden ", "ArtistImage": "https://photos.bandsintown.com/thumb/9261815.jpeg", "Coordinates": [-73.989689, 40.759], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "1:30 AM UTC", "Venue": "Birdland", "moreBioInfo": "www.emilybraden.com", "otherInfo": "No other event info available"}, {"Address": "1221 6th Ave, New York, NY 10020", "Artist": "Leighann Lord ", "ArtistImage": "https://photos.bandsintown.com/thumb/10225022.jpeg", "Coordinates": [-73.98135, 40.75877], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Standup Comedy", "Time": "2:30 AM UTC", "Venue": "SiriusXM", "moreBioInfo": "Leighann Lord has appeared on ABC, NBC, Lifetime, VH-1, HBO, Comedy Central, and is a former co-host of StarTalk Radio, with Neil de Grasse Tyson. She was a national finalist in the ABFF-HBO Comedy Wings Competition and she received the 2019 Humanist Arts Award. She is the author of several humor books including: Dict Jokes and Real Women Do it Standing Up. Her DryBar Comedy Special will be out this Summer.", "otherInfo": "Progress Channel 127"}, {"Address": "269 Norman Ave, Brooklyn, NY 11222", "Artist": "Amarionette ", "ArtistImage": "https://photos.bandsintown.com/thumb/8823151.jpeg", "Coordinates": [-73.94218, 40.727844], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Post Hardcore, Rock, Pop, Alternative", "Time": "10:00 PM UTC", "Venue": "Kingsland Bar & Grill", "moreBioInfo": "Amarionette is a NÜ Funk/Rock band from Las Vegas, NV that formed in 2010. Over the last several years they have embarked on numerous tours with national acts such as Kurt Travis, Strawberry Girls, Eidola, Andrés, etc. In 2018, Amarionette parted ways with former lead vocalist Quin White, and have released two EP’s with new lead vocalist, Issy Berry titled AMVRI and Evolution.", "otherInfo": "No other event info available"}, {"Address": "127 E 23rd St, New York, NY 11226", "Artist": "Danger Incorporated ", "ArtistImage": "https://photos.bandsintown.com/thumb/10013531.jpeg", "Coordinates": [-73.98492, 40.7399], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Alternative, Hip Hop", "Time": "10:30 PM UTC", "Venue": "Gramercy Theatre", "moreBioInfo": "No artist bio available", "otherInfo": "Accessible accommodations should purchase a General Admission ticket and will be taken care of at the venue day of event."}, {"Address": "205 W 54th St, New York, NY 10019", "Artist": "Sarah Rayani ", "ArtistImage": "https://photos.bandsintown.com/thumb/8569663.jpeg", "Coordinates": [-73.981969, 40.763932], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Jazz, Soul, Pop", "Time": "11:00 PM UTC", "Venue": "Flûte Champagne Bar", "moreBioInfo": "Sarah Rayani is taking sultry sounds of classic jazz and soul and making it cooler, younger and putting some \"booty\" in it. New Yorkers have been discovering her band's soulful and bluesy sounds at some of the city's most posh and trendy venues including 44 Bar, Bar Basque and Ella Lounge, to name only a few. Sarah's original songs combine jazzy vocals and old-school hip hop instrumentals and you will also hear new and old favorites worked into their signature live set; sexy, sophisticated and engaging. Sarah Rayani was born in London, England, and is half Swedish and half Indian. She was vocally trained in both Opera and Jazz, writes her own songs, and has appeared on Maino's track \"I'm Da Future\" and in the film Sex And The City 2.", "otherInfo": "Upscale bar dedicated to champagne, with a candlelit lounge, fireplaces & weekly live music."}, {"Address": "95 Stanton St, New York, NY 10002", "Artist": "The Infection ", "ArtistImage": "https://photos.bandsintown.com/thumb/9133218.jpeg", "Coordinates": [-73.988383, 40.721329], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Heavy Metal, Heavy Rock, Classic Rock, New Rock, Metal, Hard Rock", "Time": "11:00 PM UTC", "Venue": "Arlene's Grocery", "moreBioInfo": "The infection is spreading - heavy modern rock grooves with memorable hooks and melodies. The lineup is all NYC guts and talent.", "otherInfo": "Tommy London Presents another amazing lineup for the Planet Rock Fest - featuring\nTHE INFECTION\nand\nThe Blackfires\nand\nThe Planets\n\nKiller $5 Rock show at one of the best Rock Venues in NYC!"}, {"Address": "146 Broadway, Brooklyn, NY 11211", "Artist": "MAPACHE ", "ArtistImage": "https://photos.bandsintown.com/thumb/8173362.jpeg", "Coordinates": [-73.963479, 40.7101], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Bluegrass, Jam Band, Folk, Country, Psychedelic, Rock", "Time": "11:00 PM UTC", "Venue": "Baby's All Right", "moreBioInfo": "Formed in January 2016.\nMapache is a new folk / blues / rock / bluegrass / psychadelic duo born in Los Angeles California. Mapache is interested in spreading good feelings of love as well as raw musical talent to anyone and everyone. Mapache is an experience both live and in the studio presenting a memorable and honest sound.", "otherInfo": "No other event info available"}, {"Address": "233 Butler St, Brooklyn, NY 11217, USA, New York City, NY", "Artist": "Arthur Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8256495.jpeg", "Coordinates": [-73.986465, 40.682058], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Martin D. Fowler, Lora-Faye Åshuvud, Nick Lerman, Cale Hawkins, Dave Palazola, Aviva Jaye", "Time": "11:00 PM UTC", "Venue": "Public Records", "moreBioInfo": "Arthur Moon is the moniker of award-winning composer/singer Lora-Faye Åshuvud, who WNYC calls \"an artist bent on upending your expectations of what a pop song should sound like.\" Åshuvud writes her lyrics using cut up newspaper and magazine articles, and describes the process of composing the experimental pop arrangements as similarly collage-like. \"On the best days,\" she said in an interview with LPR, \"it feels like playing a rousing game of Exquisite Corpse--except only with myself.\" The band’s debut EP Our Head was released on Velvet Elk Records in the Spring of 2017, after their debut track/music video “Wind Up” premiered with NOWNESS the previous summer. The Arthur Moon band also includes Martin D Fowler (composer for This American Life and Limetown), Cale Hawkins (Quincy Jones, Wyclef Jean, Nikki Yanofsky), Aviva Jaye, Nick Lerman and Dave Palazola.", "otherInfo": "No other event info available"}, {"Address": "1120 Manhattan Ave, Brooklyn, NY 11222", "Artist": "Funkrust Brass Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9122972.jpeg", "Coordinates": [-73.955172, 40.736777], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Punk Disco Brass", "Time": "11:00 PM UTC", "Venue": "Saint Vitus", "moreBioInfo": "Funkrust Brass Band is a twenty-piece brass band founded and led by songwriter, arranger and multi-instrumentalist Phil Andrews (Rude Mechanical Orchestra, Gay Panic, Apocalypse Five & Dime), with lyrics and megaphone vocals by Ellia Bisker (Sweet Soubrette, Charming Disaster). Funkrust was born in a basement in Ridgewood, Queens in November of 2014. Their sound stems from a unique blend of punk, disco, EDM, metal, funk, Balkan brass and New Orleans second line. Featuring snazzy uniforms, choreography, megaphone vocals and all original compositions, they are a sight not to be missed.\n\nBased in Brooklyn, Funkrust has performed across New York City -- in small clubs and big public venues, in parades and at festivals -- to universal acclaim. Outside New York City, Funkrust has performed in Boston, Kingston NY, Trenton NJ, Philadelphia, and Baltimore, and at Mysteryland USA, on the iconic grounds of Woodstock. Funkrust released their debut album, Dark City, in 2017.\n\n\"It’s an upbeat album that is easy to sing along to, but more importantly it’s easy to dance to. The biggest problem the record has for the listener is that it makes it impossible to not want to catch Funkrust live and in person right away.\" - rBeatz review of Dark City\n\n\"Funkrust Brass Band waste no time opening the album with their signature song, Funkrust. Catchy tuba bassline underpinning its rat-a-tat trombones, cinematically rising trumpets and undulating groove, this mashup of Balkan brass and American funk sounds like an even more epic version of iconic Brooklyn band Slavic Soul Party.\" - New York Music Daily on Dark City\n\n\"Prior to hitting play limber up your hips, knees and most importantly ankles as Funkrust Brass Band take the listener on a journey that demands much of the lower joints in a roughly twenty five minute, seven track, release of unrelenting strutting dance.\" - Emerging Indie Bands preview of Dark City", "otherInfo": "Kultur Shock comes to Vitus! With Funkrust."}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Caroline Spence ", "ArtistImage": "https://photos.bandsintown.com/thumb/8980254.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Americana, Alt Country, Roots & Folk, Songwriter, Folk", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "Ever since the release of \"Blood on the Tracks\" in 1975, Dylan posed the challenge to every songwriter that came after him: Can life's emotional complexities be rendered simply? Can a song be so intensely personal that it somehow manages to reach beyond itself towards something universal? With this record, Dylan turned the American Songwriter into a definite vocation, a job that’s core responsibility was the nearly impossible task of simply and honestly singing your own story, and somehow mysteriously manage to speak for all of us.\n\nWhile Caroline Spence may not look like one of the road-hardened troubadours of America's past, with the release of Spades & Roses, the young songwriter from Charlottesville Virginia proves she is every bit as serious. Having won numerous songwriting awards from industry mainstays like the Kerrville Folk Festival and American Songwriter Magazine, and garnered nods and admiration from both Miranda Lambert and her fellow writers in the Nashville underground, Caroline has delivered a record to meet the expectation: Quite simply, 11 songs of gorgeous Americana that remind us of why we fell in love with the genre in the first place.\n\nIt’s is a rare but unmistakable authenticity and emotional resonance that can't be faked, all delivered from a voice that somehow manages to be both ethereally pristine and yet profoundly raw and human-- a disarming union of self-assuredness and vulnerability that runs throughout the record. Under the guidance of Producer Neilson Hubbard, \"Spades and Roses\" strips away all of the sonic barriers that might stand between Caroline and her listener, allowing her fragile melodies and first person confessionals to do their work-- reaching out and empathizing, providing a soundtrack to our own hidden stories. Every song on the record--whether pop or meditative, glib or heartbreaking-- asks the essential question of whether or not the listener can recognize himself.\n\nWhether it’s a song like \"Southern Accident,\" a strikingly personal and heartbreaking account of the lingering effects of her parents divorce on her own search for love and commitment, or \"Softball,\" an extended anthemic metaphor for the all-to-real injustices of the gender gap in modern life, Spades and Roses is Caroline's unflinching testimony and reminder as to why songs are important: It’s about paying attention. It's about whether you can take a handful of chords and find those still points of peace and clarity and joy amidst the basic confusion, struggles, and emotional wreckage of our everyday lives. Most importantly, it’s about finding a way to make it beautiful.", "otherInfo": "No other event info available"}, {"Address": "553 Main St, Islip, NY 11751", "Artist": "Dudley Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8371487.jpeg", "Coordinates": [-73.21318, 40.72941], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Jazz, Hip Hop, R&b, R&b/soul, Rnb-soul", "Time": "11:00 PM UTC", "Venue": "Treme", "moreBioInfo": "Dudley Music is a Long Island-based Hip Hop singer-songwriter, producer, and jazz musician, playing saxophone, keys, guitar, drums, flute, and clarinet.\n\nHis debut EP, On My Way, was released in the Spring of 2016. With support from Talib Kweli, an extended version of the project was made available at Talib's online store, KweliClub.com.", "otherInfo": "No other event info available"}, {"Address": "140 Merrick Rd, Amityville, NY 11701", "Artist": "Be//gotten (Official) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9111436.jpeg", "Coordinates": [-73.4175, 40.6712], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Dallas, Texas", "Time": "11:00 PM UTC", "Venue": "Revolution Bar & Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "3 Lafayette Ave, Brooklyn, NY 11217", "Artist": "Colin Fowler ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.978878, 40.686876], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "No genre available", "Time": "11:30 PM UTC", "Venue": "Mark Morris Dance Group", "moreBioInfo": "No artist bio available", "otherInfo": "Performing Satie, Handel, and Schubert's Trout Quintet with the MMDG Music Ensemble"}, {"Address": "101 Newark Pompton Turnpike, Little Falls, NJ 07424", "Artist": "chrissiemusic ", "ArtistImage": "https://photos.bandsintown.com/thumb/8548370.jpeg", "Coordinates": [-74.2446, 40.88424], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Pop, R&b, Soul", "Time": "11:30 PM UTC", "Venue": "The Fine Grind - A Coffee Bar", "moreBioInfo": "Chrissie Limos is a Soul/Pop singer and songwriter born in the Philippines and is now residing in North New Jersey.\n\nHer powerful, yet sweet and soulful vocals engage every crowd she performs for throughout the New Jersey and New York Circuit. Her style and sound has compared her from artists like Alicia Keys to Allen Stone.\n\nChrissie plays piano and guitar and composes her own original songs. In her writing, she aims to connect with her listeners and be a voice for those who are unable to speak their emotions, thoughts and struggles.\n\nChrissie Limos has two singles called \"Tricks\" and \"1000 Bullets\". She has recently released her debut EP, Got The Love EP, on November 24. It is now available on all streaming platforms including Spotify and iTunes.\n\nKeep a look out for upcoming videos and show dates!", "otherInfo": "No other event info available"}, {"Address": "New York City, NY", "Artist": "Jeffrey Pepper Rodgers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8737520.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Acoustic", "Time": "11:30 PM UTC", "Venue": "Online songwriting workshop", "moreBioInfo": "Jeffrey Pepper Rodgers is a grand prize winner of the John Lennon Songwriting Contest, a contributor to NPR’s All Things Considered, and the founding editor of Acoustic Guitar magazine.\n\n“Jeffrey Pepper Rodgers’ songs ring true and new. Spot-on work from an American wordsmith.”\n—Patty Larkin", "otherInfo": "Songwriting Sessions Online workshop with Jeffrey Pepper Rodgers, meeting four consecutive Wednesdays 7:30 to 9:30 pm Eastern."}, {"Address": "479 Washington Blvd, Jersey City, NJ 07310", "Artist": "Gina Chavez ", "ArtistImage": "https://photos.bandsintown.com/thumb/9155676.jpeg", "Coordinates": [-74.035914, 40.724966], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Latin Pop, Soul", "Time": "11:30 PM UTC", "Venue": "The Westin Jersey City Newport", "moreBioInfo": "A multi-ethnic Latin pop songstress, Gina Chavez is a 12-time Austin Music Award winner. Her bilingual record, Up.Rooted, topped both the Amazon and Latin iTunes charts following a feature on NPR's All Things Considered. Her NPR Tiny Desk concert has nearly 1 million views and her band has toured 12 countries as cultural ambassadors with the U.S. State Department. Chavez’s passionate collection of bilingual songs take audiences on a journey through the Americas, blending the sounds and rhythms of the region with tension and grace. Her Spanish-language anthem, “Siete-D” (Grand Prize winner of the 2014 John Lennon Songwriting Contest) recounts her experience volunteering in a gang-dominated suburb of San Salvador where she is a co-founder of The Niñas Arriba College Fund for young Latinas.", "otherInfo": "No other event info available"}, {"Address": "1090 Wyckoff Ave, Queens, NY 11385", "Artist": "Jeauxsmeaux ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.902137, 40.694328], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "No genre available", "Time": "11:30 PM UTC", "Venue": "H0L0", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "80 E Ridge Rd, Ridgefield, CT 06877", "Artist": "Dante Palminteri ", "ArtistImage": "https://photos.bandsintown.com/thumb/8679019.jpeg", "Coordinates": [-73.49241, 41.28225], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Pop Singer Songwriter", "Time": "12:00 AM UTC", "Venue": "Ridgefield Playhouse", "moreBioInfo": "Growing up between the East and West coasts, American singer-songwriter and actor Dante Palminteri matured his musical styling at an early age, drawing inspiration from John Mayer's lyrical mastery of the human psyche and Ed Sheeran's genre-defying melodies. As a teenager, he took center stage as the lead vocalist of New York-Based metal band Kaymus, having learned how to fuse his vibrant sound with the edgier chords of think-outside-the-box bands, Tool and Audioslave. During his time studying songwriting at Berklee College of Music in Boston, lyrics about teenage angst and high school crushes soon turned into more complex compilations about unrequited love, soul mates lost and found, and life's emotional roller coaster. Bringing together the pop sounds of his musical contemporaries and the hard rock roots of his past, Dante has brought an original vision to his debut EP \"From Me To You.\" Having toured locally around the Tri-state area over the years, Dante has already laid the groundwork for a busy 2018.", "otherInfo": "No other event info available"}, {"Address": "1 South Ave, Garden City, NY 11530", "Artist": "Nelly's Echo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8480956.jpeg", "Coordinates": [-73.652451, 40.722173], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Alternative, Folk, Pop, Music", "Time": "12:00 AM UTC", "Venue": "Adelphi University Performing Arts Center", "moreBioInfo": "Nelly’s Echo is neither a band nor a solo musician, but a concept of the musical experience associated with its creator, Nelson. He has self-released five successful albums, performed at well over 500 different establishments since 2012, entertained the troops in Cuba, and even participated in Season 3 of The Voice as a member of Team Christina. Relying on lessons learned from his childhood in Africa and his everyday experiences, his storytelling style has led to some comparing his musicality & storytelling to that of Jason Mraz and John Mayer. Nelson also has taken great pride in sharing the stage with the likes of Trombone Shorty, Travis McCoy & Sean Kingston and Boyz II Men to name a few. In the end, the goal of Nelly's Echo is to use music as a vehichle to reach the four corners of the earth, while sharing the message of positivity, life, hope, and love to everyone that it comes in contact with.", "otherInfo": "No other event info available"}, {"Address": "149 7th St, Brooklyn, NY 11215", "Artist": "Kate Davis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9145651.jpeg", "Coordinates": [-73.991761, 40.673627], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Alternative, Rock, Pop", "Time": "12:00 AM UTC", "Venue": "The Bell House", "moreBioInfo": "Kate Davis’s triumphant debut album, Trophy, blends precise pop melodies with raw, emotive lyrics, and a sonic edge. With its sparkling hooks and gritty guitars, Trophy shows Davis throwing off the trappings of her jazz training in favor of a lush, contemporary sound. Having written the entirety of Trophy in her Harlem bedroom over a four-year period, Davis launched a Kickstarter campaign in 2017 to fund the album’s recording and production, crowd-sourcing nearly double her fundraising goal in less than a month. The resulting album, which explores the loss of Davis’s father and the growing pains of early adulthood, marks the emergence of a masterly and propulsive new talent.", "otherInfo": "Margaret Glaspy\nThe Devotion Tour\nwith Kate Davis"}, {"Address": "217 E Houston St, New York, NY 10002", "Artist": "Katie Pruitt ", "ArtistImage": "https://photos.bandsintown.com/thumb/9381425.jpeg", "Coordinates": [-73.986751, 40.722165], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Indie Folk, Americana", "Time": "12:00 AM UTC", "Venue": "Mercury Lounge", "moreBioInfo": "2017 winner of the Buddy Holly Prize, awarded to Sylvan Esso in 2018 and Emily King in 2016. No album out yet, but Katie Pruitt's songwriting has already got everyone's attention. Rolling Stone says, \"an early song of hers, 'Loving Her,' repurposed country cliches of forbidden love from heteronormative adultery into more fluid, modern territory.\"", "otherInfo": "Katie Pruitt's debut headlining tour \"Expectations\" is coming to a city near you! Tickets go on sale November 22nd."}, {"Address": "25 Avenue A, New York City, NY 10009", "Artist": "Young Shanty ", "ArtistImage": "https://photos.bandsintown.com/thumb/7703282.jpeg", "Coordinates": [-73.985959, 40.722966], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Dancehall, Rap, Reggae", "Time": "12:00 AM UTC", "Venue": "Berlin Under A", "moreBioInfo": "Born in the San Francisco Bay Area USA, Young Shanty (aka Iyahson) seamlessly blends reggae, dancehall, hip hop, rap, soul, funk and r&b together. Co-Founder of Chalice Row Records, Young Shanty currently releases music through his own imprint as well as parent label Giddimani Records. The 2016 commercially released EP, Chalice Row Or Dig A Hole, has received worldwide radio airplay with its multiple hit singles. In April of 2017, it debuted on the Billboard Reggae Albums Chart at #1. Also gaining traction on the international radio market is the single \"More Weed\" feat. Sizzla and Ras Rap. The first half of 2017 saw single releases on the Burnhard Spliffington Riddim, Nike Ear Riddim, Nugs & Kisses Riddim and Kenyakibera Riddim. On June 30th, 2017, the concept album with producer Dr. Edward Love entitled \"Smokers Music Vol 1\" was released. In its first week of release, it debuted at #9 on the Billboard Heatseekers (Pacific) albums chart and reached #8 on Amazon Music's New Release Reggae Chart. Having toured the West Coast USA extensively, and with performances in Miami, Hawaii and Canada, Young Shanty brings a fine-tuned, professional stage presence rarely seen today. He has already shared concert billing with artists: Wu-Tang Clan, Sizzla, Cappadonna (Wu-Tang), Killah Priest, Hieroglyphics, San Quinn, Kymani Marley, Capleton, Beenie Man, Pressure, Lutan Fyah, Mega Banton, Turbulence, Norrisman, The Meditations, Lymie Murray, Chezidek, Luciano, Mutabaruka, Inner Circle, Half Pint, dead prez, Marlon Asher, Ras Shiloh and of course Giddimani Records CEO Perfect Giddimani. \"The Best Falsetto From The Ghetto\" #1 Billboard Reggae Album Debut www.billboard.com/charts/reggae-albums/2017-04-22", "otherInfo": "Perfect Giddimani with Special Guests Young Shanty and Bigga Haitian at Berlin"}, {"Address": "801 Seneca Ave, Queens County, NY 11385", "Artist": "Ben Pagano & The Space Machine ", "ArtistImage": "https://photos.bandsintown.com/thumb/9011178.jpeg", "Coordinates": [-73.905269, 40.701504], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Jazz, Psychedelic, Freak Funk, Space Rock, Art Rock", "Time": "12:00 AM UTC", "Venue": "Planet X", "moreBioInfo": "Ben Pagano is a pianist/keyboardist, singer/songwriter, and actor based in New York City. He studied method acting at Lee Strasberg Theater and Film Institute starting in 2006, and since has performed in numerous Off Broadway plays. He recently was seen as 'The Monster' in the critically acclaimed immersive play, 'Houseworld'.\n\nIt was around 2010 when he started playing his own original music out in the Lower East Side's Antifolk scene at the Sidewalk Cafe. Since then he has been writing songs, and gigging non-stop. He released his first album titled \"Robot Jazz' in 2014. Ben Pagano and his band, \"The Space Machine\" have just released their second album \"Forms\" named for it's conceptual focus on the spectrum of human emotion and forms of being. The album is extensive in its genre coverage and displays an impressive blend of jazz, pop, funk, folk, soul and psychedelic rock whilst maintaining a cohesiveness that defines Ben Pagano & The Space Machine.\n\nIn late 2017 Pagano released a new single 'Members Only', which Impose Magazine deemed 'this generation's lost gem'. It's the first single from his third album currently in the works.", "otherInfo": "No other event info available"}, {"Address": "376 9th St, Brooklyn, NY 11215", "Artist": "Aaron Parks ", "ArtistImage": "https://photos.bandsintown.com/thumb/6949958.jpeg", "Coordinates": [-73.98384, 40.667796], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "..., Jazz", "Time": "12:00 AM UTC", "Venue": "Barbes", "moreBioInfo": "Aaron Parks Little Big, the new Ropeadope album from the acclaimed pianist, keyboardist and composer, is at once the culmination of his brilliant early career and the long-awaited follow-up to his Blue Note Records debut, Invisible Cinema. That 2008 release, with its gorgeously melodic writing and improvising and deft use of indie-rock, electronica and hip-hop elements, established Parks as one of the most gifted and original young voices in jazz. “This is the natural successor to that record,” says the New York-based artist, 34. “It’s taking the ideas of that project and doubling down on them—fully committing to that direction.”\n\nLittle Big also marks the recorded debut of the intuitive working group that gives the album its title (and which takes its name from a fantastical novel by John Crowley—a favorite book of Parks and, the pianist notes, Wayne Shorter). Parks handled the production duties, with engineering by Daniel Schlett (whose credits include The War on Drugs and Ghostface Killah). The album was mixed by both Schlett and Grizzly Bear bassist/producer Chris Taylor, the latter of whom Parks met in a Seattle big band at the age of 10. “We put a lot of time and care into the way this record sounds, and the result”—simultaneously crystalline and warm, postmodern and natural—“makes me really happy,” Parks adds.\n\nAfter experimenting with various lineups and sessions, Parks landed on three musicians ideally suited for this atmospheric, genre-bending new work. “This feels like a real band, one that will be around for a while,” he says. Greg Tuohey is the longest-running member, a guitarist who places taste and tone ahead of chops-focused bravado—or, as Parks puts it, “It’s like he’s chasing Miles Davis’ phrasing with Jimi Hendrix’s attitude.” On electric bass is David “DJ” Ginyard Jr., a left-handed player with a distinctively lyrical approach and an aptitude for seeing the bigger musical picture. “He really understands what the bass does, and he thinks super compositionally,” Parks says, noting how some of Ginyard’s basslines have become integral to the songs. Anchoring the unit is Tommy Crane, a forward-looking, stylistically resourceful drummer who brings both explosive creativity and a producer’s knack for precision. “He has a very unique ability to internalize and commit to the particular heartbeat of each song,” Parks explains, “but always with this vital and elastic human element, which is rare to hear in combination with the kinds of grooves we’re exploring.”\n\nTogether they interpret a panoramic set of Parks’ original compositions—from the 21st-century fusion of “Kid,” to the odd-metered studio jam “Professor Strangeweather,” to the trip-hop ambiance and folkish melody of “Bells.” The psychedelic “Aquarium”—“probably the sexiest tune on the album,” Parks says, chuckling—conjures up the trippy, sultry neo-soul vibe of Meshell Ndegeocello, before Tuohey offers a solo that channels Radiohead’s Jonny Greenwood. “Digital Society” somehow manages to evoke Afrobeat, bluegrass and Aphex Twin. “Lilac” is, as Parks describes it, “a solo-piano pop tune.” The leader’s “secret favorite” cut, “Doors Open,” seeks inspiration in late Talk Talk and the “earnestness” of Brian Blade & the Fellowship Band. That closing track is “definitely not afraid to go straight for your heart,” Parks says with a laugh.\n\nA prodigal talent raised outside of Seattle, Parks moved with his family to study at the Manhattan School of Music when he was 16. Two years later, on the recommendation of a teacher, NEA Jazz Master Kenny Barron, he was invited to join trumpet great Terence Blanchard’s band. That tenure began the relationship with Blue Note that would yield Invisible Cinema, released when Parks was just 24. In The Guardian, John Fordham called the album “a real independent vision,” adding that “Parks is a fast-rising star.” In the September 2008 issue of JazzTimes, Parks was named a “New Jazz Visionary” alongside current giants like Esperanza Spalding, Robert Glasper and Christian Scott aTunde Adjuah. Over the ensuing decade, Parks certainly made good on that early promise. He was an essential presence in Kurt Rosenwinkel’s band, including on the guitarist’s well-received double album from 2012, Star of Jupiter. As a member of the supergroup James Farm, also featuring saxophonist Joshua Redman, bassist Matt Penman and drummer Eric Harland, Parks put out two celebrated albums on Nonesuch. In 2013 he released his first disc as an ECM Records artist, Arborescence, which DownBeat’s J.D. Considine called “a forest-invoking solo-piano effort marked by wonderfully detailed narratives and a harmonic palette worthy of Ravel.” Find the Way, an ECM trio session with bassist Ben Street and drummer Billy Hart, followed last year and garnered equally enthusiastic reviews.\n\nOn Little Big, Parks taps into the lessons he’s absorbed throughout those far-reaching experiences, while also progressing some of the au courant sounds he investigated on Invisible Cinema. “This feels like the most personal record I’ve ever made,” he says. What’s more, the album reflects his worldview, an outlook in which optimism and inclusion supersede politics. “There’s a lot out there right now to protest against, and it feels like it’s the artist’s duty to create music that reckons with the issues of the day. Nonetheless, this is not a protest record. It’s not against anything; it’s much more for something. What we’re aiming to do is blend genres and ideas in an open and fluid way, so that structure and freedom work together to serve the larger concept of the song. It’s a way of working together that feels representative of the kind of world I could imagine many of us might want to live in.”", "otherInfo": "No other event info available"}, {"Address": "149 7th St, Brooklyn, NY 11215", "Artist": "Margaret Glaspy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8587088.jpeg", "Coordinates": [-73.991761, 40.673627], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Rock, Indie Rock, Alternative", "Time": "12:00 AM UTC", "Venue": "The Bell House", "moreBioInfo": "‘Devotion’ is a very different record from the last. It’s not about being righteous or all-knowing, it's about letting love in even when you don't know what will happen when you do. It's about devoting your heart to someone or something, against all odds. 'Devotion' is out March 27 on ATO. Pre-order here: https://smarturl.it/MG_Devotion", "otherInfo": "No other event info available"}, {"Address": "196 Allen St, New York, NY 10002", "Artist": "Siobhan O'Brien ", "ArtistImage": "https://photos.bandsintown.com/thumb/8572977.jpeg", "Coordinates": [-73.98907, 40.72277], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Folk Rock Music", "Time": "12:00 AM UTC", "Venue": "Rockwood Music Hall", "moreBioInfo": "RESUME:\n\n\" In addition to Bob Dylan inviting her to join him on stage, Siobhan has performed in concert as a guest vocalist with the famed Irish group The Chieftains. She has also appeared in shows supporting such acts as: The Cranberries,Christy Moore, Donovan, Pete Cummins, Sharon Shannon, Henry Mc Cullough(Wings), Maria Mc Kee,Damien Dempsey, Paul Brady, Mick Flannery and many more.\n\nLeonard Cohen heard about Siobhán from a friend of his which prompted him to send a book to her called 'Dance Me To The End Of Love' with a Henry Matisse painting on each page, as a gesture of encouragement. Siobhan's last CD 'Songs I grew Up To' includes special guest appearances by several of Siobhan's musical friends including Paddy Moloney (The Chieftains) Pete Cummins(Fleadh Cowboys/Nanci Griffith) & Brendan Bowyer (Royal Show Band)\n\nQUOTES –\n\nPaddy Moloney (The Chieftains) - \"A Voice The World Should Hear\"\nBono - \"WOW\"\nLilli Kuzma Host of\" Folk Festival: radio show WDCB-FM Chicago \"Siobhan has a marvelous voice and style, and seamlessly incorporates her musical influences into excellent arrangements that transcend genres\". ..\n\nMatchbox Radio UK - \"A voice of an angel gone to folk heaven..simpley beautiful\"\nHIGHLIGHTS:\nGuest vocalist with The San Diego Symphony Orchestra at The Copely Symphony Hall California 2010,\nGuest Vocalist with The Chieftains at Boston Symphony Hall, Massachusetts 2008.\nRTE TV - Seoige & O'Shea - Performing \"All MY TRIALS\" with Band 2008\n\nINTERVIEW BOSTON GLOBE 2008\n\n\"Siobhan O'Brien finds her own voice with a new CD of cover songs \"\nArticle from: The Boston Globe (Boston, MA)\nMarch 14, 2008 by Linda Laban Globe\n\nWhen Siobhan O'Brien heard that the Frames frontman Glen Hansard had won the Oscar last month for best song for \"Falling Slowly,\" his duet with Marketa Irglova from the film \"Once,\" she was so happy for him that she cried. Her father told her he had heard the company that makes the guitar Hansard favors had seen him playing his battered old instrument at the awards show and offered him a new one.\"I was going, `Don't take the guitar, don't take the guitar,\"' O'Brien recalls from her home in Limerick. She got her wish. Her father said Hansard had declined.\"That's Glen. I knew he wouldn't take the guitar,\" says the 38- year-old Irish singer-songwriter. READ MORE\n\n\nAWARDS:\n\nUnisong International voted Siobhán in the top 10% of undiscovered\nsongwriters in the world. 1996.\n\nLike a Habit \"Single Of The Fortnight Feb '96 Hot Press (Ireland's\nNational Music Mag)\n\nLike A Habit No 4 Irish Indie charts 1997\n\nGuilty of Despair and He Said I said, were in the top 4 Unplugged\nsongs of the year 1998 /1999 (Ireland).\n\nShowcased at SXSW Austin Texas 1999.\n\nBeautiful Bodies 'Pick of the Fortnight' Hot Press (Ireland's National\nMusic Mag)Feb, '07\nBeautiful Bodies No. 1 for 15 weeks in Irish Indie Chart 2007.\nBeautiful Bodies Track Of the Day GARAGEBAND.COM Feb 2007.\n\nMy Man got 'honourable Mention' from Unisong this year Oct. 2007.\nMy Man and Beautiful Bodies Airplay on Sirius Satellite Radio New York.\nAll My Trials included on British Compilation album by Matchbox Recordings, May 2008.\n\nTV APPEARANCES\nNationwide - March '95\nThe Late Late Show - Feb '96\nPOP4 TG4 - March, '06\nRTE TV - Seoige & O'Shea - 14 April, '08", "otherInfo": "Stage 1 @ Rockwood Music Hall"}, {"Address": "641 Classon Ave, Brooklyn, NY 11238", "Artist": "Dan Perlman ", "ArtistImage": "https://photos.bandsintown.com/thumb/9145929.jpeg", "Coordinates": [-73.958599, 40.678558], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Standup Comedy, Comedy", "Time": "12:30 AM UTC", "Venue": "Friends and Lovers", "moreBioInfo": "Dan Perlman is a stand-up comedian and writer from New York City. Dan was recently named one of the 2018 New Faces in stand-up at Montreal Just For Laughs and headlined Caroline's on Broadway. Dan is the co-writer/director/star of the award-winning comedy series, Flatbush Misdemeanors, which became Oscar-qualified after winning the Grand Jury Prize for Best Narrative Short at the 2018 Florida Film Festival. Dan created and wrote an animated series, That's My Bus!, which received a pilot order from FOX. Dan has appeared on TruTV, MTV2, and as a cast member on MTV's Vidiots. As a writer-filmmaker, Dan has had four projects featured in the New York Television Festival. Previously, Dan was a writer for SiriusXM's Bennington. He also wrote for the 2017-19 WGA Awards, for hosts including Roy Wood Jr. and Lewis Black. As a stand-up, Dan's festival credits include Montreal Just For Laughs, New York Comedy Festival, SF Sketchfest, Limestone Comedy Fest, and Finger Lakes Comedy Competition (1st place).", "otherInfo": "No other event info available"}, {"Address": "425 Lafayette St, New York, NY 10003", "Artist": "Julian Velard ", "ArtistImage": "https://photos.bandsintown.com/thumb/9923198.jpeg", "Coordinates": [-73.991774, 40.729208], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Pop, Vocal", "Time": "1:00 AM UTC", "Venue": "Joe's Pub", "moreBioInfo": "Julian Velard’s musical stylings and comedic timing have made him a fixture in both the comedy and music scenes in his native America, and have created cult followings overseas in the UK and The Netherlands. His music initially took hold a decade ago, where praise from The Guardian, Time Out London, and The Sunday Times led to a major label record deal.\n\nHe’s toured internationally as an opening act for artists such as Jamie Cullum, Paul Carrack, and Goldfrapp, and he has shared the stage with a host of comedians including Will Ferrell, Reggie Watts, Paul Scheer, and Wyatt Cenac. His ability to transition seamlessly between both worlds has led to regular appearances on The Howard Stern Show and NPR’s Ask Me Another. In 2017, he was an artist in residence at the prestigious Joe’s Pub at The Public Theater in New York City.\n\nVelard has written music and lyrics for Pop acts, commercials and the Internet, including songs for UK sensation Olly Murs, Wix.com, New York Knicks, Buzzfeed, Audible and The New Republic. His work has been featured Mashable, The AV Club, and Nerdist. Velard’s latest album, Fancy Words for Failure, was profiled in The Wall Street Journal.", "otherInfo": "Inspired by the unsuccessful experimental Broadway shows of the 1970s, singer-songwriter-comedian Julian Velard has written a musical about his own life. A born Manhattanite living in Queens with a wife and a child, Velard has quit the music business for the stable world of musical theater. Joined by his co-writer and fellow dad Mark from the Park, Velard presents his disasterpiece in an attempt to face middle age with his dreams still on his shoulders and the realities of life around his neck.\n\nWritten by Julian Velard, Grant Black, and Joe Schiappa. Performed by Julian Velard and Joe Schiappa.\n\nJulian Velard’s music styling and comedic timing have made him a regular on The Howard Stern Show and NPR, and have won acclaim in The Guardian, Time Out London, The Sunday Times, and The Wall Street Journal. He’s toured internationally as an opening act for artists such as Jamie Cullum, Paul Carrack, and Goldfrapp, and he has shared the stage with a host of comedians including Will Ferrell and Reggie Watts. Velard’s songs have been featured in Mashable, The AV Club, Nerdist and performed by UK Pop sensation Olly Murs.\n\nJoe Schiappa is a writer and performer based in New York City. Joe's made the series “Sport Court” which was one of IndieWire's Ten Best Web Series of 2017. He was the head writer for the 2016 & 2015 MTV Fandom Awards, MTV's New Year's Eve 2015 and the creator of Truth or Dare which premiered in 2014 on MTV(other). He has written for various comedic outlets including Impractical Jokers, Prank Academy on Youtube RED and Funny Or Die.\n\nGrant Black was born into song. He is the son of legendary Oscar winning lyricist Don Black O.B.E and started his career as a manager representing acts including Adam Ant, Strictly Rhythm Records, and many more. Grant is an international platinum award winning songwriter and songs have been recorded by diverse artists including Run DMC, Sarah Brightman, Craig David, JLS, Olly Murs, Katie Melua, Liberty X, Holly Vallance, Corrine Bailey Rae, Heather Small, and Alicia Keys."}, {"Address": "1650 Broadway, New York, NY 11207", "Artist": "Rick Estrin & The Nightcats ", "ArtistImage": "https://photos.bandsintown.com/thumb/9248229.jpeg", "Coordinates": [-73.983533, 40.761865], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Jump Blues, Blues", "Time": "1:00 AM UTC", "Venue": "Iridium Jazz Club", "moreBioInfo": "Larger-than-life blues star Rick Estrin has piloted the wildly fun and musically fearless Rick Estrin & The Nightcats for the last decade, touring the world and proving night after night why they won 2018’s Blues Music Award for Band Of The Year. The limitless combined talents of blues harmonica virtuoso and sly, soulful singer Estrin, guitar mastermind Kid Andersen, keyboard wizard Lorenzo Farrell and endlessly creative drummer Derrick “D’Mar” Martin take Estrin’s inventive, original songs to new and unexpected places. On stage, the band’s ability to deliver an unpredictable, no-holds-barred show is unmatched.\n\nNow, Rick Estrin & The Nightcats return with their fourth studio album, Contemporary. With the band kicking everything up a notch, Estrin and the Nightcats explore some different sounds, instrumentation and grooves, while maintaining the trademark Nightcats style. Produced by Andersen and Estrin and recorded at Andersen’s now-famous Greaseland Studio in San Jose, California, Contemporary delivers twelve surprising, wise-cracking, foot-stomping songs, including nine by Estrin (one co-written with Andersen), one each by Andersen and Farrell, and one obscure Bobo Jenkins cover. From the noir-ish romp I’m Running to the hilarious title track to the sardonic Resentment File (co-written with Estrin’s friend of over 50 years, Joe Louis Walker), Contemporary packs a modern blues punch. According to Estrin, “Recording at Greaseland, we all had so much fun and were so relaxed, the genius ideas just started pouring in from all sides. I really expect this record to blow some minds.”\n\nIn addition to Estrin’s celebrated songwriting and spectacular harmonica playing, he and the band are among the most entertaining and colorful showmen around. Estrin’s flashing harmonica solos, quick wit and signature hipster-cool look, Andersen’s off-the-cuff guitar pyrotechnics, Farrell’s mighty organ and piano work and D’Mar’s dynamic drumming bring instant fun to their live performances. “People don’t go out to see people who look like themselves,” says Estrin. “They want to see something special. I was schooled in this business to be a showman, and that’s what you get when you come to see us perform. We know how to put on a show. I feel sorry for anyone who has to follow us.”\n\nEstrin was schooled by some of the very best blues musicians. While still a teen, he was tutored by San Francisco’s famous musician (and pimp) Fillmore Slim. He was mentored by Oakland’s legendary Rodger Collins, and gigged with blues stars Lowell Fulson and Z.Z. Hill. Estrin moved to Chicago when he was 19 to work with Windy City bluesmen Johnny Young, Eddie Taylor, Sam Lay and John Littlejohn, and even jammed with Muddy Waters. He returned to California and continued to hone his craft. By the time he joined forces with guitarist Little Charlie Baty and formed Little Charlie & The Nightcats in 1976—a band he would front for the next 30 years—Estrin was a seasoned performer with plenty of talent and a newfound knack for writing killer original songs.\n\nUpon Baty’s retirement from touring in 2008, Estrin recruited high-flying guitar wunderkind Christoffer “Kid” Andersen and formed Rick Estrin & The Nightcats. The band quickly became a worldwide favorite with blues fans as well as critics and radio programmers. “Kid’s a fearless nut on the guitar,” says Estrin. “He’s really the only guy who could fit in with us.” With an uninhibited style that perfectly meshed with Estrin’s wildly imaginative songs, the new band charged out of the gate. Billboard called them “fabulous, remarkable and original.”\n\nSince the 2009 release of Rick Estrin & The Nightcats’ celebrated Alligator Records debut, Twisted, the 2012 follow-up One Wrong Turn, 2014’s crowd-pleasing You Asked For It...Live!, and 2017’s Groovin’ In Greaseland, the band has toured the world, earning high praise and standing ovations everywhere they go. The Chicago Sun-Times said, “These are serious musicians having a hotter than hot good time. It’s tough to stay in your seat when Estrin and his musical cohorts get cooking.” They’ve performed at festivals and concert stages from San Francisco to Chicago to New York, and everywhere in between, plus tours of the United Kingdom, Norway, Belgium, France, Switzerland, Poland, Australia, Israel and recently Estonia and Russia. The band’s worldwide popularity helped Estrin win five Blues Music Awards, including two nods for Song Of The Year (1994 and 2018), Best Instrumentalist—Harmonica (2013) and Traditional Blues Male Artist Of The Year (2018). The full band, Rick Estrin & The Nightcats, won the highly coveted 2018 Blues Music Award for Band Of The Year.\n\nAccording to Estrin, “Contemporary is the most fully realized expression of who Rick Estrin & The Nightcats really are and what we’re capable of as a band. With the group’s help, everything I envisioned for the songs got turned up a notch, with everyone getting more and more inspired.” This is modern blues at its most potent and powerful, with phenomenal musicianship and lyrics that cut with a wink and nod. According to the UK’s Blues & Rhythm, “Rick Estrin & The Nightcats have crafted an instantly identifiable sound. They serve up insightful, original blues combined with tough rock’n’ roll. This band is superb.”\n\nRick Estrin (harmonica, vocals)\nRick Estrin was born in San Francisco, California in 1949, and grew up fiercely independent. As a 10-year-old boy, he made his way to the tough Market Street area and befriended many of the neighborhood characters. When he was 12, his older sister gave him a copy of Ray Charles’ The Genius Sings The Blues, and he became infatuated with the music. Albums from Jimmy Reed, Champion Jack Dupree, Mose Allison, Nina Simone and others soon followed. By the time he was a teenager, Estrin had immersed himself in the urban, African-American culture surrounding him. He got his first harmonica at age 15, and by age 18 was proficient enough to begin sitting in at black clubs around the city. He first jammed with blues master Lowell Fulson and immediately was hired to open five shows for R&B giant Z.Z. Hill. He worked five nights a week for almost a year with guitar legend Travis Phillips in a band fronted by famed pimp/bluesman Fillmore Slim (who was the centerpiece of the acclaimed Hughes Brothers documentary American Pimp). Slim introduced Estrin to singer Rodger Collins, the man who would become Rick’s first real musical mentor. Collins schooled Rick on the finer points of songwriting and show business. At 19, Estrin relocated to Chicago and worked with some of the city’s best bluesmen. He met and jammed with the legendary Muddy Waters, who told Rick, “You outta sight, boy! You got that sound! You play like a man!” Muddy wanted Estrin to go on the road with him, but Estrin missed Muddy’s phone call and it never happened. Estrin eventually moved back to the Bay Area, met guitarist Charlie Baty and formed Little Charlie & The Nightcats. With Charlie’s retirement from touring in 2008, Rick brought in guitar virtuoso Kid Andersen and formed Rick Estrin & The Nightcats.\n\nEstrin cites Sonny Boy Williamson II, Percy Mayfield and Detroit bluesman Baby Boy Warren as his major songwriting influences. His work on the reeds is deep in the tradition of harmonica masters Sonny Boy Williamson II and Little Walter Jacobs, while at the same time pushing that tradition forward with his innovative songs. And his sly and soulful vocals are the perfect vehicle for driving those songs home.\n\nKid Andersen (guitar)\nChristoffer “Kid” Andersen was born in Telemark, Norway. A blues fan since childhood, Andersen fell in love with the music of Otis Rush, Buddy Guy, Junior Watson, and the Kings (B.B., Albert and Freddie). By the time he was 18, he was backing all the American blues stars who came through Norway, including Homesick James, Nappy Brown and Willie “Big Eyes” Smith. He moved to California when he was 21. Once in the U.S.A., Andersen earned a green card as an “Alien of Extraordinary Ability.” Andersen released four solo albums before joining blues harmonica legend Charlie Musselwhite’s band in 2004, a gig that lasted until he joined Rick Estrin & The Nightcats in 2008. In addition to being an expert multi-instrumentalist (guitar, bass, keyboards, percussion), Kid’s talents as engineer and producer keep his now-famous Greaseland Studio fully booked. Winner of the 2017 Keeping The Blues Alive Award, Greaseland has been featured in The San Jose Mercury News as well as on NPR. At Greaseland, Kid has produced, engineered (and many times played on) albums by artists including Tommy Castro, Nick Moss, John Nemeth, Wee Willie Walker and Finis Tasby, as well as all five Rick Estrin & The Nightcats CDs.\n\nLorenzo Farrell (piano, organ)\nLorenzo Farrell was born in Lexington, Kentucky, and grew up in Bloomington, Indiana, where he started playing piano at age five. During his high school years in California, he discovered jazz and made the switch to upright acoustic bass. After high school, Farrell took several years off from his music career to earn a degree in Philosophy from the University of California at Berkeley, and study religion in Delhi, India. Since returning to the San Francisco Bay Area, he has been a highly sought-after multi-instrumentalist, having returned to piano and mastered the organ in recent years. A Nightcat since 2003, Lorenzo has also had the opportunity to perform and/or record with many other artists, including Wee Willie Walker, Elvin Bishop, Finis Tasby, Jackie Payne, Andy Santana, Terry Hanck and Little Charlie Baty’s Organ Grinder Swing.\n\nDerrick “D’Mar” Martin (drums)\nDerrick “D’Mar” Martin is simply a force of nature. D’Mar is a musician, producer, songwriter, singer, educator, entertainer and motivational speaker. He traveled the world for 17 years as the drummer for the legendary Little Richard. D’Mar has also worked with a number of other artists including Dorothy Moore, Bobby Rush, Vasti Jackson, Ali Ollie Woodson (The Temptations), Big Jack Johnson, Carla Thomas, Billy Preston, Roy Gaines, Mitch Woods, Jackie Payne, Syl Johnson, Bob Margolin and Tutu Jones. He shares his passion for music education in his own music lecture series entitled Drums & More. Now, D’Mar brings all of these talents to his new family, The Nightcats.", "otherInfo": "No other event info available"}, {"Address": "951 Dean St, Kings County, NY 11238", "Artist": "Anbessa Orchestra ", "ArtistImage": "https://photos.bandsintown.com/thumb/7158877.jpeg", "Coordinates": [-73.958416, 40.678303], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Wayne Tucker- Trumpet, Eyal Vilner- Alto Saxophone, Eden Bareket- Baritone Saxophone, Nadav Peled- Guitar, Compositions, Arrangements, Dor Heled- Keys, Tamir Shmerling- Bass, Eran Fink- Drums", "Time": "1:00 AM UTC", "Venue": "Wild Birds", "moreBioInfo": "Ethio-Groove group based in NYC.", "otherInfo": "Come join us at this awesome new music venue in Brooklyn!"}, {"Address": "254 W 54th St, New York City, NY 10019", "Artist": "Jumaane Smith ", "ArtistImage": "https://photos.bandsintown.com/thumb/8964241.jpeg", "Coordinates": [-73.98374, 40.76428], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Jazz", "Time": "1:30 AM UTC", "Venue": "Feinstein's/54 Below", "moreBioInfo": "At 30 years old, trumpeter and vocalist Jumaane Smith has already done what most musicians spend their lives dreaming about. He’s traveled the world, played stages in historic clubs, in massive stadiums and at cultural landmarks, recorded a solo album, appeared on national television and performed for two sitting U.S. presidents.\n\nHis collaborations range from pop idols to jazz legends, and the list reads like a lineup for the best New Orleans Jazz Fest ever. He’s worked with Stevie Wonder, Quincy Jones, Alicia Keys, The Jonas Brothers, Wyclef Jean, Justin Bieber, Diddy, Natalie Cole, James Ingram, Wynton Marsalis, Ravi Coltrane, Chris Botti along with many, many more. (See Artists.) And to think… so little of that might have been possible if he’d gotten his wish 21 years ago.\n\nWhen the music teacher at Seattle’s Sacajawea Elementary School led a musical instrument presentation for 4th graders in the school library, young Jumaane, then 9 years old, was immediately drawn to the French Horn and asked to play the instrument. “Why don’t you take this instead,” she replied, explaining that the school had no French Horns. Jumaane “settled” for the trumpet and his life was never the same.\n\nIt took some time to build a foundation. “For the first few years I was horrible,” he admits, “and when I would practice, my mom would make me go outside in the yard because she didn’t want to hear it.” But Jumaane was a quick learner and a voracious student. From his earliest experiences, he established a career-long aptitude toward absorbing anything that would make him a better musician and person.\n\nBy 16, while most kids are content with getting a driver’s license, Jumaane was on a plane for the first time headed to Europe. As a member of the Roosevelt High School Jazz Band under the direction of Scott Brown, he spent three weeks performing at such events as the Montreux Jazz Festival in Switzerland and the North Sea Jazz Festival in Den Hague. He was also able to see many jazz greats in concert. The tour was a defining experience. After that, Jumaane recalls, “I was hooked on music and becoming a great musician myself.” Back in the States, thirsty for more knowledge (and the rush of adventure), he started sneaking backstage at shows to talk to musicians, soaking in an extracurricular education of his own design.\n\nOnly a few years later, Jumaane was living in New York, attending New School University on scholarship. Classrooms were his secondary education as New York’s many Jazz clubs offered a live and lively education. He made connections in the jazz scene by catching shows and performing at jam sessions.\n\nWhile Jumaane was headlining his first gig in New York City he met legendary jazz drummer Rashied Ali, who happened to live a few blocks from the club. Mentored by the great John Coltrane, Rashied in turn became Jumaane’s mentor and a true father figure to the young musician and man. Ali kept him grounded, but taught him to accept the boundless potential of music. He coached him to acquire as much knowledge as he could, but to research and come to his own conclusions rather than take anything at face value. They were great lessons from a great man.\n\nAnd it wasn’t long before another legendary jazz musician would mentor this budding talent. Jumaane was still living in Seattle when he first met Wynton Marsalis. In fact, it was Marsalis who first recommended that he make the big move to the Big Apple. Now, a year into living in New York City, Jumaane was one of 17 musicians (including only 4 trumpeters) invited to join the inaugural class of Jazz Studies at Julliard – a program developed by Marsalis.\n\nSuddenly the classroom was the place to be. Jumaane immersed himself in trumpet technique, classical repertoire, jazz technique and jazz repertoire, orchestration and arranging from both classical and jazz perspectives, music production, music preparation and even music software notation. Meanwhile, Marsalis took him (and only one other student) on for one-on-one private trumpet instruction through Jazz Studies at Juilliard, a practice he hasn’t engaged in since. That relationship had a profound effect on Jumaane. “Wynton is probably the most disciplined person I’ve ever gotten the chance to be around and learn from,” he says. “I feel very fortunate to have him as a mentor to this day.”\n\nGood fortune is only a small part of it, however. Jumaane, by nature recognizes and seeks opportunity. More than that, he strives constantly to earn it. Even before he graduated from Julliard’s four-year curriculum, his hard work paid off with some great professional opportunities.\n\nIn 2002, Marsalis awarded him a scholarship to attend the Academy of Achievement Summit in Dublin, Ireland. The attendees were some of the greatest thinkers alive: world leaders such as Gorbachev and Bill Clinton, Hollywood giants such as James Earl Jones, Nobel Prize winners. Asked the night before the event’s gala finale, Jumaane and a fellow student performed a duet for the event under pressure with no repertoire prepared, “opening” for Chuck Berry. One year later, as February was being declared African-American Music Month, Jumaane and the Jazz Museum in Harlem All-Stars performed for George W. Bush in the East Room of the White House.\n\nIn 2005, thanks to the recommendation of a Julliard classmate, Jumaane was invited to audition for Michael Bublé’s band. Almost seven years later, Jumaane continues to perform, record, travel and learn as a part of the Bublé family. “The experience has been what I imagine post-graduate school to be like,” he says. “Michael Bublé is a wonderfully humble, down to earth and extremely generous person who thrives off of his family and friends realizing their own hopes, dreams and goals. It has been truly inspirational working with him.”\n\nFrom touring the world with Bublé to playing the Grammy Awards show with Stevie Wonder and the Jonas Brothers to recording “As I Am” with Alicia Keys to appearing on the “American Idol” soundtrack to scoring and performing music for the film “Handsome Harry,” Jumaane’s accomplishments go on and on. The recordings he’s appeared on have sold more than 25 million copies worldwide, garnered four Grammy nominations and earned three Grammy wins. The TV shows he’s appeared on total an audience of around 100 million viewers.\n\nJumaane has relished, with gratitude, every experience he’s had as a musician, and intends to embrace new opportunities to work with amazing talents. But finally, after years of conceptualizing, the time has come to take a big step forward into the spotlight, to turn his own ideas into reality. In 2010, he entered the studio to begin work on his debut album, “I Only Have Eyes For You.” A celebration of the Great American Songbook with the theme of love and romance, the album includes interpretations of classic tunes full of personal emotion and meaning for Jumaane.\n\n“I imagine that it is very rewarding to see your own project become successful,” he says. “As the leader, you get back what you put into it.” Now only time will tell how a lifetime of learning and all-star mentorship will pay off.", "otherInfo": "No other event info available"}, {"Address": "289 10th Ave St, New York, NY 10001", "Artist": "DJ Politik ", "ArtistImage": "https://photos.bandsintown.com/thumb/8635854.jpeg", "Coordinates": [-74.002675, 40.750051], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Hip Hop, Edm", "Time": "3:00 AM UTC", "Venue": "Marquee New York", "moreBioInfo": "DJ Politik cut his teeth in the L.A. nightlife scene by sneaking into exclusive Hollywood nightclubs while still in high school. Fueled by a passion for turntablism and hip-hop, he was exposed nightly to world-renowned deejays such as DJ AM, Mark Ronson, and Z-Trip, many of whom were instrumental in pioneering the multi-genre style of mixing records that would pave the way for his career.\n\nPolitik’s eclectic taste, extraordinary musical instincts, and versatility behind the decks has allowed him to tour the world while building an illustrious list of brands, celebrities, and tastemakers that call upon him regularly to spin their annual events & happenings.\n\nAn established face on the international club circuit, Politik maintains high profile residencies in Las Vegas (KAOS @ The Palms), Miami (LIV), New York (Marquee), Atlantic City (Premier @ The Borgata), Chicago (TAO), San Diego (Omnia), and Los Angeles (Avenue).\n\nHis journey has evolved into music production where he has crafted and released club-friendly remixes & edits that are widely supported by artists including Diplo and The Chainsmokers. His wide-ranging, cerebral musical perspective has garnered attention from various heavyweight producers and songwriters, including super-producer Mike WiLL Made-It with whom he has collaborated extensively.\n\nWith a slew of original releases slated for 2020, the budding DJ/Producer continues to position his sonic identity as a melting pot of sorts, drawing influence from virtually every genre of music, and brazenly playing by his own rules.", "otherInfo": "No other event info available"}, {"Address": "E 72nd & 5th Ave, New York, NY 10019", "Artist": "And The Band ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.983759, 40.750183], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "5:00 AM UTC", "Venue": "SummerStage, Central Park", "moreBioInfo": "No artist bio available", "otherInfo": "For the upcoming events, we are going to host several fun quizzes for all of our fans. We choose AhaSlides - the best option among so many kahoot alternatives to enhance your experience. Let's have some fun!!\n\nhttps://ahaslides.com/blog/free-alternative-to-kahoot"}, {"Address": "New York City, NY", "Artist": "Nick Finzer ", "ArtistImage": "https://photos.bandsintown.com/thumb/4913357.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Post Bop, Modern Jazz, Trombone Jazz, Jazz, Trombone", "Time": "4:00 PM UTC", "Venue": "Facebook Live & Zoom", "moreBioInfo": "NICK FINZER...\n\n...is one of the most dynamic musicians of the millennial generation.\n\nAn award-winning composer, arranger, and trombonist, Finzer is bringing the joy and power of Jazz to both traditional fans and the most modern 21st century audiences. He’s on a mission to be a passionate voice defining the sound of Jazz in this age while also bringing street cred to the trombone with a bold, tight sound.\n\nBorn into the musical world (Mom Sherry Finzer is an international flutist), Finzer developed a fascination for the music of Duke Ellington and found himself, in high school, performing at the annual Essentially Ellington competition of Jazz at Lincoln Center. It was then that he decided to pursue a life in music himself. His budding talent was recognized by Wycliffe Gordon who began a life-long mentorship by writing four pieces for the young Finzer while he attended the Eastman School of Music. Nick went on to get his masters at Juilliard’s prestigious Jazz program where he was mentored by the trombone legend Steve Turre.\n\nIn 2011 Nick was the winner of the Eastern Trombone Workshop’s National Jazz Trombone Competition and was a finalist in the 2010 International Trombone Association’s Carl Fontana Jazz Trombone Competition.\n\nIn January of 2013 Nick released his recording debut as a bandleader and composer with “Exposition” (Outside In Music). Two tracks appearing on the album garnered Finzer a pair of accolades: The prestigious American Society of Composers and Performers (ASCAP)’s Herb Alpert Award for young composers (2013 & 2015)\n\nIn 2014, Nick composed a new album-length work, “The Chase.” Nick's sophomore album debuted in July of 2015 on Origin Records to rave reviews, a feature article in Downbeat Magazine, and peaked at #6 on the JazzWeek Charts.\n\nFamed trombonist and mentor Wycliffe Gordon called Finzer “a new voice [in] the pantheon of upcoming trombone greats in the making” and added “Nick's CD is a glowing example of things to come.”\n\nWhen away from NYC, Finzer can be found touring the globe not only with his own projects, but as part of YouTube sensation, Scott Bradlee’s Postmodern Jukebox. Finzer has joined the group on television, in viral videos with millions of views, and on tours across North America, Australia, New Zealand and Europe.\n\nFinzer has performed at top Jazz clubs and concert halls with Wynton Marsalis’ Jazz at Lincoln Center Orchestra, Lucas Pino’s No Net Nonet, Ryan Truesdell's Gil Evans Project, Bob Stewart’s Double Quartet, Frank Wess, Terrell Stafford, Lewis Nash, the Tommy Dorsey Orchestra, Walt Weiskopf, Slide Hampton, Frank Kimbrough, Carl Allen, Steve Turre and many more.", "otherInfo": "Live Stream: https://unt.zoom.us/j/738692774"}, {"Address": "1395 Lexington Ave, New York, NY 10128", "Artist": "Mike Block ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440485.jpeg", "Coordinates": [-73.952791, 40.783079], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "4:00 PM UTC", "Venue": "92nd Street Y", "moreBioInfo": "MIKE BLOCK is a pioneering multi-style cellist, singer, composer, and educator, hailed by Yo-Yo Ma as the \"ideal musician of the 21st-Century\", and acclaimed by the NY Times for his \"vital rich-hued solo playing\". While still studying at the Juilliard School, Mike joined Yo-Yo Ma’s Silk Road Ensemble, with which he has toured extensively throughout the world, and won a 2017 Grammy Award for Best World Music Album. Mike is also an active recording artist of original material, folk music, cross-cultural collaborations, and he has an ongoing project to record all of the Bach cello suites in acoustically glorious bathrooms of famous concert halls, via BachInTheBathroom.com. As one of the first wave of cellists to adopt a strap in order to stand and move while playing, Mike was the first standing cellist to perform at Carnegie Hall, using a cello strap of his own design, called the Block Strap, a performance which the NY Times called \"Breathless ... Half dance, half dare.\"\n\nAs a music educator, Mike is passionate about emphasizing creativity and collaboration, leading to the founding of the Mike Block String Camp in 2010. MBSC provides players of all backgrounds the opportunity to learn from a world-class faculty in a variety of styles, and supports the exploration and development of the artistic voice of each student. Mike is also the founding Director of the Silkroad Global Musician Workshop, bringing together musicians from around the globe, and he created the online Multi-Style Cello School at ArtistWorks.com, with an extensive library of instructional videos. In 2012, Mike was appointed Associate Professor at the Berklee College of Music. Mike lives in Boston with his wife, fiddler Hanneke Cassel.\n\nMike has collaborated with a variety of diverse musicians and groups, such as Mark OConnor, Bobby McFerrin, The New York Philharmonic, Will.i.am, Edgar Meyer, Stevie Wonder, Darol Anger, Allison Krauss, Mike Marshall, Zakir Hussain, The National, Bon Iver, My Brightest Diamond, The Illinois Symphony, Rachel Barton Pine, Marcel Khaliffe, Goran Bregovic, Simone Dinnerstein, Dawn Upshaw, Anthony McGill, Tony Trishcka, Lenny Kravitz, Shakira, Joe Zawinul, Alasdair Fraser, Shujaat Khan, and many others.\n\nMike’s television and radio credits include \"Late Night with Conan O’Brian\", \"Regis and Kelly\", NBC’s 30 Rock, NPR’s \"St. Paul Sunday Morning\", WNYC’s \"Soundcheck\", APM’s \"Performance Today\", WNBC 4’s Chuck Scarborough Show, VH1, The Disney Channel, and the CBS \"Early Show\". When still living in New York City, Mike regularly subbed on Broadway as on-stage cellist for the Pulitzer Prize winning musical, \"Next to Normal\", and he also worked as Music Consultant on the 2012 film, \"A Late Quartet\". Mike was the subject of a 2011 feature article in the Wall Street Journal for his Artistic Directorship of the GALA BROOKLYN Music Festival, featuring cross-cultural collaborations among locally-based musicians.\n\nMike attended college at the Cleveland Institute of Music, where he studied cello with Richard Aaron, and received the Jim Hall Prize for Undergraduate Achievement. Mike also earned a Master’s Degree from the Juilliard School, where he studied with Darrett Adkins and Joel Krosnick. These days, Mike plays on a modern cello made in 2014 by Fabienne Gauchet, D’Addario strings, a David Gage Realist pickup, and the patented cello strap of his own design, The Block Strap.\nwww.MikeBlockMusic.com\nwww.GlobalMusicianWorkshop.com\nwww.MikeBlockStringCamp.com\nwww.CelloStrap.com\nwww.BachInTheBathroom.com\nwww.ArtistWorks.com/Cello", "otherInfo": "No other event info available"}, {"Address": "79 Monmouth St, Red Bank, NJ 07701", "Artist": "El Rock ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-74.06892, 40.34912], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "8:00 PM UTC", "Venue": "Jamian's Food and Drink", "moreBioInfo": "No artist bio available", "otherInfo": "Dry clean\nIn what situations do we go to dry cleaning? Usually, when we cannot deal with pollution ourselves, when the dimensions of the product do not allow us to wash it in a machine (carpets are so accurate), and also when the cut and weaving are so complicated that it will be almost impossible to smooth them after an independent washing.\n\nDry cleaning of carpets and upholstered furniture solves two main problems:\n\nIt does not change the shape of the product;\nShe does not crumple it, so there is no need to smooth it.\nIn addition, water can have a negative effect on some types of stains, and instead of removing them, you get only stains.\n\nDry cleaning of furniture and textiles got its name due to the type of cleaner used. Its composition is similar to ordinary powder, but in reality it consists of a huge number of micro-sponges soaked in a cleaning agent. As a result, contaminants of any origin, starting from oily stains and ending with street-household stains, are easily removed from the surface of the fabric.\n\nThe price of dry cleaning is slightly higher than wet, due to the need to use powerful equipment and expensive cleaning products. At the same time, it allows you to remove dirt as delicately as possible without harming the shape, color and durability of the product.\n\nDry cleaning is suitable for luxury furniture, expensive carpets and textiles.\n\nCleaning after disinfestation. Features and nuances\nInsects and pests are a very unpleasant thing in itself. And after disinsection, you can still find them in a dead form for a long time throughout the room. The simplest and most correct solution in such a situation is to conduct a comprehensive cleaning or order the services of a professional cleaning company.\n\nWhat should be done:\n\nWipe with a damp cloth all exposed surfaces in the room, on which particles of insecticidal preparations could remain;\nVacuum the carpet and carpets with a powerful washing vacuum cleaner using deep cleaning products;\nWash or dry-clean all textile items, including bedding, curtains, curtains, covers for upholstered furniture, etc.;\nWash dishes, ceramics, indoor plants and other interior items that were not taken out during disinfestation.\nBut there are some nuances like showed on https://bestcleaneradviser.com. Firstly, if cleaning is carried out immediately after the destruction of insects, then not all places can be processed. Since insecticidal preparations have a prolonged effect, that is, they continue to kill parasites for several days after spraying, it is better not to touch the places where insect egg clutches were found for some time.\n\nSecondly, it is better to completely abandon the use of folk remedies. No matter how reliable you consider the folk method of cleaning, it will not help you get rid of the remnants of aggressive chemistry. As a matter of fact, pest controllers treat the room with poison, so it is unlikely that you can remove it qualitatively using, say, a solution of water with baking soda.\n\nCleaning after disinfestation requires care, accuracy and willingness to pay attention to detail. If you doubt that you can do everything right, it is better not to expose yourself to unnecessary risk and order a professional cleaning immediately after the persecution of insects."}, {"Address": "66 North 6th St, Brooklyn, NY 11211", "Artist": "Lime Cordiale ", "ArtistImage": "https://photos.bandsintown.com/thumb/9055034.jpeg", "Coordinates": [-73.96168, 40.71925], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Alternative", "Time": "10:00 PM UTC", "Venue": "Music Hall of Williamsburg", "moreBioInfo": "Hailing from Sydney’s northern beaches, brothers Oli and Louis Leimbach of Lime Cordiale command legions of dedicated fans with their incredible live set. They say there’s an innate bond between siblings, a relationship is forged that can last a lifetime. Now, take that intuitive understanding and translate it into music; magic can happen. This is exactly the case for the brothers of Lime Cordiale, whom growing up within a creative, musical family on Sydney’s Northern Beaches, it was natural for the pair to make music together.\n\nLime Cordiale express their feelings that people need to break the rules in order to progress, with Oli stating “you don't have to take the conservative route. You don't need to necessarily plan out your life in your twenties or thirties”. With the brothers compassionate and progressive awareness, the band are focussed on using their love of music to keep Sydney’s music scene alive, along with the support from their surrounding communities and the Australian community as a whole.\nIt’s no surprise that the pair are passionate, and overly sensitive to the effect humans have on Australia’s environment after being raised on an island home and in coastal areas while growing up. The band’s vegan lifestyle and plastic free rider may not be to everyone’s tastes, but their response is simply - “fuck ‘em”.\nIn addition to the hectic schedule and life-band balance, Louis is an avid artist holding regular showcases, but notes that whether he is cutting lino or painting, this side of his life is kept secluded, “Lino cutting is a very time-consuming art form, requires a lot of attention and I find myself doing it alone” says Louis. His art form though does cross over to band-life, with Louis designing all album art, posters and merchandise and states that the creative process can take time to think up ideas and sometimes his work can get so out of control he has to go into hiding, but he calls it “meditative and an escape” and likes the process itself over the end result.\n\nWhen they aren’t busy playing shows, cutting footage for films or designing some form of artwork, Oli and Louis return to their roots, the ocean. Though they love being close to the CBD, sometimes the inner-city pressure means they need to get back to the freedom that the ocean can give, Oli tells “you can be working in the dirt and grind of the city just behind you, but out there on the waves the world is yours”.\n\nLime Cordiale received no airplay from triple j, FBI or commercial radio with the release of their debut album “Permanent Vacation” in Oct 2017, but this essentially underground band was in no need of the tastemaker radios support. Lime Cordiale were happy touring Australia, brewing a strong following along the way. With the release of their single “Dirt Cheap” (Nov – 18) the band exploded to the charts of triple j, then after only 3 short months the single placed #86 on triple j’s infamous Hottest 100 countdown.\n\nIn Feb 2019, Lime Cordiale released their latest single “Money” to accompany their fast selling tour of the same name. The extensive run of shows includes Melbourne, New Zealand and Sydney, and will continue in April to Tasmania, Adelaide, Western Australia and regional New South Wales. So far selling out every show (bar one) they’ve performed (14/20 sold out) and over 5300+ tickets sold. Meanwhile the single was succeeding by its own right, featuring on Spotify’s New Music Friday, iTunes’ Best of the Week and by week 2 was #1 most played on triple j.\n\nThe road ahead looks bright and busy for Sydney based band Lime Cordiale, with a new album just over the horizon and a long-awaited European tour set to unite their international audiences.", "otherInfo": "No other event info available"}, {"Address": "Point Pleasant Beach, NJ", "Artist": "Thomas Vincent ", "ArtistImage": "https://photos.bandsintown.com/thumb/9456719.jpeg", "Coordinates": [-74.048, 40.0917], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Little Falls, New Jersey", "Time": "10:00 PM UTC", "Venue": "Point Lobster Bar & Grill", "moreBioInfo": "Singer/Songwriter from NJ. Styles include, classic rock, folk, 90's alt, and punk.", "otherInfo": "No other event info available"}, {"Address": "1816 Hylan Blvd, Richmond County, NY 10305", "Artist": "Karen Bella ", "ArtistImage": "https://photos.bandsintown.com/thumb/9346109.jpeg", "Coordinates": [-74.09345, 40.58472], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Karen Bella", "Time": "10:30 PM UTC", "Venue": "Michaels Martinis And Meatballs", "moreBioInfo": "Karen Bella, born and raised in New York, is a singer-songwriter and guitarist who performs throughout the tri-state area.\n\nShe studied voice at 9 and began writing original songs at 12. She was always involved with theater production in school as well as band, choir and drama.\n\n\n\nAfter studying at Fivetowns College, Karen began her singer-songwriter music career.\n\nShe released her first album titled “Ordinary Girl”.\n\nBella was invited for a VIP audition for NBC’s The Voice and began performing throughout NYC including places in The Village such as The Delancey, The Living Room, Piano’s and the famously known, The Bitter End. She was even asked to perform at The Harry Chapin Memorial Concert at Harry Chapin Lakeside Theater in Eisenhower Park which she has done for the past several years.\n\n\n\nMajor recent performances have included Huntington’s Folk Festival (July 2015 & 2018), The Smithtown Blues Festival (June 2015) , Philadelphia Music Festival (June 2019) , The Great South Bay Music Festival (July 2019), The Opioids Prevention & Awareness Music Festival (August 2019) and more to come.\n\nAs of June 2019, Sam Ash Music Store sponsors Karen Bella. www.samash.com\nAs of November 2019, Fishman endorses Karen Bella. www.fishman.com\n\n\n\nBella will be releasing a 6 song EP with Producer Josh Dion from the band Paris Monster. March 2020\n\nFor more information on upcoming shows, photos, videos news, music and record releases, please go to www.karenbella.com\n\nFacebook/Instagram: @karenbellamusic\n\nTwitter: @karen_bella_", "otherInfo": "No other event info available"}, {"Address": "121 Brighton Ave, Long Branch, NJ 07740", "Artist": "Three Cheers Too Late ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.987371, 40.284661], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "10:30 PM UTC", "Venue": "Brighton Bar", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "53 Croton Ave, Ossining, NY 10562", "Artist": "Hudson River Stories ", "ArtistImage": "https://photos.bandsintown.com/thumb/8106020.jpeg", "Coordinates": [-73.859981, 41.164604], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Germantown, New York", "Time": "10:30 PM UTC", "Venue": "Ossining Public Library", "moreBioInfo": "JON BOWERMASTER\nWriter, filmmaker and adventurer, Jon is a six-time grantee of the National Geographic Expeditions Council. One of the Society’s ‘Ocean Heroes,’ his first assignment for National Geographic Magazine was documenting a 3,741 mile crossing of Antarctica by dogsled.\nJon has written eleven books and produced/directed more than thirty documentary films. His feature documentaries include ‘Dear President Obama,’ ‘Antarctica, on the Edge,’ ‘After the Spill’ and ‘Ghost Fleet.’ (oceans8films.com)\nHis National Geographic-sponsored Oceans 8 project took him and his teams around the world by sea kayak over the course of ten years (1999-2008), bringing back stories from the Aleutian Islands to French Polynesia, Gabon to Tasmania, and more, reporting on how the planet’s one ocean and its various coastlines are faring in today’s busy world.\nJon lives in New York’s Hudson Valley. He is the President of the One Ocean Media Foundation and Chairman of the Advisory Board of Adventurers and Scientists for Conservation.\nFor the past several years, Jon and his One Ocean Media Foundation / Oceans 8 Films team have focused on a series of short films about the environmental risks to, and hopes for the Hudson River Valley, the birthplace of the American environmental movement. (hudsonriverstories.com)\nJon is a Visiting Lecturer at Bard College, in the Environment and Urban Studies Department; tune into his weekly radio show/podcast, ‘The Green Radio Hour with Jon Bowermaster,’ at radiokingston.org.", "otherInfo": "No other event info available"}, {"Address": "217 E Houston St, New York, NY 10002", "Artist": "Jordan Mackampa ", "ArtistImage": "https://photos.bandsintown.com/thumb/9460185.jpeg", "Coordinates": [-73.986751, 40.722165], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Acoustic Blues, Pop, Soul-blues, Indie, Alt Soul Folk, Soul, Acoustic, Gospel, Alternative, Folk", "Time": "10:30 PM UTC", "Venue": "Mercury Lounge", "moreBioInfo": "After catching the eye of Beats’ Julie Adenuga for his debut single Same Faces, he has only gained more attention and support from the likes Rolling Stones FR, NME, CLASH, The 405, Mahogany, The Telegraph, & BBC Introducing just to name a few.\n\n“You can trust Mackampa's heart and soul” Notion\n\nHis previous releases, including Ep’s Physics and Tales from the Broken have amassed over 50 million streams on Spotify and have been featured on multiple playlists including New Music Friday US, Sweet Soul Sunday, This is How We Do, The Nu Modern, Indie Chill Out, US Viral Charts, New Alt & Indie, Hanging Out and Relaxing as well as Best of the Week & Alternative A List on Apple Music.\n\n“He can equally tear at your heartstrings and fill you with joy” Wonderland\n\nOver the past 2 year Jordan has sold out 4 headline shows in London (most recently selling out Omeara), embarked on 2 UK/EU Headline tours and played support slots at Village Underground, Shepherd’s Bush Empire and Hyde Park for Tom Petty & Stevie Nicks British Summer Time. He also packed out stages and venues at festival such as Barn on the Farm (UK), The Great Escape (UK), Bushstock (UK), Live at Leeds (UK), 110 Above (UK), Kaltern Pop (ITL), Haldern Pop (GER), Neighbourhood (UK), 7 Layers (NL), Cardinal Sessions (GER), Mittsommers (SWZ), MAMA (FR) amongst others.\n\n“Jordan’s powerful live show is imbued with rich potential” CLASH", "otherInfo": "Jordan Mackampa"}, {"Address": "3 Spruce St, New York, NY 10038", "Artist": "Smolsky ", "ArtistImage": "https://photos.bandsintown.com/thumb/9388462.jpeg", "Coordinates": [-74.004764, 40.710781], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Folk, Indie", "Time": "11:00 PM UTC", "Venue": "Schimmel Center", "moreBioInfo": "Matthew Smolsky is a singer, songwriter, actor, and producer from Los Angeles, CA. Now based in New York City, Smolsky has made a name for himself in both the music and theatre industry using only his last name. This one-name, one man show is known for his high-energy performances in venues across the nation such as The Mint (Los Angeles), The Bitter End (New York City), and The Ryman Auditorium (Nashville). Smolsky started developing his craft at thirteen after seeing Ed Sheeran perform in 2011. His influences range from the rock anthems of Bruce Springsteen to the lyrical complexities of Stephen Sondheim. As a singer/songwriter, Smolsky has proved himself to be a very prolific songwriter of his age and “one of the best [songwriters] of his generation” (SCV Magazine). In 2014, Smolsky created his own label/publisher Crazy Bitch Records. In May 2018, Smolsky and CBR released Sea Salt + Strawberries: A Live Album on all streaming platforms which allowed Smolsky to tour across the US and EU. At the age of 21, Smolsky is making waves into what be will soon be “one of the biggest names in music” (The Main). He has been regarded as “an artist that really is defining a new genre of this generation and bringing talent to the music industry that is refreshing and pure\" (Buzz Music LA). His live album “Sea Salt + Strawberries” is out now on all platforms.", "otherInfo": "No other event info available"}, {"Address": "768 Franklin Ave,, Brooklyn, NY 11238", "Artist": "Robi D Light ", "ArtistImage": "https://photos.bandsintown.com/thumb/10220059.jpeg", "Coordinates": [-73.957575, 40.672163], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "Drink", "moreBioInfo": "No artist bio available", "otherInfo": "A happy hour gathering for queer women and folx age 30+\nBKLYN\nDrink Lounge *"}, {"Address": "315 West 44th St, New York, NY 10036", "Artist": "Nellie McKay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8580565.jpeg", "Coordinates": [-73.989689, 40.759], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Nellie McKay", "Time": "11:00 PM UTC", "Venue": "Birdland", "moreBioInfo": "Sister Orchid is Nellie’s seventh album, starting with Get Away From Me (“a tour de force” – The New York Times), including Normal As Blueberry Pie: A Tribute to Doris Day (“among the killer overhauls of American standards” – The New York Times) and My Weekly Reader, music of the ‘60s (“..kicks serious butt. The results are beautiful.” – PopMatters), her second collaboration with famed Beatles engineer Geoff Emerick. On Obligatory Villagers (“a brisk nine-song set that plays like the breathless first act of a stage musical decrying American fascism” – SPIN), local Poconos hometown jazz greats Bob Dorough, Phil Woods, and David Liebman contributed their exceptional talents.\n\nShe has won a Theatre World Award for her portrayal of Polly Peachum on Broadway in The Threepenny Opera, performed onscreen in the films PS I Love You and Downtown Express, and her music was used in Rumor Has It, Monster-in-Law, PS I Love You, Gasland, Last Holiday and Private Life.\n\nMcKay co-created and starred in the award-winning off-Broadway hit Old Hats and has written three acclaimed musical biographies – I Want to Live!, the story of Barbara Graham, third woman executed in the gas chamber at San Quentin, Silent Spring: It’s Not Nice to Fool Mother Nature, an exploration of environmental pioneer Rachel Carson, and A GIRL NAMED BILL – The Life and Times of Billy Tipton, named one of the Best Concerts of 2014 by The New York Times. Her latest lady bio is The Big Molinsky – Considering Joan Rivers (“unpredictable, thrilling…sardonic wit..” – The New York Times).\n\nNellie’s music has been heard on Mad Men, Boardwalk Empire, Weeds, Grey’s Anatomy, NCIS, Nurse Jackie, and SMILF, and she has appeared on TV shows including The Late Show with David Letterman, Conan, Ferguson, and The View. Nellie has made numerous radio appearances on NPR’s Mountain Stage, A Prairie Home Companion, eTown, and Marion McPartland’s Piano Jazz. The Chase Brock Experience produced a ballet of her third album, Obligatory Villagers, and she contributed the forward to the 20th anniversary edition of The Sexual Politics of Meat. Her writing has also appeared in The Onion, Interview and The New York Times Book Review.\n\nA recipient of PETA’s Humanitarian Award and the Humane Society’s Doris Day Music Award in recognition of her dedication to animal rights, Nellie is an annoyingly vocal advocate for feminism, civil rights and other deeply felt progressive ideals. She is currently part of the campaign to get horse-drawn carriages off the streets of New York City. She would like to be friends with Russia, the country with the most nuclear weapons in the world. We must all be very kind to one another.\n\n“Thanks to (McKay), the Great American Songbook has a living, breathing present as well as a glorious past” – Boston Globe\n\n“McKay comes on as a Harlem Holly Golightly, a social activist with a disarming mastery of pop vernacular.” – Los Angeles Times\n\n“…a sly, articulate musician who sounds comfortable in any era” – The New York Times\n\n“..ambitious, intriguing and clever..” – Billboard\n\n“McKay must have been genetically engineered under an oyster shell in New Orleans’ Frenchman St.. a bizarre sense of busker authenticity…witty, bright, and gloriously inappropriate.” – Theater Mania\n\n“..funny and touching, ceaselessly clever and scarily talented.” – The New Yorker\n\n“A renegade songwriter with an ultraflexible Great American Songbook sensibility, McKay finds modern resonances everywhere…” – Rolling Stone\n\n“Her last two ‘cabaret’ shows I saw have been jaw-dropping. They both completely subverted the genre,” said David Byrne, … Among Ms. McKay’s charms, Mr. Byrne said, are the ways she playfully mixes what he called a “tragic noir vibe” with her “wicked sense of humor.” – The Wall Street Journal\n\n\n“The one thing certain about Ms. McKay is the size and range of her talent..” – The New York Times", "otherInfo": "No other event info available"}, {"Address": "127 E 23rd St, New York, NY 11226", "Artist": "Young Nudy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9045229.jpeg", "Coordinates": [-73.98492, 40.7399], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rap", "Time": "11:00 PM UTC", "Venue": "Gramercy Theatre", "moreBioInfo": "Young Nudy", "otherInfo": "No other event info available"}, {"Address": "269 Norman Ave, Brooklyn, NY 11222", "Artist": "Ryan Clark ", "ArtistImage": "https://photos.bandsintown.com/thumb/10213564.jpeg", "Coordinates": [-73.94218, 40.727844], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Pop, Country", "Time": "11:00 PM UTC", "Venue": "Kingsland Bar & Grill", "moreBioInfo": "Ryan Clark is an original Nashville recording artist who is quickly making a name for himself in the industry. He's a singer-songwriter who's got that pop-country Nashville sound that is allowing him to independently explore music. He released his first original EP titled Take a Chance and now has a new single out titled Show Me How. His energy on stage is electric, making for an interactive and enjoyable experiences every time he performs. His songs are catchy and written from the heart...reflecting on past relationships, heart-break, and life experiences. Check out ryanclarkmusic.com to learn more.", "otherInfo": "Nothing but Everything Tour"}, {"Address": "269 Norman Ave, Brooklyn, NY 11222", "Artist": "Lance and Lea ", "ArtistImage": "https://photos.bandsintown.com/thumb/9986975.jpeg", "Coordinates": [-73.94218, 40.727844], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Americana Pop Folk, Indie, Alternative", "Time": "11:00 PM UTC", "Venue": "Kingsland Bar & Grill", "moreBioInfo": "Dream loud. That’s the way Texas native Lance Kotara and Colorado belle LeAnna Kaufman live their lives. It was no surprise the two songwriters would find each other in Nashville. Their undeniable creative chemistry exploded, forming the duo, Lance and Lea.\nLance describes their first songwriting session together as nothing short of amazing. “It was so magical how the songs just fell out of the air. Right away we knew we were onto something special.”\nOn a typical day, you can find the duo in their home studio, writing and laying down a new track. Lea says their determination and commitment to the music is indestructible. “To get our music out there, we had to learn how to record ourselves.” It’s been tough at times, but they both know it’s beneficial. “The hard work, the time, it’s all worth it. We’ve honed our craft, and every day we learn something new.” Marked by heart pounding harmonies, prominent guitars, and emotional lyrics and melodies, their collaborative genius is on fire, with over 200 songs already penned. And they were right. It was worth it. In 2016 the duo signed with Nashville’s Number One Group, and their first album with producer Paul Worley is scheduled for release in mid-2017. Their music is making the rounds internationally, garnering airplay in the UK, Ireland, and in Music City, Nashville Tennessee.\nLance knew he wanted to be a musician at a young age. “Music has been my passion since I started playing the guitar at thirteen,” he said. Growing up in the small town of Beeville, Texas, he saw music as self-expression, and once he started, he couldn’t stop. The desire to play brought Lance to Austin, where he formed a band and played the live scene, sharing the stage with influencers like Snow Patrol, Jars of Clay, and even Vince Neil of Motley Crue. Lance found a love for songwriting and relocated to Nashville to hone those skills and make a name for himself. He was lucky enough to land a major label single with country artist Laura Bell Bundy, and have a song in the 2016 Share a Song/Share a Coke campaign.\nLea says her love for music grew from her days singing alongside her sisters in church. “I was born into an Amish family, and though music wasn’t encouraged, I always dreamed of having my own guitar and singing on stage.” The loss of her father pushed that desire. “Death has a way of changing your reality and altering your perception on life. It wasn’t until my Dad passed away that I picked up the guitar and started writing my own songs. The first song I ever wrote was about him.” Songwriting opened up a new outlet for creative expression for Lea. “It wasn’t long before I found myself in Nashville working alongside producer/songwriter Wayne Wilkins, who’s worked with Natasha Bedingfield and Beyoncé, and since then, I’ve had the opportunity to record with some of Nashville’s finest musicians.”\nThe duo hasn’t forgotten their past but uses the present for inspiration. They agree that something special happens when they both pick up a guitar, something that puts them in the moment where songs come to life.", "otherInfo": "Nothing but Everything Tour with Ryan Clark and Lance and Lea"}, {"Address": "158 Bleecker St, New York, NY 10012", "Artist": "Horse Feathers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9138501.jpeg", "Coordinates": [-73.999882, 40.728425], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk, Indie Folk", "Time": "11:00 PM UTC", "Venue": "Le Poisson Rouge", "moreBioInfo": "Justin Ringle moved to Portland, Oregon in 2004, and began to play open mics regularly under the moniker Horse Feathers. In 2005 Peter Broderick heard two songs that Justin had recorded in a friend's basement, and proceeded to track Justin down via the internet. Shortly after that, the two started playing music together. For the most part, Justin writes the songs initially, and then Peter helps to arrange them with varying instrumentation. The resulting sound is music.", "otherInfo": "No other event info available"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Erene ", "ArtistImage": "https://photos.bandsintown.com/thumb/7808435.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Hip Hop, Alternative Folk, Rock, International, Pop, World, Folk", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "Italian born singer songwriter Erene moved to New York in 2000 and has already made a spectacular impact. She performs regularly at New York City clubs like The Living Room, Bitter End, Rockwood Music Hall, The Knitting Factory, Makor. Her self- titled debut album was recently released to critical acclaim and she’s developed a growing and loyal following both online and live. Among her fans is hit maker and star Brad Roberts of Crash Test Dummies (Erene’s co-writer), and Larry Dvoskin- a four time Grammy nominated songwriter/producer who’s worked with David Bowie, Brandy, Ricky Martin, Van Halen. Erene's EP is on rotation on national Italian radio, she is featured in Festivals throughout the country. Erene is young and part of a new generation of chanteuse singer songwriters speaking for her world conscious generation. Her star is bright and will continue to shine brighter in days to come.", "otherInfo": "No other event info available"}, {"Address": "185 Orchard St, New York, NY 10002", "Artist": "Erene ", "ArtistImage": "https://photos.bandsintown.com/thumb/7808435.jpeg", "Coordinates": [-73.988346, 40.722035], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Hip Hop, Alternative Folk, Rock, International, Pop, World, Folk", "Time": "11:00 PM UTC", "Venue": "Rockwood Music Hall Stage 3", "moreBioInfo": "Italian born singer songwriter Erene moved to New York in 2000 and has already made a spectacular impact. She performs regularly at New York City clubs like The Living Room, Bitter End, Rockwood Music Hall, The Knitting Factory, Makor. Her self- titled debut album was recently released to critical acclaim and she’s developed a growing and loyal following both online and live. Among her fans is hit maker and star Brad Roberts of Crash Test Dummies (Erene’s co-writer), and Larry Dvoskin- a four time Grammy nominated songwriter/producer who’s worked with David Bowie, Brandy, Ricky Martin, Van Halen. Erene's EP is on rotation on national Italian radio, she is featured in Festivals throughout the country. Erene is young and part of a new generation of chanteuse singer songwriters speaking for her world conscious generation. Her star is bright and will continue to shine brighter in days to come.", "otherInfo": "No other event info available"}, {"Address": "129 Main St, Nanuet, NY 10954", "Artist": "Richie G and Ginger Martini Duo ", "ArtistImage": "https://photos.bandsintown.com/thumb/5343707.jpeg", "Coordinates": [-74.012969, 41.092609], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Singer Songwriter, Rock, Pop Country, Pop", "Time": "11:00 PM UTC", "Venue": "Jacqueline's on Main", "moreBioInfo": "So….first a little history. Sadly, I attempted violin as a young child and was brutally bad. My parents had some how had me listening to classical music at that time which probably explains the violin attempt. Then a miracle happened…First, the Beatles arrived so, bye bye classical & then my aunt who was buying a new piano (the wealthier end of the family) offered me her old one. I’m 8 1/2 so I was still agreeable to anything so I promised to take lessons and really work at it.\nI lied…After a year and a half I quit…..until I discovered Elton John. That was it! I was determined to be a musician. In the late 70’s I joined a fairly succesful 50’s/60’s band called Slick. I played 6 nights a week and worked full time at a department store as a stock man (person in this politically correct universe). Exhaustion wasn’t considered. I went to gigs with a thermos of tea and lemon since I was always sick. This lasted until the early 80’s. I joined a band called Loose Change which (under my direction) played anything from the 1960’s- whatever was current. That lasted 12 years. Many years of putting my ears in harms way and breathing in way to much bar smoke told me it was time to quit. This was somewhere around 1993/94 (I don’t remember). The next time I played live was in 2004 at my local block party. That’s what I needed to get the itch to play again but, I was working in retail at Sam Ash Music and simply had no time to gig. In 2007 I was offered a better job which offered me a 9-5 existence. The economy turned sour and earning extra cash became a priority. And then it happened….I walked into a local Italian restaurant called Vera’s Trattoria to pick up a pizza and lo and behold (fancy words ehh?) a piano player was pumping out Jazz licks. Can you imagine? Live music! I decided to approach the owner to see if I could score a gig. He decided to try me the following week. I was hired as a permanent fixture on Saturday nights. Thus The Richie G Review was born. “A one man band Piano/vocals using backing tracks and a voice harmonizer to create a full band sound. My current song list represents over seventy artists including Elton John, Billy Joel , James Taylor, The Beatles and hits from the 1960’s thru today. Over 500 tunes and counting– Booking email onemanbandrichieg@gmail.com .” I played at Vera’s for 14 months and then a new owner took over. He decided that entertainment was unnecessary. I got to work recording a CD of covers and creating business cards. The hard work paid off! I’m a permanent Wednesday night fixture at the Woodcliff lake Hilton as well as sprinkling in various weekend gigs.\nRidgewood Street Fair 2013-2014\n\n392561_413258562028352_398683286819213_1318553_160572558_nRIDGEWOOD\n\nChapter 2- Ginger Martini was Born Right around St Patty’s Day of 2012, I was performing at the Elm Street Grill in Oakland NJ. I was approached by my soon to be partner Wendy Kelly. I was on the floor wiring up my equipment as she, asked me questions about what I do (kind of music, etc). I was excited believing that I was going to be hired for a private party. During the break, she handed me her card.It turned out she was interested in joining me. I wasn’t looking but, I agreed to see what she sounded like at my rehearsal space (haha my basement). Three songs later I was convinced. We sounded great together. A week later, we had 50 plus songs ready for prime time. She joined me at The Paris Inn in Wayne NJ. Ever since we perform around 50% of my gigs together and get an incredible response. Wendy started a seasoned veteran of the Broadway, Standard, and Country Genres. She has since dragged me into her country word as I dragged her into my pop/rock world. An amazing combination was born!", "otherInfo": "Located in the heart of Nanuet, Jacqueline's Wine on Main serves the finest wine and tapas.\n\n\n\nWhether it's a night out with friends, or a setting for an informative business meeting, our venue provides the highest quality atmosphere, food, and drink.\nhttps://www.jwineonmain.com"}, {"Address": "340 Summit Ave, Jersey City, NJ 07306", "Artist": "Alison Clancy ", "ArtistImage": "https://photos.bandsintown.com/thumb/7185169.jpeg", "Coordinates": [-74.063643, 40.727077], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Electro Rock, Altpop, Psychadelic Disco, Dream Pop, Alternative", "Time": "11:00 PM UTC", "Venue": "Smush Gallery", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "337 Newark Ave, Jersey City, NJ 07302", "Artist": "Kishi Bashi ", "ArtistImage": "https://photos.bandsintown.com/thumb/6714051.jpeg", "Coordinates": [-74.051506, 40.724972], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Electro Pop, Pop, Chamber Pop", "Time": "11:00 PM UTC", "Venue": "White Eagle Hall", "moreBioInfo": "Having collaborated and toured with indie strangelings of Montreal, Regina Spektor, and Sondre Lerche, singer, violinist, and composer, K Ishibashi (aka Kishi Bashi), embarks on a epic orchestral solo project. His solo live show is a dazzling array of looping and vocal/violin gymnastics. K is also singer of the NYC synth rock band Jupiter One.\n\nhttp://KishiBashi.com", "otherInfo": "No other event info available"}, {"Address": "155 Varick St, New York, NY 10013", "Artist": "Sinéad O'Connor ", "ArtistImage": "https://photos.bandsintown.com/thumb/10272104.jpeg", "Coordinates": [-74.00575, 40.72642], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "City Winery", "moreBioInfo": "Sinéad Marie Bernadette O'Connor (born December 8, 1966) is a Grammy Award-winning Irish singer and songwriter. Brash and outspoken — her shaven head, angry visage, and shapeless wardrobe a direct challenge to the popular culture's long-prevailing notions of femininity and sexuality — O'Connor irrevocably altered the image of women in rock; railing against long-standing stereotypes simply by asserting herself not as a sex object but as a serious artist, she kick-started a revolt which led the way for many female performers. O'Connor ranked among the most distinctive and controversial popular music stars of the 1990s, the first and in many ways the most influential of the numerous female performers whose music dominated airwaves throughout the decade. Her first album, The Lion and The Cobra, was released in 1987, and its popular and critical acclaim made her a star of pop music. She produced her second album, I Do Not Want What I Haven't Got, a critical success that included her hit single \"Nothing Compares 2 U,\" a song written by Prince. O'Connor was as well-known for her political beliefs as for her music (she once shredded a photo of Pope John Paul II on U.S. television), but in recent years she has been less publicly controversial. In 2003 she announced her retirement from the music business. In 2000 released her album \"Faith and Courage\". Another album, Throw Down Your Arms was released in 2005. Her newest release is a double CD, Theology, being released in June 2007.\n\nCurrently working with Ian Brown (former The Stone Roses frontman).", "otherInfo": "It is with deep regret that we must inform you that the Sinead O’Connor City Winery shows scheduled for March and April 2020 have been postponed due to all our concerns with the recent developments concerning the spread of COVID-19. City Winery did everything possible to keep the shows running but priority for them as well as us is the safety and well-being of guests, artists, and staff. With recommendations that there be no gatherings of more than 250 people, even with their social distancing venue layout, we have collectively taken it under advisement that a rescheduling is in the benefit of the public good. We apologize for the notice, as the situation has changed rapidly and we are responding accordingly. We are diligently working to provide new upcoming future dates and will update as soon as it’s finalized.\n\nAlso, due to the current corona virus emergency, the 4/7/20 concert with Sinead O’Connor has been postponed. The Birchmere and Ticketmaster will notify patrons as to the rescheduled date. Please hang on to your tickets until we have more info. We appreciate your patience during these difficult time.\n\n\nWhile this decision comes at a time of universal uncertainty, we take the safety and health of all involved with Sinead O'Connor very seriously.\n\nWe would like to thank all at City Winery, The Birchmere, ICM Partners, and Ms O'Connor's band and crew for their honourable and consummate professionalism under the most challenging of circumstances - and to Sinead O'Connor for doing all in her power to assure the safety & well being of her band, crew and in assuring her fans that the show will go on...\n\n\n\n67 Management"}, {"Address": "155 Varick St, New York, NY 10013", "Artist": "Tinsley Ellis ", "ArtistImage": "https://photos.bandsintown.com/thumb/10097995.jpeg", "Coordinates": [-74.00575, 40.72642], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Blues Rock, Blues", "Time": "11:30 PM UTC", "Venue": "City Winery", "moreBioInfo": "Ever since he first hit the road 40 years ago, blues-rock guitar virtuoso, soulful vocalist and prolific songwriter Tinsley Ellis has grown his worldwide audience one scorching performance at a time. Armed with blazing, every-note-matters guitar skills and scores of instantly memorable original songs, Ellis has traveled enough miles, he says, \"to get to the moon and back six times.\" He's released 17 previous solo albums, and has earned his place at the top of the blues-rock world. When asked if he'd consider himself a \"blue-collar\" bluesman, Ellis, in his trademark wit, quips, \"No. I'm part of the no-collar crowd.\" His imaginative songs tell stories of common, shared experiences in uncommon ways, all fueled by his high-octane, infectious, hard-rocking guitar playing. Live, Ellis has captivated and amazed fans in all 50 United States, as well as in Canada, all across Europe, Australia and South America. Vintage Guitar says, \"He delivers blistering blues-rock, soul romps, minor-key blues, and shuffles—and it all sounds great.\" The Chicago Sun-Times says, \"It's hard to overstate the raw power of his music.\"\n\nEllis considers his new album, Ice Cream In Hell, the most raw-sounding, guitar-drenched album of his career. Recorded in Nashville and produced by Ellis and his longtime co-producer Kevin McKendree (John Hiatt, Delbert McClinton), Ice Cream In Hell is a cathartic blast of blues-rock power. Though inspired by all three Kings (B.B., Albert and Freddie), as well by Carlos Santana, Hound Dog Taylor and others, Ice Cream In Hell is pure, unadulterated Tinsley Ellis. The 11 Ellis originals range from the nod to Stax-era Albert King, Last One To Know, to the Peter Green-flavored Everything And Everyone to the Hound Dog Taylor-esqe romp Sit Tight Mama before ending with the hair-raising, slow-burning ballad, Your Love's Like Heroin. Throughout the album, Ellis' deeply emotional, lyrical guitar solos perfectly match his fervent vocals.\n\nFor full bio see https://www.alligator.com/artists/Tinsley-Ellis", "otherInfo": "No other event info available"}, {"Address": "23 White Deer Plaza, Sparta, NJ 07871", "Artist": "Kate Dressed Up ", "ArtistImage": "https://photos.bandsintown.com/thumb/9505719.jpeg", "Coordinates": [-74.640188, 41.031053], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie Rock, Indie Folk, Indie", "Time": "11:30 PM UTC", "Venue": "Krogh's Restaurant & Brew Pub", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "3 Lafayette Ave, Brooklyn, NY 11217", "Artist": "Colin Fowler ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.978878, 40.686876], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "11:30 PM UTC", "Venue": "Mark Morris Dance Group", "moreBioInfo": "No artist bio available", "otherInfo": "Performing Satie, Handel, and Schubert's Trout Quintet with the MMDG Music Ensemble"}, {"Address": "310 Lenox Ave, New York, NY 10027", "Artist": "Michela Marino Lerman ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-73.944882, 40.808144], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Tap Dancing, Jazz, Rhythm & Blues, Tap Dance, Funk, Blues, World Music", "Time": "11:30 PM UTC", "Venue": "Ginny's Supper Club", "moreBioInfo": "Michela Marino Lerman winner of the 2019 Hoofer Award, is a globally sought after tap dance artist, performer, choreographer, educator and all-around creative spirit. The Huffington Post has called her a “hurricane of rhythm” and the NY Times has called her both a “prodigy” and has described her dancing as “flashes of brilliance”. She very proudly, was mentored by some of the masters of tap dance including Gregory Hines, Buster Brown, Leroy Myers, Marion Coles and Mable Lee. Lerman has performed, choreographed, produced, and directed many projects throughout her career. Some highlights include leading her own band Love Movement and being a member of the band Mwenso and the Shakes, whom she tours with regularly. Performing at the Newport Jazz festival, Jazz at Lincoln Center, opening night of The Shed at the Hudson Yards, The Other Palace on London's West End, and co-producing the documentary American Tap. She has had the honor of working with such masters as Wynton Marsalis, Roy Hargrove, Anna Deavere Smith, Jon Bastiste, Quincy Jones, Steve McQueen and many more. www.michelataps.com @michelataps", "otherInfo": "No other event info available"}, {"Address": "65 St Marks Pl, New York, NY 10003", "Artist": "Yuval Amihai ", "ArtistImage": "https://photos.bandsintown.com/thumb/8294803.jpeg", "Coordinates": [-73.986145, 40.728081], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Jazz", "Time": "11:30 PM UTC", "Venue": "Jules Bistro", "moreBioInfo": "Yuval Amihai was born in Beer Sheva, Israel in 1981. He began studying the piano at the age of eight, and five years later switched to electric guitar. He soon discovered his passion for improvisation and jazz, and during his high school years he began to travel regularly to Tel Aviv to study with Israel’s leading musicians, and to participate in workshops and master classes. At the age of 16 he started performing professionally with jazz bands around the country and leading several projects with his original music. At 19, Yuval wrote an original composition for his hometown’s string quartet and for the renowned Oud and Violin player Yair Dalal. His music was selected by one of Israel’s leading composers and music educators Michael Wolpe, and was performed in concert halls across Israel. Soon afterwards he started studying at The Jerusalem Academy of Music and the Rimon Jazz School in Tel Aviv and participated in various musical projects. In 2005 Yuval moved to Paris. He quickly made his way into the local jazz scene and started playing in Paris clubs and venues. The following year he studied at the Jazz department of the Paris Region Conservatory, graduating two years later. Since 2008 Yuval leads his quintet, the Yuval Amihai Ensemble, with whom he performs music which is strongly influenced by his childhood in Israel. The ensemble has won numerous awards, including the Grand Prize and the 1st composition prize at the \"La Défense\" National Jazz Competition in 2009, The 1st prize in the Saint-Germain Jazz festival Contest in Paris (2008), and the 3rd prize in the international jazz competition of Hoeilaart, Belgium. The band has performed in opening act concerts for renowned artists as Avishai Cohen, Bojan Z, Rabia Abu-Khalil and Kyle Eastwood, and played in numerous Jazz festivals, concert halls and jazz clubs in France and Europe, including Nancy Jazz Pulsations, La Défense Jazz Festival, Sunset/Sunside Jazz Club (Paris), Jazz à Staint-Gérmain-des-Près Festival (Paris), Guitar Art Café (Belgrade, Serbie), Budo Tomovic Theater (Podgorica, Monténégro), National theaters of Amiens, Sceaux & Valencienne. In 2012 Yuval released his first album with his quintet, \"Yuval Amihai Ensemble\", which was acclaimed by critics and received the \"Chosen Album\" label by French leading jazz critics website CitizenJazz.com. This was followed by a full support by the SACEM organisation's grants program for self-produced albums. In 2015, Yuval records his second album \"LONGING\" with his new trio, including bass player Damien Varaillon and drummer Gautier Garrigue. The album was released May 25, 2015 (distributed by L'Autre Distribution). Acclaimed by critics it receives the \"Chosen album” label by CitizenJazz.com as well as the “Discovery” label in the Jazz News magazine. The trio is invited on several radio shows, including on the national France Musique radio and TSF Jazz radio. The CD release concert is held in September that year at the Duc des Lombards Jazz club in Paris. Jazz guitarist & composer", "otherInfo": "No other event info available"}, {"Address": "224 Waverly Pl, New York, NY 10014", "Artist": "Grace McLean and Them Apples ", "ArtistImage": "https://photos.bandsintown.com/thumb/6388885.jpeg", "Coordinates": [-74.001945, 40.736066], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Electronic, Pop", "Time": "12:00 AM UTC", "Venue": "Rattlestick Playwrights Theater", "moreBioInfo": "Called “electrifying” by The Huffington Post and “phenomenal” by The New York Times, Grace McLean is a multi-hyphenate actor-singer-writer-teacher on the rise. In addition to performing in the New York theater scene on Broadway and off, Grace also makes time for her acclaimed original music, writing for her band Grace McLean & Them Apples. Manhattan User's Guide writes, \"this pop and jazz singer writes seriously infectious melodies with seriously antic lyrics. Her voice can raise the roof, or she can slide off a note and break your heart,” and Stephen Holden of the New York Times says “Ms. McLean’s voice [is] a flexible instrument with unexpected reserves of power...Behind her playful adventurousness lies a well of passion.”", "otherInfo": "No other event info available"}, {"Address": "370 New York Ave, Huntington, NY 11743", "Artist": "Kofi Baker ", "ArtistImage": "https://photos.bandsintown.com/thumb/8981258.jpeg", "Coordinates": [-73.425768, 40.869652], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Kofi Baker", "Time": "12:00 AM UTC", "Venue": "The Paramount", "moreBioInfo": "Kofi Baker made his first appearance with his father Ginger Baker in 1975 on the live UK TV show The Old Grey Whistle Test, he’s been playing before the public ever since.\nThe early 80’s found Kofi and his father playing drum duets throughout Europe. Later Kofi toured with John Ethridge (Soft Machine), gigged in London with Steve Waller (Manfred Mann) and with Randy California (Spirit). He joined Steve Marriot after Humble Pie and toured Europe.\nHighlights of the 1990’s for Kofi were a Budapest tour with Jack Bruce, signing to Scotty Brothers Records and recording the album Lost City in ‘92, followed by the album “Abstract Logic” with Jonas Hellborg and Shawn Lane in 1994. This was followed by a variety of tours including more drum duets with Ginger Baker.\nNow living in L.A., Kofi formed Mojo with Ric Fierabracci and Brett Garsed. Kofi then played in OHM, a jazz fusion outfit with Chris Poland (of Megadeth) on guitar and Robert Pagliari on bass, he has also toured in support on Joe Satriani's European Tour\nMore recently Kofi has completed The Extreme Guitar Tour with Uli Jon Roth -Former Scorpions lead guitarist, Vinny Appice - DIO, Black Sabbath, Rick Derringer, John Lennon ect. Vinnie Moore - Lead guitarist with UFO.\n\nKofi is now living in Hobart IN. Kofi Baker's Cream Experience is his latest inspiration - a powerful trio that rivals that of Cream.", "otherInfo": "No other event info available"}, {"Address": "330 7th Ave, New York, NY 10001", "Artist": "Fernando  Otero ", "ArtistImage": "https://photos.bandsintown.com/thumb/10046098.jpeg", "Coordinates": [-73.99335, 40.74777], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Fernando Otero", "Time": "12:00 AM UTC", "Venue": "OPERA America's National Opera Center", "moreBioInfo": "FERNANDO OTERO\nThe Argentine composer, vocalist and pianist Fernando Otero found his voice as writer, musician and bandleader when, at the urging of one of his music teachers, he began to incorporate the indigenous sounds of his native Buenos Aires into his work. …\"A unique and provocative style developed, which combined the improvisatory thrill of jazz with a contemporary classical structure in compositions that were often fast–paced and intense, full of dramatic stops and starts\" BBC London 2007\nOtero first gained prominence in 2000 with his debut and eponymous album, a collection of pieces recorded in Buenos Aires in the early 90's, before moving his residence to New York. Afterwards he released \"Chamber Music\", \"Siderata\", \"Plan\", \"Revision\", \"Expansion\" and in 2008 his acclaimed debut album on Nonesuch Records: \"Pagina de Buenos Aires\" .\nAfter the release of \"Material\" in 2009 by Warner Music, his new album entitled \"Vital\" (World Village) won the Latin Grammy for Best Classical album in 2010.\nIn 2012 he recorded \"Romance\", a chamber music work which offers a collection of original compositions that draw from traditional elements of Argentine music , but are decidedly cosmopolitan. While meticulously constructed, they also at times involve the freedom of improvisation. The new album was released on February 2013 by Soundbrush Records.\nHe has written music for orchestra, chamber ensembles, string quartet, choir, and solo instruments as piano, violin and cello, being many of his compositions commissioned and premiered by performers like the Kronos Quartet\n-like \"The Cherry Tree\". premiered in Carnegie Hall in February 2008- and the Imani Winds ensemble. Among his recent works he wrote a Solo Violin sonata for Nick Danielson, Solo Piano Works for Krisztina Wajsza, a Cello Concerto for Inbal Segev, piano trios for the Ahn Trio, and an album for two pianos performed by himself and Yana Reznik.\nDue to the nature of his compositions and performance, he was embraced by both New York classical and jazz scenes. He has performed with legendary bassist Eddie Gomez (who introduced Otero as one of the pianists of the new generation) , flautist Dave Valentin, the Arturo O’Farrill Afro-Cuban Jazz Orchestra, and was featured in the Grammy Award-winning album Funk Tango by reed maestro Paquito D’Rivera, with whom he has also performed at Birdland, Blue Note, and the Caramoor Classical Music Festival. Fernando Otero has written and produced soundtracks for movies and recorded in more than 40 albums.\nReviewing Fernando Otero's performance at New York's Symphony Space in February 2012, Steve Smith wrote in The New York Times: \"Mr. Otero's writing vibrantly summoned tango ancestors while also acknowledging Bartok and Prokofiev. His brilliant playing bore traces of jazz pianists like Bill Evans and Don Pullen. The resulting synthesis proposed bold new directions for a venerable tradition.\n\"Mr. Otero, a resourceful pianist and composer from Buenos Aires, recently released a darkly ravishing album with the plain but connotative title of “Romance” (Soundbrush). This concert will feature that material, a sensuous blend of tango and classical and chamber jazz, with a cohort that includes the vocalist Kristin Norderval, the bandonéon player Juan Pablo Jofre Romarion, the clarinetist Ivan Barenboim and a string quartet headed by the violinist Nick Danielson.\" Nate Chinen, New York Times,March 2013.\nMr. Otero hails from Argentina, where romance has often been cast as a kinetic pursuit. The expressive drama of tango generally animates his compositions, which also involve aspects of classical chamber music and jazz improvisation.\"Beginning with \"El Circulo Rojo,\" which appears on both recent albums, Mr. Danielson and Mr. Otero locked in tightly, playing a compact melody in sync and then spiraling outward to set up some counterpoint. During one passage in the piece, and on a brisk subsequent composition, there was a faint echo of the dynamic that existed between the pianist Chick Corea and the violinist Jean-Luc Ponty some 30 years ago…\" Nate Chinen, New York Times, February 2008\n\"Otero is a seriously talented pianist, and his orchestrations are equal parts Bernard Hermann and Charlie Parker. That is, they alternate between jagged suspenseful crescendos and long, sinuous melodies. This music bounds out of the speakers and leaps into every corner of the room at once, exhilarating but also bewildering - Phil Freeman. Jazziz Magazine, March 2008,\nwww.fernandootero.com\n￼", "otherInfo": "Chamber Music from Buenos Aires\nFernando Otero - Nick Danielson\nAdam Fisher -\nConcerto per Cello e Corde -\nInbal Segev (soloist)"}, {"Address": "40 Wooster St 3rd floor, New York, NY 10013", "Artist": "Tatiana Owens ", "ArtistImage": "https://photos.bandsintown.com/thumb/9362618.jpeg", "Coordinates": [-74.00262, 40.722275], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Funk, Pop", "Time": "12:00 AM UTC", "Venue": "Sofar Sounds", "moreBioInfo": "MTV \"O Music Award\" Nominee - Tatiana's music has been featured on CBS, MTV, VH1 Logo, Lifetime, CMT, BET, USA Network and Showtime. Tatiana's song \"Pendulum\" from the hit Vh1 show Love and Hip Hop was released on Universal/Def Jam Records as part of the Love and Hip Compilation. \"Trigger\" from Tatiana has been featured on the Showtime television series Ray Donovan as well as The CW Network's Dynasty show. \"Beautiful People\" - Tatiana Owens featuring DJ Ayres (T&A Records) Treasure Fingers mix was a \"Code\" Top 5 pick in Billboard Magazine. Additionally, Tatiana was featured in the reality show \"Unleashed By Garo\" on The Sundance Channel.", "otherInfo": "Tatiana Owens brings her soulful funk vibe to Soafr Sounds in NYC. Tatiana will perform her hit song \"Trigger\" from the Showtime Television Series Ray Donovan & Shameless. A fun up-tempo evening with New York City's premier soulful funk singer."}, {"Address": "70 Sanford St., Fairfield, CT 06824", "Artist": "Christopher Cavaliere ", "ArtistImage": "https://photos.bandsintown.com/thumb/7535025.jpeg", "Coordinates": [-73.257615, 41.142374], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Ambient, Jazz, Folk, Rock", "Time": "12:00 AM UTC", "Venue": "StageOne at FTC", "moreBioInfo": "Christopher Cavaliere is a Musician Singer/Songwriter from Bridgeport,Ct. His work is based upon creating musical collages composed of a wide range of styles. As a performer Chris has supported national touring acts Marc Ribot, Kaki King, The Stepkids, Antoine Dufour, Drums and Tuba, Consider the Source and Perhaps. Chris has been a featured artist for the Ovation VXT guitar DVD as well as being endorsed by B&K guitars. As a recording artist his 2010 album release entitled Monrovia Suite has been featured in national (AlARM Press, Guitar Player Magazine) and local press (Fairfield County Weekly’s Best Instrumentalist of 2010 and 2011). Cavaliere’s current music projects include band Symphonic Bodega and multi media group DaDA Mr.", "otherInfo": "No other event info available"}, {"Address": "158 Bleecker St, New York, NY 10012", "Artist": "Thin Lear ", "ArtistImage": "https://photos.bandsintown.com/thumb/9138501.jpeg", "Coordinates": [-73.999882, 40.728425], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Astoria, United States", "Time": "12:00 AM UTC", "Venue": "Le Poisson Rouge", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "1 Sopac Way, South Orange, NJ 07079", "Artist": "KJ Denhert ", "ArtistImage": "https://photos.bandsintown.com/thumb/6197023.jpeg", "Coordinates": [-74.2628, 40.74608], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Urban Folk, Jazz, Contemporary Music", "Time": "12:00 AM UTC", "Venue": "SOPAC | South Orange Performing Arts Center", "moreBioInfo": "KJ remembers, “I picked up a guitar when I was ten and immediately I started writing music. I loved Sergio Mendes’ songs, liked John Hartford on the Glenn Campbell Show and really got into James Taylor and Joni Mitchell who I still consider my two main influences. I also loved the singer-songwriters of the time including Carole King and Laura Nyro and later fell in love with Steely Dan’s music, and just wore out my copy of Hubert Laws’ Rite Of Spring. I was completely self-taught, by llistening to records and playing them over and over, teaching myself tablature from a great James Taylor book and modal tunings from Joni Mitchell’s For The Roses song book. I didn’t really do anything but play guitar through my teenage years.”\n\nIn the 1980s, KJ Denhert toured for six years as the lead guitarist and occasional vocalist with an all-female band called Fire, playing rock and top-40 music throughout the US, Canada and Europe. After the group ran its course, she worked at a day job while continuing to write and play music. While working in Cleveland as a financial analyst, she started the Mother Cyclone label and made her first recording. Moving home to New York in 1997, she formed the NY Unit, a group that she still performs with. “I look for players who have an ability to groove and have lots of drama in their playing.\n\nLucky 7 (which is set to be released in September 2007) is KJ Denhert’s seventh recording to date. “I left my day job three years ago and this is the record that I’ve been wanting to record ever since. It combines all of the styles that I grew up with and enjoyed, going all the way back to Sergio Mendes. It has a bit of acoustic guitar, some r&b and it grooves in what I hope after seven recordings is a signature of my style. I took the chance to tip my hat to Steely Dan for the first time in a recording and James Taylor’s influence comes through me in the solo guitar and voice rendition of Sad Song.\n\nLucky 7, was recorded and mixed by Ben Wisch (Marc Cohn, Jonatha Brooke) bringing more focus to KJ’s vocals than previous recordings. She also teamed up with keyboardist and producer Bennett Paster to co-produce five tracks after they worked together in Italy last summer. There are 11 originals and a sensitive version of Over The Rainbow ”When people hear me perform that standard, they regularly ask me if I am going to put it on a CD, so I did”. Among the many other highlights are the funky opener Little Problems the swinging Lucky Seven, the spirited He’s Not Coming Home, the infectious three-part “What‚s My Name, the powerful I Got Time, the wistful Beautiful and Man As A Man, KJ’s unaccompanied performance of Sad Song and the exuberant Rivera which has a passionate electric guitar solo from Sheryl Bailey.\n\nAmong KJ Denhert’s many accomplishments, in addition to running her own band and label, are three highly successful appearances at Umbria Jazz (“the audience response was very gratifying”), an ongoing residency since 1999 at The 55 Bar in NYC, winning many songwriting contests (including being named among the six winners of the Kerrville New Folk Song contest in June 2006 for Private Angel and the Mountain Stage Newsong contest in August 05 for Little Mary), and successful appearances at other festivals and clubs around the world. Her previous recording, Another Year Gone By, Live won the 2006 Independent Music Award for Best Live Performance.\n\n“ For me, the highpoints come from playing and working with people who I really respect.\nMy bassist, Mamadou Ba who is originally from Senegal, has been with me the longest since 1997 when I started the NY Unit. Other long term members include drummer Ray Levier and keyboardist Peter Vitalone, both of whom have been with KJ since’98 and ‘99. I am always interested in stretching myself and performing my music in different ways. The Lucky 7 recordings feature some wonderful pairings of great players that I don’t always get to tour with but who have appeared in with me at The 55 and are wonderful friends too.\nKJ manages between 120-140 performances a year. New music, places to play and new festivals are what she’s about these days “… so we can keep on performing for new audiences. I can’t stop, this is what I do.”\n\nA crowd pleaser whose music is impossible to classify but very easy to enjoy, KJ Denhert is in her own special category.", "otherInfo": "KJ begins a three-night run opening for the world famous Aaron Neville.\n\nhttps://www.sopacnow.org/events/aaron-neville\n\nNew Orleans-born Aaron Neville brings his unmistakable sound, heard in classic ballads like “Tell It Like It Is” and “Don’t Know Much” – his hit duo with Linda Ronstadt – to the intimate SOPAC stage in an evening of sublime artistry. Slipping easily from Funky to R&B and Soul, Aaron Neville is surely one of the most distinctive vocal stylists of all time."}, {"Address": "361 George St, New Brunswick, NJ 08901", "Artist": "Irwin Hall ", "ArtistImage": "https://photos.bandsintown.com/thumb/10143079.jpeg", "Coordinates": [-74.443742, 40.494949], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Blues, Jazz, Bam, Soul", "Time": "12:00 AM UTC", "Venue": "Tavern on George", "moreBioInfo": "Irwin Hall got his start at the age of 9 when he won a lottery in school and was gifted an alto saxophone. By the age of 11 he was on stage performing professionally and began winning state and national competitions. Irwin attended Princeton University on a full ride to study East Asian philosophy. He learned Japanese and after graduating began work at a major Japanese newspaper in Tokyo. As fate would have it, he ran into songstress Melody Gardot backstage at the Tokyo Jazz Festival who heard him play and immediately hired him to tour with her band. He quit his job and went on back-to-back international tours as her featured soloist.\n\nSoon after he caught the ear of 3x Grammy/Tony Award winning NEA Jazz Master Dee Dee Bridgewater and joined her working band, honing his skills under the master vocalist on saxophone, flute, and bass clarinet. His woodwind work is featured on the Grammy-nominated album Star People Nation by trumpeter Theo Croker, and he has toured extensively with Grammy-nominated vocalist Jazzmeia Horn and bass virtuoso Charnett Moffett, among many others. Irwin now leads his own band - Irwin Hall Organ Trio - and continues to perform in cities around the world including London, Tokyo, Shanghai, Rio, Prague, New York, Paris, Melbourne, and more.", "otherInfo": "Welcome the Irwin Hall Organ Trio (#IHOT) this weekend to Irwin's hometown show at Tavern on George ahead of the band's upcoming album release - We In It! #IHOT is a foot stomping, swing and groove power trio that plays everything from Duke Ellington to Tower of Power to Kirk Franklin. Presented by the New Brunswick Jazz Project, join Irwin and his band for an incredible night of music."}, {"Address": "70 Sanford St., Fairfield, CT 06824", "Artist": "Christopher Cavaliere ", "ArtistImage": "https://photos.bandsintown.com/thumb/7535025.jpeg", "Coordinates": [-73.257615, 41.142374], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Ambient, Jazz, Folk, Rock", "Time": "12:00 AM UTC", "Venue": "StageOne at FTC", "moreBioInfo": "Christopher Cavaliere is a Musician Singer/Songwriter from Bridgeport,Ct. His work is based upon creating musical collages composed of a wide range of styles. As a performer Chris has supported national touring acts Marc Ribot, Kaki King, The Stepkids, Antoine Dufour, Drums and Tuba, Consider the Source and Perhaps. Chris has been a featured artist for the Ovation VXT guitar DVD as well as being endorsed by B&K guitars. As a recording artist his 2010 album release entitled Monrovia Suite has been featured in national (AlARM Press, Guitar Player Magazine) and local press (Fairfield County Weekly’s Best Instrumentalist of 2010 and 2011). Cavaliere’s current music projects include band Symphonic Bodega and multi media group DaDA Mr.", "otherInfo": "No other event info available"}, {"Address": "212 E 52nd St, New York, NY 10022", "Artist": "Joe Benjamin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9025409.jpeg", "Coordinates": [-73.969227, 40.756686], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Soul, Pop, Funk", "Time": "12:00 AM UTC", "Venue": "Club Bonafide", "moreBioInfo": "No artist bio available", "otherInfo": "a full set of motown tunes arranged with a new Jazz flare. The band will feature Singer Joe Benjamin and arrangements by Drummer Darrell Smith.\nYouTube clip: Watch \"Dal Segño Trio Featuring LaToya Smith “in a sentimental mood”\" on YouTube\nhttps://youtu.be/vnWfDGP6NKE\nYouTube 2: Watch \"Joe Benjamin & A Mighty Handful - City People [Music Video]\" on YouTubehttps://youtu.be/1c18U1-Otng"}, {"Address": "New York City, NY", "Artist": "Jackopierce ", "ArtistImage": "https://photos.bandsintown.com/thumb/8280131.jpeg", "Coordinates": [-73.9808, 40.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Pop", "Time": "12:00 AM UTC", "Venue": "StageIt Online Show with Jack O'Neill ", "moreBioInfo": "Jack O’Neill and Cary Pierce, the “Jack O” and “Pierce” who make up the seminal duo Jackopierce, are celebrating 30 years of making music that has amassed a loyal following of millions of fans across the country and the world with a super high-energy live show and what the Dallas Morning News has called “spotless harmonies.”\n\nHaving just released their first studio project 'Feel This Good' in 5 years, Jackopierce is poised and ready to get back on the road full-time.\n\nJackopierce formed in 1988 in Dallas as theater students at SMU. The duo steadily made a name for themselves, especially with two of their signature tracks, “Vineyard” and their version of the classic “Please Come to Boston.” They released ten studio albums (two for major label A&M), toured three continents, nine countries, and 45 states - amassing millions of loyal fans along the way . Over the years They have shared the stage with John Mayer, Dave Matthews Band, Matchbox20, Counting Crows, The Wallflowers, Sheryl Crow, Toad the Wet Sprocket - to name a few. After a five-year breakup, the guys reunited in 2002 to test out the waters. They were very warm and city by city, Jack & Cary got back out there to play for grateful fans that thought they would never see them again. The two now have a totally renewed creative vigor, mutual respect and deep gratitude for their fans.\n\nThese good vibes shine through on their 25th anniversary live album “Live 25.”\n\nIt’s definitely been a creative time for the duo, and celebrating the past inspires the guys to move forward in new, inventive ways. To freshen up the live show, Jackopierce started creating uniquely intimate “Destination Shows.” These shows are a whole new fan experience where people can enjoy gorgeous scenery, share delicious food & wine and have “campfire”-type access to their favorite band. It’s a vacation and concert in one. Each Destination Show provides a unique experience dedicated to the local culture: Napa/Sonoma vineyards at sunset, a ranch in Austin Hill Country, high society in Dallas, a two-mile-high a private club in Aspen, amazing history at the Biltmore in NC, a 14,000 square foot hacienda in San Miguel de Allende, MX - and the list goes on. July 27, Jackopierce will host their first 7th Destination Show in Martha’s Vineyard and they’ll be back for their fourth annual Destination Show in San Miguel in April 2020.\n\n“We have been doing destination events for 10 years now and they have been a huge hit with our fans and have allowed us to make so many great new ones along the way,” said Cary Pierce. “I think these events continue to grow and sell out because people want more than \"just a show” - they want an experience. They want to create lasting memories, explore a new place or visit an old favorite. In some cases, we're offering them a trip of a lifetime. We're finding there a lot of people that really value these experiences.”\n\nJackopierce has celebrated numerous career milestones including the T-Bone Burnett produced A&M debut album “Bringing on The Weather,” being a part of one of the world’s largest live events with close to 400K people in attendance at the 1997 Blockbuster RockFest at Texas Motor Speedway alongside artists No Doubt, Counting Crows, and Matchbox Twenty, performing on Conan O’Brien in 1992 with the Max Weinberg Band backing them up and sitting in the chairs on the Rosie O'Donnell Show.\n\n“Even after 30 years I feel like we're just getting started,” said Cary Pierce.", "otherInfo": "No other event info available"}, {"Address": "361 George St, New Brunswick, NJ 08901", "Artist": "Irwin Hall ", "ArtistImage": "https://photos.bandsintown.com/thumb/10143079.jpeg", "Coordinates": [-74.443742, 40.494949], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Blues, Jazz, Bam, Soul", "Time": "12:00 AM UTC", "Venue": "Tavern on George", "moreBioInfo": "Irwin Hall got his start at the age of 9 when he won a lottery in school and was gifted an alto saxophone. By the age of 11 he was on stage performing professionally and began winning state and national competitions. Irwin attended Princeton University on a full ride to study East Asian philosophy. He learned Japanese and after graduating began work at a major Japanese newspaper in Tokyo. As fate would have it, he ran into songstress Melody Gardot backstage at the Tokyo Jazz Festival who heard him play and immediately hired him to tour with her band. He quit his job and went on back-to-back international tours as her featured soloist.\n\nSoon after he caught the ear of 3x Grammy/Tony Award winning NEA Jazz Master Dee Dee Bridgewater and joined her working band, honing his skills under the master vocalist on saxophone, flute, and bass clarinet. His woodwind work is featured on the Grammy-nominated album Star People Nation by trumpeter Theo Croker, and he has toured extensively with Grammy-nominated vocalist Jazzmeia Horn and bass virtuoso Charnett Moffett, among many others. Irwin now leads his own band - Irwin Hall Organ Trio - and continues to perform in cities around the world including London, Tokyo, Shanghai, Rio, Prague, New York, Paris, Melbourne, and more.", "otherInfo": "Welcome the Irwin Hall Organ Trio (#IHOT) this weekend to Irwin's hometown show at Tavern on George ahead of the band's upcoming album release - We In It! #IHOT is a foot stomping, swing and groove power trio that plays everything from Duke Ellington to Tower of Power to Kirk Franklin. Presented by the New Brunswick Jazz Project, join Irwin and his band for an incredible night of music."}, {"Address": "1747 Hooper Ave, Toms River, NJ 08753", "Artist": "Jessica Rose Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8619942.jpeg", "Coordinates": [-74.15113, 40.00501], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Pop, Country Pop, Country", "Time": "12:30 AM UTC", "Venue": "McIntyre's Pub", "moreBioInfo": "Jessica Rose was named 2017 Emerging Artist by the Country Music Association. She also won the 2017 WSM Road Show competition put on by the Grand Ole Opry and opened for Tracy Lawrence this past Summer. She appeared on American Idol season 12 featuring Keith Urban, Mariah Carey, Nicki Minaj and Randy Jackson. She won the 2017 Josie Award for Modern Country Female Rising Star. Go listen to her new EP “Wild Hearts” on Spotify, iTunes or Apple Music. For more info and fun about Jessica Rose, check out RealJessicaRose.com\n\nhttp://realjessicarose.com\n\nhttp://www.youtube.com/user/realjessicarose\n\nhttps://twitter.com/JessicaRoseLive\n\nhttps://www.instagram.com/RealJessicaRose", "otherInfo": "Jessica Rose performing live at McIntrye's Pub in Toms River NJ! 8:30-11:30pm"}, {"Address": "423 Park Ave, Huntington, NY 11743", "Artist": "Kala Farnham ", "ArtistImage": "https://photos.bandsintown.com/thumb/8969912.jpeg", "Coordinates": [-73.414797, 40.873459], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Kala Farnham & co.", "Time": "12:30 AM UTC", "Venue": "Hard Luck Café", "moreBioInfo": "Once upon a time, nestled away in the Quiet Corner of rural Connecticut...\n\nA pint-sized songstress set out into the world with one vision: to inspire and heal through the transformative power of music. Decades later, Kala has performed at listening rooms across the country, garnering numerous awards and media attention, including The Rhode Island Songwriters Association Performing Songwriter Contest 2017 winner and alumni of the prestigious Johnny Mercer Songwriters Project. Drawing from a classical education and a professional background in musical theater, Kala presents a hallmark reinvention of the folk tradition. Her passion for fairytales, ancient history, and storytelling draws audiences from around the country into the reinvented worlds of alternate times and places.", "otherInfo": "No other event info available"}, {"Address": "3331 US-22, Branchburg, NJ 08876", "Artist": "Mid-Life Crisis Band NJ ", "ArtistImage": "https://photos.bandsintown.com/thumb/10186093.jpeg", "Coordinates": [-74.704126, 40.607146], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Dance Pop, Dance-rock, Alternative, Disco, Classic Rock, Country, Pop", "Time": "1:00 AM UTC", "Venue": "The Royal Bar", "moreBioInfo": "We have been rocking the Northern and Central NJ Area since 2002 playing Classic Rock, Alt Rock, Pop.Country, Dance to Current Hits and everything in between. MLC (for short) is a rocks-the-house/high energy band that starts the party and keeps it going! We play the club/bar circuit from Bergen to Ocean County and enjoy a loyal following. If you love the hits from Classic to Current, we're your band! Come check us out! www.mid-lifecrisisband.com", "otherInfo": "No other event info available"}, {"Address": "125 East 11th St, New York, NY 10003", "Artist": "Dabin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9951445.jpeg", "Coordinates": [-73.989166, 40.731661], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Feels Good Music", "Time": "1:00 AM UTC", "Venue": "Webster Hall", "moreBioInfo": "Twitter: @iamdabinlee Instagram: dabinmusic Snapchat: dabinmusic", "otherInfo": "Use code \"kindregards\" for tickets!"}, {"Address": "217 E Houston St, New York, NY 10002", "Artist": "Kate Bentsen ", "ArtistImage": "https://photos.bandsintown.com/thumb/10182076.jpeg", "Coordinates": [-73.986751, 40.722165], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "1:00 AM UTC", "Venue": "Mercury Lounge", "moreBioInfo": "New York Ferocity, Nashville Composition, Texas Twang", "otherInfo": "No other event info available"}, {"Address": "465 Seneca Ave, Queens County, NY 11385", "Artist": "the Roof ", "ArtistImage": "https://photos.bandsintown.com/thumb/9169287.jpeg", "Coordinates": [-73.912912, 40.706031], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Frank Musaraca Ivan Zvorsky, Jacob Finkbiner, Skyler Scholl", "Time": "1:00 AM UTC", "Venue": "The Footlight Bar", "moreBioInfo": "The Roof met in 2015 at Penn State Altoona by random chance, with no songwriting experience, and no expectations. Their overlapping musical interests(Cage the Elephant, Bob Dylan, Led Zeppelin, Grateful Dead, Sam Cooke, Faces, Tom Petty, etc.) soon sparked insight into a deeper friendship, as well as a desire to create. At first, with minuscule prowess, but with immense drive and effort, the songs progressed, as well as their friendship. After three years of playing dive bars, and house shows, The Roof has earned a dedicated fan base at The Pennsylvania State University as well as the Pittsburgh, PA area. As a result, the band has opened for national acts like New Politics, Waka Flocka Flame, The Brook and the Bluff, and more, at venues like Stage AE, Club Café, and The Altoona Railroaders Museum. In the summer of 2018, their debut EP “Tangled Lives” was self-recorded & self-produced, within the reigns of a small college apartment. Currently, they are in the midst of writing songs for their follow up album, as well as booking a summer tour. Although three members will graduate this year with engineering degrees, they plan to forego that career path, and pursue their love for music, forevermore.", "otherInfo": "No other event info available"}, {"Address": "217 E Houston St, New York, NY 10002", "Artist": "Peter Wise ", "ArtistImage": "https://photos.bandsintown.com/thumb/9113961.jpeg", "Coordinates": [-73.986751, 40.722165], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Soul Pop", "Time": "1:30 AM UTC", "Venue": "Mercury Lounge", "moreBioInfo": "Peter Wise is a singer/songwriter and multi-instrumentalist based out of Brooklyn, NY. Sharing the stage with everyone from The Eagles and Lisa Fischer to Liza Anne, Joey Dosik, and Kevin Garrett, Wise is building a name through his unique blend of introspective lyricism and guitar driven, genre bending pop /rock. After spending the fall and winter touring all over the country, with stops in Hawaii, Los Angeles, New England, Philadelphia, and Washington D.C., he is now putting the finishing touches on new material, due out this summer.", "otherInfo": "No other event info available"}, {"Address": "158 Ludlow St, New York, NY 10002", "Artist": "DJ Taela Naomi ", "ArtistImage": "https://photos.bandsintown.com/thumb/7226315.jpeg", "Coordinates": [-73.987746, 40.72104], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Pianos", "moreBioInfo": "Taela Naomi is an award winning DJ, model and educator based in NYC whose talent and presence have gained attention both in NYC and internationally. Raised in Brooklyn, NY, Taela's early musical influences included everything from classical composers Rachmaninov and Tchaikovsky to Curtis Mayfield, James Brown, and Michael Jackson. After earning her B.A. from Amherst College, Taela performed as a dancer with shows including The Producers, Dreamgirls, and Bill T. Jones' Broadway adaptation of Superfly. With her knowledge of diverse musical genres, natural ability for cutting and blending, impenetrable focus, and bubbly spirit, Taela has risen to become one of NYC's most sought after DJs. She has played all over NYC and has earned praise from the legendary DJ Red Alert and played alongside the great DJ Tony Touch. Her signature party, The Dance Party, has become a weekly go-to event for music lovers, dancers, and NYC trendsetters. Her latest party series, Rum + Pum Pum Shorts which features Afrobeat, dancehall, reggae, and soca music, has been selling out in record time since it launched in September 2017. Taela won the prestigious Uptown Battle of the Bars competition, earning her the title \"Best Uptown DJ.\" As an educator, Taela created a course in the Art of DJing, which she teaches in public schools in Brownsville Brooklyn, the Bronx, and soon Harlem, which has made a huge difference in the lives of the children. Taela's mission is to transcend the typical club experience to get people to connect and to move, to be present, and to boldly fall back in love with dance parties.", "otherInfo": "No other event info available"}, {"Address": "1411 Kingsley St, Asbury Park, NJ 07712", "Artist": "Sean Tobin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9146897.jpeg", "Coordinates": [-74.000362, 40.225617], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Punk, Folk Rock, Americana, Rock, Indie Folk, Acoustic, Indie Rock, Rockabilly, Punk Americana", "Time": "2:00 AM UTC", "Venue": "Kim Marie's Eat n Drink Away", "moreBioInfo": "Born and raised on the New Jersey shore, Sean Tobin grew up surrounded by salt, surf, and incredible music. After getting in some trouble in high school, Tobin decided to put his downtime into teaching himself the guitar. A poet in his own right, songwriting soon followed.\n\nIn 2017, Tobin traveled to Europe to walk El Camino de Santiago, a 500-mile trail through the north of Spain. He walked to discover himself and how he should spend his life. Tobin tied his guitar to his 30-pound pack, and each day, walked 20km toward Santiago de Compostela. Upon his arrival, it became obvious that his commitment to his music was how he would spend his days.\n\nSean returned to New Jersey in the fall of 2017 where he worked a white collar job to fund his independent music. He released his first album, This Midnight, in the summer of 2018. He began to build a name for himself in his home state, and in 2019, he played Frank Turner's Lost Evenings III Festival at the House of Blues in Boston.\n\nSean currently lives in Jersey City, NJ.", "otherInfo": "10:00 - Midnight Every Thursday Night!"}]