var seattle_events = [{"Address": "411 University St, Seattle, WA 98101", "Artist": "Culture ", "ArtistImage": "https://photos.bandsintown.com/thumb/7041332.jpeg", "Coordinates": [47.6079957, -122.3338074], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Reggae", "Time": "10:00 AM", "Venue": "Fairmont Olympic Hotel, Seattle", "moreBioInfo": "There are two bands with the name Culture. 1. a Jamaican roots reggae group founded in 1976. Originally they were known as the African Disciples. Critically considered one of the most authentic traditional reggae acts, at the time of the first Rolling Stone Record Guide publication, they were the only band of any genre whose every recording received a five-star review (of bands with more than one recording in the guide). The members were: Joseph Hill (lead vocals), Albert Walker (backing vocals), Kenneth Dayes (backing vocals). Joseph Hill, who came to symbolise the face of Culture, died in Germany on 19 August 2006 while the group was on tour. 2. an early-90s Vegan straight edge hardcore new school band. They featured Rich Thurston, John Wylie (of Morning Again), Damien Moyall (also Morning Again and As Friends Rust and currently working on a solo album), Josh Williams, and Gordon Tapley. www.myspace.com/xxxculturexxx", "otherInfo": "No event info available"}, {"Address": "411 University St, Seattle, WA 98101", "Artist": "Context ", "ArtistImage": "https://photos.bandsintown.com/thumb/9617899.jpeg", "Coordinates": [47.6079957, -122.3338074], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Soul, Dubstep, Electronic, Drum, Funk, R&b, Bass, Rnb-soul, R&b/soul", "Time": "10:00 AM", "Venue": "Fairmont Olympic Hotel, Seattle", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "117 S Washington St, Seattle, WA 98104", "Artist": "The Black Tones ", "ArtistImage": "https://photos.bandsintown.com/thumb/10393490.jpeg", "Coordinates": [47.6005061, -122.3332235], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Garage Rock, Blues-punk, Afropunk, Blues-rock", "Time": "10:30 AM", "Venue": "Occidental Square", "moreBioInfo": "The Black Tones album title Cobain and Cornbread is a description of the band that lead singer/guitarist Eva came up with playing at a show, in answer to the most commonly asked question, “What does your band sound like?” This tasty adroitly description sums up her and her twin drummer Cedric David’s Seattle-spawned punk-blues. “Sometimes we don’t even sound like our influences,” she explains, “So the best way I found to describe The Black Tones was to talk about our environment we were raised around, which was a bunch of southerners living in the Northwest.” Louisiana-bred, though born and raised in Seattle, The Black Tones’ reference to grunge god Kurt and the Native American quick bread cuisine, evokes “Southern influences in the grey of the Northwest,” Eva says. “It sort of creates this offspring of rebellion and soul. We eat gumbo in our flannel shirts, and we eat red beans and rice while head-banging!” Music was a huge part of Eva and Cedric’s childhood, their first shared fandom being for “Turn Your Love Around” by iconic vocalist and guitarist George Benson, which they would dance to together every time the radio played it. They enjoyed looking in at what their older siblings were digging on MTV, such as Jay Z, Nirvana, Blind Melon, Michael Jackson, and “90s pop music was awesome too! And R&B like SWV, En Vogue, etc.,” Eva says. In high school their tastes had drifted; Eva was introduced to Jimi Hendrix, Led Zeppelin, and Pink Floyd. After high school she researched and grooved on the old blues and folk that had influenced those classic rock bands. At the same time, she and Cedric were also big World-Wide Wrestling fans — “we loved wrestling! Cedric loved it before I did, but then I became a fanatic too.” They really enjoyed the hard rock music used in bouts, drawing them closer to heavy metal. About this time Cedric had started to play the drums and wanted to hear the songs that Eva was writing, which she found exciting. He matched drum parts to songs she had only worked out so far on guitar, later on getting a bass player and another guitarist. As soon as they had a few arranged, they were ready to start performing. They went through some changes: The Black Tones as a four piece only lasted for a while, then became a trio, “but Cedric and I were the founders and the only consistently reliable members, so now we just keep it as a duo, while hiring other musicians to play instruments live with us.” Eva had also been in an all-girl punk band called BUST, but she ended up channeling everything into The Black Tones with Cedric. Through countless shows supporting a few early singles, The Black Tones felt they finally got their first big breakthrough opening for Death Cab for Cutie in an anniversary benefit for the Paramount Theater. “That was the biggest show we’ve done!” Eva exclaims. She gives credit for reaching that height to NighTrain, the all black female punk band that she says discovered and championed them when they had freshly started. For Cobain and Cornbread, The Black Tones are returning from their singles to work with the renowned, glorious grunge producer Jack Endino, introduced to them by Eva’s fiancé and music writer Jake Uitti. Jake had interviewed Jack and sent him their song “Woman in Black” without Eva’s knowledge and Jack replied how much he loved it and wanted to work with The Black Tones. “I was never really big on recording in a studio,” she says, “I’m a live show nut, I just love performing. Being in studios was always very stressful for me, but when we worked with Jack, that totally changed! It was the best recording experience I’ve ever had. Jack is like a scientist, a chemist behind the soundboard. He had great ideas that strengthened each song. I’ve never met anyone with an ear like his, it’s unbelievable, though he’s a calm, humble, kind, efficient, honest and very intelligent guy — I was so intimidated at first, I mean, here’s the guy who recorded the Melvins, Nirvana, Soundgarden, and the list goes on. And now he’s working with us and he’s really into it!” Cobain and Cornbread also features help from their friend Mason Lowe from Bread & Butter, on “Chubby and Tubby” (a frenetic garage rock instrumental ode to the landmark Seattle variety store) and “Welcome Mr. Pink” (the band’s autobiographical anthem). “Mason has a great ear and was really amazing to work with.” Ed Brooks mastered all the songs on the record, with Jack checking back in to make sure he was looped on everything. “As a band we are of course rooting for the record, but it’s even more special when everyone else is as well!” There’s something very unique about the songs (all originals save for a cover of “River of Jordan”) and sound unique about the minimalist sound Jack helped The Black Tones achieved, reminding one of the debuts from The Ramones to the Stooges to the Modern Lovers. Eva acknowledges the brute power of the album’s sound, “it’s pretty vulnerable and raw and I like that,” she says. “There are songs like ‘Welcome Mr. Pink’ where you can hear the click sound from me pressing down on the button to turn on my reverb pedal.” Or in their righteous, ferocious Black Power anthem, “Key of Black (They Want Us Dead),” “after the second guitar chorus when I go back to the solo, I almost forgot to press my Wah Wah pedal back on so it comes in a little late. “We’re not factory made or even ever scratch the surface of perfection, we’re real people, this is real life and these little details remind me of the imperfections of life,” she says. “Life’s real, life’s the blues, coming from the heart. My doctor told me I have a slight heart murmur, well, so does our music!”", "otherInfo": "No event info available"}, {"Address": "203 W Thomas St, Seattle, WA 98119", "Artist": "Avian Invasion ", "ArtistImage": "https://photos.bandsintown.com/thumb/11324074.jpeg", "Coordinates": [47.620803, -122.359704], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Progressive Trance, Deep House, Future House, Trance, Progressive House", "Time": "12:00 PM", "Venue": "The DJ Sessions 7B's Brunch Series", "moreBioInfo": "www.avianinvasion.com", "otherInfo": "The DJ Sessions and the Queen Anne Beer Hall have teamed up to bring you one of the best brunches in the city better known as the 7B’s Brunch…\n\nBENEDICTS, BRATS, BURGERS, BEERS, BLOODY’S, BACON, AND BEATS BRUNCH.\n\nEvery Saturday starting at Noon you can come to the “Hall” and start you day with and awesome assortment of menu items that will make your mouth water while at the same time be part of one of the world’s most popular live streaming DJs series."}, {"Address": "2125 Queen Anne Ave N, Seattle, WA 98109", "Artist": "Carly Ann Calbero ", "ArtistImage": "https://photos.bandsintown.com/thumb/11365315.jpeg", "Coordinates": [47.6380011, -122.3572265], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie, Folk, Rock, Alternative", "Time": "1:00 PM", "Venue": "Paragon's Acoustic Brunch", "moreBioInfo": "Seattle musician", "otherInfo": "One of the coolest stages in the city. Get cozy and get your brunch on. I'll bring my acoustic and the tunes.\n\n21+ // Free"}, {"Address": "628 11th Ave E, Seattle, WA 98102", "Artist": "Jeannie Rak ", "ArtistImage": "https://photos.bandsintown.com/thumb/11563112.jpeg", "Coordinates": [47.625138, -122.3174899], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Lowdown Ballroom", "moreBioInfo": "No artist bio available", "otherInfo": "Join us for a lovely summertime outdoor concert in front of Lowdown Ballroom! Jeannie Rak, singer/songwriter and Seattle busker extraordinaire, will serenade the audience from atop the Lowdown Ballroom's garage-top terrace! AND....get this: we'll have the Sugar + Spoon food truck on side, offering tasty EDIBLE COOKIE DOUGH CREATIONS! The event is FREE to attend! So bring a folding chair or blanket, grab a delicious treat and settle in for an afternoon of live music! LEARN MORE ⬇️ www.lowdownballroom.com/events ABOUT JEANNIE Jeannie Rak is a Seattle-based singer-songwriter who cut her teeth as a busker at Pike Place Market, armed with only her guitar and vocals. She grew up in Bangkok, Thailand learning to sing in choirs and during long car ride sing-alongs with her mother and siblings. A former public school teacher, Rak is pursuing a lifelong dream of making music that moves people."}, {"Address": "490 Hyak Dr E, Snoqualmie Pass, WA 98068", "Artist": "Benni James ", "ArtistImage": "https://photos.bandsintown.com/thumb/6707489.jpeg", "Coordinates": [47.3909509, -121.3961991], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Heavy Soft Rock", "Time": "4:00 PM", "Venue": "Snoqualmie Pass", "moreBioInfo": "Based in Seattle, established singer-songwriter Benni James upholds the legacy of what is the Seattle Music Scene. His haunting 4 octave vocal range and passionate performances have captivated audiences globally for both his showmanship and songwriting. Benni has opened for global rock icons, Chris Cornell, Tom Morello and Candlebox. He's also performed with national acts, Puddle of Mudd, Adelitas Way, Stitched Up Heart, The Classic Crime, Emery and Rookie of the Year. His debut album, 'All I Want is You' received substantial praise and landed the #3 slot of Top 10 Albums of 2016 in the PNW.", "otherInfo": "The Snoqualmie Pass Presents:\nBenni James LIVE\n4pm-6pm"}, {"Address": "1225 S Southern St, Seattle, WA 98108", "Artist": "War Puppy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8178391.jpeg", "Coordinates": [47.52951669999999, -122.3162969], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Garage Rock, Psychedelic Rock, Punk Rock, Rock, Grunge, Grunge Psychedelic", "Time": "6:00 PM", "Venue": "Yard Party w/ War Puppy & Friends", "moreBioInfo": "We are a two piece rock band with a little psychedelic thrown in via theramin. We spent our first year as a band writing and recording our record, Volcano Flower, now available at https://warpuppy.bandcamp.com/releases", "otherInfo": "6:45-7:15 Fortuna\n7:30-8:00 12 Pack of Doom\n8:15-9:00 Sun Puddle\n9:20-10:20 War Puppy\n \nAll Ages, Yard Party - BYOB Outdoor show on the Duwamish River\n\n1225 S Southern St. Seattle, WA 98108"}, {"Address": "925 E Pike St, Seattle, WA 98122", "Artist": "Fleetwood Snack ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [47.6138118, -122.3196659], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Barboza", "moreBioInfo": "No artist bio available", "otherInfo": "Fleetwood Snack"}, {"Address": "2033 6th Ave, Seattle, WA 98121", "Artist": "Will Brahm ", "ArtistImage": "https://photos.bandsintown.com/thumb/11365019.jpeg", "Coordinates": [47.614592, -122.3391944], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Acoustic, Jazz", "Time": "7:00 PM", "Venue": "Arturo Sandoval ", "moreBioInfo": "Will Brahm is a Los Angeles based guitarist and composer, and a 2019 Herbie Hancock International Guitar competition semi finalist. He received his bachelors of music in Jazz Guitar Studies at California Sate University Long Beach, where he was a five time consecutive recipient of the “K-jazz” scholarship. Will has performed, recorded, and worked with artists such as Arturo Sandoval, the New West Guitar Group, Gordon Goodwin’s “Big Phat Band,” Kim Richmond, Otmaro Ruiz, Sara Gazarek, Jane Monheit, and Gretchen Parlato. Will has toured with The New West Guitar Group across the United States and to Malasia and the Philippines, and toured with his own original music across the United States and to Spain, Netherlands, Belgium, Germany, Greece, and Turkey. Recent albums of his include the 2017 release of his world original music ensemble “Homenaje,” the 2018 release of his duet album “Will Brahm & Lia Booth,” and the 2019 release of his most recent album under his own name, “Venture Atlas.” Will draws from a number of musical backgrounds from all over the world, giving his original compositions the combination of singing melodies, rich dense harmonic variations, and diverse exciting rhythmic motion. His 2019 album release “Venture Atlas” contains all original compositions of his, and he is joined by Chris Wabich on drum set and percussion, Diego Alvarez on percussion, Ahmet Türkmenoğlu on bass, and Katisse Buckingham on flute. Will's new album “Venture Atlas” is out now!", "otherInfo": "No event info available"}, {"Address": "602 N 105th St, Seattle, WA 98133", "Artist": "DB Stewart ", "ArtistImage": "https://photos.bandsintown.com/thumb/11434472.jpeg", "Coordinates": [47.705209, -122.3509799], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues, Pop, Rock", "Time": "7:00 PM", "Venue": "DB Stewart / Turtlnck / Camaira Metz", "moreBioInfo": "DB Stewart is a singer-songwriter from Seattle, WA. Ever since he learned to talk - and oh boy, does he love to talk - he developed a passion for storytelling, which translated into a passion for writing. He began playing the piano at five years old, but it was the guitar that unleashed his passion for songwriting. Now, he is writing and recording for his upcoming Solo EP (expected Winter 2019), produced by electronic artist/producer, Emperidol. The sound is a departure from the hard-rock aesthetic of Deify, encompassing a more traditional blues sound, with with elements of pop production.", "otherInfo": "DB Stewart, Turtlnck, and Camaira Metz all make their returns to the stage for a night of music you won't want to miss! \n\nCapacity is limited*"}, {"Address": "3100 Airport Way S, Seattle, WA 98134", "Artist": "Drastic Down ", "ArtistImage": "https://photos.bandsintown.com/thumb/9168989.jpeg", "Coordinates": [47.575188, -122.3210273], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock", "Time": "7:00 PM", "Venue": "Innocents Torn with Drastic Down", "moreBioInfo": "Drastic Down is the creation of guitarist Enrico Mariuzzo. Enrico moved to Seattle from his homeland of Italy in 2017. Enrico quickly jumped into the Seattle scene playing with various heavy rocking bands. A chance meeting on Craigslist brought Enrico together with vocalist Andy Brodigan. Andy's vocal style was a perfect match with Enrico's music and the two quickly began blending their musical visions and writing styles. Craig Raphael was enlisted soon after as drummer of the band. Craig brings his spot on hard hitting style to the band. Jordan Miles was added on bass as a recommendation from Craig. Jordan has 15 years of experience playing guitar and bass. Jordan and Craig played in previous bands together playing venues such as Whiskey A GoGo. Together, their chemistry rounds out the rhythm section of Drastic Down. Drastic Down's style can be described as the heavy guitar riffs of Guns N Roses and Motley Crue blended with vocal stylings and harmonies reminiscent of Alice In Chains. Drastic Down released their first EP in June 2019.", "otherInfo": "Drastic Down joins Vancouver rockers \"Innocents Torn\" for a night of hard rock at the Factory Luxe in Seattle"}, {"Address": "4425 Burnham Dr, Gig Harbor, WA 98332", "Artist": "Billy Shew ", "ArtistImage": "https://photos.bandsintown.com/thumb/8300331.jpeg", "Coordinates": [47.34304729999999, -122.5962128], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Rock, Blues", "Time": "7:00 PM", "Venue": "Billy Shew Band featuring Nick Cain @ Gig Harbor Eagles", "moreBioInfo": "Billy Shew has pursued a life in music for over 30 years. He got his first guitar at the age of 5 and started taking lessons at the age of 8. While moving around the country at a young age, he got to experience the music culture of the different communities including a time overseas with his Aunt from Zaire Africa. While in college, he studied classical guitar and mathematics. He has been playing professionally around the Pacific Northwest for the last 17 years playing in the local bars and hosting open blues jams during the week, which makes up a good 4 to 5 nights worth of music. He has played with his own band and continues to do so, but also plays with a country band, 8 Second Ride, and fills in with other bands when guitar is needed. Billy Shew has 3 albums to his credit that are presently available everywhere music is sold and streamed: After Midnight, Bootlegged At Dawsons, and Look At Me Now. Billy Shew is a lover of all types of music especially country and jazz/blues. His influences are the likes of Jimi Hendrix, Stevie Ray Vaughn, Eric Johnson, Brad Paisley, Vince Gill, Danny Gatton, Johnny Hilland, Randy Rhoad, Robben Ford, Neil Schon, Larry Carlton, John Denver, and Dave Mathews.", "otherInfo": "No event info available"}, {"Address": "109 Eastlake Ave E, Seattle, WA 98109", "Artist": "Mark Ellis ", "ArtistImage": "https://photos.bandsintown.com/thumb/226058.jpeg", "Coordinates": [47.6186896, -122.3293861], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "El Corazón", "moreBioInfo": "No artist bio available", "otherInfo": "Mark Ellis"}, {"Address": "370 NE Camano Dr #6, Camano, WA 98282", "Artist": "Enchantrix ", "ArtistImage": "https://photos.bandsintown.com/thumb/11382218.jpeg", "Coordinates": [47.6186896, -122.3293861], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Pub 282", "moreBioInfo": "Variety Rock Cover Band. Having over 60 years experience between us, there isn't a situation that we haven't been in. Powerful PA system, and top-of-the-line gear, Plus the know how. Check it out!", "otherInfo": "No event info available"}, {"Address": "925 E Pike St, Seattle, WA 98122", "Artist": "Chromeo ", "ArtistImage": "https://photos.bandsintown.com/thumb/11250509.jpeg", "Coordinates": [47.6138118, -122.3196659], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electro Funk, Funk, Nu-disco, Electronic, Synth Pop", "Time": "8:00 PM", "Venue": "Neumos", "moreBioInfo": "World leaders, powerful CEOs, and assorted other fat cats could learn myriad lessons from Chromeo, but the number one tip that Dave 1 and P-Thugg have is this: Know thyself, know thy vibe, and stay thy course. The rest of the population will catch up. What this means is that Chromeo is really good at being Chromeo. The mission, the package, the vision—it’s been a straight shot of pure intentionality from the jump. These Chromeo dudes? They have the whole being-these-Chromeo-dudes thing totally wired. And with the benefit of blessed hindsight, we can all see now that Chromeo stuck to it with the natural doggedness of the soulful heirs that they are. Funk a game plan—these guys had a ten-year battle strategy. When they released their first album in 2004, Rick James was still the Antichrist to all but the enlightened. Fast forward to today, and ‘80s funk—which makes up a major part of Chromeo’s DNA—is all over the charts. So it’s the perfect time for a fresh dose of the real stuff and—lo and behold—Pee (still looking a smooth criminal in a Coogi) and Dave (ever the Semitic/Gallic heartthrob in tight pants) are back. We are officially on the cusp of the Canadian funk lords’ fourth album’s release. It’s called White Women and it’s a doozy. As a work of cultural theory, it posits that we are living in a post-nostalgia age. All previous genres and styles of music now coexist within a singularity of moves and gestures. (Ouch, sorry, got possessed by a cultural studies prof. for a second there… but the foregoing is true of Chromeo, just FYI.) More importantly, as pure entertainment, White Women perpetuates and elevates Chromeo’s existing blueprint: sexy funk, ass-targeting beats, melodic honey, and smart lyrics about the foibles of contemporary love. Dave 1’s words continue to turn urban music clichés on their heads. On “Jealous (I Ain’t With It)”, a Chromeo crossover comet if there ever was one, our arch antihero witnesses his ex in the arms of other guys… wearing the jacket that he bought her. Conversely, the pristinely produced “Over Your Shoulder” is a paean to the insecure. You’re all beautiful, ladies, is the message; don’t even sweat that body-image noise. And “Sexy Socialite” is a warning to the highhanded party girls of the early twenty-teens. Check yourself, sayeth Chromeo. White Women is the band at its most ambitious, with both the pop and the muso elements of Chromeo pushed into the red. On the hooky side, we’ve got instant classics like the soaring “Come Alive” and the pulsating “Frequent Flyer” which offer moments that would make Hall & Oates and Wham green with envy. On the crate-digger side, Dave and Pee employ an unprecedented analog arsenal that would make Kraftwerk drool. Mtume’s female vocalist croons on more than half the album. Steely Dan’s string conductor pops up on the progressive album closer “Fall Back 2U.” Try all that on for size, nerds. But for all that 80s talk, White Women, more so than any other Chrome-opus, is firmly grounded in pop’s present. It features some stellar cameos, too. Solange belts it out with Dave 1 on “Lost On The Way Home,” Ezra Koenig of Vampire Weekend contributes the piano-led, heartstring-pulling intermezzo “Ezra’s Interlude,” and Toro y Moi dives into the undiluted electro-funk of the aforementioned “Come Alive.” 2014 happens to be the Year of the Horse, which makes sense because Chromeo are about gallop in on shining white steeds to delicately trample all of us with their sublime sound. The weather is perfect; the water is warm; the people are waiting. Here comes White Women to remind everyone else just how this shit is done.", "otherInfo": "Chromeo DJ Set"}, {"Address": "5606 1st Ave S, Seattle, WA 98108", "Artist": "The Scoffs ", "ArtistImage": "https://photos.bandsintown.com/thumb/11429781.jpeg", "Coordinates": [47.5524929, -122.33387], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Punk, 77 Punk, Old School, Indie, Rock", "Time": "8:00 PM", "Venue": "The Scoffs, The Swaggerlies, The Finger Guns @ Slim's Last Chance", "moreBioInfo": "Punk rock from the Needle City!", "otherInfo": "The Scoffs\nThe Swaggerlies\nThe Finger Guns\n\nJuly 24\n8pm \n21+\n$13.00\n\nTickets link: https://www.slimslastchance.com/event-details/the-scoffs-swaggerlies-the-finger-guns"}, {"Address": "3803 Delridge Way SW,, Seattle, WA 98106", "Artist": "Dining Dead ", "ArtistImage": "https://photos.bandsintown.com/thumb/11467172.jpeg", "Coordinates": [47.5699847, -122.3624868], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Witchy Surf Rock", "Time": "8:00 PM", "Venue": "Skylark Cafe & Club", "moreBioInfo": "Dining Dead is a Seattle based music project consisting of Seattle natives Emma Hayes (guitar) and Sammy Skidmore (vocals, guitar) with Bogie Pieper (drums) and Shannon Hargis (bass), hailing from California and Nashville respectively. Dining Dead is a blend of West Coast style and the American South, combining moody, melancholy twang and soul-baring songwriting with edgy, lyric heavy, surf rock-inspired licks to create their unique Northwest-inspired sound.", "otherInfo": "No event info available"}, {"Address": "5606 1st Ave S, Seattle, WA 98108", "Artist": "The Finger Guns ", "ArtistImage": "https://photos.bandsintown.com/thumb/11387416.jpeg", "Coordinates": [47.5524929, -122.33387], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Punk, Rock, Post Punk, Punk-n-roll", "Time": "8:00 PM", "Venue": "Live Rock Is BACK!", "moreBioInfo": "Authentic to the Northwest music scene, The Finger Guns are here to rock your proverbial socks off. Armed with musicianship and passion, this three-piece band leaves it all on the stage every time the amps get warm. Their performances are unpretentious, witty, and guaranteed to make a crowd move. The band has a unique set of influences brings out songs that have a sensibility that spans decades. Slices of 80’s punk topped with sprinkles of 90’s rock and spatters of country make up a big steaming batch of awesome. Featuring a veteran line-up of Seattle musicians including: Eric Chapman (Big Splash Champion, Kingpin Hayes) on drums, Kyle Curnutt (We Are Not Mel Torme, Radio Telescope) on bass, and Steve Bergstrom (Dapper Jones) on vocals and guitar. The Finger Guns have released four albums to date: “A Double EP”, “The Bigfoot EP”, “Yeti”, and their vinyl debut, “Sasquatch”, which launched in the spring of 2018. Having played nearly 200 live shows since their debut, the band had the pleasure of opening up a series of sold out shows for Black Happy this past summer at the legendary Showbox Market (Seattle, WA) and the Knitting Factory (Spokane, WA).", "otherInfo": "Live rock and roll is back in action with The Scoffs, The Swaggerlies, and The Finger Guns. \n\n21+ Doors at 8. Outdoor show, weather permitting."}, {"Address": "16300 Mill Creek Blvd, Mill Creek, WA 98012", "Artist": "Blue Velvet Groove ", "ArtistImage": "https://photos.bandsintown.com/thumb/11520584.jpeg", "Coordinates": [47.8506605, -122.2217038], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Blue Velvet Groove at The Haven Show Bar and Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "117 E Division St, Arlington, WA 98223", "Artist": "Eric Blu & The Soul Revue ", "ArtistImage": "https://photos.bandsintown.com/thumb/11252247.jpeg", "Coordinates": [48.19890119999999, -122.1260613], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Neo-soul, Soul, Future Soul", "Time": "8:00 PM", "Venue": "Live @ the Mirkwood", "moreBioInfo": "Seattle-based soul band reminiscent of 60s and 70s Motown Sound, but with all new tunes for new times!", "otherInfo": "10-piece soul powerhouse band, Eric Blue And The Soul Review makes their first appearance on the Mirkwood stage! Come out and dance!\n9-Piece soul-rock-jazz-funk fusion phenomenon, Letters From Traffic is back for their first show since early 2020!"}, {"Address": "1307 Bay St, Port Orchard, WA 98366", "Artist": "Anthony Schuman ", "ArtistImage": "https://photos.bandsintown.com/thumb/11510631.jpeg", "Coordinates": [47.542866, -122.6261847], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Standup Comedy, Comedy", "Time": "8:30 PM", "Venue": "Live Comedy Night at Slaughter County Brewery w/ Simon Kaufman", "moreBioInfo": "Anthony Schuman is an Army Veteran from Olympia, WA . When Anthony is not on stage, you can find him taking care of two little girls, taking care of a mini farm and writing jokes. Anthony spends time canvasing the local hiking trails, fishing, or kayaking. He spent his early years film making and has had his films screened as part of Seattle international Film Festival.He has even been featured on King 5’s Evening Magazine.", "otherInfo": "No event info available"}, {"Address": "1303 NE 45th St, Seattle, WA 98105", "Artist": "Kassa Overall ", "ArtistImage": "https://photos.bandsintown.com/thumb/11020040.jpeg", "Coordinates": [47.66117089999999, -122.3140159], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz, New Jazz, Rap, Electronic, Hip Hop, Avant-garde Jazz, Trap, Computer Music", "Time": "9:00 PM", "Venue": "Neptune Theatre", "moreBioInfo": "NYTIMES, 1/11/2019 “Kassa Overall’s new album — the irreverently titled “Go Get Ice Cream and Listen to Jazz” — attests to the diverse musical identity of this drummer, producer and rapper. It’s one of the few genuine-sounding, full-scope amalgams of contemporary hip-hop and jazz to surface in recent years. - GIOVANNI RUSSONELLO", "otherInfo": "Proof of full COVID vaccination and matching photo ID required at the door. Masks also required. COVID policies subject to change. COVID safety: https://www.stgpresents.org/about/reopening The Neptune Theatre is located in Seattle, Washington at 1313 NE 45th Street in Seattles University District. 8 ticket limit per patron. Patrons exceeding the ticket limit will have their orders cancelled at the venue's discretion. All sales are final. No refunds or exchanges. All ages, bar with photo ID. Metal detectors & bag search at door. Arrive early. No weapons. www.stgpresents.org/about/safety Mobile ticket delivery will be delayed until 4 days prior to event."}, {"Address": "Seattle, WA", "Artist": "That Irish Guy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8291442.jpeg", "Coordinates": [47.6062095, -122.3320708], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Celtic, Folk, Irish Folk", "Time": "9:00 PM", "Venue": "Murphys Irish Pub ", "moreBioInfo": "Born in the town of Omagh, County Tyrone in Ireland in 1974, That Irish Guy has been steeped in music from an early age. His great grandmother was Sarah Makem,the celebrated folk singer and song collector from Keady in Count Armagh. Her son, Tommy, was himself a famous folk singer in America,having gained the moniker, the grandfather of Irish folk with the Clancy brothers. His uncles, Tom and Jimmy Sweeney played in Barley Bree in the 70's and 80's. That Irish Guys influences range from the staple of Irish trad music to American folk artists such as Guy Clark, John Prine and Townes Van Zandt. He plays guitar and writes his own songs.", "otherInfo": "No event info available"}, {"Address": "1809 Minor Ave, Seattle, WA 98101", "Artist": "DJ KP ", "ArtistImage": "https://photos.bandsintown.com/thumb/9048863.jpeg", "Coordinates": [47.6168853, -122.3311713], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Timbre Room", "moreBioInfo": "The story of how I started dj'ing. 2007-2008: I moved to San Diego and that is when I got exposed to so much West coast music; especially remixes. I began to mess around with basic mixing software and started making random mixes. 2009: I moved back to Kansas City and had the opportunity to study abroad in Barcelona, Spain. I was overwhelmed with the dance music scene out there. It was amazing and I fully embraced it and submerged myself in it. The time I spent there changed my life forever. Unfortunately, when I came back from Barcelona I contracted Mono and I was out of commission for a month. My sister bought me a very basic audio mixer to help me pass the time and I never looked back. 2009-2010: At this point I had gotten the hang of basic mixing and my roommate at the time Deep Singh was mastering the Dholi (Indian Drum). With the help of parental investors we got together and decided to form DK Productions. We had the equipment and we hit the streets to market the brand. Soon after we started getting our first gigs, and from there the rest was history. This was the time when I chose the name Dj eKleCtic. 2011-2013: More DK. With each event we got better and better. Together Deep and I would bounce ideas off each other and integrate them into our sets. I also started working on my own club gig/events and started really getting the eKleCtic name out there. 2014-2017: I decided to leave Kansas City and move to Seattle. The first year in Seattle I was going to concerts left and right: hip hop, edm, trap, etc. You name it and I was there. I was taking it all in, gaining influence on how to build a set and captivate a crowd. These years were spent mainly in the studio perfecting my craft and working on mixes to share with the world. During this time I was doing a lot of pre-made mixes for friends and old customers back in KC. 2018: I decided to retire Dj eKleCtic and rebrand as DJ KP. It is like Kobe going from 8 to 24. I am a different person with a much different approach to how I dj now. I have been influenced by so many artists in the last 9 years and collectively I have shaped my own style.", "otherInfo": "No event info available"}, {"Address": "1809 Minor Ave, Seattle, WA 98101", "Artist": "Mister Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9020210.jpeg", "Coordinates": [47.6168853, -122.3311713], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Timbre Room", "moreBioInfo": "\"The syncopated drums are to die for. The guitar is present, clear and tasteful. The keys carry the necessary moods. And the vocals hold your hand throughout the experience.\" - Alex D, In The Record Store \"\"“CHIMES,” their new single, is a wonderfully smooth song that shows evidence of a band that is destined to do great things. Christian’s hauntingly suave vocals drive an elegantly layered backing track that sounds like it was produced by a band well into their prime. The song is vocally reminiscent of Jesse Rutherford, lead singer of The Neighbourhood, but with more grit and more range. Bobbing your head to this song is inevitable and is a sign that Mister Moon succeeded in creating a great track.\" - Stefano Todaro, Vinyl Venue \"The disc opens with the droning \"Waste,\" an atmospheric tune that features hushed vocals. The Alt-J-like \"Peer\" benefits from perky synths and rattling percussion. Consisting of two drummers, two keyboardists and two guitars, the band plays sonically lush melodies.\"- Jeff Niesel, Cleveland Scene Magazine", "otherInfo": "No event info available"}, {"Address": "16330 NE 4th St, Bellevue, WA 98008", "Artist": "Denise Rosier ", "ArtistImage": "https://photos.bandsintown.com/thumb/11110936.jpeg", "Coordinates": [47.6136643, -122.1233544], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Inspirational", "Time": "10:30 AM", "Venue": "Unity of Bellevue, WA  [Zoom @ 10:30AM PT]", "moreBioInfo": "Denise Rosier is an award-winning recording artist, songwriter, producer, and New Thought worship leader in Colorado Springs, CO. Denise's first album Only A Whisper Away was released in 2001, and from there her music has taken her to audiences as far away as Osaka, Japan. Her inspirational albums One Heart (2013), and EVERYDAY (2016) have garnered 7 Positive Music Award nominations, and 5 wins. She best known for \"Spirit Is In This Place\", \"Joy In My Day\", \"I Know God\", and \"Hallelujah Today\" . Her new album \"Heart of Praise Vol. 1\" (2019) was nominated at the 2019 Independent Music Awards in the Best Contemporary Christian/Gospel Album category. Denise is the first New Thought artist to have been nominated in that category, thereby breaking the genre barrier, and inviting inspirational music to be more inclusive. Her \"Heart Of Praise\" concerts are currently touring nationally introducing audiences to a fresh, new, experience of praise aligned with the New Thought philosophy. \"I believe singing is a spiritual practice\", says Denise, \"It's more than just a song. When we write for New Thought, we write to create a holy experience\".", "otherInfo": "No event info available"}, {"Address": "17537 15th Ave NE B, Shoreline, WA 98155", "Artist": "The Stacy Jones Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11464726.jpeg", "Coordinates": [47.756831, -122.313786], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues- Roots Rock-americana", "Time": "12:00 PM", "Venue": "Easy Monkey Taphouse", "moreBioInfo": "Stacy Jones is continually nominated for \"Best of the Blues\" awards in songwriting, performance, harmonica, guitar and winning the 2018 \"Best Band\" award plus nine other \"Best of the Blues Awards from the Washington Blues Society including Best Female Vocalist, Blues harmonica, Blues songwriter and The 2018 NW recording of the year for her 2017 album 'Love Is Everywhere.' Her 2017 release was also accepted in the first round of Grammy Voting for the \"Best Contemporary Blues Album and Best Americana Song categories and was chosen to represent the South Sound Blues Association as the entrant for the 2018 Best Self-produced CD competition at the International Blues Challenge in Memphis TN. The album made the list of Roots Radio Report top 40 Blues Rock albums of 2017. She has performed at the Chicago Blues Festival, SXSW, juke joints in Mississippi, riverboats in California, headlined festivals, toured Europe and shared stages with Elvin Bishop, Charlie Musselwhite, Lee Oskar, and many other legends. Her music has been described as \"A Whiskey & Water Baptism that lace Blues and Rock edges.\" “With her feet firmly planted in roots-based music, Stacy Jones pays homage to the blues but experiments by mixing in some mild-Americana and subtle country licks. Dynamic vocals fueled by powerful lyrics.\" \"the rolling thunder blues of Howlin’ Wolf mixed with the honesty of Lucinda Williams the 2015 IMEA award winner: BEST BLUES SONG. The 2014 & 2010 Washington Blues Society \"Female Vocalist of the year.\" WA Blues Society’s 2009 BB Award Winner “BEST NEW BAND” Winner of the 2016 Washington Blues Society Best Blues award for Songwriter and Best Blues Album \"Whiskey, Wine, and Water\". SJB continues to blow fans away with their high-energy, genre-bending performances. Amazing vocals, incredible musicianship, outstanding songwriting and powerful, dynamic arrangements – it’s easy to understand why Stacy and her band are captivating the crowds and gathering new fans at each event they perform. Stacy Jones not only impresses with a vocal richness beyond her years but is also a top-notch harmonica player as well as playing keyboards and acoustic guitar. The entertaining trio of Rick Bowen (drums), Tom Jones (bass) and Jeff Menteer (guitar) provides the foundation for a strong ensemble sound and the band’s obvious joy of making music together is contagious. Full history======= In 2009 The Stacy Jones Band took the Seattle music scene by storm, playing over 115 gigs & festivals as well as winning the Best New Band award from The Washington State Blues Society. The band released a limited edition CD Live at the Triple Door, in September2009 The Stacy Jones Band’s first full-length CD “Long Time Comin” was released in January 2010 and continues to receive strong airplay and is now in its second pressing. 2011 looks promising for this Northwest favorite. May 2010 Stacy Jones is award the Best Female vocalist award from The Washington Blues Society. Nov 2011 the band released \"No Need to Spell It Out,\" on Critical Sun Recordings. The 4th full-length album was Produced by Bubba Jones and recorded at Contact Create Studios-Snohomish. 2012 the album was nominated for NW recording of the year by the Washington Blues Society. Dec 2011 Jeff Menteer released \"The Nature of My Dreams,\" his first solo album featuring members of SJB, produced by Jeff Menteer and Tom Jones. June 1.2012 release Live And Untapped. captured May 2011 at the Untapped Blues and Brews festival, Showcasing the strengths and depth of the whole group, the set was recorded by Jazz Stream mobile and mixed at Studio Litho in Seattle by Floyd Reitsma (Pearl Jam-Dave Mathews) and mastered by Ed Brooks at RFI. 2013 - Stacy invited to Chicago Blues festival - Women of the Blues Showcase. 2014 -Stacy Jones awarded Best Female Vocalist award, and Rick J Bowen awarded Blues Drummer award from The Washington Blues Society. 2015 - April 1st-- the release of Whiskey, Wine, & Water from Stacy Jones. Produced by Stacy Jones and Floyd Reitsma -recorded and mixed by Floyd Reitsma at Studio Litho -Seattle 2016 WBS best of the blues awards winner Best NW recording =whiskey Wine and Water Blues Songwriter Stacy Jones 2017 release Love Is Everywhere Produced by Stacy Jones and Floyd Reitsma -recorded and mixed by Floyd Reitsma at Studio Litho -Seattle with a special guest appearance by Lee Oskar. chosen By SSBA as the entrant for a best indie CD at the 2018 IBC in Memphis TN. 2018 Washington Blues Society \"Best of the Blues Awards: Best Band, Best Female Vocalist, Paul Green Harmonica Award, Blues Bass, Blues Drummer, Blues Songwriter, Best NW Recording, Best Non-Festival Event For additional info, music and video go to: www.stacyjonesband.com Contact: info@stacyjoneband.com Tom Jones; trijones@comcast.net (206)-849-4562 http://stacyjonesband.bandcamp.com/ http://www.cdbaby.com/Artist/StacyJonesBand https://twitter.com/stacyjonesband", "otherInfo": "SUNDAY, 25 JULY 2021 FROM 12:00 PDT-20:00 PDT\nPinky's Rockin Weekend benefit show at Easy Monkey Taphouse.\nSunday July 25th\nAnnie Eastwood at noon,\nStacy Jones Band at 3pm and Mark DuFresne at 6pm. Sunday bands are a $20 cover or all 3 for $50.\nWe’ll be barbecuing both days\nAll money from the bands and the food goes to Pinky’s Passion for a Parkinson’s Cure"}, {"Address": "Tacoma, WA", "Artist": "The Olson Bros Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9946709.jpeg", "Coordinates": [47.2528768, -122.4442906], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Country", "Time": "2:00 PM", "Venue": "Private party", "moreBioInfo": "The Olson Band burst onto the country music scene in 2013 when they won a national songwriting contest for their hit song \"Sunrise\" in the Texaco Country Showdown, winning them a trip to Nashville to consult with a publishing company and being introduced at The Grand Ole' Opry. The band originated in Olympia, WA and is lead by singer/songwriters and brothers Luke and Isaac Olson and recent addition, Kaylee Rose Olson. Since then, the band has released two full length albums “Lookin’ At You” and “Let The Jack Drop” and an EP “A New High”. They have toured heavily up in the Pacific Northwest the past few years playing in Washington, Oregon, California, Idaho, Montana, along with receiving radio time in WA for their singles “Kiss Me Slow”, “By and By” and most recently “If I Find You”. Their single “If I Find You” just hit over 1.5 million streams on Spotify. The bands highly anticipated 3rd studio album \"Dancin' In Headlights\" is set for release in February 2019.", "otherInfo": "No event info available"}, {"Address": "Seattle, WA", "Artist": "Alex Ashley ", "ArtistImage": "https://photos.bandsintown.com/thumb/11565644.jpeg", "Coordinates": [47.6062095, -122.3320708], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "Private Event", "moreBioInfo": "“Masterfully weaving the old with the new, Alex Ashley brings fresh eyes and an old soul to the gritty realities of life and love lost. With an unorthodox approach [speaking of his method of playing guitar upside down and backwards], Ashley delivers heartfelt vocals and wields his well-worn six-string to stir fresh reflection on the human condition in a way only honest American music can. And that’s what he makes - real music of the tortured and fiercely independent West, rooted firmly in the musical traditions of country and rock & roll.” — Dillon Honcoop, Cascade Radio Group “Alex Ashley’s … songwriting takes you inside yourself and then out, impressing the beauty and danger of the complex world we live in, the heart is best kept safe through lyrical wanderings… A singer-songwriter to watch for, and listen to in these days of ours…”—Zan Agzigian, Host/Producer, 91.1 KPBX Spokane Public Radio", "otherInfo": "No event info available"}, {"Address": "124 Center Rd, Chimacum, WA 98325", "Artist": "Sway Wild (featuring Mandy Fer & Dave McGraw) ", "ArtistImage": "https://photos.bandsintown.com/thumb/11327975.jpeg", "Coordinates": [48.0097298, -122.7694012], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Folk-rock Indie-roots", "Time": "5:00 PM", "Venue": "Finnriver Farm and Cidery", "moreBioInfo": "SWAY WILD: New Name, New Music from Mandy Fer & Dave McGraw-- Debut Sway Wild album avail. today! Known as a standout electric guitarist and multi-instrumentalist, Mandy Fer fills the stage with her strong yet poised guitar solos, defying long-held gender barriers for female lead guitarists. Dave McGraw’s emotional songwriting riffs on natural elements of the world around him. McGraw spent a decade as a wildlife biologist, studying endangered birds in remote locales from the deserts of Mexico and the Grand Canyon to the mountainous rainforests of Washington. McGraw and Fer joined forces in Flagstaff, Arizona in 2010 before relocating to the Pacific Northwest in 2012. The duo’s 2014 release Maritime charted at #1 on the EuroAmericana Chart for two consecutive months and was praised by The Telegraph for “…soulful songs, intuitive musicianship, and fine singing.” Together, their exceptional vocal harmonies coupled with Fer’s pioneering electric guitar work have become a vehicle to carry them around the world. The pair has honed their skills touring extensively throughout the US and Europe, sharing stages with such artists as Iron & Wine, Glen Hansard, Gregory Alan Isakov, Charlie Hunter Trio, Lake Street Dive and many others. Winning over audiences anywhere from Alaska to Amsterdam, McGraw and Fer perform a heartfelt and dynamic blend of innovative folk, rock, pop and funk.", "otherInfo": "stay tuned to https://shop.finnriver.com/Music for tickets!"}, {"Address": "5500 Phinney Ave N, Seattle, WA 98103", "Artist": "Delvon Lamarr Organ Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/8998085.jpeg", "Coordinates": [47.6685394, -122.3536448], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Woodland Park Zoo", "moreBioInfo": "A Unique 60's & 70's Vintage Soul Trio With the Sounds of the Hammond B3 Mixed With Tasty Guitar Lines & Old School Style Pocket Drumming.", "otherInfo": "No event info available"}, {"Address": "2033 6th Ave, Seattle, WA 98121", "Artist": "Will Brahm ", "ArtistImage": "https://photos.bandsintown.com/thumb/11365019.jpeg", "Coordinates": [47.614592, -122.3391944], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Acoustic, Jazz", "Time": "7:00 PM", "Venue": "Arturo Sandoval ", "moreBioInfo": "Will Brahm is a Los Angeles based guitarist and composer, and a 2019 Herbie Hancock International Guitar competition semi finalist. He received his bachelors of music in Jazz Guitar Studies at California Sate University Long Beach, where he was a five time consecutive recipient of the “K-jazz” scholarship. Will has performed, recorded, and worked with artists such as Arturo Sandoval, the New West Guitar Group, Gordon Goodwin’s “Big Phat Band,” Kim Richmond, Otmaro Ruiz, Sara Gazarek, Jane Monheit, and Gretchen Parlato. Will has toured with The New West Guitar Group across the United States and to Malasia and the Philippines, and toured with his own original music across the United States and to Spain, Netherlands, Belgium, Germany, Greece, and Turkey. Recent albums of his include the 2017 release of his world original music ensemble “Homenaje,” the 2018 release of his duet album “Will Brahm & Lia Booth,” and the 2019 release of his most recent album under his own name, “Venture Atlas.” Will draws from a number of musical backgrounds from all over the world, giving his original compositions the combination of singing melodies, rich dense harmonic variations, and diverse exciting rhythmic motion. His 2019 album release “Venture Atlas” contains all original compositions of his, and he is joined by Chris Wabich on drum set and percussion, Diego Alvarez on percussion, Ahmet Türkmenoğlu on bass, and Katisse Buckingham on flute. Will's new album “Venture Atlas” is out now!", "otherInfo": "No event info available"}, {"Address": "Seattle, Seattle, WA 98116", "Artist": "Avian Invasion ", "ArtistImage": "https://photos.bandsintown.com/thumb/9211644.jpeg", "Coordinates": [47.5745802, -122.4047843], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Progressive Trance, Deep House, Future House, Trance, Progressive House", "Time": "3:00 PM", "Venue": "The Progressive Birdhouse", "moreBioInfo": "www.avianinvasion.com", "otherInfo": "Bird One spins fresh progressive, trance, and more every week from his studio in Seattle, WA - Join the Invasion at avianinvasion.com/live"}, {"Address": "Seattle, WA", "Artist": "Vocal Few ", "ArtistImage": "https://photos.bandsintown.com/thumb/8850468.jpeg", "Coordinates": [47.6062095, -122.3320708], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Acoustic, Folk", "Time": "6:30 PM", "Venue": "HOUSE TBA", "moreBioInfo": "Vocal Few is an singer/songwriter folk pop duo singing songs about travel & change & dreams & heartache. We formed in Seattle, WA, in 2011. Both our formation and debut EP were motivated by the impending birth of our first daughter. Now we make music for ourselves and have more albums than children. Life's a trip. A road trip. Vocals, Guitar / Matt MacDonald Keyboard, Vocals / Kristie MacDonald", "otherInfo": "The vaccinated Seattle duo is coming to living rooms this summer for the first time since 2018 on the READY TO GO TOUR, a title welcoming the end of quarantine and lockdowns, and the rekindling of community and camaraderie."}, {"Address": "920 SW 150th St, Burien, WA 98166", "Artist": "Billy Shew ", "ArtistImage": "https://photos.bandsintown.com/thumb/8300331.jpeg", "Coordinates": [47.4688276, -122.3469497], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Country, Rock, Blues", "Time": "7:00 PM", "Venue": "Tuesday night Jam @ Burien Eagles", "moreBioInfo": "Billy Shew has pursued a life in music for over 30 years. He got his first guitar at the age of 5 and started taking lessons at the age of 8. While moving around the country at a young age, he got to experience the music culture of the different communities including a time overseas with his Aunt from Zaire Africa. While in college, he studied classical guitar and mathematics. He has been playing professionally around the Pacific Northwest for the last 17 years playing in the local bars and hosting open blues jams during the week, which makes up a good 4 to 5 nights worth of music. He has played with his own band and continues to do so, but also plays with a country band, 8 Second Ride, and fills in with other bands when guitar is needed. Billy Shew has 3 albums to his credit that are presently available everywhere music is sold and streamed: After Midnight, Bootlegged At Dawsons, and Look At Me Now. Billy Shew is a lover of all types of music especially country and jazz/blues. His influences are the likes of Jimi Hendrix, Stevie Ray Vaughn, Eric Johnson, Brad Paisley, Vince Gill, Danny Gatton, Johnny Hilland, Randy Rhoad, Robben Ford, Neil Schon, Larry Carlton, John Denver, and Dave Mathews.", "otherInfo": "No event info available"}, {"Address": "301 Rainier Blvd S, Issaquah, WA 98027", "Artist": "WingsNThings: The Music of Paul McCartney ", "ArtistImage": "https://photos.bandsintown.com/thumb/7901689.jpeg", "Coordinates": [47.5273806, -122.0343262], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Ballads, Beatles, Classic Rock, Wings", "Time": "7:00 PM", "Venue": "Concerts On The Green", "moreBioInfo": "WingsNThings is a Seattle band playing the Music of Paul McCartney. From Sir Paul's Beatles classics, to Wings, and Solo hits, the group covers all phases of McCartney's incredible career. Excellent musicianship, spot-on harmonies, an excellent rapport with the audience, and an incredible catalog of hits to choose from ensures that you will have a great time at any WingsNThings show. Note that WingsNThings is NOT a \"Tribute Band\" in the look alike sense. The emphasis is put on what matters: The Music. However, they recreate note-perfect renditions of McCartney's biggest hits that he had with The Beatles, Wings and also his great solo career. From \"Hey Jude\", \"All My Loving\", and \"Penny Lane\" to \"Band on the Run\", \"Live and Let Die\", \"Silly Love Songs\" all the way to \"Dance Tonight\", \"Sing the Changes\" and Paul's latest hit \"My Valentine\". If you love McCartney, WingsNThings: The Music of Paul McCartney should be on you bucket list! WingsNThings: The Music of Paul McCartney has been a favorite at many clubs in the greater Seattle area including Tulalip Casino, Washington's number 1 rated casino. In 2012 they were part of Mountain Meadows Farm entertainment roster playing for crowds of up to 10,000 and corporate events for Boeing and Amazon.com. They've also played for local East Side festivals as Newcastle Days, Issaquah Salmon Days, and Issaquah Concerts on the Green. Here's local Beatlemaniac and all around great radio host and friend MIKE WEST (Host of KZOK's \"Breakfast With The Beatles\"): \"This past Friday I went to the Historic Everett Theater to see the band 'WingsNThings' perform the entire Wings Kingdome performance that happened 40 years ago to the day. My Quick Review: Man... WingsNThings... we gave away tickets to this show and I wish everyone could've gone. They did an EPIC job doing the entire show from their spot-on musicianship to the actual horn section to the lasers and the smoke and the whole thing, it was just a flashback. It was like going back in time and these guys are awesome. So if you've never seen WingsNThings before, I am officially endorsing them now. I highly recommend that you see them.\" (Hear Mike's Endorsement) Listen to Mike's Show \"Breakfast With The Beatles\" on KZOK 102.5 FM EVERY Sunday at 8AM!", "otherInfo": "WingsNThings: The Music of Paul McCartney is back to where it all started for us - ISSAQUAH! Come out with us and get yer Wings on! FREE! ALL AGES! Under the Summer skies!"}, {"Address": "301 Rainier Blvd S, Issaquah, WA 98027", "Artist": "Bryan Woolley Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11169196.jpeg", "Coordinates": [47.5273806, -122.0343262], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Rock, Harmonies, Vocal, Multi-instrumentalist", "Time": "7:00 PM", "Venue": "Issaquah Community Center", "moreBioInfo": "Bryan Woolley is a multi-instrumentalist and vocalist from Seattle. Bryan performs in some of the busiest bands (4) in Washington, including 3 tribute bands (Styx, McCartney, & Boston) and also a dance band (The Machine) that's been a staple in the Seattle club scene since the 80s (he joined in 98). He's recently decided to take the plunge into releasing his own songs, performed on his own and recorded at home. Bryan's music can be described as pop, rock, with a definite nod to rock bands from the late 70s and early 80s. You can find them on Spotify (search Bryan Woolley Music). It's a free listen, so check 'em out. You can hit me up on Facebook at brywoolmusic, Youtube.com/Brywool, and also my website at http://www.BryanWoolleyMusic.com.", "otherInfo": "No event info available"}]