var sf_events = [{"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Týr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10165861.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Classic Metal, Viking Metal, Progressive Metal, Death Metal, Classic Rock, Symphonic Metal, Folk Metal, Heavy Metal, Pagan Metal, Melodic Metal, Hard Rock", "Time": "2:00 AM UTC", "Venue": "DNA Lounge", "moreBioInfo": "With Hel, the Faroe Islands' Týr provide even more irrefutable evidence that they stand at the vanguard of Scandinavian metal. Their eighth full-length is a collection of ruthlessly melodic and irresistibly compelling progressive folk metal that will immediately resonate with any who have followed the band at any point over the two decades of their storied career. \"Being so close to the album, it's almost impossible for us in the band to have an objective opinion about it, but my impression is that it's a more diverse collection that's also more extreme in some ways. There are more instrumental passages than on 'Valkyrja' (2013), and there are a lot of guitar and bass details,\" states guitarist/vocalist Heri Joensen. \"I really feel we've realized the vision we set out to create all those years ago, and as I listen through the album, I am satisfied with every aspect: the epicness, the intricacy, the melodies and harmonies, and the sheer heaviness of it. I love the whole atmosphere of it.\"\n\nKnown for their prolific nature - dropping their first five full-lengths in the space of just seven years - the six-year gap between Valkyrja and Hel is by far the longest between any two of their records. During that period the band toured hard, taking the album around the world, including a support run with Children Of Bodom in North America and an appearance on the 70,000 Tons Of Metal cruise. However, other factors played into this extended break between releases. \"We approached this one differently because I learned that if I continue doing albums in the way we had up to now, I would die from a heart attack before I'm 50!\" says Joensen. \"That's one of the reasons we changed our method and took such a long time on this one.\" That this tactic - which also includes more songwriting contributions from bassist/vocalist Gunnar Thomsen and guitarist Terji Skibenæs than on previous releases - has been beneficial is borne out in the finished product, which is perhaps more immersive than those that came before. \"Musically it leans a bit towards our album, 'Ragnarok' (2005),\" states Thomsen. \"It's a bit more epic and also much better worked through than any of our previous albums.\" It also marks the recording debut of drummer Tadeusz Rieckmann, who has manned the drum throne for Týr's live shows since 2016. \"We had some problems finding the right guy some years back, but Tadeusz is the man for the job,\" says Joensen. \"He's a very technically able drummer, but at the same time, he has a very natural old-school heaviness to his style, and he plays with deep emotion, which is just what we need.\"\n\nConceptually, the album is informed by a combination of mythology, personal experience and observations of current international events, making for a multifaceted experience that can be processed and understood on many levels. Starting not with a specific story to tell but with an atmosphere in mind, Joensen prefers not to disclose too much detail when it comes to lyrics, keen for listeners to have a chance to take what they want from the songs, though he provides a basic description of that which inspired him. \"Hel is the realm of death in Norse mythology, the underworld where those who die a natural death, not in battle, go. A bit confusingly, it is also the name of the goddess who rules over the same realm. She's the daughter of Loki and a terrifying creature to look upon.\" Two of the songs - \"Ragnars Kvæõi\" and \"Álvur Kongur\" - are traditional Faroese ballads and are as such sung in Joensen's native tongue. Followers of Týr will be aware that they have on numerous occasions strayed from English, which Joensen acknowledges as the \"language of metal\", though this time out it is only the ballads that feature non-English lyrics. \"If I have a good folky melody, I always have the thought that I should write the lyrics in Faroese, but I seldom have the time. The traditional songs come with lyrics, so it's just about picking out the verses I want to use.\" These tracks were in actuality selected even before the release of Valkyrja and have had a long gestation period, Joensen feeling that in adapting them they very much fit with the band's signature sound. \"I am always trying out melodies and chose 'Ragnars Kvæði' first for the fascinating melody in the chorus, and secondly for the storyline. The other ballad I picked first because of the lyrics, which refer to Odin extensively, and secondly for the melody and chorus. I was very satisfied with the harmonies and epic feel of the arrangements I'd come up with, and to tell you the truth, I wish there were more songs of this kind on the album.\"\n\nHel was tracked entirely by Thomsen and Joensen, with sessions split between the latter's studio in Søldarfjørður, drums lain down at Jacob Hansen's studio in Denmark, Skibenæs working in his home studio, and some solos and bass details recorded while they were on the road in North America. \"The sessions took us a long time because we did it all on our own. But we gathered a lot of knowhow while doing it, so it will be a good reference for the future,\" states Thomsen. Joensen concurs, adding, \"It was a bit more relaxing than usual, which was good for me. It took some discipline, and creative people are not typically the most disciplined types. I am definitely not, so I guess it could have gone faster with someone else at the whip!\" That the delay in getting the record out means it's emerging in the twentieth year of Týr's existence is quite poignant. It has definitely not been an easy road to this point, with several members having come and gone, and those that remain having had to endure some very difficult periods, but despite all of it, they have managed to make it through, and achieved a great deal in the process. \"I did dream about becoming an internationally successful professional when I started. It's what I aimed at, but still it's a bit surreal that we've made it this far,\" Joensen admits. \"I didn't in my wildest dreams think I could put survive such misery and abject poverty that this career has lead me through. Still, here I am.\" Thomsen \"could not be prouder\" when he looks back at the string of records they have released, also acknowledging the ups and downs experienced along the way, but making an important point: \"We've done something nobody from where we're from has done before,\" he states plainly. \"But there's a lot more to come!\"\n\nKeep up to date with TÝR at the following locations:\nhttp://www.tyr.fo\nhttps://www.facebook.com/tyrband\nhttps://twitter.com/tyrband\nhttps://www.instagram.com/tyr_official\nhttps://www.youtube.com/tyrband\n\n\nBand History:\nProfession of the Christian Faith or Decapitation: This was the choice given by Sigmundur to his Faroese Viking compatriot Tróndur í Gøtu. And so it was that in 999 A.D., the Christianization of the small “Faeroe Islands” began, casting a veil of oblivion over the ancient Scandinavian gods and only leaving the relics of forgotten heathenry buried deep within the Christian ritual. Or so it was believed...\n\nExactly 999 years later, a small group fondly remembering the archaic gods and rites came together to form the Faroese Viking metal band, TÝR. The one-armed God of War —the bravest of all— became the eponym of the Nordic quartet. Yet TÝR mastermind Heri Joensen is no war monger in disguise and points out that TÝR (also known as the God of Justice) is also revered for first seeking the avenues of diplomacy—an attribute that does not take away from this god of war’s drive.\n\nA distinctive trademark that sets TÝR apart from most other bands of the Viking metal genre is the authenticity of their music: “Traditional music dating back to the Vikings, that is not preserved anywhere else in the world, not even in Iceland, is passed on in an oral tradition here and it is still alive and well. That is what we build our music on and draw great inspiration from,” explains Joensen.\n\nAlmost every song is based on Faroese or Norwegian lore, and is riveted in the garb of the folk metal genre. Its approach unmistakably creates very true Viking metal.\n\nFollowing the release of a demo, the Ólavur Riddararos single, full-length How Far to Asgard, six years of innumerable gigs, and several domestic television appearances, TÝR’s second full-length Eric the Red became the Islands’ best-selling album, coming to the attention of Napalm Records, the label that finally made the album available worldwide in 2006.\n\nImmediately, the unique approach of TÝR´s music, melting traditional Nordic songs and dances with Celtic influences, doom, heavy, and progressive metal found fans around the globe. “Hail to The Hammer” became the hymn to the new generation of folk, pagan, and Viking metal fans.\n\nIn late 2006, TÝR refined their trademark sound with Ragnarok. Technically brilliant and 100 percent authentic, Ragnarok was nothing less than a masterpiece within the true Viking metal genre. The Faroese band embarked on a European tour with Die Apokalyptischen Reiter and a few months later with AMON AMARTH. Though musically different, TÝR gained legions of new fans, impressed by the four men on stage, who were able to turn every show into a demonstration of musical prowess.\n\nFestival appearances throughout Europe and continued touring followed until TÝR enjoyed their biggest live triumph ever at the very over-crowded Wet Stage in Wacken.\n\nLand was released in 2008 and proved to be yet another milestone in the band’s career. Traditional Faroese lyrics marked tracks such as “Gátu Ríma,” “Fípan Fagra” and “Lokka Táttur,” and “Gandkvæði Tróndar,” which is a poem by J.H.O. Djurhuus about the Faroese chieftain Tróndur, who fought against the dying of the old beliefs and for the independence of the Faeroes. A video clip was produced to the fan favorite “Sinklars Vísa.” Land received overwhelming positive feedback and a new audience was able to experience the power of TÝR for the first time.\n\nFollowing the release of Land, TÝR embarked on numerous tours through Europe. One of the highlights was without a doubt the Aaskereia Festival tour with then label-mates Alestorm and Hollenthon. Thanks to their efforts, the band reached many new fans with their memorable concerts. 2008 ended with TÝR being nominated as “Band of the Year” by the Faroese National TV and radio. However, the band had no time to rest on its laurels and embarked on yet another tour through North America in the spring of 2009.\n\nDespite their busy touring schedule, TÝR worked on new songs recorded in early 2009. The band chose to produce the album on native soil. Jacob Hansen mixed the new material with finishing touches provided by the mastering experts at Finnvox. By the Light of the Northern Star met with great feedback from fans and critics alike. The new anthem “Hold the Heathen Hammer High“ was regarded as the legitimate successor to “Hail to the Hammer.” After the release of the album By the Light of the Northern Star, the band played numerous concerts and festivals, as well as taking part in the 70.000 Tons of Metal cruise, while still finding the time to work on new material for their upcoming release.\n\nThe story of King Thrym, who dared steal Thor´s hammer \"Mjollnir,\" may set the lyrical stage on TÝR's latest album, but it does not prevent them from covering more current topics like in the track \"Shadow of the Swastika.\" The Lay of Thrym follows the path of the band's previous releases by uniting classic heavy metal riffs with impressive drumming, traditional melodies, and powerful choruses. The result is a number of epic anthems, such as \"Take Your TÝRant\" and \"Hall of Freedom,\" both of which will most certainly earn a permanent spot on TÝR's future set lists. Frontman Heri Joensen continues to give TÝR a unique and unmistakable edge with magnificent vocals and superb guitar work. Jacob Hansen was again responsible for recording, mixing, and mastering the album, complementing this fascinating Faeroese sound universe with finishing touches that allow every last detail to shine. The Lay of Thrym is a genuine Viking metal album that will undoubtedly secure TÝR's hold on this genre with its heroic melodies and glorious riffs.\n\nValkyrja, the 7 full-length album from the Faroe Islands natives TÝR, is a concept album with a story line based loosely around an nameless Viking age warrior who leaves his woman and goes off to impress the Valkyrie on the battlefield so that she may bring him to Valhalla, or to Fólkvangr, the home of Freyja—the goddess associated with love, sexuality, beauty, fertility, gold, sorcery, war, and death. One can say the album is also indirectly about women and how they affect men and what men will do to impress and obtain women. Frontman and founder Heri Joensen goes on to explain; “the woman that the warrior leaves may represent the earthly women. Freyja, The Lady Of The Slain, may represent the perfection of Women, and the Valkyrie is the link between the two, taking men from earthly to godly women.”\n\nRecorded at Hansen Studios in Ribe, Denmark with Jacob Hansen who handled production, mixing and mastering, the band began writing guitars and drums for Valkyrja over a year ago with melody lines and arrangements being handled in the studio. “I had the story outline and approximate titles very early in the writing process, but only very late, maybe almost too late, did I write the actual lyrics,” comments Heri Joensen. The band’s drummer, Kári Streymoy, parted ways with TÝR after the band completed their US run on Pagan Fest and before they entered the studio so TÝR enlisted George Kollias who stepped in to handle recording duties on Valkyrja. In terms of what the band hopes fans take away from the album, bassist Gunnar H. Thomsen states “I hope they will enjoy it and they like the new direction as well as (guitarist) Terji's bigger involvement in writing and George's drumming. We had a more upbeat direction without changing TÝR's style.”\n\nDiscography:\nÓlavur Riddararos (2002)\nHow Far to Asgard (2002)\nEric the Red (2003)\nEric the Red re-released (2006)\nRagnarok (2006)\nLand (2008)\nHow Far to Asgard re-released (2008)\nBy the Light of the Northern Star (2009)\nThe Lay of Thrym (2011)\nValkyrja (2013)\nHel (2019)", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "10 Ave of the Flags, San Rafael, CA 94903", "Artist": "AbbaFab ", "ArtistImage": "https://photos.bandsintown.com/thumb/8072786.jpeg", "Coordinates": [-122.533538, 38.002387], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Scotty Pearson, Kayla Kenzior, Anne Davies, Terry Davies, Nick Davies", "Time": "2:00 AM UTC", "Venue": "Marin Center Showcase Theater", "moreBioInfo": "AbbaFab is the ultimate ABBA concert. 2 hours of unadulterated FUN!! Click on TOUR DATES to see when AbbaFab are performing at a venue near you!", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "2:00 AM UTC", "Venue": "Sofar Sounds", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "522 2nd St, Oakland, CA 94607", "Artist": "Grade 2 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9251024.jpeg", "Coordinates": [-122.277791, 37.797058], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Streetpunk, Punk, Rock", "Time": "2:00 AM UTC", "Venue": "Oakland Metro", "moreBioInfo": "Grade 2 are an English punk band from Ryde, Isle of Wight, formed in 2013. The young three-piece is made up of Sid Ryan - Bass & Lead Vocals, Jack Chatfield - Guitar & Vocals and Jacob Hull - Drums.\n\nTheir music can be described as a classic punk sound, hard and fast whilst also including melodic guitar and vocal parts. Influence taken from classics such as The Clash, The Jam and The Stranglers.", "otherInfo": "No other event info available"}, {"Address": "13160 Central Ave, Boulder Creek, CA 95006", "Artist": "The Rough & Tumble ", "ArtistImage": "https://photos.bandsintown.com/thumb/9905529.jpeg", "Coordinates": [-122.121327, 37.124938], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk, Americana", "Time": "2:00 AM UTC", "Venue": "lille aeske arthouse", "moreBioInfo": "The Rough & Tumble are a folk/Americana duo comprised of Mallory Graham and Scott Tyler. Formerly from Nashville, they now live full-time in a 16ft camper with their two dogs playing shows across the US.", "otherInfo": "On April 16, 2020, Lille Aeske Arthouse presents The Singer & The Songwriter and The Rough & Tumble. Join us at 7PM for a great night of music. Tickets are $20.\n\nThe Rough & Tumble are a dumpster-folk, thriftstore-Americana duo, consisting of Mallory Graham & Scott Tyler and their menagerie of homemade instruments and noise makers, have been hobbling around the country in their 16ft camper with their dogs since 2015, taking their songs to the far corners of the US and to the weird little towns they pass along the way. Written during a time of doggedly trying despite the odds and a self-proclaimed “year of honesty,” The Rough & Tumble released their latest studio album Howling Back at the Wounded Dog in September 2019. Join the pack and see the show that has been described as \"restorative Americana, highly entertaining, with jokes and stories worthy of an HBO special.\"\n\nwww.theroughandtumble.com.\n\nThe Singer and The Songwriter is the musical duo of vocalist/songwriter Rachel Garcia and guitarist/songwriter Thu Tran. “The duo creates soft melodic songs, that could just as easily exist as poems. Beautiful, and full of sound and emotion” (Playlist Play) while their multi-cultural backgrounds bring depth and diversity to the rich traditions of folk, jazz and blues music; genres they navigate between with ease and fluidity.\n\nThe duo has been captivating audiences across the US with their intimate live shows at house concerts, theaters, listening rooms, and coffeehouses. At times heartbreaking and at times hilarious, their performances are open-hearted conversations with the audience where they share their stories full of honesty, humor and wit, while delivering their songs with riveting, economical precision. Their live shows are filled with “inimitable storytelling, musical mastery, and soul-baring honesty. These two are truly a gift.”"}, {"Address": "1710 Mission St, San Francisco, CA 94103", "Artist": "Honey Gold Jasmine ", "ArtistImage": "https://photos.bandsintown.com/thumb/8182717.jpeg", "Coordinates": [-122.420383, 37.769717], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Jazz, Hip Hop", "Time": "2:00 AM UTC", "Venue": "Brick & Mortar Music Hall", "moreBioInfo": "Honey Gold Jasmine is a singer-songwriter, visual artist and ARTivist from Vallejo, CA known for her eclectic and innovative sound that combines experimental elements of hip-hop, R&B, and jazz. Her raw, authentic style, signature smooth voice, poetic lyrics, and genre-bending instrumentals all add up to a sound that grows as she flows. She describes this musical experience as \"from my mind, body and soul to yours.\"\n\nVisit her website www.officialhoneygold.com for her latest music and news.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Madeline Tasquin ", "ArtistImage": "https://photos.bandsintown.com/thumb/10179736.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk Jazz, Vocal, Doo Wop", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Singing in both English and French, Canadian-Californian songcrafter Madeline Tasquin weaves nimbly from jazz folk to odd-meter soul, and from sassy pyschpop ballad to delicately dark fairy-tale, delivering it all with a stage presence that radiates. With influences ranging from Primus and Mr.Bungle to Rachmaninoff and Chopin, it's no surprise that her songs takes unexpected harmonic and rhythmic twists and turns, though she manages to pull this off without leaving anyone in the room behind.", "otherInfo": "Ian George (the mischievous Minnesota ballad singer backed by a peculiar experimental folk rock band) + Madeline Tasquin Musik (the equally mischevious Canada-raised Oakland-based singer-songcrafter) team up on an intimate night of musics at The Lost Church, SF's fave sexy lil' cabaret-style non-profit music venue within a 1-minute walk from a BART station!! A sure fire way to recharge your heart batteries for a harrowing election year in which your heart batteries will be sorely needed.\n\nHOT TIP: Grabbing advance tickets lets the musicians spend more time preparing music and less time getting your lovely rear ends in seats. {INSERT ADV TICKET LINK HERE}\n\nIan George + The Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. The ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…\nhttps://www.iangeorge.com/stories\n\nMadeline Tasquin just woke up after a long nap and is hellbent on inspiring you, dear human, to make the most of your life force and that big heart of yours on this beautiful planet smack dab in the Goldilocks Zone of the Solar System in the Milky Way Galaxy of our known universe. Her strangely addictive musical potions – concocted from the rhythmic seeds of balkan and doo-wop, the squishy flavourful fruit of pop, with hints of the tart rind of jazz – may cause side effects including talking to strangers, being kinder to yourself, and gas.\nhttp://madelinetasquin.bandcamp.com\n\nWow, you read all the way to the bottom! You and your impressive attention span in the Internet Age get a kiss. x"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Ian George ", "ArtistImage": "https://photos.bandsintown.com/thumb/10207176.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Folk Rock, Avant-garde Music, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Ian George + the Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. the ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…", "otherInfo": "No other event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Anthony Krayenhagen ", "ArtistImage": "https://photos.bandsintown.com/thumb/10117650.jpeg", "Coordinates": [-122.399943, 37.795514], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Standup Comedy, Stand Up Comedy, Stand-up Comedy", "Time": "3:00 AM UTC", "Venue": "Punch Line Comedy Club", "moreBioInfo": "Charming and acerbic, this 10 year veteran is at the top of his story telling prowess. Spinning highly personal stories, ranging from being raised by a single mother, to the pitfalls of growing up in a small CA town. His engaging manner, and slick wordplay make this \"old soul\" a fit for any, and all audiences.\n\nHe has been a finalist at Big Sky Comedy Festival and SF International Comedy Comp. SF Sketchfest and Comedy Centrals Clusterfest, SLO Comedy Festival, Skankfest (NY) featured performer. He has opened for: Rich Vos, Big Jay Oakerson, Cristela Alonzo, Deon Cole, Ryan Stout, Bill Bellamy, Craig Shoemaker, Michael Blackson, Aries Spears, Frankie Quinones, and Damon Wayans Jr.", "otherInfo": "No other event info available"}, {"Address": "1928 Telegraph Ave, Oakland, CA 94612-2202", "Artist": "Tay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8445474.jpeg", "Coordinates": [-122.26958, 37.80952], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Abuja,Nigeria", "Time": "3:00 AM UTC", "Venue": "Uptown", "moreBioInfo": "tayiwar.com/biography", "otherInfo": "Join Tay and the JangLahDahs (OAK), Boot Juice (SAC) and Levi Thomas (OAK) and TBA"}, {"Address": "8240 Old Redwood Hwy, Cotati, CA 94931", "Artist": "Small Hat ", "ArtistImage": "https://photos.bandsintown.com/thumb/9523631.jpeg", "Coordinates": [-122.705214, 38.325608], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Blues-rock, Alternative, Rock, Soul", "Time": "3:00 AM UTC", "Venue": "Redwood Cafe", "moreBioInfo": "Delivering their unique sound of soulful alternative southern rock, Small Hat features Mandy Brooks, Cosmos Harrison, and ZOZ, along with various special guests, with the intention to inspire and connect with their audience. Based out of Northern California, Small Hat has been awarded for songwriting, with their first single released spring of 2018. smallhatband.com", "otherInfo": "No other event info available"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Country, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk, Rock", "Time": "3:00 AM UTC", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Country, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk, Rock", "Time": "3:00 AM UTC", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Teddy Abrams ", "ArtistImage": "https://photos.bandsintown.com/thumb/6264505.jpeg", "Coordinates": [-122.419994, 37.777441], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Davies Symphony Hall", "moreBioInfo": "Teddy Abrams is an American conductor, composer, pianist, and clarinetist.", "otherInfo": "This week, the San Francisco Symphony brings together two composers—one past and one present—for an inspired pairing of audience favorites. Guest conductor Teddy Abrams leads the orchestra in the West Coast premiere of Philharmonia Fantastique by the internationally renowned Bay Area composer Mason Bates. A fixture as a DJ in the splashiest nightclubs around town, Bates turns his ear for layering sound, rhythm and texture upon the infinitely variable palette of the symphony orchestra (plus a pair of laptops). Bates' work appears side-by-side with another master musical colorist—but in a nineteenth-century aesthetic—Tchaikovsky, who delivers a volcanic rush of irresistible melodies in his thundering Symphony No. 5.\n\nConductor/Performers\n\nTeddy Abrams\nconductor\n\nSan Francisco Symphony\nProgram\n\nBarber\nSecond Essay for Orchestra\n\nMason Bates\nPhilharmonia Fantastique: The Making of the Orchestra West Coast Premiere, SFS Co-commission\n\nTchaikovsky\nSymphony No. 5"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Adam Brookes ", "ArtistImage": "https://photos.bandsintown.com/thumb/9635055.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Pop, Indie", "Time": "3:00 AM UTC", "Venue": "Rickshaw Stop", "moreBioInfo": "\"Adam Brookes' solo project is a deviation from Dangermaker's dark pop sound. The minimal use of guitar paired with electronic production creates a chill and light attitude, suitable for summertime vibes.\"\n– RIFF MAGAZINE\n\n\"San Francisco’s Adam Brookes has never been an artist easily pigeonholed, he’s increasingly on quests to expand his range. His first solo single, All I Got is You, is less vast Arctic Monkeys type rock and more akin to airy Spandau Ballet synth-pop (with his signature Northern California flair of course).\"\n– GLOBAL TEXAN\n\n\"With its breezy, minimal, electronic feel, the new tune All I Got is You from Dangermaker's Adam Brookes is your perfect summer soundtrack.\"\n– GLIDE MAGAZINE", "otherInfo": "ADAM BROOKES (of Dangermaker)\nSAICS\nSloome\n8 pm\n$10"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "The Groovebirds ", "ArtistImage": "https://photos.bandsintown.com/thumb/8788706.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Soft Rock, Alternative", "Time": "4:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "The Groovebirds are American songwriters and recording artists. Their music is lyric-based Alternative Soft Rock; influenced by the sounds of the 60s, 70s and 80s. Tracks from the band's \"Looking In From The Outside\" album were featured on radio and television programs in the United Kingdom, Australia, and the Pacific Northwest; and their latest release, “Time It Takes,” has appeared in music rotations globally since 2017. Both albums are currently available at Music Millennium in Portland; bandcamp.com, !tunes, Spotify and CD Baby; and through Groovebirds Music at https://thegroovebirds.com", "otherInfo": "No other event info available"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "Sonamó ", "ArtistImage": "https://photos.bandsintown.com/thumb/9317059.jpeg", "Coordinates": [-122.437364, 37.774222], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Acid Jazz, Funk", "Time": "4:30 AM UTC", "Venue": "Madrone Art Bar", "moreBioInfo": "If Jamiroquai and Stevie Wonder were Italians, they would sound like Sonamó.\n\nWith a dynamic, passionate blend of melodic lines shot through with hefty doses of R&B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree. One of the strongest characteristics of Sonamó is their high energy that’s well expressed in their memorable live performances.\n\nThe San Francisco band, whose roots are spread all over the world, released on August 2019 their latest new single, their funky fresh version of the 1956 classic Tu Vuó Fà L’Americano (You Want To Be American)…but with a TWIST!\n\nSonamó flipped the script and replaced the lyrics, so their version is called… ”You Wanna Be an ITALIANO”. You will enjoy the fierce funk and clever wordplay.\n\n\nSonamó started when Giuseppe Pinto moved to San Francisco in 2010. As a passionate musician from Italy, Pinto searched for inspiration in his new city by exploring its eclectic scene and open-mindedness. As Pinto mentioned: “[...] my experience in the United States completely changed me. I had to reconsider all my values and understand that there are many ways of doing things and seeing things. That’s what I call the American miracle: a huge diversity that brings the best part of all of us”.\nThose feelings of freedom and love in Pinto’s journey came to life with Sonamó after the meeting with creative guitarist Trent Berry who says: ”[...] as a kid growing up in the midwest it was like discovering a lost cousin almost like a parallel evolution, if American funk is like Nascar then Italian funk is like Formula 1”.\n\n\nThe name Sonamó is inspired by an album of Pino Daniele (E Sona Mo’) that means “and play now”, It is sometimes used among musicians in Southern Italian as a slang term meaning, “show me what you got!” and boy, do they ever!", "otherInfo": "If Jamiroquai and Stevie Wonder were Italians, they would sound like Sonamó.\n\nWith a dynamic, passionate blend of italian melodic lines shot through with hefty doses of R&B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree.\n\nwww.sonamomusic.com"}, {"Address": "800 Post St, San Francisco, CA 94109", "Artist": "itchtheband ", "ArtistImage": "https://photos.bandsintown.com/thumb/10063294.jpeg", "Coordinates": [-122.415268, 37.7876], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Transylvanian, Jazz, Electro", "Time": "4:30 AM UTC", "Venue": "The Royale", "moreBioInfo": "Striptease music", "otherInfo": "No other event info available"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "Junk Parlor ", "ArtistImage": "https://photos.bandsintown.com/thumb/8142032.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Junk", "Time": "4:30 AM UTC", "Venue": "Club Deluxe", "moreBioInfo": "JUNK PARLOR Biography A galvanizing force on the Bay Area indie rock scene since launching serendipitously in 2013, Junk Parlor is that crazy-rare band whose vibe is so driven by joyful schizophrenia that it transcends easy genre trappings. Born from the wild musical wanderings of Jason Vanderford, renowned for his five years recording and touring with gypsy jazz sensation The Hot Club of San Francisco, their energizing musical collage includes 50’s rock and roll rumbling atop gypsy rhythms, a bit of Gipsy Rhumba, tango, Eastern Euro/Hungarian music, bellydance, punk…Vanderford was raised on “rock and roll and punk and everything under the sun,” so other sounds are certain to appear as the hybrid junk rockers continue their jam. The songs on their mostly vocal 2013 debut Wild Tones and predominantly instrumental follow-up Melusina (2015) have earned them comparisons to Nick Cave, Leonard Cohen, Gogol Bordello, Dead Kennedys and Tom Waits. One fan called it “Crooner Punk” because of Vanderford’s beckoning, low range vocals – but those are just the centerpiece of a vibe that includes the singer’s acoustic banjo and rhythm guitar, the polyrhythmic grooves of drummer, cajon player and group cofounder Rt Goodrich, Laela Peterson-Stolen’s soaring violin and viola and the growling electric fretless bass of Tim Bush. At the heart of Junk Parlor’s desire to get their audiences dancing and singing along is Vanderford’s passion for storytelling. He taps into an offbeat influence for their latest single, the haunting rockabilly heartbreak tune “Mick Jagger’s Heart.” Drawing thematic inspiration from The Rolling Stones’ countrified ballad “Dear Doctor” (which appeared on Beggar’s Banquet), the band creates a fresh twist on the pain of lost love via the juxtaposition of dark lyrics and bouncy rhythms. Vanderford artfully describes the piece as what happens “when the heartache of Leonard Cohen decides to lament under the sun amidst the California surf…The moment of goodbye…the lingering sigh that begs to turn back time…Doctor won’t you please…tear it out.” The compelling, gut punchingly beautiful video for the track by Jeannie Jo uses scenes of San Francisco cityscapes as a metaphor for heartbreak. Building a solid, ever expanding West Coast fan base, Junk Parlor has played several hundred gigs these past few years. Beyond a batch of hotspots in San Francisco and throughout the Bay Area, the band has headlined numerous times in Seattle, Portland, Eugene, Los Angeles and Reno. Aiming each time out to capture a room for a few hours, and aware of today’s short musical attention spans, Vanderford always creates fresh set lists using previous tunes to frame or set the mood for the next, building waves of energy in an arc like fashion. Not surprisingly, Junk Parlor’s fan base is as demographically eclectic as their music. Remembering a certain trip to Seattle, the singer says, “One night we played a punk club in Bremerton, with people wearing Mohawks and going crazy in a mosh pit, and the next we were at the Triple Door jazz club, with an older audience in suits and ties, drinking fancy martinis. The sonic shift reminds us a lot of the MTV Unplugged era, when heavy rockers gained new popularity by playing softer acoustic music.” As Vanderford tells it, Junk Parlor began almost by accident. In the years since his stint with The Hot Club of San Francisco, he had emerged as one of the region’s “go-to” musicians for his rhythm guitar and gypsy jazz expertise. In early 2013, his uncle, Tim Bush, asked him to come play his acoustic at a wine bar in Petaluma that he tended bar at. Vanderford agreed, but only if Bush played bass. “He’s been a professional bassist for 30 years and took me to buy my first guitar when I was 14,” says the singer. As he got into his once a month residency, Robin Goodrich showed up, telling Vanderford he wanted to put a group together. “I had never met him before, but he said he knew who I was,” Vanderford says. “I was hesitant but asked him to sit in with me for a few months. Then he shows up one day saying he booked the band. I told him we didn’t have a name and he said we better get one. So then I took it seriously.” As the idea of a larger ensemble took shape, Vanderford decided he wanted an original, more experimental band rather than another traditional gypsy jazz outfit. He began pulling out songs he had never shown anyone. The clever band name came from his younger days, when his bedroom stored his collection of vintage furniture and pictures he’d bought at antique stores. He vowed then that if he ever had a band of his own, he would call it what he called that space: Junk Parlor. Adding Bush on bass, the band played their first gig that May and five months later they made their debut album Wild Tones and started touring. While the singer writes all the original songs, the band works together on the arrangements and each member writes their own parts. Vanderford and Goodrich are financial partners in the band who do everything DIY, including booking, social media, poster making and promotion. Junk Parlor's members have played the gamut of festivals and prestigious venues including Outside Lands, Kate Wolfe Fest, Djangofest, Gaia Fest and SXSW. Vanderford has played, recorded and toured with the Americano Social Club, The Hot Club of San Francisco, Clint Bakers New Orleans Jazz Band, Little Charlie's Caravan, Avatar Ensemble and Seth Ford Young Quartet. Rt Goodrich has laid down rhythms and toured with Staggerwing, Beso Negro and Standing Room Only. Bush has played extensively with Danny Montana, Sweetie Pie and the Doughboys, Chuck Day, Sam Andrew, Jim Martin, and Freddie Roulette. Wild Tones included two instrumentals that resonated with the local bellydance community. The band started getting videos of dance troupes from all over, dancing to these tracks. Kami Liddle from the Gold Star Dane Company asked Vanderford if he wanted to collaborate, and he dove into a fresh project, aiming to create an album for dancers to choreograph to. They put together a Kickstarter campaign and raised enough money to make Junk Parlor’s instrumental dominated Melusina and go on tour with the Gold Star girls. He had been collecting vintage bellydance records for years, so he started picking out the ones he loved to learn. He recorded two covers among the originals, “Gold Star Dance Academy” and “Procession.” Looking ahead, Vanderford says that the new album, which will include “Mick Jagger’s Heart,” will build upon what Junk Parlor has been doing since day one. “Our first two records are simply two sides of the same coin,” he says. “I am looking forward to our next project as we already have all the songs and have been playing them out and getting a wonderful response. This one will include a few instrumentals, but have more of an emphasis on vocals. “What I’m learning through all of these recording and performing experiences is that it doesn’t matter if you’re a jazz musician, singer or dancer, the goal is always telling a great story. I love getting out there and hearing people’s stories and then transforming those into songs that can be interpreted in unique ways by the band, dancers and everyone in the audience that it touches.” \"A dream falling off the edge of a cliff.\"", "otherInfo": "No other event info available"}, {"Address": "77 Harrison Ave, Campbell, CA 95008", "Artist": "123 Andrés ", "ArtistImage": "https://photos.bandsintown.com/thumb/10235218.jpeg", "Coordinates": [-121.9425, 37.28829], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Alternative", "Time": "5:30 PM UTC", "Venue": "Campbell Library", "moreBioInfo": "123 Andrés is the bilingual music duo made up of Christina & Andrés. Their songs in both Spanish and English celebrate language and culture, and get the whole family moving and singing. They play guitar, saxophone, clarinet - and the kids get up and dance and sing, do sign language, jump, and they get the parents up, too. They even won a Latin Grammy for kids’ music and they’ve been nominated 3 times. The songs are about letters, numbers, geography, and it’s in Spanish and English, and they also incorporate sign language.", "otherInfo": "Latin Grammy-winners 123 Andrés are the bilingual music duo made up of Christina & Andrés. Their songs in both Spanish and English celebrate language and culture, and get the whole family moving and singing. Come jump and dance - don't miss this high-energy show!\n¡Volvemos a California! 4 conciertos GRATIS en Bibliotecas Públicas del condado de Santa Clara. Acompáñanos con tus peques. ¡Van a estar divertidísimos!\nWe’re coming back to California! We start April with 4 FREE concerts for all our amigos in Santa Clara public libraries. Join us for a super fun time!"}, {"Address": "425 Mission St, San Francisco, CA 94105", "Artist": "Mother & The Boards ", "ArtistImage": "https://photos.bandsintown.com/thumb/8829955.jpeg", "Coordinates": [-122.39792, 37.78993], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Ken Burton, Elandis V Brooks, Kazoo Studios", "Time": "7:00 PM UTC", "Venue": "Salesforce Park", "moreBioInfo": "Mother & the Boards is a fierce blend of folk, funk and experimental rock with a message to incite and inspire you. Defined by the vocal gymnastics and songwriting prowess of front woman Kazoo Studios, their sound feels like a modern eclectic take on 60s era protest music - with an edge.", "otherInfo": "No other event info available"}, {"Address": "2402 Research Dr, Livermore, CA 94550", "Artist": "Thrive ", "ArtistImage": "https://photos.bandsintown.com/thumb/9730407.jpeg", "Coordinates": [-121.72009, 37.67602], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rnb., Soul, Dub, Reggae", "Time": "7:30 PM UTC", "Venue": "Altamont Beer Works", "moreBioInfo": "“Don’t be a follower when you can be a leader.”\n\n-Thrive, “Freedom of speech”\n\nThrive is an American Reggae group founded in 2008 by singer/songwriter duo Aaron Borowitz and Kenneth Rogers. Based out of northern California, the band eventually made their home in Santa Cruz in 2009.\n\nDuring that time, The American Reggae movement was starting to gain momentum. Bands like SOJA and Rebelution were rising in popularity, and Thrive found themselves opening for these bands and cultivating their own fan base.\n\nIn October 2010 Thrive released their first studio album \"Gratitude Attitude\". Shockingly, the relatively unknown group shot up to #4 on the Itunes Reggae charts, which pushed the band towards many more opportunities.\n\nIn the following years, Thrive found themselves performing at festivals and night clubs all over the West Coast. Their first major tour was \"Everything Changes Tour\" with SOJA in 2011.\n\nMay 7th 2013 Thrive released their second full length studio release \"Relentless\". This album featured the single \"Just Fine\" featuring Eric Rachmany of the band Rebelution, and went to #3 on itunes Reggae charts, as well as #6 on the Billboard Reggae charts. Following this release, Thrive landed a performance at California Roots Music And Arts Festival. During this performance, Eric Rachmany and EN young joined Thrive on stage, and the audience erupted in an explosion of energy.\n\nAfter that incredible experience, The band recorded a single entitled \"Broken\" featuring Hirie. The tune was recorded mixed and mastered by EN Young. This would be the last song their beloved saxophonist Scott Shipper would record on before he passed away from cancer.\n\nIn 2015, Thrive released The \"Thrive EP\". This project featured Trevor Young of the band SOJA on the single \"The Gift\". Following the release of the EP, the group toured relentlessly through established and new markets, gaining new fans and growing their presence in the Reggae community.\n\nCurrently Thrive is recording their 4th studio release, which will feature a few musicians and singers the band has met through their incredible journey. Their latest single \"Not Enemies\" is available for FREE on their website www.thrivingmusic.com. Thrive's brand new full length album is set to release late Summer/ early Autumn, 2017.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9973739.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "9:00 PM UTC", "Venue": "Second Life - Berlin Raw - Entranced", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "http://maps.secondlife.com/secondlife/Thunder Hallows/228/132/2704"}, {"Address": "535 Main St Ste A, Vacaville, CA 95688", "Artist": "5 O'clock Somewhere ", "ArtistImage": "https://photos.bandsintown.com/thumb/10099572.jpeg", "Coordinates": [-121.986934, 38.356917], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Fairfield, California", "Time": "1:30 AM UTC", "Venue": "Fuso | Italian Restaurant", "moreBioInfo": "A fun dynamic band playing hits from the 50s to today.", "otherInfo": "No other event info available"}, {"Address": "142 Throckmorton Ave, Mill Valley, CA 94941", "Artist": "The Black Market Trust ", "ArtistImage": "https://photos.bandsintown.com/thumb/9069806.jpeg", "Coordinates": [-122.549119, 37.905857], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Swing, Jazz, Vocal Jazz, Gypsy Jazz, Traditional Pop", "Time": "2:00 AM UTC", "Venue": "142 Throckmorton Theatre", "moreBioInfo": "The Black Market Trust are an American Traditional Pop/Vocal Jazz group from Los Angeles who combine the sounds of the legendary American crooners and vocal groups with the fire and energy of Gypsy Jazz guitarist Django Reinhardt. Consisting of five world class musicians who have traveled the globe recording and performing on the world’s biggest stages and with music’s most renowned artists, The Black Market Trust capitalize on their experience and pedigree to deliver a high energy, crowd pleasing performance filled with some of the best songs ever written.\n\nThe live show features material from The Great American Songbook infused with Django’s romantic and virtuosic flavor. Add some intricate vocal harmonies, a dash of Rat Pack-style comedy and it’s clear to audiences why The Black Market Trust have quickly earned a reputation as one of the premier live acts performing in music today. Be transported as they meld two distinctly different vibes- one of a gypsy campfire, the other a slick metropolitan nightclub- into a cohesive, stylish sound.", "otherInfo": "The Black Market Trust are thrilled to return to Mill Valley's historic 142 Throckmorton Theater!"}, {"Address": "pa w, Bolinas, CA 94924", "Artist": "Ian George ", "ArtistImage": "https://photos.bandsintown.com/thumb/10207176.jpeg", "Coordinates": [-122.69, 37.91], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Indie, Folk Rock, Avant-garde Music, Folk", "Time": "2:00 AM UTC", "Venue": "Gospel Flats Farm Stand", "moreBioInfo": "Ian George + the Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. the ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…", "otherInfo": "Contact Bronwen for more info:\n\nbronwen.halsey@gmail.com\n\nAddress: 140 Olema Bolinas Rd, Bolinas, CA 94924"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Seun Anikulapo Kuti ", "ArtistImage": "https://photos.bandsintown.com/thumb/7257536.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Afrobeat, African, Jazz Fusion, World Fusion, Jazz-funk, Funk, Worldbeat", "Time": "2:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "Seun Kuti is the youngest son of legendary Afrobeat pioneer Fela Kuti. At the age of nine, Seun expressed the wish to sing to his father. A short while later Seun started performing with his father and the band, until his father’s untimely death in 1997. Seun, then only 14 years old, assumed the role as lead singer of Egypt 80. Ever since, Seun has followed the political and social ethos of his father. Along the way, he began to add his own twist to the music, digging deep into various African traditions to reflect the continent's struggles and cultures. About three quarters of the current Egypt 80 line-up consists of musicians that not only played with Fela Kuti, but often were arrested and harassed alongside the founder of the Afrobeat movement. Seun Kuti has toured the world and released many albums.", "otherInfo": "No other event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-122.822691, 38.40115], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk, Rock", "Time": "2:00 AM UTC", "Venue": "Hopmonk Tavern", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Cam'ron ", "ArtistImage": "https://photos.bandsintown.com/thumb/9761640.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rap, Hip Hop, Hip-hop", "Time": "2:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "Cameron Giles, better known worldwide as the Grammy-nominated, multiplatinum-selling rapper Cam’ron, is one of the few artists in hip-hop who has managed to remain relevant for nearly as long as the music has existed. Born and raised in Harlem, Cam’ron epitomizes the unmatched entrepreneurial spirit of the neighborhood between the 110th and 155th blocks of Upper Manhattan, having successfully tackled the roles of hip-hop artist, director, actor, screenwriter, designer, and entrepreneur with finesse. He is the de facto leader and founding member of The Diplomats, arguably one of the most influential crews in hip-hop, that has left an indelible mark on the style, language, and swagger of both New York City and hip-hop culture.\n\nCam’ron is undoubtedly one of the greatest anti-heroes in hip-hop: he’s the man who spawned a thousand memes, drove an unmistakable “Laffy Taffy” Range Rover, wore head-to-toe pink mink in the 2002 Mercedes Benz NY Fashion Week, told Anderson Cooper he wouldn’t snitch on a hypothetical serial killer neighbor, humiliated Bill O’Reilly on his own show, closed out Mark McNairy's runway show wearing custom Dipset capes, and whose face unofficially re-appropriated on everything from orthopedic shoes to Valentine’s Day cards. Cam’ron is truly one of a kind, a paradoxical living legend in pop culture whose point of view as hysterical as it is harrowing and accessible as it is absurd. Unapologetic and unstoppable, Killa Cam is back with a vengeance.", "otherInfo": "No other event info available"}, {"Address": "2309 Encinal Ave, Alameda, CA 94501", "Artist": "Quentel the Cryptid ", "ArtistImage": "https://photos.bandsintown.com/thumb/9125508.jpeg", "Coordinates": [-122.244825, 37.762952], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Red Door on Encinal ", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "427 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "Bronze Medal Hopefuls ", "ArtistImage": "https://photos.bandsintown.com/thumb/9132617.jpeg", "Coordinates": [-122.715214, 38.441851], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Groove, Funk", "Time": "2:30 AM UTC", "Venue": "Lost Church Santa Rosa", "moreBioInfo": "We play funky grooves for funky groovers.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Matt Jaffe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8945081.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Indie Rock, Rock", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Matt Jaffe is a 24 year old rock & roll singer/songwriter from San Francisco. Cutting his teeth on countless open mics around the Bay Area, Matt started taking music (a little bit) more seriously when Jerry Harrison of Talking Heads offered to produce his first record. Since then, Matt has continued to churn out more songs than he can remember the words to, oversaturate the market with gigs (opening and/or touring with the likes of Mavis Staples, Wilco, Jackie Greene, Melissa Etheridge, and Blues Traveler), and collaborate with Chuck Prophet and Tom Higgenson of the Plain White T's. Fresh off the release of his third LP, The Spirit Catches You, Matt Jaffe & Band are street-teaming with the best of them to bring rock & roll back to the masses.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Cuchulain ", "ArtistImage": "https://photos.bandsintown.com/thumb/9112338.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country, Folk Rock, Jazz, Funk, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Cuchulain (pronounced \"ka-HOO-lin\") is a singer-songwriter and multi-instrumentalist. The name (yes, his real, legal name, shared a character in Irish mythology) says as much about him as it does his music: unique, creative, lyrical, and story-driven. Cuchulain's tongue-in-cheek wit and activist spirit emerge from his carefully crafted lyrics, drawing comparisons to artists like John Prine, Randy Newman, and Johnny Cash. His self-titled debut album, released in 2017, has been most appreciated for its entrancing story-telling and rich and often surprising compositions, with more instruments than you can count, most of them played by Cuchulain himself. Cuchulain is rapidly developing a cross-country following, with experiences living and performing in places as disparate as Washington, DC, and San Francisco, California. His bass-baritone melodies will capture the attention of any listening room and leave them laughing and crying the whole way home.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Handsome Hound ", "ArtistImage": "https://photos.bandsintown.com/thumb/9112356.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Folk Rock, Americana, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "There's a reason Handsome Hound has been called the \"musical version of 60 mg of Prozac.\" With its energetic, lyric-driven music, the group turns quiet rooms into spirited dance halls, in their home city and beyond. The group sets meaningful lyrics to ear-worm melodies buoyed by guitars, drums, and horns, blending musical styles and influences including folk, rock, pop, Americana, and country.\n\nHandsome Hound was formed in Washington, DC in 2015 by partners Cuchulain Kelly and Claire Daviss, who met through music communities. Collaborating with top musicians in the DC area, the band released their debut EP, I Guess We're Doing Alright, in 2016, featuring the crowd favorite \"Hannah.\"\n\nSince then, the band has rapidly developed a devoted following. They perform in intimate house shows up and down the East Coast, and have headlined some of the DC’s historic music venues and festivals, including the Black Cat, Rock and Roll Hotel, and the John F. Kennedy Center for the Performing Arts’ Millennium Stage. The group has come to be known as a dynamic live band, experimenting with acoustic and electric instrumentation, horns, and strings.\n\nIn 2018, Handsome Hound self-released its ten-song debut LP, Mountain on Fire. Engineered by Beat Baby Studios (Wye Oak, Lower Dens) and mastered by Sarah Register (Big Thief, The Shins), the highly anticipated album captures the band’s energetic live sound while elevating carefully crafted lyrics. Written over the course of several years, the album draws heavily on Claire’s and Cuchulain’s experiences as “weekend warriors” - musicians who work full-time jobs while committing their weekends to writing and performing, a balance typical for artists living in DC. While retaining tongue-in-cheek playfulness, the songs grapple with loneliness, feeling out of place, anxiety, and growing up.\n\nClaire and Cuchulain now live in Palo Alto, CA and call the Bay Area their musical home.", "otherInfo": "No other event info available"}, {"Address": "1801 E Cotati Ave, Rohnert Park, CA 94928", "Artist": "Maria Schneider ", "ArtistImage": "https://photos.bandsintown.com/thumb/9174678.jpeg", "Coordinates": [-122.673536, 38.340121], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Big Band, Classical, Classical Crossover, Jazz", "Time": "2:30 AM UTC", "Venue": "Sonoma State University", "moreBioInfo": "Maria Schneider’s music has been hailed by critics as “evocative, majestic, magical, heart-stoppingly gorgeous, and beyond categorization.” She and her orchestra became widely known starting in 1994 when they released their first recording, Evanescence. There, Schneider began to develop her personal way of writing for what would become her 18-member collective, made up of many of the finest musicians in jazz today, tailoring her compositions to distinctly highlight the uniquely creative voices of the group. The Maria Schneider Orchestra has performed at festivals and concert halls worldwide. She herself has received numerous commissions and guest-conducting invites, working with over 90 groups in over 30 countries.\n\nSchneider’s music blurs the lines between genres, making her long list of commissioners quite varied, stretching from Jazz at Lincoln Center, to The Saint Paul Chamber Orchestra, to collaborating with David Bowie. She is among a small few to have received GRAMMYS in multiple genres, have received the award in both jazz and classical categories, as well as for her work with David Bowie.\n\nSchneider and her orchestra have a distinguished recording career with twelve GRAMMY nominations and five GRAMMY awards. Unique funding of projects has become a hallmark for Schneider through the trend-setting company, ArtistShare. Her album, Concert in the Garden (2004) became historic as the first recording to win a GRAMMY with Internet-only sales, even more significantly, it blazed the \"crowd-funding\" trail as ArtistShare’s first release. She’s been awarded many honors by the Jazz Journalists Association and DOWNBEAT and JAZZTIMES Critics and Readers Polls. In 2012, her alma mater, the University of Minnesota, presented Schneider with an honorary doctorate. ASCAP awarded her their esteemed Concert Music Award in 2014. And in 2019, the National Endowment for the Arts bestowed on Schneider the nation's highest honor in jazz, naming her an NEA Jazz Master.\n\nSchneider has become a strong voice for music advocacy and in 2014, testified before the US Congressional Subcommittee on Intellectual Property about digital rights. She has also appeared in CNN, participated in round-tables for the United States Copyright Office, and has been quoted in numerous publications for her views on Spotify, Pandora, YouTube, Google, digital rights, and music piracy.\n\nA collaboration with her orchestra and David Bowie resulted in his single called, \"Sue (Or In A Season of Crime),” and brought Schneider a 2016 GRAMMY (Best Arrangement, Instruments and Vocals). Schneider and her orchestra also received a 2016 GRAMMY for The Thompson Fields (Best Large Jazz Ensemble Album). Their next recording project, Data Lords, is underway (2019) through ArtistShare and is set to be released April 1, 2020.", "otherInfo": "No other event info available"}, {"Address": "101 W Main St, Los Gatos, CA 95030", "Artist": "Them Slack Jawed SOB's ", "ArtistImage": "https://photos.bandsintown.com/thumb/9995686.jpeg", "Coordinates": [-121.983074, 37.221881], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "2:30 AM UTC", "Venue": "Los Gatos Coffee Roasting Company", "moreBioInfo": "No artist bio available", "otherInfo": "Playing a raw, semi-acoustic show featuring originals and country classics coated in a thick layer of Slack Jawed Sons of Bitches grease!\n\nThe ever amazing, Special Guest, will be opening the show once again!\n\nAll ages.\n\nNo cover.\n\nBeer. Wine. Coffee.\n\nLiquor across the street (Cary Nations) and around the corner (Los Gatos Soda Works)."}, {"Address": "460 Capistrano Rd, Half Moon Bay, CA 94019", "Artist": "J.Lately ", "ArtistImage": "https://photos.bandsintown.com/thumb/8836108.jpeg", "Coordinates": [-122.48613, 37.504998], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Hip-hop, Hip Hop", "Time": "3:00 AM UTC", "Venue": "Old Princeton Landing Public House & Grill", "moreBioInfo": "J.Lately distinguishes himself as an emcee with his soulful style and laid back flow. A true appreciation for music along with the unique ability to put everyday life into a relatable perspective has allowed him to flourish in the local Bay Area scene and beyond. His music possesses the rare ability to make you contemplate and vibe out simultaneously, finding the perfect balance between the conscious and the stoner. Coming from the small town of Sebastopol, and having split time between Oakland and Southern California, his influences are eclectic and mesh together effortlessly to form his own individual style. A relentless drive has kept Lately on tour across the country with artists such as Zion I, Locksmith, and A-Plus of the Hieroglyphics. He has released multiple solo and collaborative projects, with his most recent solo release, Be Fucking Happy, garnering the attention of many notable blogs and listeners alike.\n\nGo to www.justlatelymusic.com for more information, updates, and releases.", "otherInfo": "No other event info available"}, {"Address": "752 Natoma St, San Francisco, CA 94103", "Artist": "Hannah Levy MUSIC ", "ArtistImage": "https://photos.bandsintown.com/thumb/10099338.jpeg", "Coordinates": [-122.413155, 37.775879], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Funk, R&b, Balkan, Vocal, Harmony Group, Jazz", "Time": "3:00 AM UTC", "Venue": "Scout’s Artillery", "moreBioInfo": "No artist bio available", "otherInfo": "TELEPATHIC CHILDREN will move your feet and pump your pulse and turn you gayer than you have ever been! *SINGLE RELEASE PARTY*\n\nLITTLE ARCS will melt your heart and turn your ears a lil inside out only to turn them right again! Vocals and a drum machine to make you laugh n cry!\n\n\nOther acts TBA.\nSuggested donation at the door."}, {"Address": "1001 B St, Hayward, CA 94541", "Artist": "Bigelow's Treehouse ", "ArtistImage": "https://photos.bandsintown.com/thumb/6959682.jpeg", "Coordinates": [-122.082413, 37.672754], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Classic Rock, Funk", "Time": "3:00 AM UTC", "Venue": "The Bistro", "moreBioInfo": "Since it's incarnation in 2008, Bigelow's Treehouse has performed in all types of venues in every major city across California and has shared the stage with Bay Area legends such as Tia Carroll and Little Wolf & The Hellcats.\n\nBigelow's Treehouse is currently recording their debut album.\n\nEqually comfortable on a large stage or an intimate coffee house, Bigelow's Treehouse can power through an upbeat blues shuffle with the same ease with which it can lay down a slick Meters style funk groove.", "otherInfo": "No other event info available"}, {"Address": "561 1st St, Brentwood, CA 94513", "Artist": "Jeffrey James Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9013551.jpeg", "Coordinates": [-121.693812, 37.931203], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Blues", "Time": "3:00 AM UTC", "Venue": "The Mannheim Social Club", "moreBioInfo": "Jeffrey James is an american blues and rock guitarist/singer/songwriter, based in the San Francisco Bay Area. Born Jeffrey James Horan in Santa Clara, CA. in 1986. Jeffrey has been playing guitar for 25 years. Professionally for 17 years. He started playing gospel music as preteen at his families church. In high school Jeffrey started playing traditional blues and soul music with local bay area artists. It was at this time that his talent had progressed to a level that was to be desired and started his professional career. At 15 years old Jeffrey joined force with the son of the legend John Lee Hooker. As guitarist for John Lee Hooker, Jr. he was featured on 2 Grammy Nominated albums in 2004 and 2009. In the last 10 years Jeffrey has been touring with John Lee Nationally and Internationally. Sharing the stages with the likes of B.B King, Buddy Guy, Santana, Lenny Kravitz, and with The Rolling Stones last year in 2017. In the last few years Jeffrey has been working on a solo career making his way into position as the front man. Jeffrey's passion is in blues and rock music but you can hear the influence of country, gospel, and funk seasoned throughout his guitar styling. Jeffrey James describes his sound as modern blues. Live shows are an energetic, powerful, and dynamic with catchy originals and smoking covers. Some of Jeffrey's influences are B.B. King, Albert KIng, Buddy Guy, Jimi Hendrix, The Vaughan Brothers, Prince, Eric Gales, Richie Kotzen, Luther and Bernard Allison.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Skerik Skerik ", "ArtistImage": "https://photos.bandsintown.com/thumb/6051336.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Punk, Jazz", "Time": "3:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "skerikmusic.com", "otherInfo": "2 nights April 17 and 18!!"}, {"Address": "3101 Shattuck Ave, Berkeley, CA 94705", "Artist": "Earles of Newtown ", "ArtistImage": "https://photos.bandsintown.com/thumb/9293079.jpeg", "Coordinates": [-122.265906, 37.852987], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The Starry Plough Pub", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Eric Roberson ", "ArtistImage": "https://photos.bandsintown.com/thumb/9037148.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Soul, R&b", "Time": "3:00 AM UTC", "Venue": "Yoshi's Oakland", "moreBioInfo": "http://www.EricRobersonMusic.com http://www.Twitter.com/IamEricRoberson http://www.twitter.com/ErroFam", "otherInfo": "Yoshi's Oakland Presents Eric Roberson"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Teddy Abrams ", "ArtistImage": "https://photos.bandsintown.com/thumb/6264505.jpeg", "Coordinates": [-122.419994, 37.777441], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Davies Symphony Hall", "moreBioInfo": "Teddy Abrams is an American conductor, composer, pianist, and clarinetist.", "otherInfo": "This week, the San Francisco Symphony brings together two composers—one past and one present—for an inspired pairing of audience favorites. Guest conductor Teddy Abrams leads the orchestra in the West Coast premiere of Philharmonia Fantastique by the internationally renowned Bay Area composer Mason Bates. A fixture as a DJ in the splashiest nightclubs around town, Bates turns his ear for layering sound, rhythm and texture upon the infinitely variable palette of the symphony orchestra (plus a pair of laptops). Bates' work appears side-by-side with another master musical colorist—but in a nineteenth-century aesthetic—Tchaikovsky, who delivers a volcanic rush of irresistible melodies in his thundering Symphony No. 5.\n\nConductor/Performers\n\nTeddy Abrams\nconductor\n\nSan Francisco Symphony\nProgram\n\nBarber\nSecond Essay for Orchestra\n\nMason Bates\nPhilharmonia Fantastique: The Making of the Orchestra West Coast Premiere, SFS Co-commission\n\nTchaikovsky\nSymphony No. 5"}, {"Address": "99 Grove St, San Francisco, CA 94102", "Artist": "Champagne Drip ", "ArtistImage": "https://photos.bandsintown.com/thumb/8996159.jpeg", "Coordinates": [-122.417316, 37.778083], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Electronic", "Time": "3:00 AM UTC", "Venue": "Bill Graham Civic Auditorium", "moreBioInfo": "Champagne Drip, the newest musical incarnation of Los Angeles-based producer Sam Pool, was born out of a philosophy that innovation springs from inspiration. Pool had carved out a unique place for himself in the bass music community; performing under the moniker of SPL for over 10 years and releasing drum & bass, dubstep, and trap-oriented music on respected labels such as Barcode, Tech Itch, Evol Intent, Sub Human, Rottunn, and SMOG Recordings. SPL’s music was fully immersed in sound design, a musical landscape comprised of melodic, dark, and refined touches. By the Summer of 2014, Pool came to the realization that he had pushed the SPL project to its sonic boundaries and in order to evolve musically, he would need a new project to explore lighter textures and richer melodies. Rooted in jungle and bass music and built around elements of blippy 8-bit sounds, arpeggios, and lush 80s synths, Champagne Drip launched as a decidedly tropical and uplifting sounding project. Operating at first in anonymity, Champagne Drip made a big splash thru the release of official remixes of Bassnectar (Amorphous Music) and Elliphant (Mad Decent). Shortly thereafter, he released his debut EP “Radio Bikini” on Mad Decent in September of 2014. Over the first year of the project’s history, press outlets were fascinated with the unique sound, but also with uncovering the identity of the secretive producer behind the music. “Radio Bikini” was subsequently remixed by electronic upstarts Big Wild, Lazerdisk, Mayhem, and Son of Kick and released in the Spring of 2015 as “Remix Bikini”. In the Fall of 2015, Champagne Drip released his 2nd EP for Mad Decent, “Journey Into The Champagne Sea”. Whereas his first EP explored more overtly tropical overtones, “Journey” went into deeper and darker musical territory. After spending one full year refining his sound in the studio, he finally revealed himself as the former SPL in 2016; performing across the US at such festivals as Mysteryland, WTFest?, Imagine, Enchanted Forest, and Lights All Night. Building up anticipation for his next original recordings, Champagne Drip released the stand alone single “Open Your Eyes”, which was featured on the official Bernie Sanders Presidential campaign fundraising compilation “Rave4Bernie”. Official remixes for Grandtheft (Mad Decent), Cardinox (Warner Brothers), and Dillon Francis & NGHTMRE (Mad Decent) followed. Champagne Drip capped off an already busy 2016 with the release of two new EPs; “Poseidon” via Quality Goods Records and “Of Course I Still Love You” via Saturate Records. Official remixes for Zeds Dead & Diplo, UZ, and DAWN all saw early 2017 releases. Champagne Drip is set to have his biggest year yet in 2017, with multiple EPs scheduled for release on Deadbeats Records as well as forthcoming remixes for 12th Planet and Mayhem, which are due for Summer releases. https://twitter.com/champagnedrip https://soundcloud.com/champagnedrip https://www.instagram.com/champagnedrip Bookings: champagnedripbookings@gmail.com", "otherInfo": "No other event info available"}, {"Address": "308 Main St, Vacaville, CA 95688", "Artist": "Rachel Steele ", "ArtistImage": "https://photos.bandsintown.com/thumb/8392760.jpeg", "Coordinates": [-121.989455, 38.356373], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country", "Time": "3:00 AM UTC", "Venue": "Theatre DeVille", "moreBioInfo": "Rachel Steele, the energetic and “sassy” singer/songwriter brings her pristine vocals and her A-game to every performance. It’s obvious by the way she works the stage, the crowd, and interacts with band members that she’s the ultimate performer. Winner of the 2013 SAMMY award ( Sacramento Area Music Award). The Sacramento News & Review’s Sammie award is determine by votes from readers and fans throughout the Sacramento region. After tallying the thousands of votes this year, Rachel Steele and her band Road 88 won the award for best Americana/Alternative Country band.\n\nRachel has opened for country music greats like Alabama, Big & Rich, Gretchen Wilson, Trace Adkins, The Oak Ridge Boys, Wynonna, Jason Michael Carol and Mark Chesnutt, Confederate Railroad, Jon Pardi, Joe Nichols, Love & Theft, Cowboy Troy and the Marshall Tucker Band.\n\nRachel also has had the privilege of playing events for Facebook and Bogle winery not to mention all of the fairs and festivals.\n\nLook for Rachel’s new CD Stupid Love early in 2018.", "otherInfo": "No other event info available"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "The Coffis Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9521289.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "Terrapin Crossroads", "moreBioInfo": "The Coffis Brothers & The Mountain Men are a rootsy rock n’ roll band born and raised in the Santa Cruz Mountains. Influenced by those early surroundings, songwriters Jamie and Kellen Coffis’ blend of folk, blues, R&B and straight-ahead rock is evidence an upbringing spent listening to all of the right records from Tom Petty, Neil Young, and The Beatles.\n\nOn their third full-length album, Roll With It, The Coffis Brothers put that rock into overdrive, looking ahead to the good things coming and suffering no fools. First single “You Ain’t Got the Heart” is a barn burner and a fan favorite, having already been part of the band’s live set for a couple of years. “There’s a little bit of that sense of angst and that sort of ‘I don’t need this’ attitude,” says Kellen Coffis, “but don’t overthink this one.”\n\nNot that there isn’t plenty to think about on Roll With It. Tracks like “Bad Luck” and “Better Days” reflect on how to live with and learn from rough times, while “You and Me” is a testament to how people can make it through these things together. But on every song, The Coffis Brothers & the Mountain Men stay true to a rock sound that draws from Southern grit and California hills.\n\nRoll With It was recorded on analog tape over a week at Barefoot Studios in Hollywood with producer Andy Zenczak and engineer Cian Riordan. The band’s near-constant touring throughout California and elsewhere has earned them not only devoted fans, but lots of critical praise as well:\n\n“The Coffis Brothers & the Mountain Men have developed a sound that has an easy rock vibe that’s actually hip.” – San Francisco Chronicle\n\n“The Coffis Brothers mix a blend of folk, country and rock with the intensity of personal lyrics into a gritty and often tender harmony of sound… a show that delivers one part Avett Brothers and one part early Neil Young for a full night of dancing and fun.” – Santa Cruz Weekly\n\nJamie and Kellen are joined by Kyle Poppen on lead guitar, Aidan Collins on bass and Sam Kellerman on drums. Their debut self titled full-length album was released in 2011 and was followed by 2012’s Waiting For You EP and 2014’s Wrong Side of the Road.", "otherInfo": "No other event info available"}, {"Address": "2128 Railroad Ave, Livermore, CA 94550", "Artist": "Shane Dwight ", "ArtistImage": "https://photos.bandsintown.com/thumb/8999662.jpeg", "Coordinates": [-121.770686, 37.68337], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Southern Rock, Rock", "Time": "3:00 AM UTC", "Venue": "Railroad Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "3700 Middlefield Rd, Palo Alto, CA 94303", "Artist": "Liberty Ellman ", "ArtistImage": "https://photos.bandsintown.com/thumb/7728647.jpeg", "Coordinates": [-122.113309, 37.423261], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Jazz Guitar, Jazz", "Time": "3:00 AM UTC", "Venue": "Mitchell Park Community Center", "moreBioInfo": "Based in Brooklyn New York, guitarist / composer Liberty Ellman has performed and or recorded with a host of stand out creative artists including: Joe Lovano, Myra Melford, Wadada Leo Smith, Butch Morris, Vijay Iyer, Steve Lehman, Greg Osby, Rudresh Mahanthappa, JD Allen, Nels Cline, Somi, Matana Roberts, Ledisi, Michele Rosewoman, Adam Rudolph, Barney McAll, Okkyung Lee, Mary Halverson, and Ches Smith. Other projects of interest include working with Jason Moran on Luanda Kinshasa, a video installation by visionary filmmaker Stan Douglas, and a performance in John Zorn's Bagatelles series.\n\nMr. Ellman is perhaps best known for his long tenure in Henry Threadgill's groundbreaking ensemble, Zooid. The group has recorded several critically lauded albums. Their most recent recording \"In For A Penny, In For A Pound\" earned a Pulitzer prize. In addition to playing guitar, Mr. Ellman is credited as producer and mixing engineer on that recording. He has mixed and mastered many other recordings as well, including Gregory Porter's \"Be Good,\" which was nominated for a Grammy.\n\nEllman has released 4 of his own critically acclaimed albums: Orthodoxy, Tactiles, Ophiuchus Butterfly, and 2015’s Radiate on Pi Recordings. His compositional style has been described as \"At once highly controlled and recklessly inventive,” and the Wall Street Journal said: “Ellman, along with his peers, is helping to define post millennial jazz.” Voted #1 Rising Star Guitarist in the 2016 Downbeat Critics Poll, he was also honored in the 2015 Jazz Times expanded critics poll, as one of the four guitarists of the year alongside Bill Frisell, John Scofield and Julian Lage.\n\nLiberty Ellman has also worked beyond the jazz world: hip hop artists Midnight Voices, and The Coup, dance producer DJ Joe Claussell, and worked on remixes of N'Dea Davenport, Chico Freeman, Ann Dyer, Ayo and others. He also made an appearance on the Grammy nominated Groove Collective record, People People Music Music.", "otherInfo": "No other event info available"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Dilated Peoples ", "ArtistImage": "https://photos.bandsintown.com/thumb/8130142.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Hip-hop", "Time": "3:00 AM UTC", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "Directors Of Photography | New Album http://rse.lnk.to/DilatedDirectors | Management: Kevin Zinger - Info@Regimeinc.com | Tour Dates: http://rhymesayers.com/dilatedpeoples", "otherInfo": "The UC Theatre Presents: Little Brother & Dilated Peoples with Zion I"}, {"Address": "752 Natoma St, San Francisco, CA 94103", "Artist": "Little Arcs ", "ArtistImage": "https://photos.bandsintown.com/thumb/9075703.jpeg", "Coordinates": [-122.413155, 37.775879], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Chamber Pop, Math Rock, Harmony Group, Vocal Music, Dream Pop, Progressive Alternative", "Time": "3:00 AM UTC", "Venue": "Scout’s Artillery", "moreBioInfo": "No artist bio available", "otherInfo": "Telepathic Children and Little Arcs and TBA IRL!"}, {"Address": "900 Marin St, San Francisco, CA 94124", "Artist": "Kruder & Dorfmeister ", "ArtistImage": "https://photos.bandsintown.com/thumb/10040461.jpeg", "Coordinates": [-122.386006, 37.749454], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Ambient, Downbeat, Electronic, Dub, Drum Bass", "Time": "4:00 AM UTC", "Venue": "The Midway", "moreBioInfo": "K&D are two producers/djs/remixers whose distinctive trademark sound is at most times extremely mellow, has a lot of bass, downbeat tracks and a sense of epic soundscapes. There might be the occasional double-time breaks and the heavy and deep typically viennese feeling.\n\nConsider K&D to roam in their own, unique realm of musical beutekunst that owes and gives a lot to rare funk tunes, electric jazz arrangements, the feeling of deep soul, hiphop, dub, reggae, ambient, fusion, brazil, chansons, dope beats and drum+bass and still a lot more influences that happen to find the interest of the two austrians.\n\nAt a time when hip hopbeats started to emancipate themselves from the rapping and everyone started to pay highest attention to the blooming breakbeat scene in the UK, K&D broke through out of nowhere with one 4-track e.p. (G-stoned) that featured a hypnotic track called High Noon and a cover that showed the dj-duo in true Simon & Garfunkel form, straight out of Richard Avedon anno 1969.\n\nThe impact was massive, especially since the first wave of enthusiasm came from the UK where musical imports from the continent are seldom appreciated. Gilles Peterson played the track at first on his famous now called Worldwide-show.\n\nGathering momentum with support from people like Wall of Sounds Mark Jones and tracks for fellow Austrians Count Basic or strange people like William Orbit, the further story of K&D and Richard's Tosca project is well documented on various compilations and twelve inch releases. They met people like the Ninja tune posse, touched base with the leftfield dance, befriended Munich's Compost crew, remixed artists as diverse as Bomb the bass, Bones thugs & harmony, Alex Reece, United Future Organisation, Rockers Hifi (the K&D version was used in the video of \"Going under\"), Lamb, Roni Size, Depeche Mode and dj-ed in more clubs than you would care to count.\n\nBe it their self-produced tracks or the sound of their remixes, the K&D symptomatic feeling of lush european loungcore-dub pervaded all swift changes of the triphop hype and survived as a highly personal expression that found easy access into the world of drum&bass when the breakbeats became soulful.\n\nTheir regular presence in the club circuit, a characteristic side effect of their consistant travelling as djs, made them well-received guest at the various crossing of an international beat-set that took them from Vienna to London, to the American Westcoast, to Germany and back, with a tightly packed dj-bag full of remixes tracing their steps.\n\nA mix-CD compilation, DJ-kicks, for german label studio K7 marked a relevant change in the overall concept of K&D or rather in the way the audience seemed to take them in. From being well-respected underground heroes they had emerged to be full fledged media-celebrities in the music-press whose mix-CD was so excellently mixed and selected, that many new fans were attracted all over the world.\n\nK&D are maybe something like the continental answer to the british breakbeat or the american illbient scene, but then again their musical imprint is outernational anyway. They could achieve the special abstract global reputation that makes them neighbours to RockersHifi, Fila Brazilia, Howie B., DJ Shadow, the wordsound collective, Coldcut or the Thievery corporation in a virtual neighbourhood of twekwando-ing beatmeisters.\n\nBut, with a number of prolific dj-dates of K&D all around the world and the production and releases of Tosca and Peace Orchestra as well as numerous remixes, it seems unavoidable that there will be a lot of talk about Peter Kruder & Richard Dorfmeister.", "otherInfo": "No other event info available"}, {"Address": "30 S 1st St, San Jose, CA 95113", "Artist": "Dirtybeats ", "ArtistImage": "https://photos.bandsintown.com/thumb/8199801.jpeg", "Coordinates": [-121.889735, 37.335686], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Bass Music, Drumandbass, Trap, Bass House, Dubstep", "Time": "4:00 AM UTC", "Venue": "Elev8 Night club", "moreBioInfo": "San Jose, Ca based producer & Dj ( DirtyBeats ) is a veteran in the Bay area and the dubstep scene, with a cyberpunk style of hard hitting synths and massive bass.\n\nBelow is DirtyBeats EPK all hotlinks on the images are active.\n\nhttps://drive.google.com/open?id=0B01S911YqOmIRWhiTzRWUmtnS1VsT2k2UVdRNTVDa1FyU1Fv", "otherInfo": "After taking a quite long hiatus, Surface Lights is proud to be back with another huge show in the heart of downtown San Jose. Hosting @ Elev8 Nightclub which is the newest venue for bass parties and a wide spectrum of touring acts in the South Bay. Are you ready to join us?\nCome party at ELEV8 with the SL goons FRIDAY APRIL 17TH\n\n⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺\n\n★ 21+ Event – Doors open at 8:00 pm\n★ $10 tickets online or before 10:00 pm\n★ $15 after 10:00 pm\n\n⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺\n\nLINEUP\n▼▼▼▼\n\n- AB THE THIEF -\nhttps://soundcloud.com/abthethief\n\n- Send Help! -\nhttps://soundcloud.com/sendhelpmusic\n\n- BLAOW! -\nhttps://soundcloud.com/blaow_official\n\n- DirtyBeats -\nhttps://soundcloud.com/dirtybeatsss\n\n- Filthgrinder -\nhttps://soundcloud.com/filthgrinder\n\n- Smelly Shlaps -\nhttps://soundcloud.com/smellygotshlaps\n\n- Zero Excuse -\nhttps://soundcloud.com/zeroexcuse\n\n\nART & VENDORS\n\n☆ SpacePlace Collective ☆\nhttps://www.facebook.com/SpacePlaceCollective\n\n\nDRESS CODE ENFORCED\n- NO Sports Attire\n- NO Baggy Clothing\n- NO Hats\n- NO Tank Tops\n- NO White Tees\n- NO Boots"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Stanton Moore ", "ArtistImage": "https://photos.bandsintown.com/thumb/7999914.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Jazz, Funk", "Time": "4:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Born and raised in New Orleans, Stanton Moore is a dedicated drummer and performer especially connected to the city, its culture and collaborative spirit. Driven and inspired by the thriving music scene of his hometown which includes such greats as Professor Longhair, Doctor John and The Meters, Moore’s name is now mentioned amongst these Big Easy mainstays.\n\nIn the early ‘90s, Moore helped found the New Orleans-based essential funk band Galactic. Their first album, 1996’s widely acclaimed Coolin’ Off, led to an intense tour schedule of nearly 200 gigs a year for the next ten years. Building on their fan base by adding an esteemed list of all-star collaborations to the six albums that followed, Galactic continues to amass a worldwide audience via recording and touring globally.\n\nMoore launched his solo career in 1998 aided by eight-string guitar virtuoso Charlie Hunter and saxophonist Skerik (Les Claypool, John Scofield, Roger Waters). The group recorded All Kooked Out! featuring a handful of local New Orleans musicians as well.\n\nIn the midst of these recording sessions yet another concept was taking shape. Outtakes turned into the first Garage a Trois release, Mysteryfunk (1999). In 2000 the trio, led by Moore behind the drum kit, was joined by percussionist Mike Dillon (Les Claypool, Ani DiFranco) and has since released three more albums – Emphasizer in 2003, Outre Mer in 2005 and Power Patriot in 2009.\n\nMoore extended his solo discography with the release of Flyin’ the Koop (Verve/Blue Thumb) in 2001, and III (Telarc) in 2006. Following the latter Modern Drummer called Moore’s trademark sound “infectious, jazz-meets-Bonham, nouveau second-line.” Recorded at the legendary Preservation Hall in New Orleans, III featured organist Robert Walter (Greyboy Allstars, The Head Hunters) and guitarist Will Bernard (T.J. Kirk, Doctor Lonnie Smith) as the Stanton Moore Trio, with special guests Skerik and trombonist Mark Mullins (Galactic, Bonerama, Harry Connick, Jr., Better Than Ezra).\n\nIn 2008, Moore looked to continue his scaled back session crew with Walter and Bernard to record Emphasis! (on parenthesis). Says Moore, “When it came time to do another record, I had already known for a while that I wanted to build on the momentum of this band – three musicians who were becoming a unit unto themselves – and I wanted to get a little more adventurous with the music itself.”\n\nIn April 2010, Moore releases Groove Alchemy. The 12-track set is the culmination of Moore’s multimedia project that also includes an instructional book and DVD of the same name. All three facets of the project are designed to explore the roots of funk drumming by examining the work of pioneers like Jabo Starks, Clyde Stubblefield, and Zigaboo Modeliste – each of whom made their mark at different times throughout the 1960s as the engines driving James Brown’s and the Meters’ legendary rhythm sections – and in turn tracing their influences back to the rhythms coming out of New Orleans in the earlier part of the 20th century. Recorded at Levon Helm’s studio in Woodstock, NY, this project is the follow up to the widely acclaimed Take it to the Street DVD and book that focused specifically on New Orleans drumming styles.\n\nShowing his outstanding versatility, Moore has appeared on Heavy Metal Grammy nominees Corrosion of Conformity’s In the Arms of God, Irma Thomas’ After the Rain (winning a grammy in the process), Robert Walter’s Super Heavy Organ, Tom Morello (Rage Against the Machine) and Boots Riley’s (the Coup) Street Sweeper Social Club, Will BernarDiane Birch’s Bible Belt, Alec Ounsworth’s (Clap Your Hands Say Yeah) Mo Beauty. He continues to play dates globally with an ever-evolving cast of musicians including John Scofield; Karl Denson; George Porter, Jr., and Leo Nocentelli (of the Meters); Charlie Hunter; Warren Haynes; John Medeski and Chris Wood (of Medeski, Martin and Wood); Donald Harrison Jr.; Dr. Lonnie Smith, Dr. John, Tab Benoit, Robert Walter; the New Orleans Klezmer All-Stars and the Preservation Hall Jazz Band to name a few.\n\nWith a bachelor’s degree in music and business from Loyola University, Moore stays involved in education by constantly giving clinics and teaching master classes and private lessons all over the world. He has been a contributing writer for Drum!, Modern Drummer, and DownBeat magazines here he was featured on the covers of more than six drum publications. In 2005, he launched a signature line of cymbals with Bosphorus Cymbals and a signature drumstick with the Vic Firth stick company. In 2009, Moore developed his own drum company to introduce his signature titanium snare drum that he designed in conjunction with Ronn Dunnett.\n\nDeeply affected by Katrina and its aftermath, New Orleans’ native son was quick to lend a hand by spearheaded the Tipitina’s Music Workshop, free Sunday seminars that cater to children and a rotating cast of well-known professionals to promote the preservation of New Orleans music. He also set up the Staletta Fund, a scholarship started by he and his wife Aletta to help cover costs for aspiring students to attend jazz camps, auditions and further their education.\n\nMoore stays active as a spokesperson for the Gulf Restoration Network and is a regular proponent of and player with the Voice of the Wetlands All-Stars. Additionally he serves on the board of directors for the Roots of Music, a free music education and academic mentoring program founded by Derrick Tabb, drummer for Rebirth Brass Band and recent nominee for CNN’s Heroes awards.\n\nGalactic’s next record Ya-ka-may was released February 2010, and Moore steps into the role of producer on Anders Osborne’s next record due out in April.", "otherInfo": "General Admission. All ages."}, {"Address": "1030 Main St, Napa, CA 94559", "Artist": "SOUL SKA ", "ArtistImage": "https://photos.bandsintown.com/thumb/9555947.jpeg", "Coordinates": [-122.285583, 38.29958], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Ska Revival, Reggae, Ska, Soul", "Time": "4:00 AM UTC", "Venue": "JaM Cellars Ballroom", "moreBioInfo": "Featuring members of Vinyl, Monophonics, Stymie and The Pimp Jones Luv Orchestra, The Right Time, Jethro Jeremiah Band, and El Radio Fantastique. We play 1st and 2nd wave Jamaican and UK Ska classics, from the Skatalites, Don Drummond, Prince Buster, The Specials, Madness, The Selector, The Wailers...and hell of a lot more. It's a 10-piece all star Ska-Tribute Juggernaut! 3 singers and a 3 piece horn section and full rhythm section...Look Out!\"", "otherInfo": "SOUL SKA, GRASS CHILD, AND RAMBLE: RYAN SNYDER BENEFIT CONCERT\n\nJaM Cellars Ballroom at Margrit Mondavi Theatre\n\nThis inaugural concert, being headlined by Soul Ska and graciously supported by Grass Child and Ramble is a fundraiser to benefit the Brayden Snyder Trust, which was set up by his father, Ryan C. Snyder. Ryan was an integral part of live event production, especially within the music industry in both the Bay Area and Ohio. His family and friends miss him and have banded together to honor his wish to help take care of his son.\nFrom Indie, to Jam Band to Ska, this concert promises to be a fun night celebrating our shared love of music!\nHope you will join us for a great night of entertainment featuring some of the Bay Area’s finest musicians and the best part is, it is also for a good cause.\nSee you at the show!\nSOUL SKA is a 9-piece San Francisco Bay Area Ska/Rocksteady collective formed in 2014 dedicated to keeping SKA music alive! The band serves up a high-energy mix of original & 1st and 2nd wave Jamaican/UK ska classics.\nGrass Child a local homegrown group celebrating over a decade performing groove/ska/funk to local audiences and receiving numerous invitations for mainstage performances at regional festivals and engagements in support of headline acts such as The Cure, No Doubt, The Avett Brothers, Ziggy Marley, Gregg Allman, Los Lonely Boys, Los Lobos, Blues Traveler, Michael Franti and Spearhead, The Cold War Kids, Houndmouth, Ozomatli, Jimmy Cliff and many more\nRamble are an indie-rock band from Napa. They started writing music influenced by their different life experiences and musical preferences from surf rock to pop and psychedelic rock. Collectively they achieve a sound unmatched in uniqueness and spirit.\nJaM Cellars Ballroom is UPSTAIRS in the historic Napa Valley Opera House in Downtown Napa\n\nThis show is General Admission.\nFLOOR: $18 Advance / $20 Day of Show ( Standing)\nBALCONY ACCESS: $25 (Standing with limited seating)\n\nEach person does require a ticket for entry.\n\nWe welcome ages 8+ (with children under 16 accompanied by an adult).\n\nNo Refunds. No professional cameras or outside food and drink.\n\nThere is a Bar available for drink purchases. Patrons attending a show upstairs in the Ballroom are welcome to dine downstairs in the Blue Note club restaurant if there is seating available.\n\nDue to the historic nature of the Ballroom, there are no bathrooms located upstairs. Facilities are located downstairs through the Blue Note Club and are accessible via stairs or the elevator.\n\nEar Plugs are available for free at the Box Office.\n\nIf you have a specific concern or accessibility request for an upcoming event, please contact our Box Office in advance so we may best accommodate your needs.\n\nThank you, and we look forward to seeing you at the JaM Cellars Ballroom!\n\n1030 Main Street, Napa CA 94559\n\nBox Office: 707.880.2300 (Wed-Sat, 2:30-9:00 pm, Sun 1 hr before doors)"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Scott Pemberton Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8652402.jpeg", "Coordinates": [-122.433417, 37.784563], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Psychedelic, Funk, Blues, Rock, Soul-jazz, R&b/soul, Rnb-soul", "Time": "4:00 AM UTC", "Venue": "Boom Boom Room", "moreBioInfo": "Scott is an emerging force on the festival circuit, with his wild approach to the guitar and nimble funky band he is immediately recognizable and undeniably original. He doesn’t use a strap, often plays the guitar like someone would play piano and performs with the uninhibited joy and intensity of someone who recognizes that every time we make music is an honor and a gift.\n\nPemberton's sound is much like the vibe of his native Portland: freaky, fun and just the right amount of weird. The best way to categorize his music is with the moniker “Timber Rock”. Scott naturally applies his own lens/stamp to the sounds of the Pacific North West, the region he has always called home. The deep jazz, NW rock/grunge, blues roots and the west coast funk. It’s all there, and often all in the same song. Listeners are finding this honest, original and to-the-point music refreshing and fun.\n\nThe latest LP “Timber Rock” style has been very well received. He has placed #4 on Billboards Tastemaker Chart, #1 on Portland Pop Charts and has been making waves at clubs and festivals nationwide generating press headlines such as:\n\n\"The Bruce Lee of Guitar” - Tahoe Onstage\n“A modern day Jimi Hendrix” - Chico Enterprise\n“It’s not everyday someone can convey joy while digging deep” - Glide Magazine\n“A stand out artist at this year’s High Sierra Music Festival” - Relix Magazine", "otherInfo": "No other event info available"}, {"Address": "311 Broadway, Oakland, CA 94607", "Artist": "Brume ", "ArtistImage": "https://photos.bandsintown.com/thumb/9422666.jpeg", "Coordinates": [-122.276005, 37.797178], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Metal, Chillwave, Darkwave", "Time": "4:00 AM UTC", "Venue": "Elbo Room Jack London", "moreBioInfo": "Brume are a San Francisco-based doom metal trio who combine the weight of Black Sabbath’s pioneering distorted riffs with the graceful beauty of singers like Bjork and Portishead’s Beth Gibbons. While they set the tone for greatness with their first pair of crushing releases, the group’s forthcoming Magnetic Eye debut ‘Rabbits’ showcases a band at their tightest, most creative, and ready to take the metal underground by storm. Put on tracks like the expansive “Lament” and settle in to experience the hypnotic sonic catharsis that awaits when the record makes its world debut on November 9th.\n\nBUY OUR DIGITAL ALBUMS HERE:\nhttp://brumesf.bandcamp.com/album/donkey", "otherInfo": "Holy Grove returns to the Bay!"}, {"Address": "314 11th St, San Francisco, CA 94103", "Artist": "Andy Moor ", "ArtistImage": "https://photos.bandsintown.com/thumb/9034530.jpeg", "Coordinates": [-122.413904, 37.771448], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Progressive Electronic, Trance, Electronica, Ambient", "Time": "4:00 AM UTC", "Venue": "Halcyon SF", "moreBioInfo": "DJ, Producer, Musician - UK", "otherInfo": "No other event info available"}, {"Address": "180 Eureka Sq, Pacifica, CA 94044", "Artist": "The Purple Ones - Insatiable Tribute to Prince ", "ArtistImage": "https://photos.bandsintown.com/thumb/9888001.jpeg", "Coordinates": [-122.48864, 37.63265], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Derek Clark - Lead Vocals, Pamela Fields - Lead Vocals, Morgan Day - Guitar, Nick Ciardelli - Trumpet, Willie Adams - DJ/ BU Vocals, Levi Seacer Jr. - Musical Director/ Lead Guitar, Shane Cox - Trombone, Jamison Smeltz - Bari/ Tenor Sax, Morty Okin -Trumpet/Bandleader/Manager/Booking, Michael (Tiny) Lindsey - Bass, Christian Houston - Keyboards, Tony Two Times Providence - Drums", "Time": "4:00 AM UTC", "Venue": "Longboard Margarita Bar", "moreBioInfo": "The Purple Ones is California's premier Prince tribute band and is a labor of love that was born in 2012\n\nOakland California’s The Purple Ones treat the music and patented vibe of Prince’s legacy with the utmost respect. The musical dexterity of The Purple Ones – with 12 pieces on stage including a full horn section - delivers their own spin on Prince’s (and other Prince related artists such as The Revolution, The New Power Generation, Sheila E., Morris Day & The Time and the general Minneapolis Sound) live onstage, as this funk machine, dance party has to be experienced to be believed!\n\nThe Purple Ones is a group of world-class musicians that carries out the Purple Legacy of the MUSIC. TPO is NOT a typical tribute band. There is no impersonator or look- a-like, nor do they dress up in goofy costumes or wigs.\n\nThe Purple Ones bring audiences to their feet, night after night, by speaking Prince’s musical language. energy, rhythm, creativity and of course…a serious dose of unadulterated funk. The Purple Ones tap into that soulful artistry like none other.\n\nThe Purple Ones is a labor of love that was born in 2012 when Bay Area based bandleader and founder, Morty Okin (“The New Morty Show”, co-founder of the Michael Jackson tribute “Foreverland” and Neil Diamond tribute “Super Diamond”,) decided to focus all of his energy on building the greatest Prince homage on the planet.\n\nThe Purple Ones have been packing concert venues since their inception, growing a fan base over the years that includes long time Prince devotees and newbies that are just discovering the icon. Recently, Brown Mark and Matt “Doctor” Fink from The Revolution performed with TPO onstage and is not uncommon for the band to be joined on stage by “Honorary Purple Ones” like celebrity “Super Fan,” comedienne Margaret Cho and members of the artist’s extended musical family, including renowned percussionist (and brother of Sheila E,) Juan Escovedo who toured the world with Prince in the 80’s, as well as Sheila E’s longtime saxophonist Eddie M.\n\nThe Purple Ones’ Musical Director is Prince’s former Musical Director, bassist/guitarist and co-founder (and current member) of Prince’s “New Power Generation,” Levi Seacer Jr. Levi was with Prince for many years and is the only Prince band member to have played multiple instruments. Later, collaborating with Prince as a songwriter and Co-Producer on his projects. Now the lead guitarist and Musical Director of The Purple Ones, Seacer is determined to continue the musical legacy of his late friend and former band mate. He says one of the biggest keys to the authenticity is the ‘controlled chaos” that existed in Prince’s world that allowed for extreme creativity, “With Prince,” Levi says, “you tried everything. That’s the biggest thing I learned from him over all those years. If it doesn’t work you can always take it out, but if it does work…there’s no limit.”", "otherInfo": "No other event info available"}, {"Address": "243 O’Farrel Street, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Cabaret, Broadway, Cover Songs, Singer Songwriter", "Time": "4:00 AM UTC", "Venue": "Johnny Foley's Dueling Piano Show", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs.\n?\nHis theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City.\n?\nHe is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page.\n?", "otherInfo": "Dueling Piano Show (21+)"}, {"Address": "144 Taylor St, San Francisco, CA 94102", "Artist": "The Freshmakers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9032581.jpeg", "Coordinates": [-122.41066, 37.783936], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "R&b, Rock, Hip Hop, Country, Pop", "Time": "5:00 AM UTC", "Venue": "PianoFight", "moreBioInfo": "The Bay Areas newest top 40 band, rocking a range of hits from hip hop, pop, rock, and country. We keep it nostalgic, while keeping the crowd dancing.", "otherInfo": "No other event info available"}, {"Address": "5600 Greenville Rd, Livermore, CA 94550", "Artist": "Nick Tyrrel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9116756.jpeg", "Coordinates": [-121.693981, 37.649673], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "7:00 PM UTC", "Venue": "McGrail Vineyards and Winery", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9973751.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "7:00 PM UTC", "Venue": "Second Life - FFF - Sexy Saturdays", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "https://maps.secondlife.com/secondlife/Cargo City/119/70/24"}, {"Address": "19369 Stevens Creek Blvd Suite 130, Cupertino, CA 95014", "Artist": "Vudajé ", "ArtistImage": "https://photos.bandsintown.com/thumb/9164966.jpeg", "Coordinates": [-122.009125, 37.323299], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Alternative, R&b", "Time": "7:00 PM UTC", "Venue": "Eureka!", "moreBioInfo": "Established in 2017, Vudajé colors his soundscape with positivity and passion built on emotive lyrics and feel-good vibes.", "otherInfo": "No other event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Sean Hayes ", "ArtistImage": "https://photos.bandsintown.com/thumb/8218311.jpeg", "Coordinates": [-122.822691, 38.40115], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Soul, Dirty Blues", "Time": "8:00 PM UTC", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "Low Light, the eighth album from independent recording artist Sean Hayes, captures his distinctive sound at its most intimate. Recorded both at home and in the studio, Low Light webs its way through genres, incorporating the pulse and yearning of R&B with the low-fi grit and crackle of folk. From the gauzy, beat-driven title track to the aching, old-school country “Sing Me Your Love Song,” Hayes’ voice glides between a growling purr and seductive vibrato, transporting the listener into a rich, sensual late-night world.\n\nIn his twenty -year career as a San Francisco-based musician, Hayes has won acclaim from fans and critics alike. He’s duetted with Aimee Mann, toured with Ani DiFranco and the Cold War Kids, been covered by The Be Good Tanyas and re-mixed by DJ Mark Farina, and had his music featured in a variety of television shows, films, and commercials. Raised in North Carolina and honed as an artist in Northern California, Hayes crafts music that, as the SF Weekly puts it, “succeeds on the tension between warm, resonant soul and dirt-road folk, all laced with a wandering troubadour’s coo.” In the track “Home I Left” Hayes sings of leaving San Francisco--“headed north with my young family/needed space to grow”--and this album is structured to represent snapshots from his life in the four years since. Low Light thrums with songs of desire, sanctuary, and the redemptive power of love.", "otherInfo": "No other event info available"}, {"Address": "2870 Seventh St, Berkeley, CA 94710", "Artist": "Charanpal ", "ArtistImage": "https://photos.bandsintown.com/thumb/9166126.jpeg", "Coordinates": [-122.291871, 37.853366], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Indie, Kirtan, World, Mantra, New Age", "Time": "9:00 PM UTC", "Venue": "Aura", "moreBioInfo": "www.charanpalmusic.com\nwww.charanpal.bandcamp.com", "otherInfo": "No other event info available"}, {"Address": "3141 Browns Valley Rd, Napa, CA 94558", "Artist": "Dave Sampson Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9062126.jpeg", "Coordinates": [-122.322517, 38.302789], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "11:00 PM UTC", "Venue": "Connolly Ranch", "moreBioInfo": "Based in the San Francisco Bay Area, Dave Sampson is a freelance guitarist, producer, multi-instrumtentalist and music instructor. Drawing from his experiences living and playing in the music scenes of Austin, Los Angeles, Seattle, and Memphis, Sampson put roots down in the Bay Area in 2004. Dave's vibrant and versatile style supports a wide range of genres and artists. His work can be heard on a variety of records, major films, and national radio and television shows. Always favoring taste, melody, and finding the perfect complimentary part, his approach to playing has been compared to Mike Campbell, David Lindley, Mark Knopfler, Daniel Lanois and Lindsey Buckingham.", "otherInfo": "No other event info available"}, {"Address": "Los Gatos, CA", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-121.9747, 37.2266], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "11:00 PM UTC", "Venue": "Sky Ranch Farm", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "20990 Homestead Rd, Cupertino, CA 95014", "Artist": "Alive In Barcelona ", "ArtistImage": "https://photos.bandsintown.com/thumb/10236226.jpeg", "Coordinates": [-122.040382, 37.336297], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Rock", "Time": "1:00 AM UTC", "Venue": "Homestead Bowl & The X Bar", "moreBioInfo": "Hard Rock band Alive In Barcelona, have ignited the airwaves with their explosive new single, 'Back To Life', which premiered on Loudwire.com, charted at #94 for Media Base and #42 for Under The Radar Charts.\n\nThe four-piece from the Pacific Northwest have been to hell and back, suffering loss both personal and public to achieve heights in their musical career.\n\nThe group's musical proficiency on guitar paired with the technical expertise of the rhythm section provides an ironclad backbone for their vocal delivery.\n\nThe lyrical content conjured by the band is derived from personal experience and gives the listener a deep understanding of who the band are without and cliches or hidden meanings, thus connecting to their audience more than bands in their genre.\n\nExpect more from the Alive In Barcelona as they continue their steady rise to the pinnacle of their genre. The band provides a unique harmony of clean and heavy vocals,, shedding the dichotomy of the standard post-hardcore formula.\n\nWith multi-platinum producers on their side, and an arsenal of insanely well written songs, the future looks bright for Alive In Barcelona.\n\nUplifting but dark, Alive In Barcelona shed a light on the darkness of the human condition. The band provides hope through thought-provoking lyricism and musical proficiency as they aim for the pinnacle of modern hard rock music.", "otherInfo": "No other event info available"}, {"Address": "399 9th St, San Francisco, CA 94103", "Artist": "Bessie Snow ", "ArtistImage": "https://photos.bandsintown.com/thumb/10061726.jpeg", "Coordinates": [-122.409983, 37.772814], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Play, Classic Blues, Entertainment, Fine Art, Tease, Pop, Jazz, Classic, Funk, Rock, Burlesque, Live, Glamour, Dance, Old Hollywood, Performance Art, Classic Rock", "Time": "1:30 AM UTC", "Venue": "The Stud", "moreBioInfo": "Bessie Snow is a Neo-classic burlesque performer. She enjoys incorporating classic models of striptease along with modern innovation. She has performed internationally and all over the U.S by way of some of the most reputable burlesque festivals. She is known for igniting audiences with her magical and sensual ways of moving and shifting. She is your year around snow storm that’s here to remind you that being cold can be hot too.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "99 Grove St, San Francisco, CA 94102", "Artist": "Trampa ", "ArtistImage": "https://photos.bandsintown.com/thumb/8680311.jpeg", "Coordinates": [-122.417316, 37.778083], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Metal, Rock, Electronic, Alternative Metal, Dubstep", "Time": "2:00 AM UTC", "Venue": "Bill Graham Civic Auditorium", "moreBioInfo": "No artist bio available", "otherInfo": "18 AND OVER ONLY"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Watkins Family Hour ", "ArtistImage": "https://photos.bandsintown.com/thumb/7484262.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Americana, Folk", "Time": "2:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "For singer-songwriter-multi-instrumentalists Sara Watkins and Sean Watkins, the Watkins Family Hour has long been an oasis from the rigors of the road, a laboratory where they can try out new material or master beloved cover songs. Their monthly show at L.A.’s famed venue Largo has been hailed as a convivial, communal event where they welcome an impressive array of musician friends old and new. While it’s true that fans who aren’t lucky enough to be in L.A. and score a coveted ticket can check out the proceedings via youtube or on the podcasts the Watkins siblings have created, the fun of these evenings is really in being there as the unscripted show unfolds. The Watkins Family Hour is always full of surprises, unexpected guests, one-of-a-kind match-ups; serendipity plays as much of a role as virtuosity. Fiona Apple often joins them, and recent guests have included Dawes, Jackson Browne, Nikka Costa, Booker T. and actor-singer John C. Reilly, as well as comedians Paul F. Tompkins, Nick Kroll and Pete Holmes. Now Sara and Sean have decided to take their Family Hour format on the road -- a kind of musical pop-up shop, if you will -- to clubs and concert halls around the country. And to mark this undertaking, this summer they are releasing the first-ever Watkins Family Hour LP on their own Family Hour Records imprint. The album, recorded live over three days in the studio of their friend and producer-engineer Sheldon Gomberg, beautifully captures the freewheeling spirit of the shows. It features Apple and the stellar players who have become a de facto house band: drummer Don Heffington, pedal steel and dobro player Greg Leisz, bassist Sebastian Steinberg, and keyboardist Benmont Tench, each of whom take a vocal turn at the mic. The Watkins Family Hour is an all-covers affair; tracks include Sara doing Lindsey Buckingham’s “Steal Your Heart Away,” Sean essaying Roger Miller’s wistful “Not In Nottingham,” from Disney’s 1973 animated Robin Hood, and Apple singing “Where I Ought To Be,” originally performed by Skeeter Davis. On tour, the Watkinses plan to make every venue they visit a home away from home. In each town, they’ll extend an invitation to the many artists they’ve befriended over the years -- through their touring in Nickel Creek, as solo artists, and as frequent collaborators with other like-minded musicians from the worlds of bluegrass, folk, country and rock. “Taking the Watkins Family Hour on tour and releasing this record feels like the right next step,” says Sara. “The show is about a community of players and that community stretches across the country. If we can’t get everyone to L.A. to do our show, we’ll come to them.” “The Family Hour has always been something we’ve really loved,” echoes Sean. “It’s been an amazing outlet for us for so many years. Until recently we had thought of it as just an L.A. thing at Largo. But now we feel it’s time to take the show out to more people.” Sara and Sean, raised in the San Diego area, were eight and twelve years old when they partnered, on fiddle and guitar respectively, with eight year old mandolinist Chris Thile in 1989 to form Nickel Creek. By 2002, the prodigious trio had garnered a Best Contemporary Folk Album Grammy for its second album, the Allison Krauss-produced This Side. Sara and Sean learned about the original Largo on Fairfax Avenue from Toad the Wet Sprocket singer-songwriter Glenn Phillips and it became their go-to local spot. They started out as audience members but soon were coaxed on stage. Owner Mark Flanagan fostered an open, cooperative environment that attracted an eclectic list of regulars, most famously musician-producer Jon Brion, who established a popular weekly residency, as well as musicians like Aimee Mann, Michael Penn and Brad Mehldau. Fiona Apple has long been a familiar face, often joining Brion and now becoming an integral part of the Family Hour. As Sara recalls, “One day Flanny said to us, you guys should have a show; we’ll call it the Watkins Family Hour. I don’t care if only seventeen people come. And we said okay. We invited a friend of ours, Gabe Witcher [now a Punch Brother], to play fiddle with us. For each show we’d invite different friends to join in and the show became something we planned on whenever we were home from tour for a few days. Back then we were touring almost year round, three weeks on, one week off. The Family Hour show began as a chance to fly by the seat of our pants, play songs we simply liked to play, experiment with new, unfinished original material. It was a good excuse to learn cover songs we always loved, and most importantly to get together with other musician friends from the area, and say hey, we’ve got this show, do you want to bring a couple of songs down? Play by yourself, play with us – whatever you want. In doing that, you get to work up songs with people, practice a little bit, or just wing it and enjoy being in the moment with whomever is on stage and these hundred people in the audience. “ It’s also very natural for the Watkinses. As Sean explains, “Sara and I grew up in the bluegrass scene. People are traveling around, going to festivals. When they are not playing on stage, they are playing off stage around a campsite, at somebody’s house or in a trailer somewhere. That’s the mentality we grew up with; that felt normal.” Being reared in the tradition of bluegrass and folk, continues Sara, “it gave us this bug that craves this kind of reactive playing, that encourages improvisation and mixing up band members. In bluegrass and roots music, there is this wonderful cross-pollination that happens. It’s very common for someone to be in two or three bands. And that strengthens the individual musician, keeps you on your toes, teaches you how to be a better leader in one situation and a supportive teammate when that’s called for. I feel lucky to experience those different sides of being a musician, to have those kind of moments, those Family Hour moments, where it is always different, and you get to share the same space with musicians who are doing great things – to stand there in awe and try to contribute something special.” As the Watkins Family Hour has become an established part of the Largo calendar, fitting nicely into the club’s new space at the Coronet Theater on La Cienega Boulevard, the show has evolved to where it truly can be taken on the road – and shared with Sara’s and Sean’s fans around the country. As Sara observes, “It’s become a good blend of organized, planned, arranged harmonies and good quality moments on stage that we’ve prepared… and some great surprises that happen when a guest just remembers a song they want to do or when somebody walks in the back door with their guitar and wants to play a song on a whim. Those moments make it special and that’s the kind of thing we want to maintain when we bring the show to cities across the country. We are coming to towns where we have friends and we can have those moments, even if it’s not our home club. It’s the people on stage who make that happen; it’s just a matter of getting the right group of people together. We are being thoughtful about where we are going on this tour so we can have that sort of flexibility. It will be a very different show in every town.” Which means that we may all get a chance to be part of the family now. -- Michael Hill Watkins Family Hour is a monthly residency hosted by siblings Sean & Sara Watkins. Debut record available for pre-order now: http://smarturl.it/watkinsFH", "otherInfo": "No other event info available"}, {"Address": "189 H St, Petaluma, CA 94952", "Artist": "Migrant Pickers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8669475.jpeg", "Coordinates": [-122.631268, 38.231285], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Aggravated Folk", "Time": "2:00 AM UTC", "Venue": "Aqus Cafe", "moreBioInfo": "Migrant Pickers\nhttp://www.migrantpickers.com\n\nIf Joe Strummer had come up in Greenwich Village taking guitar lessons from Dave Van Ronk and crate digging for Rev. Gary Davis records, he might sound something like Migrant Pickers' frontman Gary Adler. Acoustic finger-picking guitar with a punk rock edge, Gary's music combines technical virtuosity with honest, soulful songwriting.\n\nDisciples of Woody Guthrie with a rock in their shoe, the Pickers are firmly rooted in the subversive tradition of American folk. Combined with Mark Lahti's driving electric bass Gary and Mark's performances are an unapologetic act of defiance-- of genre, expectation, and the very laws of physics.\n\nMigrant Pickers will take you on a freight train ride from the deepest roots of American music to outer space and back.", "otherInfo": "No other event info available"}, {"Address": "522 2nd St, Oakland, CA 94607", "Artist": "Fang Official ", "ArtistImage": "https://photos.bandsintown.com/thumb/8722462.jpeg", "Coordinates": [-122.277791, 37.797058], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Punk", "Time": "2:00 AM UTC", "Venue": "Oakland Metro Operahouse", "moreBioInfo": "Fang is an influential American hardcore punk band from the early East Bay punk rock scene, established in Berkeley, California, in 1980.\n\nFang's first record under the name 'Fang' was actually more of an experimental record, according to the band; the \"Yukon Fang\" single. Fang guitarist Tom Flynn and bass player Brian Beattie, his former bandmate from the bands \"Tapeworm\" and \"Safety Patrol\", put out \"Yukon Fang\" as a duo and thus Fang was born. The original version of Fang toured the country once, only to break up shortly thereafter with Beattie moving on to Texas where he later formed the band Glass Eye. In the early fall of 1981 Flynn began playing with drummer Chris Ritter. They soon added bass player Chris Wilson and began playing shows in the SF Bay area as a three piece, with Flynn on vocals.While this was happening, Sam McBride, the band's soon-to-be vocalist, was singing with future Fang drummer Greg Langston in the band \"Shut up\". In early 1982 Ritter was replaced with drummer Joel Fox, and at Fox's audition he brought along his friend McBride, who volunteered to be the band's singer. The lineup thus solidified as McBride (vocals), Chris Wilson (bass), Tom Flynn (guitar), and Joel Fox (drums). Together they contributed the song \"Fun with Acid\" on the Not so Quiet on the Western Front compilation LP. Shortly thereafter, guitarist Tom Flynn created \"Boner Records\" and released their debut LP and EP Landshark and Where the Wild Things Are. Tim Stiletto drummed on the latter. These two releases are now considered classic East Bay punk.\n\nIn January 1986, the \"Spun Helga\" LP was recorded in West Germany with McBride singing vocals, and two Germans named Joe (Guitar) and Ollie (Drums) playing instruments. We Bite Records in Germany released the LP, but in the U.S. it was handled by National Trust Records. Fang next released was 1987's \"A Mi Ga Sfafas?\" (The title literally means \"Give Me Head?\"). The lineup during this era was McBride, Bill Collins (guitar), Joe Miller (bass), and Steve Chinn (drums). Drummer Mike Branum replaced Chinn and Fang recorded the album \"Pissed-Off Buddah\", which remained unreleased until 2008, when it was released with Fang's other albums \"Spun Helga\" and \"A Mi Ga Sfafas?\"\n\nAfter a long break, Fang regrouped in 1996 and put out the \"Electric Chair\" single on Man's Ruin Records. The lineup at this time included Sam McBride (vocals), Greg Langston (Drums), Bill Burnett (Guitar) and Josh Levine (Bass). This incarnation of the Band recorded the \"American Nightmare\" LP on Wingnut Records.\n\nIn 1989, Boner Records released Fang's first compilation album, Landshark/Where the Wild Thing Are. The album included Fang's debut album and debut EP.\n\nIn 1999, Jim Martin (from Faith No More) joined on guitar, and recorded four songs for the Hello Records CD Fish and Vegetables, which was released as a split LP by fellow punk rock groups Dr. Know, and Hellions In May 2000, Sammytown and Jim Martin, along with Casey Orr (Gwar, Rigor Mortis) on bass, and Dallas drummer Clint Phillips did two shows in Texas. One at Trees in Dallas, and a sold out show at Emo's in Austin.\n\nBy 2001, the band was composed of Sammytown, Brian Schopflin (bass), Jonny Manak (guitar), Alby Wasted (guitar),and Ike Eichensehr (drums). Sammytown, Brian, Jonny, Alby and Ike also started The Resistoleros, a Oakland-based rock 'n' roll band. Steel Cage Records released the Resistoleros CD Rock 'N Roll Napalm in 2003.\n\nIn 2004, the Live Cheap\" CD' came out on Malt Soda Recordings featuring Sammytown (vocals), Brian Schopflin (bass), Ike Eichensehr (drums), Alby Wasted (guitar) and Jimmy Crucifix (guitarist for 1980s hardcore band Crucifix and hard rock band Proudflesh) also on guitar. This is the only Fang recording with two guitarists.\n\nIn 2004, the band toured the United States. Sammytown, Jimmy Crucifix (guitar), Brian Schopflin (bass)/Bubba Dennis (bass) and Ike Eichensehr (drums) toured as Fang in the Spring of 2004 and as the Resistoleros and Fang in November 2004 with Sam, Jimmy, Brian, Ike and Greg Elliott (rhythm guitar).\n\nIn January 2005, Sammy, Jimmy, Brian and Ike recorded a cover of Agression's (1980s hardcore–Narcore band) song \"Salty Leather\" for a tribute to Agression members Mark Hickey and Henry Knowles, who had died. Dave Haro and JellyRoll came up with the idea for the tribute. The CD, Taking Out A Little Agression, was released on Dr. Strange Records in 2007 and featured bands including JFA, McRad, DI, Ill Repute, Dr. Know, Verbal Abuse, MDC, Oppressed Logic, Shattered Faith and Dave Haro–JellyRoll's band KatKiller.\n\nFrom 2005–2008, Fang performed with the steady line-up of Sammytown, Jimmy Crucifix, Brian Schopflin, and Greg Langsten (returning to the drums). As of writing (July, 2012) the line-up consists of Sammytown (Vocals), Jamey Dangerous (Drums), Brian Schopflin (Bass), J-Stain Werthless (Lead Guitar), Mat ('The Kid') McCoy (Guitar). Original member Tom Flynn has re-emerged and played live with the band on at least one occasion in 2012. He also contributed to the latest Fang album, 'Here Come the Cops\".\n\nIn 2011, Malt Soda released the CD \"Pissed Off Buddha\", comprising three Fang albums - \"Spun Helga\", \"A Mi Ga Sfafas?\", and \"Pissed Off Buddha\" - the latter being a previously unreleased album recorded in 1988, in a double disc package that included a live DVD of the band.", "otherInfo": "No other event info available"}, {"Address": "327 Lasuen St, Stanford, CA 94305", "Artist": "Maria Schneider ", "ArtistImage": "https://photos.bandsintown.com/thumb/9174678.jpeg", "Coordinates": [-122.1722, 37.4215], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Big Band, Classical, Classical Crossover, Jazz", "Time": "2:30 AM UTC", "Venue": "Bing Concert Hall", "moreBioInfo": "Maria Schneider’s music has been hailed by critics as “evocative, majestic, magical, heart-stoppingly gorgeous, and beyond categorization.” She and her orchestra became widely known starting in 1994 when they released their first recording, Evanescence. There, Schneider began to develop her personal way of writing for what would become her 18-member collective, made up of many of the finest musicians in jazz today, tailoring her compositions to distinctly highlight the uniquely creative voices of the group. The Maria Schneider Orchestra has performed at festivals and concert halls worldwide. She herself has received numerous commissions and guest-conducting invites, working with over 90 groups in over 30 countries.\n\nSchneider’s music blurs the lines between genres, making her long list of commissioners quite varied, stretching from Jazz at Lincoln Center, to The Saint Paul Chamber Orchestra, to collaborating with David Bowie. She is among a small few to have received GRAMMYS in multiple genres, have received the award in both jazz and classical categories, as well as for her work with David Bowie.\n\nSchneider and her orchestra have a distinguished recording career with twelve GRAMMY nominations and five GRAMMY awards. Unique funding of projects has become a hallmark for Schneider through the trend-setting company, ArtistShare. Her album, Concert in the Garden (2004) became historic as the first recording to win a GRAMMY with Internet-only sales, even more significantly, it blazed the \"crowd-funding\" trail as ArtistShare’s first release. She’s been awarded many honors by the Jazz Journalists Association and DOWNBEAT and JAZZTIMES Critics and Readers Polls. In 2012, her alma mater, the University of Minnesota, presented Schneider with an honorary doctorate. ASCAP awarded her their esteemed Concert Music Award in 2014. And in 2019, the National Endowment for the Arts bestowed on Schneider the nation's highest honor in jazz, naming her an NEA Jazz Master.\n\nSchneider has become a strong voice for music advocacy and in 2014, testified before the US Congressional Subcommittee on Intellectual Property about digital rights. She has also appeared in CNN, participated in round-tables for the United States Copyright Office, and has been quoted in numerous publications for her views on Spotify, Pandora, YouTube, Google, digital rights, and music piracy.\n\nA collaboration with her orchestra and David Bowie resulted in his single called, \"Sue (Or In A Season of Crime),” and brought Schneider a 2016 GRAMMY (Best Arrangement, Instruments and Vocals). Schneider and her orchestra also received a 2016 GRAMMY for The Thompson Fields (Best Large Jazz Ensemble Album). Their next recording project, Data Lords, is underway (2019) through ArtistShare and is set to be released April 1, 2020.", "otherInfo": "No other event info available"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Eric Roberson ", "ArtistImage": "https://photos.bandsintown.com/thumb/9037148.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Soul, R&b", "Time": "2:30 AM UTC", "Venue": "Yoshi's Oakland", "moreBioInfo": "http://www.EricRobersonMusic.com http://www.Twitter.com/IamEricRoberson http://www.twitter.com/ErroFam", "otherInfo": "Yoshi's Oakland Presents Eric Roberson"}, {"Address": "412 14th St, Oakland, CA 94612", "Artist": "Suede Razors ", "ArtistImage": "https://photos.bandsintown.com/thumb/9963779.jpeg", "Coordinates": [-122.270302, 37.804256], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Punk", "Time": "3:00 AM UTC", "Venue": "The Golden Bull Bar", "moreBioInfo": "SUEDE RAZORS is a four-piece rock n’ roll band from the San Francisco Bay Area featuring members of local favorites HARRINGTON SAINTS, HOUNDS & HARLOTS, and SYDNEY DUCKS. Combining elements of 70’s punk, pub-rock, bootboy glam, and mod revival, they’ve created their own hard-hitting brand of amped-up retro rock n’ roll.\n\nThe group originated as a ‘side project’ creatively deviating from current bands, to fuse together the power and energy of punk with swaggery guitar riffs and big beats from the 60s and 70s. With momentum from the success of their two previously released singles, the band is now preparing for their 3rd single which will be released in Fall 2014 on Pirates Press Records (USA) / Randale Records (Europe). The release will coincide with their live debut at the Pirates Press 10th Anniversary Party in San Francisco on October 25th, 2014 where they will play alongside Cock Sparrer, Bouncing Souls, Street Dogs, and Bishops Green.\n\n\nDiscography:\n\n'Here She Comes' 7\" (Jan. 2014 / Pirates Press Records)\n\n'Bootboy Anthems' 7\" (June 2014 / Rebel Sound Records, Rebellion Records)\n\n'Boys Night Out' 7\" (November 2014 / Pirates Press Records, Randale Records)\n\n'Passion on the Pitch' 7\" (March 2015 / Contra Records, Under Watchful Eyes Records)\n\n'Berlin or Bust' 7\" (May 2016 / Contra Records, Under Watchful Eyes Records)\n\n'Razor Stomp' 12\" (April 2017 / Pirates Press Records, Randale Records)", "otherInfo": "The BELTONES first Bay Area appearance in 7 years!!\n\n...with SUEDE RAZORS, ULTRA SECT, & CLAYMORE!\n\n$13 adv / $15 door.\n\nDoors: 8pm\nShow: 9pm\n21+"}, {"Address": "1840 Haight St, San Francisco, CA 94117", "Artist": "Bisi & The Moonwalker ", "ArtistImage": "https://photos.bandsintown.com/thumb/8533266.jpeg", "Coordinates": [-122.452592, 37.769515], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Milk Bar", "moreBioInfo": "No artist bio available", "otherInfo": "Bisi & The Moonwalker, Jonny Ramada, and The Super Fantastics - Milk Bar 4/18\nOn 4/18, Bisi & The Moonwalker, Jonny Ramada, and The Super Fantastics collide for a musical journey at SF's historic Milk Bar (The Haight). This show will sell out, please get your tickets early.\n\nDoors at 8, music at 9. Come early to have a drink with us & make friends before we go on.\n\nBisi & The Moonwalker\n\nBisi and Joshua \"Shua\" Smith have combined forces to become the duo \"Bisi & The Moonwalker\". Their eclectic set comprises sounds from reggae and melodic hip-hop to distinct pop and blues influences.\n\nInstagram: @bisiandthemoonwalker\n\nJonny Ramada\n\nJonny Ramada is the lead singer of Queen Elizabeth & the Razor Bladez. Ramada is a known San Franciscan street musician. The BBC made a documentary about his struggles on the streets in 2006. The footage was lost but found years later in Helsinki.\n\nInstagram: @jonnyramada\n\nThe Super Fantastics\n\nEclectic indie rockers releasing their debut album April 2020, often seen at White Rabbit, The Chapel, and Balboa Block Party, among others. Album will be leaked prior to the show to all ticketholders. Special treat for those wearing The Super Fantastic t-shirt.\n\nInstagram: @thesuperfantastics"}, {"Address": "982 Market St, San Francisco, CA 94102", "Artist": "Michael Mayo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8149388.jpeg", "Coordinates": [-122.410073, 37.782687], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The Warfield", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "1220 Linda Mar Blvd, Pacifica, CA 94044", "Artist": "Unauthorized Rolling Stones ", "ArtistImage": "https://photos.bandsintown.com/thumb/8492095.jpeg", "Coordinates": [-122.487082, 37.583193], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Tribute Band", "Time": "3:00 AM UTC", "Venue": "Mildred Owen Concert Hall", "moreBioInfo": "Their show holds in reverence many legends of the classic rock years, while maintaining their Rolling Stones core. Colombini’s staggering, Jaggeresque showmanship now engages in a battle of the sexes with a trio of seductive, bluesy backup vocalists. Colombini, who has seen the Rolling Stones live 20 times said. “It’s been a deep drill into little nuances and movement. Frankly, it’s nearly impossible to find a better mentor than Mick Jagger for a performer. He’s an incredible entity.” “It’s a big show,” Colombini added, “A real Rock and Roll event.”", "otherInfo": "No other event info available"}, {"Address": "427 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "Ian George ", "ArtistImage": "https://photos.bandsintown.com/thumb/10207176.jpeg", "Coordinates": [-122.715214, 38.441851], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Indie, Folk Rock, Avant-garde Music, Folk", "Time": "3:00 AM UTC", "Venue": "Lost Church Santa Rosa", "moreBioInfo": "Ian George + the Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. the ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…", "otherInfo": "No other event info available"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Middle-Aged Queers ", "ArtistImage": "https://photos.bandsintown.com/thumb/10113158.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Dad Rock For Filthy Gays, Queercore, Punk Rock, Queercore Punk", "Time": "3:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "Crawling out of the primordial ooze of punk past, Middle-Aged Queers are a quartet of Jurassic Punx barreling down Interstate 580 on a mission to save Rock and Roll with broken limbs and gear held together with duct tape.", "otherInfo": "Queercore takeover in Pacifica!"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "The Waifs ", "ArtistImage": "https://photos.bandsintown.com/thumb/7995666.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "International, Folk, A Bit Of Country, Anything Really, A Bit Of Jazz, Australian, A Bit Of Blues And Roots", "Time": "3:00 AM UTC", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "The Waifs are a folk-rock band from Western Australia. Their 2003 album Up All Night has gone double platinum in Australia and reached the top 5 of the Australian album charts. and the band won four ARIA Awards in October 2003. The band has enjoyed two top fifty singles in Australia - the London Still EP in 2002 and Bridal Train EP in 2004. The band owns Jarrah Records, an independent label with John Butler of the John Butler Trio and their records are released in Australia under that label. The band so impressed Bob Dylan when they supported him on his Australian tour that he asked them to support him in his 2003 North American tour including in his gig at the Newport Folk Festival.", "otherInfo": "The Waifs"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Middle-Aged Queers ", "ArtistImage": "https://photos.bandsintown.com/thumb/10113158.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Dad Rock For Filthy Gays, Queercore, Punk Rock, Queercore Punk", "Time": "3:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "Crawling out of the primordial ooze of punk past, Middle-Aged Queers are a quartet of Jurassic Punx barreling down Interstate 580 on a mission to save Rock and Roll with broken limbs and gear held together with duct tape.", "otherInfo": "Queercore takeover in Pacifica!"}, {"Address": "99 Grove St, San Francisco, CA 94102", "Artist": "Champagne Drip ", "ArtistImage": "https://photos.bandsintown.com/thumb/8996159.jpeg", "Coordinates": [-122.417316, 37.778083], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Electronic", "Time": "3:00 AM UTC", "Venue": "Bill Graham Civic Auditorium", "moreBioInfo": "Champagne Drip, the newest musical incarnation of Los Angeles-based producer Sam Pool, was born out of a philosophy that innovation springs from inspiration. Pool had carved out a unique place for himself in the bass music community; performing under the moniker of SPL for over 10 years and releasing drum & bass, dubstep, and trap-oriented music on respected labels such as Barcode, Tech Itch, Evol Intent, Sub Human, Rottunn, and SMOG Recordings. SPL’s music was fully immersed in sound design, a musical landscape comprised of melodic, dark, and refined touches. By the Summer of 2014, Pool came to the realization that he had pushed the SPL project to its sonic boundaries and in order to evolve musically, he would need a new project to explore lighter textures and richer melodies. Rooted in jungle and bass music and built around elements of blippy 8-bit sounds, arpeggios, and lush 80s synths, Champagne Drip launched as a decidedly tropical and uplifting sounding project. Operating at first in anonymity, Champagne Drip made a big splash thru the release of official remixes of Bassnectar (Amorphous Music) and Elliphant (Mad Decent). Shortly thereafter, he released his debut EP “Radio Bikini” on Mad Decent in September of 2014. Over the first year of the project’s history, press outlets were fascinated with the unique sound, but also with uncovering the identity of the secretive producer behind the music. “Radio Bikini” was subsequently remixed by electronic upstarts Big Wild, Lazerdisk, Mayhem, and Son of Kick and released in the Spring of 2015 as “Remix Bikini”. In the Fall of 2015, Champagne Drip released his 2nd EP for Mad Decent, “Journey Into The Champagne Sea”. Whereas his first EP explored more overtly tropical overtones, “Journey” went into deeper and darker musical territory. After spending one full year refining his sound in the studio, he finally revealed himself as the former SPL in 2016; performing across the US at such festivals as Mysteryland, WTFest?, Imagine, Enchanted Forest, and Lights All Night. Building up anticipation for his next original recordings, Champagne Drip released the stand alone single “Open Your Eyes”, which was featured on the official Bernie Sanders Presidential campaign fundraising compilation “Rave4Bernie”. Official remixes for Grandtheft (Mad Decent), Cardinox (Warner Brothers), and Dillon Francis & NGHTMRE (Mad Decent) followed. Champagne Drip capped off an already busy 2016 with the release of two new EPs; “Poseidon” via Quality Goods Records and “Of Course I Still Love You” via Saturate Records. Official remixes for Zeds Dead & Diplo, UZ, and DAWN all saw early 2017 releases. Champagne Drip is set to have his biggest year yet in 2017, with multiple EPs scheduled for release on Deadbeats Records as well as forthcoming remixes for 12th Planet and Mayhem, which are due for Summer releases. https://twitter.com/champagnedrip https://soundcloud.com/champagnedrip https://www.instagram.com/champagnedrip Bookings: champagnedripbookings@gmail.com", "otherInfo": "No other event info available"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Teddy Abrams ", "ArtistImage": "https://photos.bandsintown.com/thumb/6264505.jpeg", "Coordinates": [-122.419994, 37.777441], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Davies Symphony Hall", "moreBioInfo": "Teddy Abrams is an American conductor, composer, pianist, and clarinetist.", "otherInfo": "This week, the San Francisco Symphony brings together two composers—one past and one present—for an inspired pairing of audience favorites. Guest conductor Teddy Abrams leads the orchestra in the West Coast premiere of Philharmonia Fantastique by the internationally renowned Bay Area composer Mason Bates. A fixture as a DJ in the splashiest nightclubs around town, Bates turns his ear for layering sound, rhythm and texture upon the infinitely variable palette of the symphony orchestra (plus a pair of laptops). Bates' work appears side-by-side with another master musical colorist—but in a nineteenth-century aesthetic—Tchaikovsky, who delivers a volcanic rush of irresistible melodies in his thundering Symphony No. 5.\n\nConductor/Performers\n\nTeddy Abrams\nconductor\n\nSan Francisco Symphony\nProgram\n\nBarber\nSecond Essay for Orchestra\n\nMason Bates\nPhilharmonia Fantastique: The Making of the Orchestra West Coast Premiere, SFS Co-commission\n\nTchaikovsky\nSymphony No. 5"}, {"Address": "1 Old Rancheria Rd, Nicasio, CA 94946", "Artist": "Fleetwood Macrame ", "ArtistImage": "https://photos.bandsintown.com/thumb/9069856.jpeg", "Coordinates": [-122.69817, 38.06214], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Rock, Classic Rock, Country", "Time": "3:00 AM UTC", "Venue": "Rancho Nicasio", "moreBioInfo": "Fleetwood Macramé is quickly becoming the Bay Area's most exciting tribute band. What began as a simple exercise in fun has turned into an awe inspiring live experience complete with show stopping renditions of Fleetwood Mac's greatest hits. Audience participation is encouraged, and bay area crowds are coming in droves to sing along with Fleetwood Macramé. What's more, they sound so much like Fleetwood Mac, if you closed your eyes you would think it was the real thing. Only it's better, because you are front row!", "otherInfo": "Fleetwood Macramé is quickly becoming the Bay Area's most exciting tribute band. What began as a simple exercise in fun has turned into an awe inspiring live experience complete with show stopping renditions of Fleetwood Mac's greatest hits. Audience participation is encouraged, and Bay Area crowds are coming in droves to sing along with Fleetwood Macramé. What's more, they sound so much like Fleetwood Mac, if you closed your eyes, you would think it was the real thing. Only it's better, because you are in the front row!"}, {"Address": "616 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "The Freak Accident ", "ArtistImage": "https://photos.bandsintown.com/thumb/9973434.jpeg", "Coordinates": [-122.717235, 38.445083], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "San Francisco, California", "Time": "3:00 AM UTC", "Venue": "Round Robin", "moreBioInfo": "The Freak Accident is a Punk/Math/Garage/Pop/Surf/Rock collision led by Victims Family/Jello Biafra and GSM guitarist-vocalist Ralph Spight. The epynonymous debut record in 2004 (Alternative Tentacles) found Ralph exploring a multitude of Pop stylings, while 2007's \"Tissue Sample\" (Nerve Center Recordings) took a harder turn into Spight's signature kinetic punk stylings. The band released it's third album \"Misfortune Teller\" in late 2018, a heady collision of psychedelic,punk, surf, garage and math rock and a new line-up of Spight, Henry Austin Lannan on bass and Sonoma County drum legend Eric Strand who deliver an ever changing array of lysergic thunder anthems with a lyrical perspective that abandons all hope for the future.", "otherInfo": "The Freak Accident and Lucky Ol Bones at the Dirty- 616 Mendocino Ave., Santa Rosa"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "The Purple Ones - Insatiable Tribute to Prince ", "ArtistImage": "https://photos.bandsintown.com/thumb/9888001.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Derek Clark - Lead Vocals, Pamela Fields - Lead Vocals, Morgan Day - Guitar, Nick Ciardelli - Trumpet, Willie Adams - DJ/ BU Vocals, Levi Seacer Jr. - Musical Director/ Lead Guitar, Shane Cox - Trombone, Jamison Smeltz - Bari/ Tenor Sax, Morty Okin -Trumpet/Bandleader/Manager/Booking, Michael (Tiny) Lindsey - Bass, Christian Houston - Keyboards, Tony Two Times Providence - Drums", "Time": "3:00 AM UTC", "Venue": "Mystic Theatre", "moreBioInfo": "The Purple Ones is California's premier Prince tribute band and is a labor of love that was born in 2012\n\nOakland California’s The Purple Ones treat the music and patented vibe of Prince’s legacy with the utmost respect. The musical dexterity of The Purple Ones – with 12 pieces on stage including a full horn section - delivers their own spin on Prince’s (and other Prince related artists such as The Revolution, The New Power Generation, Sheila E., Morris Day & The Time and the general Minneapolis Sound) live onstage, as this funk machine, dance party has to be experienced to be believed!\n\nThe Purple Ones is a group of world-class musicians that carries out the Purple Legacy of the MUSIC. TPO is NOT a typical tribute band. There is no impersonator or look- a-like, nor do they dress up in goofy costumes or wigs.\n\nThe Purple Ones bring audiences to their feet, night after night, by speaking Prince’s musical language. energy, rhythm, creativity and of course…a serious dose of unadulterated funk. The Purple Ones tap into that soulful artistry like none other.\n\nThe Purple Ones is a labor of love that was born in 2012 when Bay Area based bandleader and founder, Morty Okin (“The New Morty Show”, co-founder of the Michael Jackson tribute “Foreverland” and Neil Diamond tribute “Super Diamond”,) decided to focus all of his energy on building the greatest Prince homage on the planet.\n\nThe Purple Ones have been packing concert venues since their inception, growing a fan base over the years that includes long time Prince devotees and newbies that are just discovering the icon. Recently, Brown Mark and Matt “Doctor” Fink from The Revolution performed with TPO onstage and is not uncommon for the band to be joined on stage by “Honorary Purple Ones” like celebrity “Super Fan,” comedienne Margaret Cho and members of the artist’s extended musical family, including renowned percussionist (and brother of Sheila E,) Juan Escovedo who toured the world with Prince in the 80’s, as well as Sheila E’s longtime saxophonist Eddie M.\n\nThe Purple Ones’ Musical Director is Prince’s former Musical Director, bassist/guitarist and co-founder (and current member) of Prince’s “New Power Generation,” Levi Seacer Jr. Levi was with Prince for many years and is the only Prince band member to have played multiple instruments. Later, collaborating with Prince as a songwriter and Co-Producer on his projects. Now the lead guitarist and Musical Director of The Purple Ones, Seacer is determined to continue the musical legacy of his late friend and former band mate. He says one of the biggest keys to the authenticity is the ‘controlled chaos” that existed in Prince’s world that allowed for extreme creativity, “With Prince,” Levi says, “you tried everything. That’s the biggest thing I learned from him over all those years. If it doesn’t work you can always take it out, but if it does work…there’s no limit.”", "otherInfo": "No other event info available"}, {"Address": "1984 Bonita Ave,, Berkeley, CA 94704", "Artist": "Red's Blues ", "ArtistImage": "https://photos.bandsintown.com/thumb/9034428.jpeg", "Coordinates": [-122.272093, 37.871966], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Americana, Blues Some Original, Blues", "Time": "3:00 AM UTC", "Venue": "The Back Room Music", "moreBioInfo": "Red’s Blues~~You Knock Me Out\nWith this second release, You Knock Me Out, Red’s Blues has stepped up another notch into blues big league with the exemplary songwriting team of singer Beth Reid-Grigsby and her Blues Music Award-winning stand up (bass-playing and singing) husband RW Grigsby. Couple that with all their music friends joining in on the fun, and this new CD makes a very strong case for Northern California being the new torch-bearing center of the classic Chicago and Texas blues sound.\nSix stellar originals tell the couple’s individual and combined personal histories in an honest and cosmic way. Beth & RW’s love of the classic blues vibe pays off and yet, these songs could easily be covered by well-known singers in many roots music idioms.\nNestled alongside are songs by their mid-20th century heroes Jimmy Reed (lead track, “There’ll Be a Day”, “Ain’t That Loving You Baby”), Memphis Minnie (“Lookin’ the World Over”), Big Bill Broonzy (“Lonesome Road Blues”), jump blues brother-sister act, Buddy & Ella Johnson (“Why Don’t You Stop It”) and Memphis Slim (“Mother Earth.”)\nRed’s Blues has a finger-poppin’ attitude—straight outta the afore-mentioned golden years when blues, R&B and swing all meshed together and dance floors every night were filled with snake hips and slow drags. Beth, with her sensual, southern voice and classy behind-the-beat phrasing is more a Julie London or Bobbie Gentry-styled singer: smoky with languid, sexy sophistication. She can swing too, just check out the big fun on “Why Don’t Ya Stop It.” This rich nightclub feel is missed on too many modern singers. The yearning confidentiality, the wise heart that Beth brings to her true-life stories reveal tales of youth seen through grown up reflection.\nRW, who has not lost his hometown Rome, Georgia accent has this quality also. Upright bass never had a better companion—it’s no wonder that RW has anchored the doghouse rhythm for Mark Hummel’s legendary Harmonica Blowouts for ten years. Together, Beth & RW have a rare and beautiful combination of poetry, humor and groove in their music. What other couple in more recent music memory had this? Could they be the blues Sonny & Cher? Johnny & June? Whether up-tempo or ballad, this makes for a great live show —part juke joint, part nightclub. They are uptown and lowdown.\nTheir friends on this release are California harp masters Rick Estrin and Mark Hummel, Texas guitar masters Anson Funderburgh and Mike Keller, Texas drummer and RW Grigsby’s childhood music sidekick, Wes Starr (the dazzling team from Hummel’s Golden State-Lone Star Revue) guitarist and harmonica player Dave Earl and two Sacramento Hall of Famers, guitarists Robert Sidwell and Steve Randall.\nVeteran Bay Area Musician Dave Earl, now living in the Sierra foothills, played guitar and rack harmonica in Red’s Blues for two years. “Doug Crumpacker of Hucklebucks reknown, is currently Red’s Blues’ guitar player. When we have another guitar player on stage with us, he knows when to drop back and support the other artist. He’s a fine addition to our band and is up there with the best. Also a great part of our rhythm section is Tim Wilbur, Sacramento’s own shuffle king.” Doug, Tim and RW are all members of the Sacramento Blues Hall of Fame.\nDrummer/studio owner/engineer Larry Carr understands the great 1950s Chicago drummers like Jimmy Reed’s great shuffle drummer Earl Phillips. He also has a terrific beatnik bongo/shakers turn on one of the album highlights, “I’m Trouble (Hillbilly Bongo Blues)” penned by RW. If Robert Mitchum were still around, THIS 2-minute warning would absolutely be his theme song.\nYoung Hammond B-3 lions are here too. James Pace (Tommy Castro) and Kid Andersen (award-winning blues producer; and formerly with Terry Hanck, Charlie Musselwhite, now Rick Estrin & The Nightcats), and John Cocuzzi all take turns and elegant swingman Cocuzzi adds his deep blues piano touch on three songs.\nIt is always good to know what the artists themselves want to say about each song choice they carefully made and the originals they wrote:\n1. There’ll Be A Day- the flip side of Jimmy Reed’s 1963 hit “Shame, Shame, Shame.” Original 3rd verse written by Beth contains the album title You Knock Me Out.\n2. Poor Girl- inspired by RW and Beth’s time managing a ghetto bingo hall in Montgomery, Alabama and a girl with a gambling problem.\n3. Lookin’ The World Over- Memphis Minnie’s tale of travels with her righteous man. Killer Estrin harp solo.\n4. That’s All- written after Beth found a picture of her mother’s. A family tale of living, loving and dying.\n5. Ain’t That Loving You Baby- Jimmy Reed cover features Mark Hummel on harp and the Golden State Lone Star Revue.\n6. Baby Walk On- RW original inspired by Mose Allison. Solos by Hummel, Mike Keller and Anson Funderburgh.\n7. Stonebroke- originally recorded in 1992 with RW on Gary Primich’s My Pleasure on Austin’s Amazing Records. Rick Estrin plays some fine solos. A Primich original.\n8. Why Don’t You Stop It- Buddy and Ella Johnson tune, Lou Ann Barton used to sing this with Roomful of Blues.\n9. Pat’s Blues-Original tune about our friend who went on a binge and woke up with a stranger who’s name she didn’t know....yep it’s true. Only we changed it to a tune about our friend, a guy, because it didn’t sound right, Beth singing about a girl.....)\n10. Lonesome Road Blues- Big Bill Broonzy road tune.\n11. I’m Trouble (Hillbilly Bongo Blues)- RW original, Larry Carr on bongos, hillbilly beatnik.\n12. Somewhere Down The Line- Another RW&B original, trying to channel the feel of south Louisiana in this song of reconciliation. Nice soloing from John Cocuzzi and Steve Randall. Another family tale.\n13. Mother Earth- Memphis Slim cover brings it all home. Solos by John Cocuzzi and Robert Sidwell. On a Blues Cruise in 2012, Barrelhouse Chuck asked Beth if she knew “Mother Earth.” She said “no, but I know Blues is Everywhere.” He said, “I love your voice. Learn that song.” So she did—\"never got to sing it with him, though. I was glad RW thought of putting it on the CD.”\n\nA little more Beth & RW back story:\nBeth, thanks to her older brother, grew up listening to Huddie Ledbetter, Muddy Waters and Mississippi John Hurt records and as a kid, learned from and sang songs at home with her Mom-- “ Summertime,” “God Bless the Child,” and St. Louis Blues.” Across the street in her hometown of south Santa Barbara though, the shy 7 year old redhead was bold enough to go perch on the neighbor’s porch listening to a Cuban salsa band rehearse, and from that learned to love the rhythms, the bass and percussion in particular. She and RW met through the local Santa Barbara blues scene years later in 1977, and have lived in his home state of Georgia and then Texas before heading back to sunny Sacramento, California in 2006.\n2014 Grammy-nominated and Blues Music Award (BMA) winner bassist RW Grigsby has been playing since he was 14 years old, and began his professional career when still a teenager. He's toured the U.S., Canada and Europe since the '80s, and currently juggles playing with Red's Blues, Mark Hummel and the Blues Survivors and The Golden State/Lone Star Blues Revue. He played and recorded with Texas blues stars Gary Primich and Black Top Records’ Mike Morgan and the Crawl in the 1990s. RW is the bassist on the 2014 Grammy-nominated and BMA-winning CD, Remembering Little Walter. He was nominated for a BMA “Best Bassist” Award in 2017, and was inducted into the Sacramento Blues Hall of Fame in 2018.\nRed’s Blues draw their audiences into a grown-up music world—southern music with downhome simmer, dance floor fun and stellar, sophisticated players who know they have no need to blast at earsplitting volumes to make the biggest impact.\n– Bio by Mindy Giles, © 2018\n\nhttps://www.facebook.com/redsbluessac\n(916) 342-4281 bethgrigsby@comcast.net", "otherInfo": "Red’s Blues is bringing our unique blues and original Americana music back to The Back Room. Red’s Blues has been working hard on their third CD, and will be playing some new originals and old favorites. Doug Crumpacker, guitar, RW Grigsby, bass, Tim Wilbur, drums and Beth Reid-Grigsby, lead vocals. CDs on sale and tips appreciated. We also accept credit cards. See you there! This is the most comfortably intimate setting to settle back and enjoy great music, or dance on their smooth dance floor. Bring your own beverages. $15, and a discount for students and low income folks!"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Skerik Skerik ", "ArtistImage": "https://photos.bandsintown.com/thumb/6051336.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Punk, Jazz", "Time": "3:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "skerikmusic.com", "otherInfo": "2 nights April 17 and 18!!"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Weakened Friends ", "ArtistImage": "https://photos.bandsintown.com/thumb/9299716.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Its A Party And Were Crying About It", "Time": "3:00 AM UTC", "Venue": "The New Parish", "moreBioInfo": "100 or so miles north of Boston, you’ll find Portland, Maine. Among its many awesomely quirky attractions (beyond dope AF lobster rolls, of course), the mini-metropolis boasts the International Cryptozoology Museum and even served as the site of the nation’s first chewing gum factory. Suffice it to say, the town possesses all kinds of character and charm. It also makes perfect sense as HQ for Weakened Friends. Three alternative rock wiseasses and snack food connoisseurs, the trio—Sonia Sturino [vocals, guitar], Annie Hoffman [bass], and Cam Jones [drums]—first congregated in their adopted hometown during 2014. Sonia had recently relocated from Toronto and holed up in a house with Cam and a bunch of other dudes before witnessing Annie play live and asking her to join the band. As they released two independent EPs, Gloomy Tunes and Crushed, they stirred up a palpable buzz (between consuming sour spaghetti and causing trouble). Gigs followed with everyone from CHVRCHES and Silversun Pickups to Beach Slang and Juliana Hatfield as they made their 2017 debut at SXSW and earned praise from Vanyaland, CBS, If It’s Too Loud, and many more. A wiry, whimsical, and wild fusion of disarmingly pop hooks and fuzzed-out riffery that wouldn’t be out of place on the Reality Bites soundtrack or in a modern Brooklyn bar fueled this quiet rise. “If something is ear catching and interesting, I’m drawn to it,” says Sturino. “I love pop hooks, but I have this truly weird and shaky voice. I started to embrace that, and I think people connect to the sound.” For the uninitiated, they’ll definitely connect to the group’s 2017 single “Hate Mail” featuring J Mascis. On the track, a buzz of feedback slips into melodic guitar and an unshakable rhythm as the frontwoman captivates with the confessionally catchy refrain, “I hate everything you’re saying, get away from me. I hate everything we’re doing, it’s a waste of me.” It’s the perfect backdrop for an epic Mascis cameo. “It’s about when I was miserable in this other band,” recalls Sturino. “This is the most important thing to me. I don’t live comfortably. I don’t have a lot of money. I don’t have a lot of free time, because I’m putting all of my effort, passion, and self into music. So, it has to be the right situation. At the time, I just wasn’t working with the right team. The song is about those corrosive relationships with emotionally abusive assholes. J is a guitar god for indie rock. He’s an obvious inspiration, and he killed it.” “Hate Mail” hints at a lot more to come from Weakened Friends. For Sturino, the band brings everything full circle. In tow with her best friend Cam and wife Annie, she encodes a powerful message in the lyrics. “A lot of times, you hear expressions like, ‘Find your happy’,” she leaves off. “I think you should find yourself. Our music is about self-awareness and finding that. Sometimes, you’re having a shitty day. It can be hard, and that’s beautiful in its own way. In the North American mentality, if you’re depressed or sad, you have to just get rid of it. This is less about getting rid of that feeling and finding those things causing the feeling and dealing with them. It’s self-awareness, believing in yourself, finding yourself, and defining how you feel. That’s what this band is to me.” We're three tall young adults making some songs and eating some snacks. Indie noise junk band from Boston MA and Portland ME", "otherInfo": "No other event info available"}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Earles of Newtown ", "ArtistImage": "https://photos.bandsintown.com/thumb/9293079.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "No genre available", "Time": "4:00 AM UTC", "Venue": "Bottom Of the Hill", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "Wolf Jett ", "ArtistImage": "https://photos.bandsintown.com/thumb/9436665.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Santa Cruz, United States", "Time": "4:00 AM UTC", "Venue": "Cornerstone Craft Beer & Live Music", "moreBioInfo": "Street Gospel from Santa Cruz. Begun as a solo project by Chris Jones (Scary Little Friends). Down home soul mixed with country and folk blues influences, sung with the enthusiasm of a wild-eyed street preacher.", "otherInfo": "No other event info available"}, {"Address": "1460 First St., Napa, CA 94559", "Artist": "Ocean Natives ", "ArtistImage": "https://photos.bandsintown.com/thumb/10051588.jpeg", "Coordinates": [-122.289852, 38.297276], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Reggae, Rock", "Time": "4:00 AM UTC", "Venue": "JaM Cellars", "moreBioInfo": "Ocean Natives come from a small town of Ramona tucked away in the mountains of San Diego. We seek to unite like minds through the good vibes of California Reggae Music.", "otherInfo": "Cali Spring Tour 2020\nOcean Natives @ Jam Cellars Napa\n9pm-11pm"}, {"Address": "1453 Webster St, Alameda, CA 94501", "Artist": "Laura Benitez and the Heartache ", "ArtistImage": "https://photos.bandsintown.com/thumb/6295379.jpeg", "Coordinates": [-122.277118, 37.772994], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Honky-tonk, Country, Early Rock And Roll, Americana, Rockabilly, Classic Country", "Time": "4:00 AM UTC", "Venue": "The Fireside Lounge", "moreBioInfo": "Laura Benitez and the Heartache use the three chord tools of country music to tell the simple, unvarnished truth about love, too much whiskey, and the call of the road. On their new album, \"With All Its Thorns,\" they delve deeper into country music's tradition of storytelling with songs about betrayal (\"Secrets\"), murder (\"In Red\"), and grief (\"Ghostship\"), with a whole lot of heartbreak in between. Their twangy honesty shines through in straightforward arrangements, crystalline harmonies, and spare instrumentation. Beware their catchy hooks and sweet melodies - these stray puppy tunes will follow you home and become your most steadfast companions.\n\nLaura Benitez, songwriter, lead singer and founder of Laura Benitez and the Heartache, has been making her mark on stage and screen since 2000. She spent several years appearing in soap operas and commercials in Los Angeles before moving to the San Francisco Bay Area in 2004, diving into the region’s rich Americana and Roots music scenes. Taking her musical cues from the heavily rock influenced Bakersfield sound, and her lyric inspiration from her favorite songwriters Dolly Parton and Loretta Lynn, Laura began writing songs in 2008. She released her first album, \"For Duty or for Love\" on her own Copperhead Records label in 2010.\n\nIn 2012 she recruited the multi-talented singer, songwriter, and drummer Michele Kappel-Stone (Kirby Grips/Tippy Canoe/Heartache Sisters) into the band, and was lucky enough to secure the talents of Bob Spector (The Spectones) and Ted O'Connell (The GoldDiggers, Moonshine Maybelline) on twang guitar and bass. These four joined together with Ian Taylor Sutton (The Walcotts, Misisipi Mike, Secret Town) on pedal steel to record their critically acclaimed full length album, \"Heartless Woman,\" which was released in 2014.\n\n2015 saw the band touring to festivals in Southern California and Nashville, but also saw some changes in personnel, with Michele Kappel-Stone and Ted O'Connell turning their full-time attention to other projects. New members of The Heartache include Steve Pearson (Secret Town), Mike Anderson (77 El Deora), Jim Goodkind (Whiskey Pass), Patti Maxine (Island Breeze, Henhouse), and Chris Weinress (Mojo Mix).\n\nBenitez won an honorable mention for her as yet unpublished song, \"Our Remember Whens\" in American Songwriter Magazine's lyric contest for January of 2016. LB&H's critically acclaimed new album, \"With All Its Thorns\" is now available!", "otherInfo": "No other event info available"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Courtney Hartman ", "ArtistImage": "https://photos.bandsintown.com/thumb/8786393.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Folk", "Time": "4:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "Singer, songwriter, and guitarist Courtney Hartman started playing guitar at the young age of eight, after having already spent several years on the fiddle and mandolin. Her early years were spent steeped in American Roots music, and today she has fused a diverse range of influences from Norman Blake to Bill Frisell, creating music that acknowledges and pays homage to her roots, while pushing beyond its defined boundaries. Courtney left her native Colorado for Boston, where she studied in the American Roots Music program at Berklee College of Music. It was there that she joined Della Mae, and began to grow as a songwriter, contributing songs to the group’s second and third albums. Her solid rhythm playing and melodic improvisations has brought her accolades from the guitar oriented press. She appeared on the cover of Acoustic Guitar’s 2014 30 under 30 issue where her flatpicking prowess was lauded as “Staggeringly good” by the editors and the Fretboard Journal heralded Courtney as “...easily one of the greatest flatpicking guitarist performing today.” Courtney now lives in Brooklyn and tours frequently, playing some two-hundred days a year, both at home in the states, and in countries as far off as Pakistan and Vietnam as part of the US State Department’s Music Exchange program; an experience that has had a profound impact not only on her music, but her world view. Her literary songwriting is filled with stories about changing relationships, life on the road, and—implausibly enough—a song that finds beauty and longing in jet lag. In addition to her solo work and touring with Della Mae, Courtney has worked with a range of musicians including Tom Petty and the Heartbreaker’s Mike Campbell, Buffy St. Marie and Hot Rize’s Bryan Sutton. Courtney released her solo EP, Nothing We Say, in September 2016. Courtney Hartman is a guitarist, singer and writer from Colorado, She currently makes her home in Brooklyn, NY and tours solo and in the band, Della Mae.", "otherInfo": "No other event info available"}, {"Address": "243 O’Farrel Street, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Cabaret, Broadway, Cover Songs, Singer Songwriter", "Time": "4:00 AM UTC", "Venue": "Johnny Foley's Dueling Piano Show", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs.\n?\nHis theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City.\n?\nHe is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page.\n?", "otherInfo": "Dueling Piano Show (21+)"}, {"Address": "349 S 1st St, San Jose, CA 95113", "Artist": "SOLE channel Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/10179781.jpeg", "Coordinates": [-121.88716, 37.33144], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Deep House, Soulful Deep House, Tech House, Edm Dance, House, Afro House, House Music, Edm", "Time": "4:00 AM UTC", "Venue": "The Continental Bar Lounge & Patio", "moreBioInfo": "SOLE channel Music initially began as a weekly Saturday night party in NYC called SOLE Channel.\nThe mission was to create an atmosphere around deep dance grooves and present it to a younger\ngeneration of club heads.\n\nWith so much love and support from many Dj’s, Producers & Fans Mr. V knew\nthe time was right to create his own imprint to showcase\nhis ability as a producer and songwriter as well as breathe fresh ideas into underground music.\nConcentrating on the label's unique sound Mr. V says\n\"When I think of SOLE Channel Music I think of a label with vision and direction. The label's sound is\ndefinitely headed in the right direction.....THE FUTURE\".\n\nArmed with fresh sounds, new ideas and\nexciting musical collaborations with some of today’s hottest Dj’s, Producers & Artist, SOLE Channel\nis more than just a label with a copy and paste formula. It is innovative, on-point and forward thinking.\nLadies and Gentlemen, welcome to SOLE Channel Music.", "otherInfo": "Sole Channel Events presents Bring Down The Walls, A House Music event that highlights the past & present of House Music mixed by Producer, Remixer Mr. V"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Stanton Moore ", "ArtistImage": "https://photos.bandsintown.com/thumb/7999914.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Jazz, Funk", "Time": "4:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Born and raised in New Orleans, Stanton Moore is a dedicated drummer and performer especially connected to the city, its culture and collaborative spirit. Driven and inspired by the thriving music scene of his hometown which includes such greats as Professor Longhair, Doctor John and The Meters, Moore’s name is now mentioned amongst these Big Easy mainstays.\n\nIn the early ‘90s, Moore helped found the New Orleans-based essential funk band Galactic. Their first album, 1996’s widely acclaimed Coolin’ Off, led to an intense tour schedule of nearly 200 gigs a year for the next ten years. Building on their fan base by adding an esteemed list of all-star collaborations to the six albums that followed, Galactic continues to amass a worldwide audience via recording and touring globally.\n\nMoore launched his solo career in 1998 aided by eight-string guitar virtuoso Charlie Hunter and saxophonist Skerik (Les Claypool, John Scofield, Roger Waters). The group recorded All Kooked Out! featuring a handful of local New Orleans musicians as well.\n\nIn the midst of these recording sessions yet another concept was taking shape. Outtakes turned into the first Garage a Trois release, Mysteryfunk (1999). In 2000 the trio, led by Moore behind the drum kit, was joined by percussionist Mike Dillon (Les Claypool, Ani DiFranco) and has since released three more albums – Emphasizer in 2003, Outre Mer in 2005 and Power Patriot in 2009.\n\nMoore extended his solo discography with the release of Flyin’ the Koop (Verve/Blue Thumb) in 2001, and III (Telarc) in 2006. Following the latter Modern Drummer called Moore’s trademark sound “infectious, jazz-meets-Bonham, nouveau second-line.” Recorded at the legendary Preservation Hall in New Orleans, III featured organist Robert Walter (Greyboy Allstars, The Head Hunters) and guitarist Will Bernard (T.J. Kirk, Doctor Lonnie Smith) as the Stanton Moore Trio, with special guests Skerik and trombonist Mark Mullins (Galactic, Bonerama, Harry Connick, Jr., Better Than Ezra).\n\nIn 2008, Moore looked to continue his scaled back session crew with Walter and Bernard to record Emphasis! (on parenthesis). Says Moore, “When it came time to do another record, I had already known for a while that I wanted to build on the momentum of this band – three musicians who were becoming a unit unto themselves – and I wanted to get a little more adventurous with the music itself.”\n\nIn April 2010, Moore releases Groove Alchemy. The 12-track set is the culmination of Moore’s multimedia project that also includes an instructional book and DVD of the same name. All three facets of the project are designed to explore the roots of funk drumming by examining the work of pioneers like Jabo Starks, Clyde Stubblefield, and Zigaboo Modeliste – each of whom made their mark at different times throughout the 1960s as the engines driving James Brown’s and the Meters’ legendary rhythm sections – and in turn tracing their influences back to the rhythms coming out of New Orleans in the earlier part of the 20th century. Recorded at Levon Helm’s studio in Woodstock, NY, this project is the follow up to the widely acclaimed Take it to the Street DVD and book that focused specifically on New Orleans drumming styles.\n\nShowing his outstanding versatility, Moore has appeared on Heavy Metal Grammy nominees Corrosion of Conformity’s In the Arms of God, Irma Thomas’ After the Rain (winning a grammy in the process), Robert Walter’s Super Heavy Organ, Tom Morello (Rage Against the Machine) and Boots Riley’s (the Coup) Street Sweeper Social Club, Will BernarDiane Birch’s Bible Belt, Alec Ounsworth’s (Clap Your Hands Say Yeah) Mo Beauty. He continues to play dates globally with an ever-evolving cast of musicians including John Scofield; Karl Denson; George Porter, Jr., and Leo Nocentelli (of the Meters); Charlie Hunter; Warren Haynes; John Medeski and Chris Wood (of Medeski, Martin and Wood); Donald Harrison Jr.; Dr. Lonnie Smith, Dr. John, Tab Benoit, Robert Walter; the New Orleans Klezmer All-Stars and the Preservation Hall Jazz Band to name a few.\n\nWith a bachelor’s degree in music and business from Loyola University, Moore stays involved in education by constantly giving clinics and teaching master classes and private lessons all over the world. He has been a contributing writer for Drum!, Modern Drummer, and DownBeat magazines here he was featured on the covers of more than six drum publications. In 2005, he launched a signature line of cymbals with Bosphorus Cymbals and a signature drumstick with the Vic Firth stick company. In 2009, Moore developed his own drum company to introduce his signature titanium snare drum that he designed in conjunction with Ronn Dunnett.\n\nDeeply affected by Katrina and its aftermath, New Orleans’ native son was quick to lend a hand by spearheaded the Tipitina’s Music Workshop, free Sunday seminars that cater to children and a rotating cast of well-known professionals to promote the preservation of New Orleans music. He also set up the Staletta Fund, a scholarship started by he and his wife Aletta to help cover costs for aspiring students to attend jazz camps, auditions and further their education.\n\nMoore stays active as a spokesperson for the Gulf Restoration Network and is a regular proponent of and player with the Voice of the Wetlands All-Stars. Additionally he serves on the board of directors for the Roots of Music, a free music education and academic mentoring program founded by Derrick Tabb, drummer for Rebirth Brass Band and recent nominee for CNN’s Heroes awards.\n\nGalactic’s next record Ya-ka-may was released February 2010, and Moore steps into the role of producer on Anders Osborne’s next record due out in April.", "otherInfo": "General Admission. All ages."}, {"Address": "349 S 1st St, San Jose, CA 95113", "Artist": "Mr. V ", "ArtistImage": "https://photos.bandsintown.com/thumb/10180961.jpeg", "Coordinates": [-121.88716, 37.33144], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Electronic, House Music, Edm", "Time": "4:00 AM UTC", "Venue": "The Continental Bar Lounge & Patio", "moreBioInfo": "Experiencing Mr. V’s DJ sets, original productions, or remixes is like taking a trip back in time to dance music’s golden age. Before superstar DJs took over the spotlight, dance music was a cultural phenomenon that did what no other form of music could do – bring people together. It didn’t matter what race or sexual orientation you came from because dance music was all about embracing our differences and creating a homogeneous vibe.", "otherInfo": "Sole Channel Events presents Bring Down The Walls, A House Music event that highlights the past & present of House Music mixed by Producer, Remixer Mr. V"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Soul Mechanix ", "ArtistImage": "https://photos.bandsintown.com/thumb/7069265.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "David Crenshaw, Funkmaster Fred White and Sundra Manning., Aaron Green, Aaron Saul, Femi Andrades, Dante McClinton, Vernon Hall, Rich Aguon, Ray Clement, David Goodlett, oMega, LJ Holoman, Viveca Hawkins, Mike Blankenship, Soul Mechanix features some of the top musicians in the Bay Area including Luq Frank, Ruth Price, Maya Kronfeld, Colin Hogan, Ronnie Smith", "Time": "4:30 AM UTC", "Venue": "Yoshi's Oakland", "moreBioInfo": "Soul Mechanix blends groove-based Soul improv and progressive Funk drawing from a diverse universe of influences. Born from a fire to create something funky and unpredictable, Soul & Funk covers and originals are thrown down without pause including songs from Michael, Marvin, Stevie, Chaka, Erykah, Donny, Aretha, Bill Withers, Bobby Brown, Blackstreet. Maxwell, Jill Scott, Mary J. Blige, Maze, Cameo, Funkadelic, Parliament, James Brown, Roberta Flack, Rick James, The Time, O’Jays, Slave, Ohio Players, Commodores and more.\n\n~ What better way to get at the Mechanix of the soul than through music? ~\n\nPeace Love & Respect,\nGraal", "otherInfo": "No other event info available"}, {"Address": "1410 Old County Rd, Belmont, CA 94002", "Artist": "TinMan ", "ArtistImage": "https://photos.bandsintown.com/thumb/8120491.jpeg", "Coordinates": [-122.270236, 37.516673], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "70s Rock Music, 80s Rock, Classic Rock, Rock N Roll", "Time": "4:30 AM UTC", "Venue": "St. James Gate Bar and Restaurant", "moreBioInfo": "CHRISTIAN LEE SWAIN\n\nlead vocals, guitar\n\nRoots: Los Angeles, CA\n\nBeen doing this since…he was a\ntransplant high school kid lookin’\nto reinvent himself\n\nInfluences: Jagger, Bowie, Gabriel and Mercury\n\nRocked the 80′s LA scene with the best of ‘em and lived\n\n\n\n“PHILLY” BILL WEIR\n\nbass guitar, vocals\n\nRoots: Philadelphia, PA\n\nBeen doing this since…high school daze back East – rock bands and touring with Blues Award Winner Mike Dugan, then West with Lara Price, Dave Hull, and Nichole Cheri along the way…\n\nInfluences: Jack Bruce, Tim Bogert, Willie’s Dixon and Weeks, Tommy Shannon, Nathan East, James Jamerson\n\n\n\n“GYPSY” JACK VANBREEN\n\nlead guitar, vocals\n\nRoots: San Jose, CA\n\nBeen doing this since…longer than most of you’ve been breathin’!\n\nHas crossed musical paths with local faves like the Doobies, Tower of Power, and Sons of Champlin\n\n\n\nBOBBY SCHUSTER\n\nkeys, vocals\n\nRoots: Evansville, IN\n\nBeen doing this since….had no choice, four generations of Schuster men were musicians!\n\nInfluences: Hancock, Corea, Jimmy Smith, Chuck Leavell, Jan Hammer and Keith Emerson\n\n\nJOEY “BIG FOOT” CONIGLIO\n\ndrums / percussion\n\nRoots: pittsburg, CA\n\nBeen doing this since….banging pots and pans at age 4 to Sicilian folk songs…..\nGrew up to be an area first call drummer – sharing the stage with Greg Kihn, Y&T, the Fixx, Eric Martin, and Ronnie Montrose.\nInfluences: John Bonham, Keith Moon, Neil Peart, Mike’s Portnoy and Mangini.", "otherInfo": "No other event info available"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "Barrio Manouche ", "ArtistImage": "https://photos.bandsintown.com/thumb/9036629.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Javi Jiménez ~ Lead Guitar & Vocals, Cyril Guiraud ~ Tenor Sax, Emaye Ama Mizani ~ AfroBrazilian Dance, Gary Johnson ~ Upright Bass, Luis Jiménez ~ Cajón & Percussions, Alex Zelnick ~ Rhythm Guitar, Magali Sanscartier ~ Violin & Vocals, Fanny Ara ~ Flamenco Dance", "Time": "5:00 AM UTC", "Venue": "Club Deluxe", "moreBioInfo": "Barrio Manouche is a jaw dropping perfect blend of Flamenco, Gypsy Jazz, and more. With members from Spain, Quebec, France, Brazil and California, this San Francisco based septet draws on their roots, combining complex techniques and innovative style into a visual and auditory feast that is pure magic!\nWith latest collaborations including French Flamenco dancer Fanny Ara, African sacred dance Brazilian dancer Emaye Ama Mizani, as well as Colombian singer Iván Rondón, Barrio Manouche plays what is perhaps the truest definition of World Music.\nBarrio Manouche is taking their audience on a magical journey, with a unique fusion of cultures and musical backgrounds, an auditory and visual feast like no other.", "otherInfo": "The San Francisco-based acoustic ensemble performs a repertoire of original compositions with an emotionally charged sound that is difficult to classify yet instantly recognizable. The group’s international roots shine brightly in their music with members from Spain, Quebec, France, Brazil and California and is deeply influenced by a wide range of musical traditions. Barrio Manouche has been recognized for its surprise concerts, innovative style, complex technique, and its passion for musical improvisations. With latest collaborations including French Flamenco dancer Fanny Ara, African sacred dance Brazilian dancer Emaye Ama Mizani, as well as Colombian singer Iván Rondón, Barrio Manouche plays what is perhaps the truest definition of World Music. Barrio Manouche is taking their audience on a magical journey, with a unique fusion of cultures and musical backgrounds, an auditory and visual feast like no other.\n\n“Barrio Manouche makes magical acoustic music mashed together from all corners of the globe — a new form of Americana, if you will, where flamenco guitar drifts above Brazilian beats, clashing with Gypsy-jazz melodies. It could very well qualify as Americana in another decade or two. Or maybe its rich, gorgeous blend of acoustic Latin-French jazz will always remain distinctly Barrio Manouche.” — Aaron Carnes\n\nBARRIO MANOUCHE is:\n\nJavi Jiménez - guitar and vocals, Alex Zelnick - guitar, Luis Jiménez - cajón and percussions, Gary Johnson - bass, Cyril Guiraud - saxophones and caxixi , Magali Sanscartier - violin, vocals and percussions, Fanny Ara - dance, palmas, castanets and vocals, Emaye Ama Mizani - dance and percussions"}, {"Address": "1628 Webster St, Oakland, CA 94612", "Artist": "Leighann Lord ", "ArtistImage": "https://photos.bandsintown.com/thumb/10225022.jpeg", "Coordinates": [-122.267487, 37.805321], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Standup Comedy", "Time": "5:00 AM UTC", "Venue": "Comedy Oakland", "moreBioInfo": "Leighann Lord has appeared on ABC, NBC, Lifetime, VH-1, HBO, Comedy Central, and is a former co-host of StarTalk Radio, with Neil de Grasse Tyson. She was a national finalist in the ABFF-HBO Comedy Wings Competition and she received the 2019 Humanist Arts Award. She is the author of several humor books including: Dict Jokes and Real Women Do it Standing Up. Her DryBar Comedy Special will be out this Summer.", "otherInfo": "Comedy Oakland Online has an AMAZING lineup of comedians from around the country. In addition to our Comedy Oakland team, we will be joined by Leighann Lord, Shanti Charan and Laurie Kilmartin.\n\nNo matter where you are sheltering in place, this is the show you should see. For information on the show, go to ComedyOakland.com.\nSpace is limited. Only the first 100 get in. Virtual doors open at 6:45 pm.\n\nSee you all on Saturday."}, {"Address": "144 Taylor St, San Francisco, CA 94102", "Artist": "Kevin Conness Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8258706.jpeg", "Coordinates": [-122.41066, 37.783936], "Date": "Sat Apr 18 2020", "EventDate": "2020-04-18", "Genre": "Kevin Conness - Guitar Vox, Jason Braatz - Bass, Vox, Blake Ritterman - Drums, Julien Kent -Keyboards, Kelyn Crapp - Lead Guitar", "Time": "5:00 AM UTC", "Venue": "PianoFight", "moreBioInfo": "Based in San Francisco, the Kevin Conness Band, formed in 2016, is comprised of experienced musicians inspired by each other and their shared drive to put soulful original music out into the world.\n\nKevin Conness fronts the band with lead vocals and guitar, joined by Jason Braatz (bass and vox), Blake Ritterman (drums), Julien Kent (keys), and Kelyn Crapp (lead guitar).", "otherInfo": "21+"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9973807.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "No genre available", "Time": "7:00 PM UTC", "Venue": "Second Life - .Oooze @.GIN City - Sensation Sundays", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "http://maps.secondlife.com/secondlife/Moon Bright/108/128/1240"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "The Musers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8182687.jpeg", "Coordinates": [-122.822691, 38.40115], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Sebastopol, California", "Time": "9:00 PM UTC", "Venue": "Hopmonk Tavern", "moreBioInfo": "Free Range folk from Sonoma County\nThe Musers are Anita Bear Sandwina, and Megan McLaughlin both Multi-instrumentalists and award winning song-writers, accompanied by Tom Kuhn on stand up Bass. The Musers make joyful music where ever they go. Sometimes with a funky groove, sometimes with tender acoustic sensibility. Either way their hand crafted songs are delivered with a sister-like harmony blend and heart felt sass. Home grown in Sebastopol Ca.", "otherInfo": "The Bohemian Highway play a set and invite another band to play a set. The ambience is chill. The food and beer fantastic. Come and hang and sing with some local favorites. 2PM to 5PM. All ages. Dogs welcome!"}, {"Address": "24 Barrett Ave, Richmond, CA 94801", "Artist": "Sevin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9957461.jpeg", "Coordinates": [-122.367521, 37.938423], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Rap, Hip-hop", "Time": "10:00 PM UTC", "Venue": "Richmond", "moreBioInfo": "Sevin emerged on the scene at age 17 with his debut Gospel Rap album “All or None”. This was a very powerful nationwide release and is still available on shelves in many Christian book and record stores today.\n\nImmediately after the release of the album Sevin began touring and ministering the Gospel through Rap music. In his time he has traveled on a European Tour, which included ministering in London, Belgium, Canada and other places including Jamaica as well as all across the United States. He specialized in bringing the gospel to the youth on the streets that might not have the message of Jesus Christ but through rap music.\n\nHe has ministered along side some of the great names in Gospel music including, Kirk Franklin, The Kenoly Brothers, The Gospel Gangstaz, and many more. Over the years Sevin has evolved from the new kid on the West Coast block to the well-seasoned lyrical giant he is today. After the release of “All or None”, Sevin continued dropping more anointed albums about real life issues and his journey and relationship with Christ.\n\nAll of Sevin’s music is grim and graphic in nature, but nevertheless upholds a very heavy evangelistic overtone. This is rap for people that are lost in the streets and are looking for another way out. Sevin’s style and lyrical genius is already having him ranked with the likes of rap greats such as Scarface and the legendary 2Pac.\n\nSevin also is the founder of HOG MOB ministries.\n\nHOG MOB is an acronym that stands for: “HOOK’D ON GOD-MINISTRY OVA BIZNESS”. What this basically means is, we addictively desire and actively pursue a relationship with the one true and living God. We also choose to live a life that serves his purpose not our own.\n\nHOG MOB is about Kingdom Business...infiltrating our urban communities and seeing change in lives thru our Lord Jesus Christ.", "otherInfo": "Come out and join us as we minister to a community that needs the love of GOD!\n\nDont be late! ... the prayer walk will start on time!"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "Moonalice ", "ArtistImage": "https://photos.bandsintown.com/thumb/9669055.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Jam Bands, Jam Rock, Rock, Blues", "Time": "10:30 PM UTC", "Venue": "Terrapin Crossroads", "moreBioInfo": "Moonalice is a psychedelic, roots-rock band of seasoned musicians mixing a variety of genres with extended musical improvisations that evoke a sense of adventure and exploration. Everyone is a part of the experience and the music inspires dancing and other acts of self expression. Every show has an original art poster created by a well-known artist memorializing that event and given to all attendees…each poster has its own Moonalice legend. All concerts are broadcasted live in HD and available in archive shortly after their set.\n\nMoonalice plays mostly original material mixed with several covers, and during their extended freeform jams the band moves as one, drawing from many musical genres honed from years of experience playing with various major acts. Their single \"It's 4:20 Somewhere\" has been downloaded over 6 million times. Just released: 420 Gathering of the Tribe by Jay Blakesberg and Alex Fischer – a short film about the Moonalice posters and poster artists: http://www.moonalice.com/song/its-420-somewhere. Social media: nearly 424,000 on Facebook & over 67,000 on Twitter. Their extensive tour schedule and videos of every Moonalice show can be seen at moonalice.com and every show poster with legends can be viewed at moonaliceposters.com.\n\nBand\n\nDylan Chambers: Vocals, Cowbell (Midnight Transit, The New Chambers Brothers)\n\nLester Chambers: Vocals, Harmonica (Chambers Brothers, The New Chambers Brothers)\n\nJason Crosby: Keyboards (Phil Lesh, Terrapin Family Band, Jenny Lewis, John McLaughlin, Robert Randolph, Blind Boys of Alabama, Susan Tedeschi)\n\nRoger McNamee: Rhythm Guitar, Vocals, Bass. (Guff, The Engineers, Random Axes, Flying Other Brothers)\n\nJohn Molo: Drums, Vocals. (Bruce Hornsby & The Range, John Fogerty, Phil Lesh & Friends, The Other Ones, David Nelson Band).\n\nPete Sears: Bass, Keyboards, Guitar, Vocals (Sam Gopal Dream, Rod Stewart, Jefferson Starship, Jerry Garcia, Hot Tuna, John Lee Hooker, David Nelson Band, Phil Lesh & Friends).\n\nBarry Sless: Lead Guitar, Pedal Steel Guitar, Bass. (Phil Lesh & Friends, David Nelson Band, Kingfish, Cowboy Jazz).\n\nChloe Tietjen: Vocals (T Sisters)\n\nErika Tietjen: Vocals, Guitar (T Sisters)\n\nRachel Tietjen: Vocals, Guitar (T Sisters)\n\nFun facts\n\nMoonalice’s first show was in May, 2007.\nMoonalice’s single, “It’s 4:20 Somewhere” has been downloaded more than 5 million times.\nMoonalice invented the Twittercast concert, broadcasting links in near real time for live concerts and at random times for past shows. The band has done 103 Twittercast concerts.\nMoonalice is the first band to Mooncast live video of all of its concerts. Moonalice has broadcast nearly ever concert since 2010, the first band to operate a satellite-based broadcast system that enables High Definition live video to smartphones and iPads WITHOUT an app!", "otherInfo": "No other event info available"}, {"Address": "1280 N McDowell Blvd, Petaluma, CA 94954", "Artist": "Wolf Jett ", "ArtistImage": "https://photos.bandsintown.com/thumb/9436665.jpeg", "Coordinates": [-122.661783, 38.272428], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Santa Cruz, United States", "Time": "11:20 PM UTC", "Venue": "Lagunitas Brewing Company", "moreBioInfo": "Street Gospel from Santa Cruz. Begun as a solo project by Chris Jones (Scary Little Friends). Down home soul mixed with country and folk blues influences, sung with the enthusiasm of a wild-eyed street preacher.", "otherInfo": "No other event info available"}, {"Address": "652 Polk St, San Francisco, CA 94102", "Artist": "Gaucho ", "ArtistImage": "https://photos.bandsintown.com/thumb/7519822.jpeg", "Coordinates": [-122.41887, 37.782905], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Steve Apple-drums, Rob Reich-accordion, booking agent: Dave Ricketts, Leon Oakley-horns, Dave Ricketts-bandleader/guitar/vocals/songwriter, Craig Ventresco-guitar, Ari Munkres-bass", "Time": "12:00 AM UTC", "Venue": "Brenda's French Soul Food", "moreBioInfo": "Gaucho is a masterful Bay Area band that combines the influence of gypsy jazz of 1930’s Europe with the rhythmic drive and collective improvisation of New Orleans swing music, gutbucket blues and elements of ragtime. Their sound, a uniquely American concoction, blends instrumental acuity and lighthearted humor that keep their audience coming back for more. As founder, guitarist, and main composer Dave Ricketts says, the band is “in love with the music of Louis Armstrong, Fats Waller and Jimmie Rodgers, as well as the stories, the life styles and the foot steps of hundreds of other great jazz, blues, country and rock musicians that created the sound of American Music from roughly 1900-1950’s”\n\nLed by eminent guitarist, Dave Ricketts, the group has been a San Francisco mainstay for over fifteen years, and one of the busiest bands in the bay area playing 5 to 10 gigs a week. Together with virtuosos Rob Reich–accordion and Craig Venetresco–guitar, superlative bassist Ari Munkres and versatile percussionist Steve Apple, these guys keep crowds moving with their beats and complex rhythms.\n\nGaucho has recorded seven albums, tours regularly, and has an increasing repertoire of over forty original tunes. Seven of their tunes are featured in the 2012 film \"Trattoria\"; one was chosen by the Metropolitan Museum of Art for their website; and another is featured in the outtakes section of the Pixar DVD CARS 2.", "otherInfo": "Gaucho at Brenda's French Soul Food: Brenda Buenviaje's Creole-inspired restaurant in the Tenderloin is twice the size it used to be, the decor as monochromatic and still as the old space was color-soused and cluttered. But the legendary brunch lines at Brenda's French Soul Food have not abated, nor has the reputation of Buenviaje's biscuits, chocolate-filled beignets, po-boys, and shrimp and grits. At dinner, the old favorites are tasting a little tired. The barbecued oysters, however, are alternately fiery and creamy, and the banana-bread pudding is so rich you'll have to devour it in microscopic spoonfuls. Always worth ordering: the wall specials, wich range from crawfish Monica to muffaletta."}, {"Address": "Mill Valley, CA", "Artist": "Forest Sun ", "ArtistImage": "https://photos.bandsintown.com/thumb/9161674.jpeg", "Coordinates": [-122.545, 37.906], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Americana, Folk", "Time": "1:00 AM UTC", "Venue": "Private Concert", "moreBioInfo": "Born in upstate New York to folksinging back-to-the-land hippie parents (Forest’s dad literally built the floor that Bob Dylan stood on at manager Albert Grossman’s Bearsville studios in Woodstock, NY. His mom heard Pete Seeger and Joan Baez play in her uncles living room in Boston and dated one of the Chambers Brothers before she met his dad), weaned on a diet of Jackson Browne and Toots and the Maytals, some of Forest’s earliest memories are of his dad playing “Poncho and Lefty” by Townes Van Zandt and his mom singing Elizabeth Cotton’s “Freight Train”. Forest wrote songs with Rory Block when he was six years old, learned to juggle from WavyGravy when he was 9, and studied drumming with the late African master percussionist Babatunde Olatunji as a teenager. In college he played in a band with SNL star Maya Rudolph. They opened for No Doubt at the Catalyst in Santa Cruz before Forest left to study art in Spain.\n\nA pioneer of the DIY movement in 1999 he recorded his first record in his bedroom in San Francisco with bassist Seth Ford Young (Tom Waits, Edward Sharpe) and toured Europe for the first time, including playing at the Rally on Dam Square in Amsterdam for the Tibetan Freedom Concert.\n\nHe’s played festivals from California (Strawberry Music Festival, American River Music Festival) to Europe (Belladrum in Scottland, Fiesta City in Belgium) and opened for such luminaries as Lyle Lovett, Bonnie Rait, Steve Earle, Keb Mo, Brett Dennen and the Beach Boys (Forest met famed Beach Boys producer Van Dyke Parks at festival porch jam and later swapped songs at his house in LA). Collaborations include the jam band scene (ALO -Animal Liberation Orchestra on Jack Johnson’s label) the bluegrass scene (Hot Buttered Rum), and indie folk artists like Jolie Holland and JT Nero from Birds Of Chicago. Forest’s songs mine his deep folk roots and embrace his love of gospel, reggae, Americana, country, soul, jazz and funk.\n\nSun’s music has appeared on Showtime and MTV and in several film scores and soundtracks. He has also had several cameo roles in independent cinema including playing a fireman in “Who's there?” directed by Cassie Jaye and premiering at Tallgrass Film Festival.\n\nHaving done two successful kickstarters Forest is putting out his music on Vinyl and releasing a new song each month this year.\n\nForest is also a visual artist and his original paintings and prints have been shown at the Sala Lola Anglada in Barcelona and the Marin Museum of Contemporary Art.\n\nForest resides in the Redwoods of Mill Valley, Ca when he is at home.\n\n“…a quiet joy in a raucous world.\" John Davy - No Depression\n\n\" ... stripped-back, slightly twangy evocative Americana set that is a delight from start to end.\" Maverick Magazine (UK)\n\n“... alt country, folk-rock jams, creating a hodgepodge of comparisons that ranged from Jack Johnson to Ryan Adams to David Gray. ...even into Bob Dylan territory ... a daunting place to tread, but pulled off with the grace of a musical veteran.” Jessica Small - Santa Barbara Independent", "otherInfo": "Private Concert\nMill Valley"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "Mission Hot Club ", "ArtistImage": "https://photos.bandsintown.com/thumb/10007471.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Jazz Manouche, Gypsy Jazz, Swing, Jazz", "Time": "1:00 AM UTC", "Venue": "Club Deluxe", "moreBioInfo": "Hailing from France, Belarus, Israel, Mexico, NYC, Alabama and Indiana, this hot club began playing together in the Mission District of San Francisco in 2018.\n\nTheir lineup brings the big sound of a full Gypsy Swing/Bal-musette group, including violin, clarinet, accordion, upright bass, and both nylon and steel string acoustic guitars!\n\nA core repertoire of lightning hot gypsy jazz evokes the ambience of a smoky Parisian café, complimented with sounds from neighboring acoustic genres including the Spanish, Irish, Balkan, New Orleans, and Klezmer traditions.", "otherInfo": "The atmosphere at Club Deluxe is reminiscent of an old time New York City jazz house. Red lights glow, the sounds of jazz and people talking waft through the air, and most of the patrons are decked out in their best vintage clothing."}, {"Address": "175 South Blvd, San Mateo, CA 94402", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-122.31158, 37.55456], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "2:00 AM UTC", "Venue": "Broken Horn Studios", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Meg Donnelly ", "ArtistImage": "https://photos.bandsintown.com/thumb/9989519.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "London,United Kingdom", "Time": "2:00 AM UTC", "Venue": "Cafe Du Nord", "moreBioInfo": "my debut album 'trust' OUT NOW ? https://unitedmasters.com/m/MegDonnellyTrust\n\nCurrently stars as \"Taylor Otto\" on ABC's American Housewife\nIn 2018, will star as \"Addison\" in the Disney Channel Original Movie musical - Disney \"Zombies\"\n\nBorn and raised in NY, this recently turned 19 year old singer / actress has quickly become the one to watch in Hollywood. Staring in 2018 as “Addison” in Disney’s original film ZOMBIES she discovered the power and reach that Disney has. The film broke viewing records and its Soundtrack which features Meg’s songs from the film, reach #4 on Billboard. The soundtracks video have over 350 million views on YouTube. Meg is returning for the sequel ZOMBIES 2 due out February 2020. Meg also stars on ABC’s hit prime time series American Housewife which is entering its 4th season. Her following on Instagram is over 1 million with strong engagement with every new post. An unusual fact about Meg is she speaks and can sing fluently in Japanese!", "otherInfo": "No other event info available"}, {"Address": "427 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "Cuchulain ", "ArtistImage": "https://photos.bandsintown.com/thumb/9112338.jpeg", "Coordinates": [-122.715214, 38.441851], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Country, Folk Rock, Jazz, Funk, Folk", "Time": "2:00 AM UTC", "Venue": "Lost Church Santa Rosa", "moreBioInfo": "Cuchulain (pronounced \"ka-HOO-lin\") is a singer-songwriter and multi-instrumentalist. The name (yes, his real, legal name, shared a character in Irish mythology) says as much about him as it does his music: unique, creative, lyrical, and story-driven. Cuchulain's tongue-in-cheek wit and activist spirit emerge from his carefully crafted lyrics, drawing comparisons to artists like John Prine, Randy Newman, and Johnny Cash. His self-titled debut album, released in 2017, has been most appreciated for its entrancing story-telling and rich and often surprising compositions, with more instruments than you can count, most of them played by Cuchulain himself. Cuchulain is rapidly developing a cross-country following, with experiences living and performing in places as disparate as Washington, DC, and San Francisco, California. His bass-baritone melodies will capture the attention of any listening room and leave them laughing and crying the whole way home.", "otherInfo": "No other event info available"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "Tom Freund Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8011284.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Something Good", "Time": "2:30 AM UTC", "Venue": "Mystic Theatre", "moreBioInfo": "“Tom Freund is indeed one of the great singer- songwriters. He constructs a unique world, defines it, and then burns it to the ground. Truly unique and absolutely brilliant.” –All Music Guide\n\nIt’s the ease with which he delivers conversational lyrics and honeyed melodies, a natural magic that is the soul of Tom Freund’s music. Though he’s widely-traveled in a variety of genres– from hearftelt folk to buoyant pop to boho jazz to straightforward rock ’n’ roll, and beyond –Freund is, simply put, a singer-songwriter with a defined and captivating presence.\n\n“Freund clearly delights in enigma. His vocals could go from laconic to impassioned without such obvious trickery as cranking up the volume. His lyrics are full of curveballs.” –Washington Post\n\nFreund’s latest disc “Two Moons” on Surf Road Records draws roots sources for an urbane Americana sound, melding nostalgia with a raw and sharp-eyed views of life today. “If Two Moons, with its underlying message of hope in this messy world of ours, serves as an inspiring, encouraging soundtrack for listeners, then I can say to myself, ‘ok, you’re doing something right for the people out there”, Freund says. He delivers this CD’s main message in the standout track “Lemme Be Who I Wanna Be,” in which he declares: “I’m basically hooked on this life/it’s got a lot of problems/but it treats me real right/and you don’t have to agree with me/but let me fly my freak flag.” This oddly upbeat anthem of personal empowerment so impressed Canadian rock star Serena Ryder that she asked to sing on it. The opening track “Angel Eyes,” featuring vocals by Ben Harper, serves as Freund’s take on Randy Newman’s “I Love L.A.” motif, expresses his appreciation to his Southern California friends for always having his back. Notes of nostalgia play into Tom’s self-declared favorite track “Mind of Your Own” which delves into a deeply personal memory of the New York native’s childhood home.\n\n“If you want to hear what California feels like, Tom Freund’s new album is a good place to start…” – Acoustic Guitar\n\nFreund spent the mid-’90s touring with the indie rock cult faves THE SILOS and has been releasing solo albums since 1998. Tom has alternated between recording and touring behind his own discs, playing upright bass, electric bass guitar, and mandolin with the likes of British pub-rock great Graham Parker (who hailed Freund as one of the best singer-songwriters operating today), pop star Mandy Moore, groove-soul sensation Brett Dennen, Rock ‘n Roll Hall of Famer Jackson Browne, and three-time Grammy winner Ben Harper. “What really brought me to wanting to work with Tom in the studio is his songs,” Harper concludes. “It doesn’t have to even go any further than that. As far as I’m concerned, who wouldn’t wanna work with him in the studio? Because the songs are there.”\n\n“Every year the mounting landfill of new releases that threatens to bury the working music journalists yields a few unexpected gems, and Tom Freund is one of them.”\n–New York Times\n\nMore recently, you can spot Freund playing with Parker in the Judd Apatow film, “This Is 40” and featured on the hit TV shows “Parenthood”, “American Gothic” and the recently premiered Pamela Adlon show “Better Things”. He continues to tour North America, Europe and Japan playing with his band or doing solo shows.\n\n“California-based troubadour Tom Freund sings of skate-boarding kids, impending doom and Happy Days lunch boxes on his new album, Two Moons.” —NPR WEEKEND EDITION http://bit.ly/1N1vuBI", "otherInfo": "No other event info available"}, {"Address": "427 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "Matt Jaffe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8945081.jpeg", "Coordinates": [-122.715214, 38.441851], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Indie Rock, Rock", "Time": "2:30 AM UTC", "Venue": "Lost Church Santa Rosa", "moreBioInfo": "Matt Jaffe is a 24 year old rock & roll singer/songwriter from San Francisco. Cutting his teeth on countless open mics around the Bay Area, Matt started taking music (a little bit) more seriously when Jerry Harrison of Talking Heads offered to produce his first record. Since then, Matt has continued to churn out more songs than he can remember the words to, oversaturate the market with gigs (opening and/or touring with the likes of Mavis Staples, Wilco, Jackie Greene, Melissa Etheridge, and Blues Traveler), and collaborate with Chuck Prophet and Tom Higgenson of the Plain White T's. Fresh off the release of his third LP, The Spirit Catches You, Matt Jaffe & Band are street-teaming with the best of them to bring rock & roll back to the masses.", "otherInfo": "No other event info available"}, {"Address": "2525 Telegraph Ave Suite B, Oakland, CA 94612", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/9903737.jpeg", "Coordinates": [-122.25809, 37.86462], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Comedy", "Time": "3:00 AM UTC", "Venue": "All Out Comedy Theater - Improv Shows & Classes", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No other event info available"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "Pacific Range ", "ArtistImage": "https://photos.bandsintown.com/thumb/8841651.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Folk, Country, Jam Bands, Blues", "Time": "3:00 AM UTC", "Venue": "Terrapin Crossroads", "moreBioInfo": "We are Americana/blues inspired rock group from LA county.", "otherInfo": "No other event info available"}, {"Address": "900 Marin St, San Francisco, CA 94124", "Artist": "Volo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8758108.jpeg", "Coordinates": [-122.386006, 37.749454], "Date": "Sun Apr 19 2020", "EventDate": "2020-04-19", "Genre": "Journey Music", "Time": "4:00 AM UTC", "Venue": "The Midway", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/10055883.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "No genre available", "Time": "5:00 PM UTC", "Venue": "Second Life - StarkStrom - Electric Monday", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "http://maps.secondlife.com/secondlife/Berthould Pass/131/130/2399"}, {"Address": "8440 Enterprise Way, Oakland, CA 94621", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-122.194035, 37.743899], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "9:00 PM UTC", "Venue": "Phytologie Wellness", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "1807 Telegraph Ave, Oakland, CA 94612", "Artist": "Jesse Royal ", "ArtistImage": "https://photos.bandsintown.com/thumb/9115183.jpeg", "Coordinates": [-122.27017, 37.80785], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Reggae", "Time": "2:00 AM UTC", "Venue": "Fox Theater", "moreBioInfo": "With popular mixtapes (In Comes The Small Axe and Royally Speaking), hit singles and now his debut album titled \"Lily of Da Valley\", Jesse Royal is establishing himself as one of the next reggae superstars to emerge from Jamaica. Jesse's reputation has been steadily building over the past half-decade. His versatile singjay style recalls some of the giants of reggae history, but Jesse’s diverse musical taste and restless artistic spirit have set him on a unique path that is helping propel the genre into new territory. Focusing on what has worked in recent years in the reggae scene – from the heavy touring, DIY-aesthetics of the U.S. reggae movement to the Sound System and bass culture influences of the U.K. scene – he’s ready to apply all his experiences along the way to his own journey. Jesse Royal’s time is now.\n\nJesse’s official debut album, Lily Of Da Valley, drops October 6, 2017, in partnership with the New York-based tastemaker label Easy Star Records. Written largely in conjunction with producer and mastermind Llamar “Riff Raff” Brown, who has contributed to a number of Grammy-winning and Grammy-nominated projects, the album represents where Jamaican music is right now, a seamless blending of classic roots with contemporary production and superb musicianship. New songs like “400 Years,” “Generation,” “Life’s Sweet,” and “Always Be Around,” will become staples of Jesse’s catalog, which includes earlier megahits like “Modern Day Judas” and “Finally.” These two gems have garnered a combined 10 million listens on streaming services worldwide so far and are included on the album along with the new songs.\n\nWith Easy Star, he joins an international family of bands that includes The Skints, Rebelution, The Black Seeds, The Green, Gentleman’s Dub Club, Easy Star All-Stars, The Expanders, John Brown’s Body, and other artists that are evolving reggae from New York to London to New Zealand to Hawaii and beyond. The rest of the team Jesse has assembled puts him in good company: he is managed by Lukes Morgan, of the Grammy-award winning reggae family Morgan Heritage, who in the past year helped break Raging Fyah on the scene en route to a Grammy nomination themselves. Cristy Barber, a trailblazer in reggae music who has helped the careers of Damian “Jr. Gong” Marley, Stephen Marley, Beenie Man, Buju Banton, SOJA and many others, is overseeing the marketing campaign. And his team in Jamaica includes his longtime friend Kareem “Remus” Burrell, the son of Fatis Burrell, of Xterminator, one of the most important producers/labels of the dancehall era, and an early mentor of Jesse’s.\n\nIn the lead up to Jesse’s first full length release, he has already been covered by major media outlets such as Vogue and Vice. He has worked closely with the Major Lazer team, releasing a popular mixtape with Walshy Fire, which resulted in his song “If I Give You My Love” being featured on their cartoon TV series via FXX Network. He has made music with Bad Brains and performed alongside the pioneering punk/reggae band at the Afropunk Festival. He has already toured extensively in the US, UK, and Europe, playing major festivals like Cali Roots, Boomtown Fair, Reggae On The River, and Rototom Sunsplash. He obviously thrives on the unconventional approach, while still keeping grounded in the history of reggae. That’s why he often bristles at being grouped into a movement being called “Reggae Revival” – because to Jesse, he is not reviving the past; he is firmly rooted in the here and now, with an eye on the future.", "otherInfo": "No other event info available"}, {"Address": "400 S 1st St, San Jose, CA 95113", "Artist": "Joyce Manor ", "ArtistImage": "https://photos.bandsintown.com/thumb/8780604.jpeg", "Coordinates": [-121.885544, 37.330047], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Punk, Alternative, Rock", "Time": "2:00 AM UTC", "Venue": "The Ritz", "moreBioInfo": "Booking - merrick@groundcontroltouring.com\n----\nJoyce Manor’s new album ‘Million Dollars To Kill Me’, is out September 21 via Epitaph Records. Pre-Order now at https://www.joyce-manor.com", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Tennyson ", "ArtistImage": "https://photos.bandsintown.com/thumb/8173981.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Electronic", "Time": "2:00 AM UTC", "Venue": "Rickshaw Stop", "moreBioInfo": "hi, we're luke and tess :) yourstru.ly/stories/tennyson", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Tennyson ", "ArtistImage": "https://photos.bandsintown.com/thumb/8173981.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Electronic", "Time": "2:00 AM UTC", "Venue": "Rickshaw Stop", "moreBioInfo": "hi, we're luke and tess :) yourstru.ly/stories/tennyson", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "Boostive ", "ArtistImage": "https://photos.bandsintown.com/thumb/8795244.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Hiphop, Reggae, Ambient, Soul, World, Triphop, Dub", "Time": "2:30 AM UTC", "Venue": "Cornerstone Craft Beer & Live Music", "moreBioInfo": "7-10 piece live band based out of Ocean Beach, San Diego. The group draws from early dub-reggae, instrumental hip-hop, soul, and world music to create their signature sound. Their Crisp Horn section backed by a heavy bass and drum pocket is sure to break your neck.\nFollow us on all social media platforms to stay informed on new releases and all things boostive. www.boostive.world", "otherInfo": "No other event info available"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "U.S. Girls ", "ArtistImage": "https://photos.bandsintown.com/thumb/8192301.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Pop, Experimental Pop", "Time": "3:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "U.S. Girls is American-born, Meg Remy’s musical moniker. The Toronto-based multidisciplinary artist's music traces a circuitous evolution. It encompasses unconventional, challenging sound work as prominently as her vocally-driven explorations of American pop mores (often on the same album). Since 2007, Remy has toured several times in Europe, Eastern Canada and the United States. She accompanies her hugely distinctive voice with innovative set-ups, including combinations of reel-to-reel players, tape decks, and samplers, as well as occasionally singing with a full band. Remy has released a clutch of original records on labels as diverse as Siltbreeze, Kraak, FatCat and her own Calico Corp. imprint. While her early Siltbreeze-released works, ‘Introducing…’ and ‘Go Grey’, explore the limits of 4-track fidelity, they also bear hallmarks of a budding melodic ear, and vocal cadences clearly born of constant exposure to oldies radio. Given this, it’s little surprise that subsequent U.S. Girls records, ‘U.S. Girls on Kraak’ and ‘Gem’ (both co-produced with Remy’s partner, Slim Twig), are works of unabashed pop art. The two albums brought Remy’s voice further into focus, while evincing a playful disregard for genre in splicing together styles as disparate as R n’ B, glam rock, and sound collage. Perhaps what’s most striking about the cumulative power of these records, when taken in combination with her concurrent collage and film work, is Remy’s consistent vision. Her exploration of feminist themes relating to abuse and gender inequality become more clearly defined, even as her sound appears to evolve toward a mainstream, pop idiom. Her narrative use of an ‘everywoman’ perspective in her lyrics forms something of a feminine counterpoint to Bruce Springsteen’s work. Through this prism, Remy’s project gains resonance as a form of social commentary; music with something truly at stake. U.S. Girls appears as wholly original, Meg Remy's fiercely independent, modern brand of art-based, American feminism. This site is not run by one U.S. Girl but is U.S. Girls approved.", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Matisyahu ", "ArtistImage": "https://photos.bandsintown.com/thumb/9383119.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Mon Apr 20 2020", "EventDate": "2020-04-20", "Genre": "Rock, Improvisation, Hip Hop, Reggae, Jam Bands", "Time": "3:30 AM UTC", "Venue": "The Cornerstone", "moreBioInfo": "When Matisyahu first started touring to packed clubs more than eleven years ago, it was prior to the release of Live at Stubbs, the now Gold record, and prior to that record’s single “King Without A Crown” reaching #1 on the alternative rock radio charts. His performances were a raw expression of his spirituality at that time and were supported by musicians who played a foundation of roots reggae augmented by the energy of a rock trio. Fans latched on quickly for a variety of reasons, but in August of 2005, just months after the release of Live at Stubbs, Matisyahu found himself on stage at the Bonnaroo Music and Arts Festival with the de facto leader of improvisational rock-n-roll; Phish’s front man Trey Anastasio.\n\n“King without a Crown” climbed the charts and Matisyahu’s follow up record Youth was nominated for a Grammy, but the blessings and curses of mainstream success each took root. While Matisyahu’s bands have always been comprised of serious multidimensional players who have artfully molded the foundations of roots reggae into many genres, that early; if only a brief display of complete surrender to the music, seemed in some way to take a back seat. Through his lyrics however, Matisyahu developed a more personal, artistic, and sophisticated way to express the yearning for deep spiritual meaning, and as his own beliefs opened up to find more variety and depth, the desire for his performances to match the unpredictable flow of life developed as well.\n\nNow, more than a decade later, Matisyahu has formed a band that truly gives itself over to the music on par with his lyrical desire to connect to something beyond the self. The band features original Stubbs guitarist and longtime staple of the downtown New York improv scene Aaron Dugan, Jason Fraticelli on bass, Jason Lindner on keyboards, and Matt Scarano on drums .", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $40 Adv & $44 Day of Show"}]