var sf_events = [{"Address": "1111 Solano Ave, Albany, CA 94706", "Artist": "George Cole ", "ArtistImage": "https://photos.bandsintown.com/thumb/8682442.jpeg", "Coordinates": [-122.298349, 37.890478], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Gypsy Jazz, American Song, Performer, Acoustic Guitar, Acoustic, Composer Songbook, Guitar Virtuoso, Consumate Entertainer", "Time": "6:30 PM", "Venue": "Rendez-Vous Café Bistro", "moreBioInfo": "GEORGE COLE: Singer and breakneck acoustic guitarist George Cole inhabits a musical world all his own.... a world in which Django Reinhardt, The Ramones, Nat King Cole and Doc Watson get equal billing with Irving Berlin, George Gershwin, Willie Nelson and the Great American Songbook. Cole currently occupies the guitar chair for the David Grisman Quintet and has 2 releases on Grisman’s highly regarded Acoustic Disc Label. George was guitar teacher and mentor to Rock and Roll Hall of Fame Inductees Billie Joe Armstrong and Mike Dirnt of Green Day for 10 years in the East Bay. Cole, a San Francisco native and BAMMIE award winner brings an expertise to his guitar playing and singing that is filtered through Rock and Roll, Gypsy Jazz and All things American. The music he makes brings to mind the old adage “Everything Old Is New Again”. David Grisman tapped Cole to play on his most recent Sextet record and Cole in turn featured Grisman on his release “George Cole Live”. Jazz legend Keely Smith handpicked Cole to play guitar and sing duets with her on her last tour. Chris Isaak also had Cole lay down guitar tracks on his platinum selling Forever Blue release. Cole is currently performing at festivals, performing arts centers, top nightclubs, and vintage theaters. www.GEORGECOLE.net\nwww.georgecole.net", "otherInfo": "AS OF MARCH 17 POSTPONED UNTIL FURTHER NOTICE\n(\"and they were singing, bye-bye miss American pie, drove my chevy to the levy but the levy was dry...\")\nBy popular demand, the anticipated return of George Cole's San Francisco Guitar Trio with George Cole, Tony Darren, and Nick Koutsoukis.\nHands down, best thing to do on a Tuesday night in the EastBay, join those 'in the know' to enjoy George Cole’s amazing, world class music, and superb french cuisine at Rendez-Vous Café Bistro Tuesday 6:30-8:30"}, {"Address": "Berkeley, CA", "Artist": "George Kahumoku Jr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10268244.jpeg", "Coordinates": [-122.2729, 37.8708], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Hawaiian, Acoustic, Folk, World Music", "Time": "7:00 PM", "Venue": "Mainland", "moreBioInfo": "George is a 4-time Grammy Award winning Hawaiian guitarist who currently owns and hosts a weekly show on Maui called George Kahumoku Jr's SLACK KEY SHOW - Masters of Hawaiian Music. He is also a farmer, taro grower, sculptor, author, and the former director of UH Maui College's Institute of Hawaiian Music.", "otherInfo": "We are sorry to say our next few weeks of tour have been postponed until July 2020, I will update you with new dates as soon as possible."}, {"Address": "1 Hacker Way, Menlo Park, CA 94025", "Artist": "Mike Block ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440485.jpeg", "Coordinates": [-122.14462, 37.4762], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Facebook", "moreBioInfo": "MIKE BLOCK is a pioneering multi-style cellist, singer, composer, and educator, hailed by Yo-Yo Ma as the \"ideal musician of the 21st-Century\", and acclaimed by the NY Times for his \"vital rich-hued solo playing\". While still studying at the Juilliard School, Mike joined Yo-Yo Ma’s Silk Road Ensemble, with which he has toured extensively throughout the world, and won a 2017 Grammy Award for Best World Music Album. Mike is also an active recording artist of original material, folk music, cross-cultural collaborations, and he has an ongoing project to record all of the Bach cello suites in acoustically glorious bathrooms of famous concert halls, via BachInTheBathroom.com. As one of the first wave of cellists to adopt a strap in order to stand and move while playing, Mike was the first standing cellist to perform at Carnegie Hall, using a cello strap of his own design, called the Block Strap, a performance which the NY Times called \"Breathless ... Half dance, half dare.\"\n\nAs a music educator, Mike is passionate about emphasizing creativity and collaboration, leading to the founding of the Mike Block String Camp in 2010. MBSC provides players of all backgrounds the opportunity to learn from a world-class faculty in a variety of styles, and supports the exploration and development of the artistic voice of each student. Mike is also the founding Director of the Silkroad Global Musician Workshop, bringing together musicians from around the globe, and he created the online Multi-Style Cello School at ArtistWorks.com, with an extensive library of instructional videos. In 2012, Mike was appointed Associate Professor at the Berklee College of Music. Mike lives in Boston with his wife, fiddler Hanneke Cassel.\n\nMike has collaborated with a variety of diverse musicians and groups, such as Mark OConnor, Bobby McFerrin, The New York Philharmonic, Will.i.am, Edgar Meyer, Stevie Wonder, Darol Anger, Allison Krauss, Mike Marshall, Zakir Hussain, The National, Bon Iver, My Brightest Diamond, The Illinois Symphony, Rachel Barton Pine, Marcel Khaliffe, Goran Bregovic, Simone Dinnerstein, Dawn Upshaw, Anthony McGill, Tony Trishcka, Lenny Kravitz, Shakira, Joe Zawinul, Alasdair Fraser, Shujaat Khan, and many others.\n\nMike’s television and radio credits include \"Late Night with Conan O’Brian\", \"Regis and Kelly\", NBC’s 30 Rock, NPR’s \"St. Paul Sunday Morning\", WNYC’s \"Soundcheck\", APM’s \"Performance Today\", WNBC 4’s Chuck Scarborough Show, VH1, The Disney Channel, and the CBS \"Early Show\". When still living in New York City, Mike regularly subbed on Broadway as on-stage cellist for the Pulitzer Prize winning musical, \"Next to Normal\", and he also worked as Music Consultant on the 2012 film, \"A Late Quartet\". Mike was the subject of a 2011 feature article in the Wall Street Journal for his Artistic Directorship of the GALA BROOKLYN Music Festival, featuring cross-cultural collaborations among locally-based musicians.\n\nMike attended college at the Cleveland Institute of Music, where he studied cello with Richard Aaron, and received the Jim Hall Prize for Undergraduate Achievement. Mike also earned a Master’s Degree from the Juilliard School, where he studied with Darrett Adkins and Joel Krosnick. These days, Mike plays on a modern cello made in 2014 by Fabienne Gauchet, D’Addario strings, a David Gage Realist pickup, and the patented cello strap of his own design, The Block Strap.\nwww.MikeBlockMusic.com\nwww.GlobalMusicianWorkshop.com\nwww.MikeBlockStringCamp.com\nwww.CelloStrap.com\nwww.BachInTheBathroom.com\nwww.ArtistWorks.com/Cello", "otherInfo": "Live Stream: https://www.facebook.com/silkroadproject"}, {"Address": "2160 Shattuck Ave, Berkeley, CA 94704", "Artist": "Broakley Boiz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9066291.jpeg", "Coordinates": [-122.268468, 37.869772], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, Soul, Hip Hop, Everything, Funk", "Time": "5:00 PM", "Venue": "Berkeley Live! On The Plaza", "moreBioInfo": "B.BOIZ/B.GRRLZ-MAKE ART\nWE’RE A FAMILY DJ CREW FROM OAKLAND CA. WE DJ, THROW PARTIES, MAKE PRINTS, SWAG AND MORE W/ INDY ARTISTS/MUSICIANS/WE/ARE/SCUMCON2019-AND BEYOND\nCURRENTLY HAVE A RESIDENCY AT THE NEWLY RENOVATED DOWNTOWN BERKELEY PLAZA - BROAKLEYBOIZ THURSDAY NITE ROLL-CALL IS EVERY 1ST & 3RD THURSDAY OF THE MONTH NO COVER ALL AGES SPONSORED BY THE SOURCE CHIROPRACTIC", "otherInfo": "BroakleyBoiz Thursday Roll-Call Live On the Plaza every 1st & 3rd Thursday of the month! DJ Miggy Biggz & DJ Shaky Paws with special guests & live bands performing in the newly renovated outdoor venue featuring a state of the art Meyer Sound System. No cover, all ages\nSponsored by The Source Chiropractic"}, {"Address": "1 Hacker Way, Menlo Park, CA 94025", "Artist": "Mike Block ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440485.jpeg", "Coordinates": [-122.14462, 37.4762], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Facebook", "moreBioInfo": "MIKE BLOCK is a pioneering multi-style cellist, singer, composer, and educator, hailed by Yo-Yo Ma as the \"ideal musician of the 21st-Century\", and acclaimed by the NY Times for his \"vital rich-hued solo playing\". While still studying at the Juilliard School, Mike joined Yo-Yo Ma’s Silk Road Ensemble, with which he has toured extensively throughout the world, and won a 2017 Grammy Award for Best World Music Album. Mike is also an active recording artist of original material, folk music, cross-cultural collaborations, and he has an ongoing project to record all of the Bach cello suites in acoustically glorious bathrooms of famous concert halls, via BachInTheBathroom.com. As one of the first wave of cellists to adopt a strap in order to stand and move while playing, Mike was the first standing cellist to perform at Carnegie Hall, using a cello strap of his own design, called the Block Strap, a performance which the NY Times called \"Breathless ... Half dance, half dare.\"\n\nAs a music educator, Mike is passionate about emphasizing creativity and collaboration, leading to the founding of the Mike Block String Camp in 2010. MBSC provides players of all backgrounds the opportunity to learn from a world-class faculty in a variety of styles, and supports the exploration and development of the artistic voice of each student. Mike is also the founding Director of the Silkroad Global Musician Workshop, bringing together musicians from around the globe, and he created the online Multi-Style Cello School at ArtistWorks.com, with an extensive library of instructional videos. In 2012, Mike was appointed Associate Professor at the Berklee College of Music. Mike lives in Boston with his wife, fiddler Hanneke Cassel.\n\nMike has collaborated with a variety of diverse musicians and groups, such as Mark OConnor, Bobby McFerrin, The New York Philharmonic, Will.i.am, Edgar Meyer, Stevie Wonder, Darol Anger, Allison Krauss, Mike Marshall, Zakir Hussain, The National, Bon Iver, My Brightest Diamond, The Illinois Symphony, Rachel Barton Pine, Marcel Khaliffe, Goran Bregovic, Simone Dinnerstein, Dawn Upshaw, Anthony McGill, Tony Trishcka, Lenny Kravitz, Shakira, Joe Zawinul, Alasdair Fraser, Shujaat Khan, and many others.\n\nMike’s television and radio credits include \"Late Night with Conan O’Brian\", \"Regis and Kelly\", NBC’s 30 Rock, NPR’s \"St. Paul Sunday Morning\", WNYC’s \"Soundcheck\", APM’s \"Performance Today\", WNBC 4’s Chuck Scarborough Show, VH1, The Disney Channel, and the CBS \"Early Show\". When still living in New York City, Mike regularly subbed on Broadway as on-stage cellist for the Pulitzer Prize winning musical, \"Next to Normal\", and he also worked as Music Consultant on the 2012 film, \"A Late Quartet\". Mike was the subject of a 2011 feature article in the Wall Street Journal for his Artistic Directorship of the GALA BROOKLYN Music Festival, featuring cross-cultural collaborations among locally-based musicians.\n\nMike attended college at the Cleveland Institute of Music, where he studied cello with Richard Aaron, and received the Jim Hall Prize for Undergraduate Achievement. Mike also earned a Master’s Degree from the Juilliard School, where he studied with Darrett Adkins and Joel Krosnick. These days, Mike plays on a modern cello made in 2014 by Fabienne Gauchet, D’Addario strings, a David Gage Realist pickup, and the patented cello strap of his own design, The Block Strap.\nwww.MikeBlockMusic.com\nwww.GlobalMusicianWorkshop.com\nwww.MikeBlockStringCamp.com\nwww.CelloStrap.com\nwww.BachInTheBathroom.com\nwww.ArtistWorks.com/Cello", "otherInfo": "Live Stream: https://www.facebook.com/celebrityseries"}, {"Address": "West Oakland, CA", "Artist": "J.B. Barton ", "ArtistImage": "https://photos.bandsintown.com/thumb/10295723.jpeg", "Coordinates": [-79.95381499999999, 40.4440775], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Outlaw Crooner", "Time": "6:00 PM", "Venue": "My Home ", "moreBioInfo": "After 54 hours of labor, on a warm October morning, in the garage of a social activist center on SDSU campus called The Intersection House, Emily Barton brought J.B. Barton into the world. Emily never got the memo from Waylon and Willie and quickly got her son into guitars, trucks and cowboy boots.\n\nMustangs ran wild on his grandmother's property in Carrizozo, New Mexico where J.B. would spend summers in her adobe home. The days melted away occupied by catching horny toads, looking for arrowheads or road tripping with Grandma Barton to one of New Mexico's many desert anomalies .\n\nFor his 14th birthday, Emily Barton gave J.B. his first guitar and he started writing songs immediately. J.B's early inspirations include the Grateful Dead and Eric Clapton which quickly sent him down the blues, folk and country rabbit hole. Soon J.B's songwriting and singing had the influence of Willie Nelson, Son House, Stevie Ray Vaughn, Bob Dylan, and Waylon Jennings.\n\nJ.B. cut his teeth playing in folk and bluegrass bands in the Northern California. Bucky Walters, T Sisters and Brothers Comatose are just a few of the bands that J.B. has had the good fortune to play with. Some of the venues J.B. has been part of sold out shows in include: The Independent, The Paramount, Amnesia, Starline Social Club and The Lost Church. Currently, J.B. plays solo or sings duets with his friend Margo Cilker.\n\nJ.B. Barton will croon you into a swoon with his heartfelt lyrics and smooth warble. Catch J.B. soon in a dimly lit tavern near you.", "otherInfo": "Hey folks! I’ll be doing a live stream on Instagram at 6pm this Friday April 3rd. I’ll sing my heart for you."}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Official Page of drummer Dave King.\n\n(no messages, please)", "otherInfo": "No other event info available"}, {"Address": "224 Vintage Wy, Novato, CA 94945", "Artist": "Notorious ", "ArtistImage": "https://photos.bandsintown.com/thumb/8015679.jpeg", "Coordinates": [-122.55345, 38.088411], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "70s, Current Hits 60s, 90s, 80s, Decades", "Time": "9:00 PM", "Venue": "Hopmonk Tavern", "moreBioInfo": "Notorious is renowned California based dance band that is consistently recognized as one of the best groups in the country for weddings (and social events) by Martha Stewart Weddings, Modern Bride, The Knot and many other blogs, websites and wedding professionals (Hey, thank you!).", "otherInfo": "Notorious"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Space Cowboys ", "ArtistImage": "https://photos.bandsintown.com/thumb/10188968.jpeg", "Coordinates": [-122.408312, 37.780964], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Electronic, House", "Time": "9:30 PM", "Venue": "Monarch", "moreBioInfo": "Space Cowboys are a San Francisco based collective that began its exploration of the cosmos over a decade ago, as a diverse group of talented individuals who came together in the pursuit of the creation of unique entertainment events, mechanical contraptions, and unique art projects.\n\nSpace Cowboy DJs: 8Ball, Bassben, Ben Anderson, Brad Robinson, Deckard, J9, Kapt'n Kirk, kev/null, Leyl Master Black, Mancub, rrrus, Rumblemunk, Shissla, shOOey, Sol, Tamo, WorkR.", "otherInfo": "The Space Cowboys and Monarch bring you SkiiTour on their Deep Orbit Tour, hitting Monarch on Friday, April 3rd!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Fri Apr 3 2020", "EventDate": "2020-04-03", "Genre": "Jazz", "Time": "10:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Official Page of drummer Dave King.\n\n(no messages, please)", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "California Women’s Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/10287070.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "No genre available", "Time": "5:30 PM", "Venue": "The Lost Church", "moreBioInfo": "No artist bio available", "otherInfo": "California Women's Music Festival and The Lost Church - San Francisco Present: A Benefit Streaming-Concert with Clementine Darling, MAAYAN, and Rose Haze.\n\nThe concert that was originally scheduled to take place at The Lost Church in San Francisco has evolved into a streaming concert that will take place online due to the COVID-19 Pandemic.\n\nWe hope that you will join us to enjoy original music and support your lovely local performers who are currently being affected by the Pandemic. This is a pre-sale online concert. The entrance link will be given once you've made a payment. A minimum payment of $5 is required although we encourage you to donate as much as you can during these times of peril. If you need your donation to be tax-deductable we can facilitate that thanks to our sponsors California Women's Music.\n\nThe concert proceeds will benefit:\n•The performers: Clementine Darling, MAAYAN & Rose Haze.\n• CWM COVID-19 Artist Relief Fund\n• CWM COVID-19 Music Venue & Business Relief Fund\n• The Lost Church, SF\n\nOnline pass purchase link will become available Friday 03/27.\n\n\nMore about our performers:\n\nClementine Darling is a Folk Singer-Songwriter making waves in San Francisco’s music scene. Originally from Seattle, Washington, she busked her way down the West Coast in 2010 on a road trip that led her to put down roots in San Francisco’s North Bay— Sonoma County, California. The two locals heavily influenced her first two albums— Americana Folk songs and Indie ballads, with undertones of Seattle 90’s grunge. Clementine has played festivals including The Emerald Cup, sharing the bill with Margo Price and Rising Appalachia, as well as SXSW, Railroad Square Music Festival and Balanced BreakFEST.\n\nwww.clementinedarlingmusic.com\nIG: @clementinedarlingmusic\nSpotify: https://open.spotify.com/artist/7yjaAoQo650uEgATVqgwQj?si=sMW2VmnASpqLjIRLRW50QQ\n\nMAAYAN\n\nSoulful Singer-Songwriter Maayan Oppenheim is a wild child artist captivating crowds internationally with powerful performances and magnetic positivity. Her unique blend of Rock, Americana, Soul, and middle-eastern influences coupled with a singing style that's entirely her own make up a one of a kind wide musical experience. The San Francisco born-Tel Aviv & New York City-bred songstress is making waves wherever she turns with her anthemic songs of love, inspiration, and travel.\n\nhttps://www.maayanofficial.com\nIG: @maayanofficial\nSpotify:\nhttps://open.spotify.com/artist/5CRsTqcip6eBH4GhDnguKy?si=wnygm5NqS_axFiP1w8ZKbg\n\nRose Haze:\n\nRose Haze is a rolling stone with a vast songwriting style. She now resides in the San Francisco bay area and her 6-piece musical coven is cultivating an even hazier dream-pop style. Fuzzy textural colorful guitar (which has been coined as “very My Bloody Valentine”), dark violin and cello tones, and trippy organ leads create a sound that dances between alt-indie and progressive psych-rock. Her music catalog tells stories of the lone traveler experiencing blissful highs and devastating lows while on the road to nowhere, somewhere, and anywhere set to mood-oriented sonic canvases.\n\nRose will perform solo for this event.\n\nhttps://www.rosehaze.com\nIG: @ rose_haze\nSpotify:\nhttps://open.spotify.com/artist/2SpwKpFCOpBPjAZOFSzIq4?si=8Iq7acM-R--5mJlzQmQEuw\n\n\nMore about California Women's Music:\n\nCalifornia Women's Music is a tax-exempt 501(c)(3) organization. As an event-centric nonprofit our activities include pop-up concerts, benefit shows, educational events, and large scale music and art festivals. All in a celebration of womxn and girls in music, art, literature, poetry, and business.\nCalifornia Women's Music facilitates ongoing grant programs and funds in support of California communities year-round.\n\nTo learn more about CWM COVID-19 relief funds and other efforts by California Women's Music, please visit their website at www.cwmnp.com"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Jazz", "Time": "7:30 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Official Page of drummer Dave King.\n\n(no messages, please)", "otherInfo": "No other event info available"}, {"Address": "2087 Addison St, Berkeley, CA 94704", "Artist": "Scott Amendola ", "ArtistImage": "https://photos.bandsintown.com/thumb/7596193.jpeg", "Coordinates": [-122.268704, 37.871272], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Free Jazz, Jazz", "Time": "8:00 PM", "Venue": "California Jazz Conservatory", "moreBioInfo": "Scott Amendola:\nDrummer/Composer/Bandleader/Educator\n“Amendola’s music is consistently engaging, both emotionally and intellectually, the product of a fertile and inventive musical imagination.” Los Angeles Times\n\n“If Scott Amendola didn't exist, the San Francisco music scene would have to invent him.” Derk Richardson, San Francisco Bay Guardian\n\n“Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.”Steven Raphael, Modern Drummer\n\n“...drummer/signal-treater Scott Amendola is both a tyrant of heavy rhythm and an electric-haired antenna for outworldly messages (not a standard combination).” Greg Burk, LA Weekly\n\nFor Scott Amendola, the drum kit isn’t so much an instrument as a musical portal. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. His closest musical associates include guitarists Nels Cline, Jeff Parker, Charlie Hunter, Hammond B-3 organist Wil Blades, violinists Jenny Scheinman and Regina Carter, saxophonists Larry Ochs and Phillip Greenlief, and clarinetist Ben Goldberg, players who have each forged a singular path within and beyond the realm of jazz.\n\nWhile rooted in the San Francisco Bay Area scene, Amendola has woven a dense and far-reaching web of bandstand relationships that tie him to influential artists in jazz, blues, rock and new music. A potent creative catalyst, the Berkeley-based drummer is the nexus for a disparate community of musicians stretching from Los Angeles and Seattle to Chicago and New York. Whatever the context, Amendola possesses a gift for twisting musical genres in unexpected directions.\n\nNels Cline maintains his long-running role in the alt-rock juggernaut Wilco, but the band’s long stretches of inactivity mean that he can also perform as a member of the Scott Amendola Band and a recently launched duo project (a tête-à-tête setting in which Scott thrives). Amendola continues to tour and record with the volatile instrumental band, The Nels Cline Singers, which is due for a follow up to 2014’s critically hailed, genre-obliterating Macroscope (Mack Avenue).\n\nIt’s not surprising that the Singers provided an early and essential forum for Amendola’s artful use of electronics, a small menagerie of devices that has found its way “into everything I do,” he says. “After years of experimenting I’m using them in a more expressive and confident way than ever before.”\n\nCline was still an underground LA legend in the mid-1990s when he first encountered Amendola and was “blown away,” he says. “There aren’t too many drummers on the West Coast who had his wide-ranging ability. Scott’s got some funk in him, a looser, sexy thing going on, and the flexibility to play free and different styles. He plays behind singer/songwriters and he rocks too.”\n\nScott also performs widely with his longtime sparring partner Wil Blades in the orchestral duo Amendola Vs. Blades. While they’ve honed a wide array of material, the project initially centered on their thrilling investigation of Duke Ellington and Billy Strayhorn’s “Far East Suite.” Their 2016 debut album Greatest Hits (Sazi Records) earned lavish critical praise, with the San Jose Mercury News hailing the duo for honing a “repertoire of groovelicious jazz for more than a decade, and they throw down the funk with fervor on a project that clocks in at the old-school LP length of 39 minutes, distilling some of their leanest, meanest, punchiest pieces.”\n\nNo project better displays Amendola’s big ears and musical ambitions than Fade To Orange a piece commissioned as part of the Oakland East Bay Symphony’s Irvine Foundation-funded New Visions/New Vistas Initiative. The roiling work premiered to critical acclaim at Oakland’s Paramount Theater on April 15, 2011. Determined to refine and document the piece, Amendola conducted a successful PledgeMusic crowd-funding campaign and recorded Fade To Orange at Berkeley’s storied Fantasy Studios with his original collaborators—his Nels Cline Singers bandmates (Cline and powerhouse bassist Trevor Dunn)—and the great Magik*Magik Orchestra.\n\n“The idea was really the Singers meet the Symphony,” Amendola says. “I wanted Trevor’s electric bass for that big contrast with the orchestra, and I conceived of the piece as a concerto for guitar. It was an amazing experience to premiere ‘Fade to Orange’ at the Paramount, but it was bittersweet after all that work. Like, that’s it? I wanted to see what else we could do with it.”\nHe released Fade to Orange on CD and vinyl on his label Sazi Records in 2015. The album includes four distilled, wildly imaginative remixes of “Fade to Orange” by Cibo Matto’s Yuka Honda, Mocean Worker, Beautiful Bells, and Deerhoof’s John Dieterich and Teetotum’s Drake Hardin.\n\nAmendola established his reputation as a bandleader in 1999 with the release of the acclaimed album Scott Amendola Band featuring the unusual instrumentation of Eric Crystal on saxophones, Todd Sickafoose on acoustic bass, Jenny Scheinman on violin, and Dave Mac Nab on electric guitar. By the time the quintet returned to the studio in 2003, Cline had replaced Mac Nab, contributing to the quintet’s combustible chemistry on the Cryptogramophone album Cry.\n\nCline was a crucial contributor on Amendola’s 2005 Cryptogramophone album Believe, which also features guitarist Jeff Parker (from the band Tortoise), Jenny Scheinman, and late bassist John Shifflett. Scott created his own label, SAZi Records, for his next release, 2010’s exquisite Lift, a trio session with Parker and Shifflett dedicated to his gossamer, bluesy ballads and ethereal soundscapes, with an occasional foray into surf rock deconstruction.\n\nIn some circles, Amendola is best known for his intermittent two-decade collaboration with seven-string guitar wizard Charlie Hunter, with whom he connected shortly after moving to the Bay Area in 1992. They went on to play together with John Schott and Will Bernard in the three-guitar-and-drums combo T.J. Kirk, which earned a Grammy nomination for its eponymous 1996 debut album. After years of occasional gigs, they teamed up again in 2011 in a tough and sinewy duo. They spent five years touring incessantly and released two acclaimed albums: 2012’s recession-inspired Not Getting Behind is the New Getting Ahead and 2013’s Pucker, the latter showcases Amendola’s melodically inspired tunes.\n\nIn 2014, looking for new avenues to distribute their music, Hunter and Amendola released four 5-track EPs, each focusing on the music of a particular artist or act. From the standards of Ellington and Cole Porter to the country hits of Hank Williams and seminal new wave tunes of The Cars, the duo transformed everything they encountered with their groove-centric sensibility.\n\nAs a sideman, Amendola has performed and recorded with a vast, stylistically varied roster of artists, including Bill Frisell, John Zorn, Mike Patton, Mondo Cane, John Scofield, Cibo Matto, John Dieterich from Deerhoof, Wadada Leo Smith, Bruce Cockburn, Madeleine Peyroux, Cris Williamson, Joan Osborne, Jacky Terrasson, Shweta Jhaveri, Phil Lesh, Sex Mob, Kelly Joe Phelps, Larry Klein, Carla Bozulich, Wayne Horvitz, Johnny Griffin, Julian Priester, Sonny Simmons, Pat Martino, Jim Campilongo, Bobby Black, Larry Goldings, Paul McCandless, Rebecca Pidgeon, and the Joe Goode Dance Group.\n\nBorn and raised in the New Jersey suburb of Tenafly, just a stone’s throw from New York City, Amendola displayed an aptitude for rhythm almost from the moment he could walk. His grandfather, Tony Gottuso, was a highly respected guitarist who performed with jazz luminaries such as Ella Fitzgerald, Louis Armstrong, Frank Sinatra, and Nat “King” Cole. A member of the original Tonight Show Band under Steve Allen, he offered plenty of support when Amendola began to get interested in jazz.\n“We used to play together a lot when I was a teenager,” Amendola says. “It had a huge impact on me to play with someone who was around when a lot of the standards that musicians like Miles Davis, John Coltrane, and Keith Jarrett play were written.”\n\nHis passion for music only deepened during his four years at Boston’s venerable Berklee College of Music, where it wasn’t unusual for him to practice for 12 hours a day. Drawing inspiration from fellow students such as Jorge Rossi, Jim Black, Danilo Perez, Chris Cheek, and Mark Turner, and studying with the likes of Joe Hunt, and Tommy Campbell, Amendola found his own voice rather than modeling himself after established drummers. Since 2014, Scott has served as Associate Professor at the University of California - Berkeley’s Jazz Program. His teaching in Jazz Percussion focuses on private instruction.\n\n\nOver a career spanning more than three decades, Amendola has forged deep ties across the country, and throughout the world. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist, and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. He’s never more than one degree away from a powerful musical hook-up.", "otherInfo": "Paul Hanson, Jeff Denson & Scott Amendola Trio\n\nPaul-bassoon\nJeff-bass\nScott-drums/percussion/electronics"}, {"Address": "2236 Martin Luther King Jr Way, Oakland, CA 94612", "Artist": "Versoul ", "ArtistImage": "https://photos.bandsintown.com/thumb/10263346.jpeg", "Coordinates": [-122.2727, 37.81239], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Rap, Hip Hop", "Time": "9:00 PM", "Venue": "Starline Social Club", "moreBioInfo": "Versoul is an alternative hip-hop artist, producer and sound engineer born in San Francisco and raised throughout the Bay Area. Bouncing to the soundwaves of Hip-Hop, R&B, Neo-Soul music in her mothers belly in 1993, Versoul grew up captivated by music, influenced by artists like Eminem, Da Brat, Lisa \"Left Eye\" Lopes, Fugees & Nas, and Bone Thugs N Harmony, to name a few. Through her music Versoul transforms pain, in to power and trauma, into triumph. Utilizing each life lesson and loss as an inspirational catapult to continue living each day to the fullest and learning to be fully grounded in the present, inspiring others along the way through her story and eternally learning to self-love.", "otherInfo": "Versoul\nVersoul is an Alternative Hip-Hop MC, Producer and Sound Engineer born in San Francisco and raised throughout the Bay Area. Bouncing to the soundwaves of Hip-Hop, R&B, Neo-Soul music in her mothers belly in 1993, Versoul grew up captivated by music of all genres, mainly influenced by Alternative, Hip-Hop, R&B and Neo Soul. Growing up, Versoul was inspired by artists, Eminem, Alicia Keys, Sade, Tupac, Fugees & Nas, and Bone Thugs N Harmony, to name a few. The ability to be fully creative and express herself and tell her story through music is what Versoul loves the most about writing and producing her music.\nHost Bodies\nFrom the creative collaboration of MC and producer, James Collector (aka Swoop), and multi-instrumentalist and graphic designer, Nick Hess, Host Bodies emerges with a genre-defying blend of syncopated polyrhythms, gritty blues riffs, underground hip-hop psychedelia, narrative song structure, and field recordings from cities and the wild.\nAtora\nAtora is a San Francisco based trio consisting of Producer Matthew Santoro, Vocalist/Songwriter Alexa Jesse and Guitarist/Bassist Mitch Grimes. The band recently emerged in the Bay Area music scene with a style that blends 80s synth-wave, future bass, soul, as well as classic house and trance elements. They are currently working on their debut album “Dimension” so stay tuned for releases coming soon!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Dave King ", "ArtistImage": "https://photos.bandsintown.com/thumb/8568962.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Sat Apr 4 2020", "EventDate": "2020-04-04", "Genre": "Jazz", "Time": "9:30 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Official Page of drummer Dave King.\n\n(no messages, please)", "otherInfo": "No other event info available"}]