var sf_events = [{"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "Junk Parlor ", "ArtistImage": "https://photos.bandsintown.com/thumb/11524815.jpeg", "Coordinates": [37.76976860000001, -122.4471395], "Date": "2021-07-19", "EventDate": "Jul. 19th, 2021", "Genre": "Junk, Rock", "Time": "8:00 PM", "Venue": "Junk Parlor@Club Deluxe", "moreBioInfo": "JUNK PARLOR Biography A galvanizing force on the Bay Area indie rock scene since launching serendipitously in 2013, Junk Parlor is that crazy-rare band whose vibe is so driven by joyful schizophrenia that it transcends easy genre trappings. Born from the wild musical wanderings of Jason Vanderford, renowned for his five years recording and touring with gypsy jazz sensation The Hot Club of San Francisco, their energizing musical collage includes 50’s rock and roll rumbling atop gypsy rhythms, a bit of Gipsy Rhumba, tango, Eastern Euro/Hungarian music, bellydance, punk…Vanderford was raised on “rock and roll and punk and everything under the sun,” so other sounds are certain to appear as the hybrid junk rockers continue their jam. The songs on their mostly vocal 2013 debut Wild Tones and predominantly instrumental follow-up Melusina (2015) have earned them comparisons to Nick Cave, Leonard Cohen, Gogol Bordello, Dead Kennedys and Tom Waits. One fan called it “Crooner Punk” because of Vanderford’s beckoning, low range vocals – but those are just the centerpiece of a vibe that includes the singer’s acoustic banjo and rhythm guitar, the polyrhythmic grooves of drummer, cajon player and group cofounder Rt Goodrich, Laela Peterson-Stolen’s soaring violin and viola and the growling electric fretless bass of Tim Bush. At the heart of Junk Parlor’s desire to get their audiences dancing and singing along is Vanderford’s passion for storytelling. He taps into an offbeat influence for their latest single, the haunting rockabilly heartbreak tune “Mick Jagger’s Heart.” Drawing thematic inspiration from The Rolling Stones’ countrified ballad “Dear Doctor” (which appeared on Beggar’s Banquet), the band creates a fresh twist on the pain of lost love via the juxtaposition of dark lyrics and bouncy rhythms. Vanderford artfully describes the piece as what happens “when the heartache of Leonard Cohen decides to lament under the sun amidst the California surf…The moment of goodbye…the lingering sigh that begs to turn back time…Doctor won’t you please…tear it out.” The compelling, gut punchingly beautiful video for the track by Jeannie Jo uses scenes of San Francisco cityscapes as a metaphor for heartbreak. Building a solid, ever expanding West Coast fan base, Junk Parlor has played several hundred gigs these past few years. Beyond a batch of hotspots in San Francisco and throughout the Bay Area, the band has headlined numerous times in Seattle, Portland, Eugene, Los Angeles and Reno. Aiming each time out to capture a room for a few hours, and aware of today’s short musical attention spans, Vanderford always creates fresh set lists using previous tunes to frame or set the mood for the next, building waves of energy in an arc like fashion. Not surprisingly, Junk Parlor’s fan base is as demographically eclectic as their music. Remembering a certain trip to Seattle, the singer says, “One night we played a punk club in Bremerton, with people wearing Mohawks and going crazy in a mosh pit, and the next we were at the Triple Door jazz club, with an older audience in suits and ties, drinking fancy martinis. The sonic shift reminds us a lot of the MTV Unplugged era, when heavy rockers gained new popularity by playing softer acoustic music.” As Vanderford tells it, Junk Parlor began almost by accident. In the years since his stint with The Hot Club of San Francisco, he had emerged as one of the region’s “go-to” musicians for his rhythm guitar and gypsy jazz expertise. In early 2013, his uncle, Tim Bush, asked him to come play his acoustic at a wine bar in Petaluma that he tended bar at. Vanderford agreed, but only if Bush played bass. “He’s been a professional bassist for 30 years and took me to buy my first guitar when I was 14,” says the singer. As he got into his once a month residency, Robin Goodrich showed up, telling Vanderford he wanted to put a group together. “I had never met him before, but he said he knew who I was,” Vanderford says. “I was hesitant but asked him to sit in with me for a few months. Then he shows up one day saying he booked the band. I told him we didn’t have a name and he said we better get one. So then I took it seriously.” As the idea of a larger ensemble took shape, Vanderford decided he wanted an original, more experimental band rather than another traditional gypsy jazz outfit. He began pulling out songs he had never shown anyone. The clever band name came from his younger days, when his bedroom stored his collection of vintage furniture and pictures he’d bought at antique stores. He vowed then that if he ever had a band of his own, he would call it what he called that space: Junk Parlor. Adding Bush on bass, the band played their first gig that May and five months later they made their debut album Wild Tones and started touring. While the singer writes all the original songs, the band works together on the arrangements and each member writes their own parts. Vanderford and Goodrich are financial partners in the band who do everything DIY, including booking, social media, poster making and promotion. Junk Parlor's members have played the gamut of festivals and prestigious venues including Outside Lands, Kate Wolfe Fest, Djangofest, Gaia Fest and SXSW. Vanderford has played, recorded and toured with the Americano Social Club, The Hot Club of San Francisco, Clint Bakers New Orleans Jazz Band, Little Charlie's Caravan, Avatar Ensemble and Seth Ford Young Quartet. Rt Goodrich has laid down rhythms and toured with Staggerwing, Beso Negro and Standing Room Only. Bush has played extensively with Danny Montana, Sweetie Pie and the Doughboys, Chuck Day, Sam Andrew, Jim Martin, and Freddie Roulette. Wild Tones included two instrumentals that resonated with the local bellydance community. The band started getting videos of dance troupes from all over, dancing to these tracks. Kami Liddle from the Gold Star Dane Company asked Vanderford if he wanted to collaborate, and he dove into a fresh project, aiming to create an album for dancers to choreograph to. They put together a Kickstarter campaign and raised enough money to make Junk Parlor’s instrumental dominated Melusina and go on tour with the Gold Star girls. He had been collecting vintage bellydance records for years, so he started picking out the ones he loved to learn. He recorded two covers among the originals, “Gold Star Dance Academy” and “Procession.” Looking ahead, Vanderford says that the new album, which will include “Mick Jagger’s Heart,” will build upon what Junk Parlor has been doing since day one. “Our first two records are simply two sides of the same coin,” he says. “I am looking forward to our next project as we already have all the songs and have been playing them out and getting a wonderful response. This one will include a few instrumentals, but have more of an emphasis on vocals. “What I’m learning through all of these recording and performing experiences is that it doesn’t matter if you’re a jazz musician, singer or dancer, the goal is always telling a great story. I love getting out there and hearing people’s stories and then transforming those into songs that can be interpreted in unique ways by the band, dancers and everyone in the audience that it touches.” \"A dream falling off the edge of a cliff.\"", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "BIT ", "ArtistImage": "https://photos.bandsintown.com/thumb/6373397.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-19", "EventDate": "Jul. 19th, 2021", "Genre": "Electronic, Psy Trance, Goa Trance", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "DEATH GUILD\nMain Room:\n Decay\n Joe Radio\n Melting Girl\nLounge:\n Sage\n Bit\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-19.html\nWatch and listen:\n Death Guild: 2009 Trailer: http://youtu.be/c9L2pOVeLHo\ngothic. industrial. synthpop.\n9:30pm - after hours.\n18+ with ID.\n$5 advance;\n$5 < 10:30pm;\n$8 after.\nhttp://www.deathguild.com/"}, {"Address": "20 Grey St, Petaluma, CA 94952", "Artist": "Anthony Presti Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/7913872.jpeg", "Coordinates": [38.2372463, -122.6386736], "Date": "2021-07-20", "EventDate": "Jul. 20th, 2021", "Genre": "Alt-country, Folk Rock", "Time": "5:00 PM", "Venue": "Anthony Presti and Leah Van Dyke at The Block Petaluma ", "moreBioInfo": "Alt-rock singer/songwriter Anthony Presti grew up in Seattle during the 1990’s where an explosive alternative and grunge rock scene was thriving. He moved continuously until his teenage years, where he settled in Sonoma County. Presti played in a hardcore band, releasing several albums and touring extensively until they broke up. His identity shifted as he rediscovered his love for acoustic guitar and eventually moved to San Francisco. He’s gone on several west coast tours, and played shows at the Lagunitas Brewery, Napa City Winery, HopMonk Tavern and Brick and Mortar Music Hall and has shared the stage with national artists like Grammy Nominated Gretchen Peters, Little Tybee, The Deer and Elliott Peck. Presti’s latest record, Existentialism, is his strongest effort to date. The opening track, “Next of Kin,” resembles the stylings of Johnny Cash, while “Dreamland,” Presti’s first music video single, shows a strong influence of Roy Orbison. “One Step Closer” features Presti and Van Dyke trading versus like a new age Fleetwood Mac, “Reach for the Stars” is a catchy contemporary folk laden tune and “Family Tree” is a testament to Presti’s hard rock upbringing. Presti has released several albums, including, Clarity in Hindsight, recorded at Prairie Sun Studios (Tom Waits, Primus) and, Existentialism, at Tiny Telephone Studios with engineer James Riotto (Sean Hayes, The Mountain Goats) accompanied by an impressive cast of musicians including Leah Van Dyke (Brothers of Siren), Shaun David (The Lost), Burt Lewis (Stu Allen) and Jason Slota (Thao and the Getdown Staydown).", "otherInfo": "Anthony Presti and Leah Van Dyke play an acoustic set to celebrate the release of Anthony Presti's new single, \"I'm Right Here.\""}, {"Address": "25 Leland Ave, San Francisco, CA 94134", "Artist": "Noa Levy - נעה לוי ", "ArtistImage": "https://photos.bandsintown.com/thumb/6339671.jpeg", "Coordinates": [37.7113252, -122.4043505], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "3:00 PM", "Venue": "Live Jazz @ The Good Chocolate", "moreBioInfo": "נעה למדה משחק ושירת מחזות זמר בלונדון, ומוסיקה וביצוע בבית הספר רימון בישראל. בשנים האחרונות, הופיעה נעה על הבמות הכי גדולות ונחשבות בישראל, כשהיא עושה הכל החל מעיבודים אקוסטיים לשירה וגיטרה לקאברים לועזיים וישראליים שונים / שירה בערבי מחווה לקווין ופינק פלוייד / שירה בפרוייקט המחווה הענק לקווין - The Best Of Queen / הופעות עם הרכב המחווה לשירי אבבא \"Waterloo\", הרכב המחווה לשירי האירוויזיון \"דוז פואה\", השתתפות בהופעות עם המשוררת רחל חלפי, הופעות הסופרגרופ בניהולו המוסיקלי של נעם גלפרין, הופעות עם המלחין הישראלי האגדי - יוני רכטר, וכמובן, הקמתו, עיבודו וביצועו של קברט היחיד השנון, מרשים ומרגש ביותר המבוסס על חייה האישיים - \"צי'טה\".", "otherInfo": "No event info available"}, {"Address": "1280 N McDowell Blvd, Petaluma, CA 94954", "Artist": "The SoulShake ", "ArtistImage": "https://photos.bandsintown.com/thumb/11481605.jpeg", "Coordinates": [38.2726597, -122.6618868], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Reggae, Conscious Surf-rock", "Time": "4:20 PM", "Venue": "Lagunitas Brewing Co", "moreBioInfo": "Northern California band mixing positive vibes from reggae and rock.", "otherInfo": "No event info available"}, {"Address": "1475 Clubhouse Dr, Discovery Bay, CA 94505", "Artist": "Atlantic Crossing a Rod Stewart tribute ", "ArtistImage": "https://photos.bandsintown.com/thumb/11169450.jpeg", "Coordinates": [37.894651, -121.5936315], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Discovery Bay Country Club", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Mattson 2 ", "ArtistImage": "https://photos.bandsintown.com/thumb/11441056.jpeg", "Coordinates": [37.7605088, -122.4212203], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Independent Rock, Jazz Fusion, Psychedelic Rock, Psych Jazz", "Time": "7:00 PM", "Venue": "(((folkYEAH!))) Presents The Mattson 2 w/ Mad Alchemy Liquid Lights", "moreBioInfo": "The Mattson 2 are Jared and Jonathan Mattson, identical twins who have been collaborating almost literally from birth. They grew up in San Diego, CA, where in middle school they started playing music; decades later, they had earned Master’s degrees in Music from the University of California Irvine. They formed their psych-jazz group The Mattson 2 in 2003 and released their first album, Introducing the Mattson 2, in 2009. Subsequent releases include collabs with pro skaters Ray Barbee, Tommy Guerrero, Farmer Dave (of Kurt Vile), and Money Mark (of Beastie Boys). Since then, they’ve released an album with Chaz Bear — 2017’s Star Stuff, recorded under the name Chaz Bundick Meets The Mattson 2 and which peaked at #1 on the Billboard contemporary jazz charts — and reinterpreted Coltrane’s legendary A Love Supreme which Jazz Times said “manages to hold Coltrane’s revered album in the highest esteem while absolutely shredding it to pieces.” Paradise, their 8th record, marks the first time that the brothers have added vocals. The album is a masterful piece of psych-jazz, conceptually elegant and thrilling it its execution.", "otherInfo": "No event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "The Mattson 2 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9617774.jpeg", "Coordinates": [37.7605088, -122.4212203], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "The Mattson 2 on The Chapel's Outdoor Stage"}, {"Address": "2099 Folsom St, San Francisco, CA 94110", "Artist": "Meredith Edgar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8123466.jpeg", "Coordinates": [37.7638409, -122.4149695], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Acoustic, Vocal, Soundtracks, Tv Music, Tv Soundtracks, Americana, Film Music, Jazz, Vocal Music, Vocal Jazz, Folk", "Time": "7:30 PM", "Venue": "Meredith Edgar & Paul Griffiths", "moreBioInfo": "Meredith Edgar is a San Francisco Bay Area native, recently returned from a five-year stay in Austin, Texas. With some of her major musical influences being Ryan Adams, Billie Holiday, Morphine, Gillian Welch, Amy Winehouse, and Jolie Holland, Meredith's songs are melancholy and melodic, and combine her loves of folk, jazz, and Americana.", "otherInfo": "Songwriters Meredith Edgar and Paul Griffiths are joined by upright bassist Sean Silverman for their signature blend of dark folk and Americana originals, covers, and jazz standards."}, {"Address": "827 Washington St, Oakland, CA 94607", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/11546537.jpeg", "Coordinates": [37.8013366, -122.2747693], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Comedy", "Time": "7:30 PM", "Venue": "District Oakland Comedy Night", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No event info available"}, {"Address": "401 Van Ness Ave, San Francisco, CA 94102", "Artist": "Aaron Diehl ", "ArtistImage": "https://photos.bandsintown.com/thumb/9491165.jpeg", "Coordinates": [37.7795368, -122.4210212], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Jazz", "Time": "7:30 PM", "Venue": "San Francisco Performances", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Rex Navarrete ", "ArtistImage": "https://photos.bandsintown.com/thumb/6348831.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "San Jose Improv", "moreBioInfo": "Rex Lasat Navarrete (born 1969 in Manila, Philippines) is a Filipino-American comedian whose material is geared toward Filipino audiences. Sometime after his birth in 1969, his parents left the Philippines and immigrated to the United States, settling in Chicago. Navarrete, on the other hand, was raised by his grandparents in the provinces of Cavite and Batangas. He later reunited with his parents and his baby sister at the age of three. Eventually, the Navarrete family moved to South San Francisco, California where he spent the rest of his childhood. He started his career in 1989 with a performance at University of California Santa Cruz. He has since performed in over two dozen colleges and universities as well as various comedy clubs and festivals, including headlining a sold-out performance at The Warfield in San Francisco as well as the Wiltern LG in Los Angeles. As of December 2006, he has toured extensively throughout North America, Europe, Asia, and Australia. These include performances in San Francisco, New York, Montreal, Manila, Geneva, Hong Kong, Singapore, and Sydney. In 2007, an animated series featuring Filipino-American characters will be released. Navarrete will be voicing many of the characters.", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Mo Mandel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619297.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "This show is 18 & over with valid, government-issued photo ID. There is a two drink minimum per person. Cameras and video/audio recording devices are not permitted. Ticket sales shut off online before doors open; there may be tickets available at the show. Reserved Premium Seating: $32 General Admission: $22 in advance, $25 day of show"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Tuck & Patti ", "ArtistImage": "https://photos.bandsintown.com/thumb/7308627.jpeg", "Coordinates": [37.7860081, -122.4092959], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "Tuck & Patti, that's Tuck Andress and Patti Cathcart - a couple that have been making music together for over 25 years and who released ten albums flavoured with jazz, pop, rhythm and blues, gospel, folk, rock and Brazilian genres since 1988 as a duo. Patti hails from San Francisco and knew from the age of six that she wanted to be a singer. She started to sing in church, directed choirs by the age of 10 and received voice lessons in high school. As she was raised in the Bay Area in the 60s she was influenced by all the styles of music going on and places like The Fillmore were second home to her - even Bill Graham watched out for her. Patti jammed with hundreds of musicians during that time and learned how to improvise in any style. Some might remember that Patti was one of the founding members of Kingfish - featuring Bobby Weir, Matthew Kelly, Dave Torbert, Barry Flast among others. Tuck was influenced by swing and classical music from an early age but it wasn't until the Beatles and Rolling Stones came out that he knew he had to play rock and roll. Because Tuck's sister had taught him how to play the piano he started with that instrument but soon decided that the guitar would be a better choice. Although Tuck was influenced by rock music he started to learn complex jazz chords instead, simply because he had the Mel Chord Book, with 400 Orchestral Chords in the appendix, at hand. When he heard Jimi Hendrix for the first time he was not only blown away, he considered it impossible for him to come up with such a sound himself and he dived even deeper into jazz. In 1970 Tuck enrolled in Stanford where he would later major in music and played in several rock and jazz bands at the same time. He even went to Los Angeles to play in bands and took the guitar position for the Sonny and Cher TV show for some time - but decided to leave the L.A. scene before it could swallow him. Instead he headed to the Bay Area where he would play in top 40, soul and rock bands or practice and listen to music 8 to sometimes 14 hours a day. In 1978 Tuck was playing in a band Patti came to audition for. Once they met they immediately knew they had found their musical soul mate (and partner in life). Since the band didn't happen Tuck and Patti decided to work as a duo and their instant success in the Bay Area proved that their formula that every song had to speak and be played from their hearts worked. Ten years later they would release their first CD Tears of Joy and the rest is history as they say. Tuck & Patti have become a well known act worldwide - especially in Europe and Japan. That's also the reason why their CD A Gift of Love got released. They actually produced this album for their fans in Japan who wanted to hear Tuck & Patti's interpretations of classical love songs. The album turned out to be yet another success, once it was released in Japan it had to be released in Europe as well. Last but not least, 33rd Street Records released the album in July 2004 for the American market. What does this tell us? Simply that good music will always find its way.", "otherInfo": "Feinsteins at the Nikko is thrilled to welcome back legendary jazz duo Tuck & Patti. For 42 years this unique, genre-crossing vocal/guitar jazz duo has cast its passionate musical spell worldwide, capturing the hearts of lovers, the respect of jazz buffs and the jaw-dropping awe of guitarists and singers. To understand Tuck and Patti, start with the wellspring of love within them, then their music begins to make perfect sense. Married 39 years, Tuck Andress and Patti Cathcart continue to stoke the fires, not only of their own love, but also of their love of life and their passion for making music together. They have a long-standing tradition: minimalist arrangements featuring Tuck's extraordinary virtuosity and Pattis rich mezzo soprano. Patti, renowned for her remarkable ability to touch hearts directly with her voice, exudes the soft, centered yet powerful graciousness of a gospel singer; Tuck almost wears his brain on his skin, anticipating the thousands of musical decisions he'll have to send to his ten fingers during the course of a performance. Seeing the virtuosity and complexity of Tuck's guitar work, most are surprised to learn that Patti is the actual writer, arranger and producer. Without even blinking, Tuck-the-problem-solver brags, 'Patti writes and arranges; I am just the orchestra.\""}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Mark Hummel ", "ArtistImage": "https://photos.bandsintown.com/thumb/11359488.jpeg", "Coordinates": [37.7962494, -122.2785582], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "Blues", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Mark Hummel is a Grammy nominated Blues Music Award winning American blues harmonica player, vocalist, songwriter, and long-time bandleader of The Blues Survivors. Since 1991, Hummel has produced the Blues Harmonica Blowout tour, of which he is also a featured performer. The shows have featured blues harmonica players such as James Cotton, Carey Bell, and Charlie Musselwhite. Although he is typically identified as performing West Coast blues, Hummel is also proficient in Delta blues, Chicago blues, swing and jazz styles.", "otherInfo": "Mark Hummel's Blues Survivor's\nRusty Zinn, Bob Welsh, Randy Bermudes and Wes Starr"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Slope114 ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-21", "EventDate": "Jul. 21st, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "This week we welcome Slope114 for a special DJ set with One A! In the lounge, we groove to the rhythms of Felix the Dog + Neil Harris."}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Andy McKee ", "ArtistImage": "https://photos.bandsintown.com/thumb/11252035.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Acoustic, Instrumental Acoustic Guitar, Instrumental", "Time": "3:00 PM", "Venue": "Andy McKee's Musicarium 2021 (Guitar Camp)", "moreBioInfo": "Andy McKee is one of the world’s finest acoustic guitarists and it’s evident from the accolades he’s received throughout his career. It’s his youthful energy, attention to song structure and melodic content that elevates him above the rest. After nearly a decade without releasing new studio recordings, McKee returns with his six-track EP, Symbol, out Friday, September 17 on Mythmaker Records in conjunction with Cruzen Street Records. “These are my interpretations of tunes that really inspired me,” says McKee. “I wanted to give listeners a chance to hear what I hear when I listen to this music. I also wanted to branch out a bit and include music that isn’t originally for acoustic guitar.” While Symbol is a collection of inspired renditions, they are important song choices; artists that deeply influence McKee and song’s that connect to his musical past. He pulls from the catalogues of greats like Michael Hedges, Preston Reed, Billy McLaughlin and Prince. There’s “Ragamuffin,” the EP’s lead single, which is a nod to one of McKee’s biggest influences, Michael Hedges. McKee notes that “Michael was not only a revolutionary guitarist on the technical side, his ability to compose for solo guitar was also genius. Most importantly though, he was able to search inside of himself and consistently pull up very human and evocative themes that made him a true artist. I’ll always be grateful for his music.” One track that might catch fans by surprise on Symbol is McKee’s gorgeous rendition of Prince’s “Purple Rain.” In 2012, McKee played alongside Prince in his band on the “Welcome 2 Australia” tour with the song being one of the setlist highlights. “I had originally come up with the ‘Purple Rain’ arrangement to open the shows with while I was on tour with Prince in Australia,” recalls McKee. “I have played it occasionally since then while touring and figured I should finally get a recording of it down. One thing that I learned from Prince while we were on the road is that we both really admire Joni Mitchell. I used that as a reference when trying to describe what I do. Although some of what I do on the guitar is technically demanding, I don’t ever really want that to overshadow the music.” Another standout from Symbol is Mckee’s take on “Chattanooga” by acclaimed guitarist Preston Reed. “In my opinion, ‘Chattanooga’ by Preston Reed is one of the finest fingerstyle guitar pieces ever written,” says McKee. “It’s just loaded with texture, harmony, percussion, and melody. I love the key changes and chromaticism between some of the chords. This tune really inspired me a lot.” McKee, like many, was infatuated with the Rocky IV soundtrack, specifically the Vince DiCola compositions “War” and “Training Montage.” For Symbol, McKee and DiCola joined forces to craft “Rocky IV Medley.” “That was about as surreal as it gets for me,” says McKee. “I became a fan of Vince’s work when I was six years old and I bought the soundtrack to the film on cassette. I used to listen to it all the time on my Sony Walkman and I really found that my favorite tunes were the instrumental tracks which were “War” and “Training Montage” from Vince. Those tunes awakened my mind to the possibility of being moved by music with no words. To be able to recreate those tunes with the electric guitar and play with Vince is really something I could never have dreamed of.” Andy McKee entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique. McKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song “Drifting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the U.S. and Acoustic Magazine in the UK. He also curates his own annual guitar retreat called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts from Dream Theater to Tommy Emmanuel.", "otherInfo": "This is Andy McKee's Guitar Camp featuring Yvette Young, Guitaro 5000, Trevor Gordon Hall, and special guest Michael Manring. its 4 days of workshops, lessons, and intimate performances. For more information, or to register, go to https://andymckeesmusicarium.com/"}, {"Address": "N Santa Cruz Ave, Los Gatos, CA 95030", "Artist": "Them Slack Jawed SOB's ", "ArtistImage": "https://photos.bandsintown.com/thumb/11300084.jpeg", "Coordinates": [37.2297996, -121.9805545], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Them Slack Jawed SOB's LIVE on Santa Cruz Avenue!", "moreBioInfo": "No artist bio available", "otherInfo": "Santa Cruz Avenue in downtown Los Gatos will be closed to vehicles for this. Don't miss this FREE party in the street!\n\nThe band will be playing the north end of the street on Santa Cruz Avenue @ Bachman Avenue. \n\nMap: https://tinyurl.com/byhd5utw"}, {"Address": "34 S B St, San Mateo, CA 94401", "Artist": "Michelle Lambert ", "ArtistImage": "https://photos.bandsintown.com/thumb/11484241.jpeg", "Coordinates": [37.5671074, -122.3244377], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Acoustic Folk Pop, Pop, Female Vocals", "Time": "5:00 PM", "Venue": "Michelle at O'Neills Irish Pub", "moreBioInfo": "“Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!” - Dennis Willis, Soundwaves TV", "otherInfo": "Join Michelle at O'Neills Irish Pub for a Thursday show! This pub feels like you stepped into Ireland from downtown San Mateo! ~No reservations needed~\n\nRising star, Michelle Lambert, brings a world of experience when she steps up to the microphone. This Pop singer/songwriter has toured from coast to coast making waves all over the country. Michelle's 2021 single, Come to Me, has caught the attention of the press and reached number 1 on Indie Radio! Hailing from the Bay Area, Lambert began studying violin at age 2 and has continued making music ever since. A pop, folk and hip-hop artist whose career has taken her across the U.S. and abroad, she is influenced by her studies in Celtic music. Female empowerment is a recurring theme in her music. You can learn more at michellelambert.com!\n\n\"Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow an aching desire slipping out from between the lyrics of a ballad or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!\"\n-Dennis Willis Soundwaves TV-\n\n“Girl On Fire, Michelle Lambert, makes a melting pot of pop. Michelle Lambert pulls from many talents and influences when she makes her genre-bending music. That juxtaposition from raw, emotional singer-songwriter to classical musician is one that Lambert relishes in her genre-crossing pop music.”\nCharlie Swanson – Bohemian"}, {"Address": "124 Columbus Ave, Oakland, CA 94611", "Artist": "Mike Rufo ", "ArtistImage": "https://photos.bandsintown.com/thumb/11444194.jpeg", "Coordinates": [37.799341, -122.4088078], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "Rainbow Girls, Mike Rufo", "moreBioInfo": "No artist bio available", "otherInfo": "Private house concert, contact Mike Rufo for info."}, {"Address": "100 Hooper St Ste. 4, San Francisco, CA 94107", "Artist": "19th Street Station ", "ArtistImage": "https://photos.bandsintown.com/thumb/9021838.jpeg", "Coordinates": [37.76876439999999, -122.3990825], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "5:30 PM", "Venue": "Seven Stills Brewery & Distillery gig 5:30-7:30pm", "moreBioInfo": "19th Street Station delicately blends rock, Americana playing original songs and a wide variety of acoustic/electric cover songs.", "otherInfo": "No event info available"}, {"Address": "765 Center Blvd, Fairfax, CA 94930", "Artist": "Scott Guberman ", "ArtistImage": "https://photos.bandsintown.com/thumb/8809008.jpeg", "Coordinates": [37.9858756, -122.5840658], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Rock & Beyond., Psychedelic Rock, Rock", "Time": "6:00 PM", "Venue": "Iron Springs Pub & Brewery", "moreBioInfo": "Scott Guberman performs regularly with Grateful Dead's founding bassist, Phil Lesh. Scott Guberman has become an outstandingly important member of the Bay Area music scene in between his shows with Phil Lesh, appearing most often at Terrapin Crossroads. In addition to this, Guberman can be found touring the national circuit joining up with just about every professional level Grateful Dead project out there. Scott Guberman’s history finds him breaking into the Grateful Dead scene at the turn of the millennium. He first gained recognition as a Hammond organist performing heavily with Rock & Roll Hall of Famer and former Grateful Dead keyboardist, Tom Constanten; and touring with Grateful Dead’s final keyboardist, Vince Welnick. www.scottguberman.com", "otherInfo": "Scott Guberman & Friends ft Mark Karan"}, {"Address": "1 Main St, Los Altos, CA 94022", "Artist": "The Song Gardeners ", "ArtistImage": "https://photos.bandsintown.com/thumb/11461163.jpeg", "Coordinates": [37.3807794, -122.1144318], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Indie, New Age", "Time": "6:00 PM", "Venue": "The Song Gardeners @ Enchanté Boutique Hotel", "moreBioInfo": "The Song Gardeners are at the forefront of the New Age Pop genre – creating well-crafted contemporary #chill, #groove, #pop songs with positive, empowering messages. The band includes singer/songwriters and multi-instrumentalists Corrie Dunn and Mary Gospe. Time to Soar, Mary Gospe's debut album of 12 original songs with multi-instrumentalist/producer David Vito Gregoli of Dharmapala Records was released on November 15, 2019. The band has performed at private concerts, retreats, churches, fundraising events, wineries and in cafes and retail businesses. For booking information, email thesonggardeners@gospe.com.", "otherInfo": "Enjoy the New Age pop duo, The Song Gardeners (Corrie Dunn & Mary Gospe), as they perform a two-hour set of original songs with positive, empowering messages and a chill, groove vibe\n\nReservations required if you want a table for dining. (650) 946-2000"}, {"Address": "1 Main St, St. Helena, CA 94574", "Artist": "Frankie Bourne ", "ArtistImage": "https://photos.bandsintown.com/thumb/11511618.jpeg", "Coordinates": [38.4933023, -122.4558576], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Roots-rock, Americana, Indie", "Time": "6:00 PM", "Venue": "One Main Cigar (private event)", "moreBioInfo": "“California native Frankie Bourne combines the style of new Americana with all the things you loved about 90s adult alternative bands.” — Ryan Clark, TourWorthy.com Prolific singer-songwriter and indie darling Frankie Bourne is an artist who can turn heads with densely lyrical and emotionally evocative ballads as much as he can get a crowd moving with his explosive, guitar-driven roots-rock band (Frankie Bourne and the Wildcards). Rooted in classic rock and California soul, his indie songwriting blends the tones and influences of americana with the DIY spirit of indie rock. Bourne’s new album “Wildcards” releases January 2020. On his 2015 acoustic-laced debut studio album, “Californicana”, Frankie took a stance as a solo artist and emerged on the scene with an authentic sound that has been incredibly well-received by indie, rock and americana radio stations nationwide, and won an award for best love song on Jango Radio who call it, \"a refreshing roots rock record for the 21st Century\". He supported the record with a sporadically changing group of players in the LA club scene, including keyboardist Carey Frank (Tedeschi Trucks Band, Social Distortion), saxophonist Jeremy Trezona (Saint Motel), bassist Andrew Perusi (Hanson), and drummer Clinton Cameron (Fishbone), to name a few. On his brand new 2020 album “Wildcards”, Bourne finds himself not only writing and arranging, but also making his debut as producer. Tracked with his band at legendary Prairie Sun Recording in Sonoma County, his third studio album exhibits his open-road diary motif through a new collection of story-songs that merge alt-country and roots-rock with his layered lyrical style. Featuring lead guitarist Sunil Sharma (Alison Harris, Reality Check), bassist Matt Pasquale (Gravity Hill), drummer Jeff Nassi (Meredith Brooks), keyboardist Matt Piazza (Yo Flaco!) and saxophonist Jeremy Trezona (Saint Motel), “Wildcards” delivers infectious songs and an evolved sound that is as comfortably familiar as it is authentic. You can hear his music on Spotify, Apple Music, Amazon, and YouTube, as well as on the following terrestrial and internet radio stations: KSVY (Sonoma), KWMR (Marin), KRSH (Santa Rosa), KRCB (Rohnert Park), KALW (San Francisco), KPIG & KZSC (Santa Cruz), KCBX (Central Coast), HFM LA (Los Angeles), KHLV (Las Vegas), KHTP (Phoenix), Jango Radio, Indie Radio Music, Relax Free Radio, The Mad Music Asylum, War Stories Radio, Gapless Playback, and UK based XRP Radio, among others. — PRESS QUOTES — “Influenced by The Allman Brothers, Black Crowes, and Tom Petty to name a few, Frankie Bourne brings Americana Rock to the stage.” — Coyote Sonoma “California native Frankie Bourne combines the style of new Americana with all the things you loved about 90s adult alternative bands.” — Ryan Clark, TourWorthy.com “He’s got a smoky, quick tongued lyrical quality that can change speeds like a Zack Greinke change-up. He’s part Johnny Cash, part Eagles, part Steve Earle, part . . . Frankie Bourne.” — Christopher Millard, San Jose Rock Music Examiner “Bourne definitely has a way with a hook, and his infectious songs are both easy to absorb and easy to like....He’s going for earthiness rather than slickness, and the musicianship and production help him to display that organic type of sound. ” — Alex Henderson, LA Weekly “Californicana is a refreshing roots-rock record for the 21st Century” — Jango Radio “Frankie is California through and through. But then there is so much more….It’s real music, played by a real singer/songwriter with real instruments for real people.” — Michael Rauch, View From The Cheap Seats “Troubadour Frankie Bourne is one to watch, as a burgeoning solo act. So, tune in and behold” — Christopher Millard, San Jose Rock Music Examiner “His debut album Californicana is infused with picture-perfect lyrical tales of life in California” — Ryan Clark, TourWorthy.com “Bourne’s lyricism is playful, not shying away from alliteration, quick metered rhyme schemes, and heart-on-sleeve intimacy” — San Jose Rock Music Examiner AWARDS & ACCOLADES In February 2019 Frankie was one of the top 10 semifinalist winners of the Creative Sonoma Next Level Songwriting Contest. In 2018 Frankie Bourne and the Wildcards opened for Commander Cody and the Western Airmen at Valley of the Moon Vintage Festival in Sonoma Valley, CA In June of 2016 Frankie performed in a songwriter showcase at legendary Hermosa Beach music venue Saint Rocke, as part of the South Bay Film & Music Festival. In Summer 2015 Frankie was the featured artist in Digital Earbuds Music Blog’s “Artist’s For Your Earbuds Issue”. In February 2015 his song \"21st Century\" won best anti-love song on the Jango Internet Radio Valentine's Day 2015 Playlist. www.frankiebourne.com", "otherInfo": "Prolific singer-songwriter and indie darling Frankie Bourne is an artist who can turn heads with densely lyrical ballads as much as he can get a crowd moving with his explosive roots rock and California soul. His indie songwriting blends the tones and influences of americana with the DIY spirit of indie rock."}, {"Address": "100 El Camino Real, Menlo Park, CA 94025", "Artist": "The Complements ", "ArtistImage": "https://photos.bandsintown.com/thumb/8140915.jpeg", "Coordinates": [37.4478052, -122.1718111], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Positive Rock, Indie, Acoustic", "Time": "6:00 PM", "Venue": "The Stanford Park Hotel", "moreBioInfo": "Singer-songwriter acoustic duo from California.", "otherInfo": "Reservations recommended!"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Alex Bleeker ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7605088, -122.4212203], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "Alex Bleeker on The Chapel's Outdoor Stage"}, {"Address": "1 Paseo De San Antonio, San Jose, CA 95113", "Artist": "Ren Geisick, Vocalist ", "ArtistImage": "https://photos.bandsintown.com/thumb/11541563.jpeg", "Coordinates": [37.3324831, -121.8892829], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Americana", "Time": "7:00 PM", "Venue": "Plaza de César Chávez", "moreBioInfo": "Bay Area-based vocalist Ren Geisick sings with radiant energy and a passion for storytelling. Deeply influenced by Americana and jazz, her music borrows elements of both while remaining distinctly personal. With the release of her latest album, Ren, Love Song, she continues to seamlessly traverse the boundaries of genre while intimately delivering a story to each listener.", "otherInfo": "I'm going solo for this fun show in the park! there will be a beer garden, lawn games, and food trucks!"}, {"Address": "Redwood City, CA", "Artist": "The Riverside ", "ArtistImage": "https://photos.bandsintown.com/thumb/11249179.jpeg", "Coordinates": [37.4847955, -122.228141], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Folk, Bluegrass, Indie Folk", "Time": "7:00 PM", "Venue": "House Concert", "moreBioInfo": "The Riverside is a traditional melodic and harmony-driven folk string band hailing from Southern California, founded by husband and wife Jake and Lorien Jeanson in 2012. The highly engaging four-piece dynamically performs around one microphone, where each instrument and voice crafts a specific part of each story; creating intimate, savory folk music that warms the heart and feeds the soul.” -Nicholas Edward Williams, Earthtone Booking- The Riverside originated in Southern California where founding member, Jacob Jeanson (songwriter & guitar), was attending Westmont College in 2012. In his senior year, the band formed in hopes of winning Santa Barbara’s battle of the bands. As an energetic and engaging folk band with foot stomping musical companions, the group was able to win the competition and release their first album with the winnings. In the following years, Jake got to play with many talented friends and personalities which helped mold the band’s vision and created time to grow in tasteful and intentional songwriting; a nostalgic yet refreshing charm that leads listeners across a grand frontier of warm and beautiful scenery. However, the band was able to make the jump to full time when his wife Lorien Jeanson (mandolin & harmony) was added to the lineup. Lorien is originally from the redwood forest and farmlands of Northern California, but ended up attending the same college as Jake, where they met and fell in love. The duo swiftly began touring with a rotating cast of friends; playing in theatres, venues, festivals, and living room concerts across the United States. Regardless of their current friend lineup, the group aims to create a magical and organic vibe which translates into the feeling of the music, often singing and playing around a single old fashioned microphone, seamlessly blending the musical composition of their harmonies and instruments. Since 2012, the band has released 4 homegrown records and an EP, with more songs and albums in the works. Growing up and being raised listening to the likes of The Eagles, Creedence Clearwater Revival, and Crosby Stills Nash & Young, Jake and Lorien grew an appreciation and aim for group harmonies and heartfelt authenticity , while also striving to be amazing live performers like their modern influences , a few being Fleet Foxes, Mandolin Orange, and The Head and the Heart.", "otherInfo": "No event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Alex Jordan ", "ArtistImage": "https://photos.bandsintown.com/thumb/11058051.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Psychedelic Rock, Alt-country, Rock, California Country, Folk, Honky Tonk, Americana", "Time": "7:00 PM", "Venue": "The Basement Tapes", "moreBioInfo": "Alex is a singer and multi-instrumentalist who has been surrounded by music his whole life. Owing his immersion to his father, who taught music for forty-one years at Serra High School in San Mateo, Alex started singing at a young age and dabbled with brass instruments (playing primarily Jazz trombone), harmonica, ukulele, bass and piano before eventually discovering the electric guitar at age 17. Songwriting and playing with a few bands throughout high school and college, he kept up his guitar practice while studying classical voice and music education at The Bob Cole Conservatory, California State University, Long Beach before joining the road crew for Cubensis - The Grateful Dead Music Experience upon graduating in 2012. Alex began to regularly sub in with the band on rhythm guitar and vocals in the spring of 2013 when he met Grahame Lesh and Friends (the nascent Midnight North) for whom he eventually auditioned and joined that December. In 2014, Alex began touring regularly with Midnight North, adding the piano and Hammond B3 to his arsenal, playing with Bob Weir, Phil Lesh, Peter Rowan, and many others. In the fall of 2017, he began working on his debut solo record \"The Subtle Exhibitionist\" which is set to be released in Spring, 2020.", "otherInfo": "Alex joins the Casual Coalition for a special performance of Bob Dylan’s Basement Tapes with special guest Chuck Prophet."}, {"Address": "351 Lasuen St, Stanford, CA 94305", "Artist": "Lavay Smith & Her Red Hot Skillet Lickers ", "ArtistImage": "https://photos.bandsintown.com/thumb/11447058.jpeg", "Coordinates": [37.4304264, -122.1660014], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Swing, Jazz", "Time": "7:30 PM", "Venue": "Kansas City Swing: Lavay Smith and Her Red Hot Skillet LIckers @ Frost Amphitheater", "moreBioInfo": "Lavay Smith & Her Red Hot Skillet Lickers are one of the top Swingin' Jazz and Blues bands in the world. Sultry chanteuse Lavay Smith evokes a sensuous era of Jazz queens and sexy pinups and adds a modern, feminist twist. No wonder Los Angeles Magazine chose her as one of the sexiest people around! Whether singing her own compositions or drawing on a large repertoire of classics, Lavay and her all-star 8-piece band bake up an instant recipe for dancing and good times. More about the band: http://www.lavaysmith.com/meet_the_band.html", "otherInfo": "Lavay Smith and her all star eight piece band, The Red Hot Skillet Lickers celebrate the music of Kansas City. From Count Basie to Jay Mcshann, this little big band will swing the blues. The Frost Amphitheater, is the closest thing to the Hollywood Bowl in Northern California, join us for a night of glamor and swing!!!\n\nRickey Woodard Alto Sax\nRob Barics Tenor Sax\nDanny Armrstrong Vocals and Trombone\nMike Olmos Trumpet\nMarcus Shelby. Bass\nHoward Wiley Drums\nChris Siebert Piano\nLavay Smith Vocals"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Russell Peters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619761.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "San Jose Improv", "moreBioInfo": "No artist bio available", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Mo Mandel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619297.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "This show is 18 & over with valid, government-issued photo ID. There is a two drink minimum per person. Cameras and video/audio recording devices are not permitted. Ticket sales shut off online before doors open; there may be tickets available at the show. Reserved Premium Seating: $32 General Admission: $22 in advance, $25 day of show"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Ponyskull ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Performing Live:\n GREAT HIGHWAY -- https://www.takegreathighway.com/\n RYAN FLYNN -- https://www.ryanflynnmusic.com/\n PONYSKULL -- https://www.ponyskull.com/\nWith DJs:\n Vice Reine\nLive Visuals by: Fetz\nPlus a special screening of a new music video by Le Fomo!\nNow reinitializing the cosmic collision... STAR CRASH is back! A monthly synthpop soiree from the other side of space, featuring a prismatic panoply of live electronic musicians & creators from the Bay Area & beyond. Synthpop, indie dance, indie pop, electropop, synth rock, darkwave, electroclash, synthwave/popwave... all are fair game in this Neo Synth Glam Wave. Wear all your sparkles, neon, LED finery and space disco attire you've been waiting forever to take out on the town!\nThe star players bringing you dance floor decadence:\n Great Highway: Over 5 albums and 8 years, the Bay's own Great Highway has blossomed into a high-energy live electronica outfit steeped in the culture of the local scene. Their upbeat songs package sometimes-hopeful, sometimes-sorrowful lyrics; lush, moody synth vibes; and live alto saxophone, electric harp, and guitar. With an emotional grandeur reminiscent of indie giants like Arcade Fire and Sufjan Stevens, wrapped in the sophisticated dance floor hedonism of festival favorites Rufus Du Sol and Odesza, Great Highway take you on a free-wheeling musical journey that embraces the fullness of human experience, from the dazzling light of joy and connection, to the dark and somber twists life can bring.\nRyan Flynn: Originally begun as an experimental side project while in film school, Ryan Flynn has since evolved into a perpetual orb-praising space pop venture. Inspired by electronic soundscapes and the power of funk, ryan flynn brings synthesized bops to fellow explorers of the world. Orb and ryan flynn invite you to leave the pressure of life behind and take a step outside of what seems like yesterday to find automatic love. Praise Orb. Spread love.\nPonyskull is one girl, two synths, and a drum machine. Her heartfelt songs are true confessions of finding (or losing) herself in San Francisco. Inspired by everything 80s, she blends her singer-songwriter sensibilities with her New Wave aesthetic in a way that's honest and vulnerable, but also catchy and danceable.\nsynthpop. electro pop. indie dance.\ndoors @ 8pm;\nshow @ 8:30pm.\nall ages.\n$15.\nhttps://www.facebook.com/starcrashsf\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-22d.html\nWatch and listen:\n Great Highway: Writing in the Desert: http://youtu.be/ZdA-bIBxLWc\n Ryan Flynn: Automatic Love: http://youtu.be/rk-sTscSxnA\n Ponyskull: What You Don't Know: http://youtu.be/7SdipCgjS4o\n Vice Reine: Aquaerium: http://youtu.be/r8QxForMJho"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Stu Allen ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Electronic, Hardstyle", "Time": "8:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "No artist bio available", "otherInfo": "The Basement Tapes Live featuring Casual Coalition w/ Stu Al"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Vicereine ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Performing Live:\n GREAT HIGHWAY -- https://www.takegreathighway.com/\n RYAN FLYNN -- https://www.ryanflynnmusic.com/\n PONYSKULL -- https://www.ponyskull.com/\nWith DJs:\n Vice Reine\nLive Visuals by: Fetz\nPlus a special screening of a new music video by Le Fomo!\nNow reinitializing the cosmic collision... STAR CRASH is back! A monthly synthpop soiree from the other side of space, featuring a prismatic panoply of live electronic musicians & creators from the Bay Area & beyond. Synthpop, indie dance, indie pop, electropop, synth rock, darkwave, electroclash, synthwave/popwave... all are fair game in this Neo Synth Glam Wave. Wear all your sparkles, neon, LED finery and space disco attire you've been waiting forever to take out on the town!\nThe star players bringing you dance floor decadence:\n Great Highway: Over 5 albums and 8 years, the Bay's own Great Highway has blossomed into a high-energy live electronica outfit steeped in the culture of the local scene. Their upbeat songs package sometimes-hopeful, sometimes-sorrowful lyrics; lush, moody synth vibes; and live alto saxophone, electric harp, and guitar. With an emotional grandeur reminiscent of indie giants like Arcade Fire and Sufjan Stevens, wrapped in the sophisticated dance floor hedonism of festival favorites Rufus Du Sol and Odesza, Great Highway take you on a free-wheeling musical journey that embraces the fullness of human experience, from the dazzling light of joy and connection, to the dark and somber twists life can bring.\nRyan Flynn: Originally begun as an experimental side project while in film school, Ryan Flynn has since evolved into a perpetual orb-praising space pop venture. Inspired by electronic soundscapes and the power of funk, ryan flynn brings synthesized bops to fellow explorers of the world. Orb and ryan flynn invite you to leave the pressure of life behind and take a step outside of what seems like yesterday to find automatic love. Praise Orb. Spread love.\nPonyskull is one girl, two synths, and a drum machine. Her heartfelt songs are true confessions of finding (or losing) herself in San Francisco. Inspired by everything 80s, she blends her singer-songwriter sensibilities with her New Wave aesthetic in a way that's honest and vulnerable, but also catchy and danceable.\nsynthpop. electro pop. indie dance.\ndoors @ 8pm;\nshow @ 8:30pm.\nall ages.\n$15.\nhttps://www.facebook.com/starcrashsf\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-22d.html\nWatch and listen:\n Great Highway: Writing in the Desert: http://youtu.be/ZdA-bIBxLWc\n Ryan Flynn: Automatic Love: http://youtu.be/rk-sTscSxnA\n Ponyskull: What You Don't Know: http://youtu.be/7SdipCgjS4o\n Vice Reine: Aquaerium: http://youtu.be/r8QxForMJho"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Chuck Prophet ", "ArtistImage": "https://photos.bandsintown.com/thumb/11120713.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Singer, Songwriter, Folk", "Time": "8:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "San Francisco based musician Chuck Prophet originally gained recognition as the youngest member of 80's college rock stalwarts Green on Red, with whom he was featured on numerous albums and touring lineups. In the early 1990's, as Green on Red faded to black, Prophet began performing with his future wife Stefanie Finch and releasing independent records on a variety of small labels. Prophet released his solo debut Brother Aldo in 1990 on Fire records,(later reissued in the late 1990's on Walter Yetnikoff's Velvel imprint. His immediate career path took him through mostly European touring markets and his followup \"Balinese Dancer\" came out in 1993 & later the Steve Berlin produced \"Feast of Hearts\" came out in Europe only through the Fire imprint. After a decade long bout with substance abuse, Prophet resurfaced refreshed and renewed on the critical breakthroughs 1998's \"Homemade Blood\", 2000's \"The Hurting Business\" and 2002's live \"Turn The Pigeons Loose\" (all available via Cooking Vinyl in UK). By 2000 he'd recorded a side project with his wife Stefanie called Go Go Market and begun incorporating electronic influences into his traditional roots rock formula, resulting in some mainstream radio play and expanded exposure, culminating in the wider distribution of albums \"No Other Love\" from 2002 and 2004's \"Age of Miracles\" on New West Records. Chuck signed a new arrangement in the US with North Carolina based Yep Roc for 2007's \"Soap and Water\", an album that saw the musician invited to play twice on National Public Radio, as well as on televison talk shows like Late Night With David Letterman, and The Carson Daly Show. Over the years he also began collaborating with other songwriters like Kelly Willis, Steve Yerkey and contributing as a guitarist/musician to studio efforts from folks like Jonathan Richman, Warren Zevon, Kim Carnes, Cake, Tom Heyman and Jewel. Alejandro Escovedo's upcoming 2008 release produced by Tony Visconti entitled Real Animal was co-written and recorded with Prophet. In addition to having his songs recorded by artists like Solomon Burke, Heart & Cyndi Thomson he has also recorded with men who started out as his influences like Jim Dickinson, Dan Penn and the late Warren Zevon. www.chuckprophet.com. www.myspace.com/chuckprophetofficial.", "otherInfo": "The Basement Tapes Live featuring Casual Coalition w/ Stu Al"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "S ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "No artist bio available", "otherInfo": "Basement Tapes Live w/s/g CHUCK PROPHET & Casual Coalition"}, {"Address": "224 Vintage Wy, Novato, CA 94945", "Artist": "John Elliott ", "ArtistImage": "https://photos.bandsintown.com/thumb/11502415.jpeg", "Coordinates": [38.08854600000001, -122.5534481], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Hopmonk Tavern", "moreBioInfo": "http://www.thehereafterishere.com", "otherInfo": "Opening for the great Bob Schneider!"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Tuck & Patti ", "ArtistImage": "https://photos.bandsintown.com/thumb/7308627.jpeg", "Coordinates": [37.7860081, -122.4092959], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "Tuck & Patti, that's Tuck Andress and Patti Cathcart - a couple that have been making music together for over 25 years and who released ten albums flavoured with jazz, pop, rhythm and blues, gospel, folk, rock and Brazilian genres since 1988 as a duo. Patti hails from San Francisco and knew from the age of six that she wanted to be a singer. She started to sing in church, directed choirs by the age of 10 and received voice lessons in high school. As she was raised in the Bay Area in the 60s she was influenced by all the styles of music going on and places like The Fillmore were second home to her - even Bill Graham watched out for her. Patti jammed with hundreds of musicians during that time and learned how to improvise in any style. Some might remember that Patti was one of the founding members of Kingfish - featuring Bobby Weir, Matthew Kelly, Dave Torbert, Barry Flast among others. Tuck was influenced by swing and classical music from an early age but it wasn't until the Beatles and Rolling Stones came out that he knew he had to play rock and roll. Because Tuck's sister had taught him how to play the piano he started with that instrument but soon decided that the guitar would be a better choice. Although Tuck was influenced by rock music he started to learn complex jazz chords instead, simply because he had the Mel Chord Book, with 400 Orchestral Chords in the appendix, at hand. When he heard Jimi Hendrix for the first time he was not only blown away, he considered it impossible for him to come up with such a sound himself and he dived even deeper into jazz. In 1970 Tuck enrolled in Stanford where he would later major in music and played in several rock and jazz bands at the same time. He even went to Los Angeles to play in bands and took the guitar position for the Sonny and Cher TV show for some time - but decided to leave the L.A. scene before it could swallow him. Instead he headed to the Bay Area where he would play in top 40, soul and rock bands or practice and listen to music 8 to sometimes 14 hours a day. In 1978 Tuck was playing in a band Patti came to audition for. Once they met they immediately knew they had found their musical soul mate (and partner in life). Since the band didn't happen Tuck and Patti decided to work as a duo and their instant success in the Bay Area proved that their formula that every song had to speak and be played from their hearts worked. Ten years later they would release their first CD Tears of Joy and the rest is history as they say. Tuck & Patti have become a well known act worldwide - especially in Europe and Japan. That's also the reason why their CD A Gift of Love got released. They actually produced this album for their fans in Japan who wanted to hear Tuck & Patti's interpretations of classical love songs. The album turned out to be yet another success, once it was released in Japan it had to be released in Europe as well. Last but not least, 33rd Street Records released the album in July 2004 for the American market. What does this tell us? Simply that good music will always find its way.", "otherInfo": "Feinsteins at the Nikko is thrilled to welcome back legendary jazz duo, Tuck & Patti. For 42 years this unique, genre-crossing vocal/guitar jazz duo has cast its passionate musical spell worldwide, capturing the hearts of lovers, the respect of jazz buffs and the jaw-dropping awe of guitarists and singers. To understand Tuck and Patti, start with the wellspring of love within them, then their music begins to make perfect sense. Married 39 years, Tuck Andress and Patti Cathcart continue to stoke the fires, not only of their own love, but also of their love of life and their passion for making music together. They have a long-standing tradition: minimalist arrangements featuring Tucks extraordinary virtuosity and Pattis rich mezzo soprano. Patti, renowned for her remarkable ability to touch hearts directly with her voice, exudes the soft, centered yet powerful graciousness of a gospel singer; Tuck almost wears his brain on his skin, anticipating the thousands of musical decisions he'll have to send to his ten fingers during the course of a performance. Seeing the virtuosity and complexity of Tuck's guitar work, most are surprised to learn that Patti is the actual writer, arranger and producer. Without even blinking, Tuck-the-problem-solver brags, \"Patti writes and arranges; I am just the orchestra.\""}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Ryan Flynn ", "ArtistImage": "https://photos.bandsintown.com/thumb/11242494.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Electronic, Computer Music, Indie Pop, Synth Pop, Electro Pop, Pop", "Time": "8:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Originally begun as an experimental side project while in film school, ryan flynn has since evolved into a perpetual orb-praising space pop venture. It was in Rochester, New York that ryan flynn established his signature funky synth pop sound. With the help of longtime friend, guitarist ,and mixing engineer, Andrew Cavaciuti, the sound and name was solidified by the release of an eponymous EP in 2019. While in Rochester, ryan flynn had the pleasure of performing alongside acts such as KNOWER, Boy Jr., Space Cubs, and Crunk Witch. In 2020, ryan flynn took to the road with his gear, writing and performing improvisational pieces inspired by the scenery across the country alongside releasing singles, \"Seems Like Yesterday\" and \"Pressure.” Following a successful release of latest single “Outside,” ryan flynn has been featured in Rochester City Newspaper, Independent Music & Arts, Your Best Life Nashville, and Nagamag. “Outside” proved to be a fan favorite with a continuously rising 20K streams on Spotify and its accompanying hypnotic music video gaining over 4.5K views on YouTube. 2021 finds ryan flynn based out of Phoenix, AZ; exploring the deserts of space and time and continuously finding new inspiration for music and visual releases. Automatic Love is flynn’s latest release since relocating to the southwest. Praise Orb. Spread love. ◎♡", "otherInfo": "Performing Live:\n GREAT HIGHWAY -- https://www.takegreathighway.com/\n RYAN FLYNN -- https://www.ryanflynnmusic.com/\n PONYSKULL -- https://www.ponyskull.com/\nWith DJs:\n Vice Reine\nLive Visuals by: Fetz\nPlus a special screening of a new music video by Le Fomo!\nNow reinitializing the cosmic collision... STAR CRASH is back! A monthly synthpop soiree from the other side of space, featuring a prismatic panoply of live electronic musicians & creators from the Bay Area & beyond. Synthpop, indie dance, indie pop, electropop, synth rock, darkwave, electroclash, synthwave/popwave... all are fair game in this Neo Synth Glam Wave. Wear all your sparkles, neon, LED finery and space disco attire you've been waiting forever to take out on the town!\nThe star players bringing you dance floor decadence:\n Great Highway: Over 5 albums and 8 years, the Bay's own Great Highway has blossomed into a high-energy live electronica outfit steeped in the culture of the local scene. Their upbeat songs package sometimes-hopeful, sometimes-sorrowful lyrics; lush, moody synth vibes; and live alto saxophone, electric harp, and guitar. With an emotional grandeur reminiscent of indie giants like Arcade Fire and Sufjan Stevens, wrapped in the sophisticated dance floor hedonism of festival favorites Rufus Du Sol and Odesza, Great Highway take you on a free-wheeling musical journey that embraces the fullness of human experience, from the dazzling light of joy and connection, to the dark and somber twists life can bring.\nRyan Flynn: Originally begun as an experimental side project while in film school, Ryan Flynn has since evolved into a perpetual orb-praising space pop venture. Inspired by electronic soundscapes and the power of funk, ryan flynn brings synthesized bops to fellow explorers of the world. Orb and ryan flynn invite you to leave the pressure of life behind and take a step outside of what seems like yesterday to find automatic love. Praise Orb. Spread love.\nPonyskull is one girl, two synths, and a drum machine. Her heartfelt songs are true confessions of finding (or losing) herself in San Francisco. Inspired by everything 80s, she blends her singer-songwriter sensibilities with her New Wave aesthetic in a way that's honest and vulnerable, but also catchy and danceable.\nsynthpop. electro pop. indie dance.\ndoors @ 8pm;\nshow @ 8:30pm.\nall ages.\n$15.\nhttps://www.facebook.com/starcrashsf\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-22d.html\nWatch and listen:\n Great Highway: Writing in the Desert: http://youtu.be/ZdA-bIBxLWc\n Ryan Flynn: Automatic Love: http://youtu.be/rk-sTscSxnA\n Ponyskull: What You Don't Know: http://youtu.be/7SdipCgjS4o\n Vice Reine: Aquaerium: http://youtu.be/r8QxForMJho"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Great Highway ", "ArtistImage": "https://photos.bandsintown.com/thumb/8842733.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Ambitious synth pop + live violin and sax. Connect at: www.takegreathighway.com", "otherInfo": "Performing Live:\n GREAT HIGHWAY -- https://www.takegreathighway.com/\n RYAN FLYNN -- https://www.ryanflynnmusic.com/\n PONYSKULL -- https://www.ponyskull.com/\nWith DJs:\n Vice Reine\nLive Visuals by: Fetz\nPlus a special screening of a new music video by Le Fomo!\nNow reinitializing the cosmic collision... STAR CRASH is back! A monthly synthpop soiree from the other side of space, featuring a prismatic panoply of live electronic musicians & creators from the Bay Area & beyond. Synthpop, indie dance, indie pop, electropop, synth rock, darkwave, electroclash, synthwave/popwave... all are fair game in this Neo Synth Glam Wave. Wear all your sparkles, neon, LED finery and space disco attire you've been waiting forever to take out on the town!\nThe star players bringing you dance floor decadence:\n Great Highway: Over 5 albums and 8 years, the Bay's own Great Highway has blossomed into a high-energy live electronica outfit steeped in the culture of the local scene. Their upbeat songs package sometimes-hopeful, sometimes-sorrowful lyrics; lush, moody synth vibes; and live alto saxophone, electric harp, and guitar. With an emotional grandeur reminiscent of indie giants like Arcade Fire and Sufjan Stevens, wrapped in the sophisticated dance floor hedonism of festival favorites Rufus Du Sol and Odesza, Great Highway take you on a free-wheeling musical journey that embraces the fullness of human experience, from the dazzling light of joy and connection, to the dark and somber twists life can bring.\nRyan Flynn: Originally begun as an experimental side project while in film school, Ryan Flynn has since evolved into a perpetual orb-praising space pop venture. Inspired by electronic soundscapes and the power of funk, ryan flynn brings synthesized bops to fellow explorers of the world. Orb and ryan flynn invite you to leave the pressure of life behind and take a step outside of what seems like yesterday to find automatic love. Praise Orb. Spread love.\nPonyskull is one girl, two synths, and a drum machine. Her heartfelt songs are true confessions of finding (or losing) herself in San Francisco. Inspired by everything 80s, she blends her singer-songwriter sensibilities with her New Wave aesthetic in a way that's honest and vulnerable, but also catchy and danceable.\nsynthpop. electro pop. indie dance.\ndoors @ 8pm;\nshow @ 8:30pm.\nall ages.\n$15.\nhttps://www.facebook.com/starcrashsf\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-22d.html\nWatch and listen:\n Great Highway: Writing in the Desert: http://youtu.be/ZdA-bIBxLWc\n Ryan Flynn: Automatic Love: http://youtu.be/rk-sTscSxnA\n Ponyskull: What You Don't Know: http://youtu.be/7SdipCgjS4o\n Vice Reine: Aquaerium: http://youtu.be/r8QxForMJho"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "THE CASUAL COALITION ", "ArtistImage": "https://photos.bandsintown.com/thumb/11530412.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "Improvisational Indie Rock&roll", "Time": "8:00 PM", "Venue": "(((folkYEAH!))) presents:  The Basement Tapes Live!  performed by The Casual Coalition w/ very special guest Chuck Prophet", "moreBioInfo": "Born on the stage of countless nights at Terrapin Crossroads, The Casual Coalition are a branch from the \"community music tree\" that was planted at the Marin county venue, owned by Grateful Dead bassist, Phil Lesh. The Coalition features mainstays, Craig MacArthur, Brian Rashap, and Scott Guberman, as well as numerous collaborators that rotate within, such as Stu Allen (Phil Lesh & Friends, Mars Hotel), Dan “LEBO” Lebowitz (ALO), Greg Loiacono (Mother Hips), Scott Law (Phil Lesh & Friends, Cosmic Twang), Mark Karan (Ratdog, Phil Lesh & Friends), Dave Zirbel (San Geronimo), Ezra Lipp (Phil Lesh & Friends), Danny Luehring (San Geronimo). All are a product of the intermingling of various musical collaborations that happen on a daily basis at Terrapin Crossroads. The band also showcases some original songs put forth by each contributing member. The songs are then nurtured & grown with each configuration. Categorized as improvisational indie-rock, the band has been known to really explore the songs in an exciting, different way each and every night.", "otherInfo": "No event info available"}, {"Address": "224 Vintage Wy, Novato, CA 94945", "Artist": "Bob Schneider ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619194.jpeg", "Coordinates": [38.08854600000001, -122.5534481], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Hopmonk Tavern", "moreBioInfo": "No artist bio available", "otherInfo": "Bob Schneider"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "W ", "ArtistImage": "https://photos.bandsintown.com/thumb/201876.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "1)W (Double You) was a Japanese pop duo formed for Ai Kago (加護亜依) and Nozomi Tsuji (辻希美), graduated members of the group Morning Musume (モーニング娘。) when they graduated in 2004. They started off by covering older Japanese pop hits from as far back as the 50s. After their first cover album, they began to release original songs and eventually a second album. In early 2006, the group was put on hiatus due to Kago's involvement in an underage smoking scandal. An upcoming single and third album were canceled. The group ended permanently at the start of 2007 when Kago's contract with their agency was terminated. 2)W - lofi songwriter with acoustic sound. 3)W is a Korean electronic pop-rock band under the record label Fluxus Music. Homepage", "otherInfo": "The Basement Tapes Live!, feat. The Casual Coalition, w/ ver"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "MartinLutherMcCoy ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8077498, -122.2726995], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "The New Parish", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Early ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8077498, -122.2726995], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "The New Parish", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "John Summit ", "ArtistImage": "https://photos.bandsintown.com/thumb/11401608.jpeg", "Coordinates": [37.7781117, -122.4058001], "Date": "2021-07-22", "EventDate": "Jul. 22nd, 2021", "Genre": "House, Tech House", "Time": "9:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "Hailing from a city steeped in house culture, Chicago’s John Summit has quickly become the hottest name in dance music following the success of ‘Deep End’ on Defected Records in June 2020 which became the longest-running Beatport #1 of the year and was named Pete Tong’s Essential New Tune before landing on Radio 1’s main playlist. Since then Summit has gone on to release a series of groundbreaking originals including ‘Thin Line’ on D4 Dance that’s amassed over 7 million total streams, as well as ‘Beauty Sleep’ on Repopulate Mars and ‘Make Me Feel’ on Insomniac; both of which sat atop Beatport’s overall chart. Other catalog highlights include noteworthy collaborations with Lee Foss and Nic Fanciulli, in addition to delivering official remixes for Jax Jones and Au/Ra’s ‘i miss u’ and Gorgon City and DRAMA’s ‘You’ve Done Enough’. John’s prolific output has also resulted in over 3 million monthly Spotify listeners and elevated him to the highest selling artist across all genres on Beatport over the last 12 months. Having already headlined many of North America’s signature dance venues, Summit’s set to leave his imprint on many of the most notable clubs and festivals worldwide this year.", "otherInfo": "No event info available"}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Andy McKee ", "ArtistImage": "https://photos.bandsintown.com/thumb/11252040.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Acoustic, Instrumental Acoustic Guitar, Instrumental", "Time": "9:00 AM", "Venue": "Andy McKee's Musicarium 2021 (Guitar Camp)", "moreBioInfo": "Andy McKee is one of the world’s finest acoustic guitarists and it’s evident from the accolades he’s received throughout his career. It’s his youthful energy, attention to song structure and melodic content that elevates him above the rest. After nearly a decade without releasing new studio recordings, McKee returns with his six-track EP, Symbol, out Friday, September 17 on Mythmaker Records in conjunction with Cruzen Street Records. “These are my interpretations of tunes that really inspired me,” says McKee. “I wanted to give listeners a chance to hear what I hear when I listen to this music. I also wanted to branch out a bit and include music that isn’t originally for acoustic guitar.” While Symbol is a collection of inspired renditions, they are important song choices; artists that deeply influence McKee and song’s that connect to his musical past. He pulls from the catalogues of greats like Michael Hedges, Preston Reed, Billy McLaughlin and Prince. There’s “Ragamuffin,” the EP’s lead single, which is a nod to one of McKee’s biggest influences, Michael Hedges. McKee notes that “Michael was not only a revolutionary guitarist on the technical side, his ability to compose for solo guitar was also genius. Most importantly though, he was able to search inside of himself and consistently pull up very human and evocative themes that made him a true artist. I’ll always be grateful for his music.” One track that might catch fans by surprise on Symbol is McKee’s gorgeous rendition of Prince’s “Purple Rain.” In 2012, McKee played alongside Prince in his band on the “Welcome 2 Australia” tour with the song being one of the setlist highlights. “I had originally come up with the ‘Purple Rain’ arrangement to open the shows with while I was on tour with Prince in Australia,” recalls McKee. “I have played it occasionally since then while touring and figured I should finally get a recording of it down. One thing that I learned from Prince while we were on the road is that we both really admire Joni Mitchell. I used that as a reference when trying to describe what I do. Although some of what I do on the guitar is technically demanding, I don’t ever really want that to overshadow the music.” Another standout from Symbol is Mckee’s take on “Chattanooga” by acclaimed guitarist Preston Reed. “In my opinion, ‘Chattanooga’ by Preston Reed is one of the finest fingerstyle guitar pieces ever written,” says McKee. “It’s just loaded with texture, harmony, percussion, and melody. I love the key changes and chromaticism between some of the chords. This tune really inspired me a lot.” McKee, like many, was infatuated with the Rocky IV soundtrack, specifically the Vince DiCola compositions “War” and “Training Montage.” For Symbol, McKee and DiCola joined forces to craft “Rocky IV Medley.” “That was about as surreal as it gets for me,” says McKee. “I became a fan of Vince’s work when I was six years old and I bought the soundtrack to the film on cassette. I used to listen to it all the time on my Sony Walkman and I really found that my favorite tunes were the instrumental tracks which were “War” and “Training Montage” from Vince. Those tunes awakened my mind to the possibility of being moved by music with no words. To be able to recreate those tunes with the electric guitar and play with Vince is really something I could never have dreamed of.” Andy McKee entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique. McKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song “Drifting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the U.S. and Acoustic Magazine in the UK. He also curates his own annual guitar retreat called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts from Dream Theater to Tommy Emmanuel.", "otherInfo": "This is Andy McKee's Guitar Camp featuring Yvette Young, Guitaro 5000, Trevor Gordon Hall, and special guest Michael Manring. its 4 days of workshops, lessons, and intimate performances. For more information, or to register, go to https://andymckeesmusicarium.com/"}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Tommy Emmanuel ", "ArtistImage": "https://photos.bandsintown.com/thumb/10367525.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Jazz, Folk, Acoustic Blues, Acoustic Instrumental Guitar, Bluegrass, Instrumental Guitar, Acoustic", "Time": "10:00 AM", "Venue": "Andy McKee's Musicarium", "moreBioInfo": "Tommy Emmanuel, CGP has achieved enough musical milestones to satisfy several lifetimes. At age six, he was touring Australia with his family band. By 30, he was a rock lead guitarist playing stadiums. At 44, he became one of five people ever named a \"Certified Guitar Player (CGP)\" by his idol, music icon Chet Atkins. Today, he plays sold-out shows everywhere from Nashville to London to Sydney. Influenced by the Merle Travis/Chet Atkins fingerstyle of guitar pickin', Emmanuel developed a style of solo guitar playing that encompasses the range of a whole band - covering drums, bass, rhythm, lead guitar, and vocal melody simultaneously. While some artist take a band on the road, Tommy build a complete sonic world entirely on his own with no overdubs or loops. Tommy has multiple Grammy nominations, a 3 time Aria Award Winner (Australia’s Grammys), countless \"Guitar Player” awards, and he was now numerous magazine polls naming him the greatest acoustic guitarist alive. He’s grateful for it all. For Tommy though, the greatest reward is always the same - to make the next great record and to see the beaming audience at the next great show.", "otherInfo": "No event info available"}, {"Address": "900 Marin St, San Francisco, CA 94124", "Artist": "Vindata ", "ArtistImage": "https://photos.bandsintown.com/thumb/11269469.jpeg", "Coordinates": [37.749351, -122.3859024], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Electronic", "Time": "5:00 PM", "Venue": "Vindata (DJ Set) - ", "moreBioInfo": "Vindata is the brainchild of Branden Ratcliff and Jared Poythress based in Los Angeles, California. Blending rugged hip hop beats with deep r&b passions, and indie-pop sensibilities; the pair are on a mission to expand how we define dance music.", "otherInfo": "Vindata (DJ Set) on the Patio at The Midway SF"}, {"Address": "6780 McKinley St Ste 170, Sebastopol, CA 95472", "Artist": "Samuel Gray Edmondson ", "ArtistImage": "https://photos.bandsintown.com/thumb/11543228.jpeg", "Coordinates": [38.403849, -122.8214796], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "Pax Mahle Wines", "moreBioInfo": "Intricate fingerstyle guitar from the musical mind of a punk kid who grew up to love nature, elegant melodies, and the expressive power of the acoustic instrument.", "otherInfo": "I'll be playing a set of instrumentals and singing a few, too."}, {"Address": "500 City Center Dr, Rohnert Park, CA 94928", "Artist": "Petty Rocks ", "ArtistImage": "https://photos.bandsintown.com/thumb/11488853.jpeg", "Coordinates": [38.3489592, -122.7029426], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Tribute Band", "Time": "5:30 PM", "Venue": "\"The Waiting\" is Over Tour 2021", "moreBioInfo": "A tribute to the music of the one-of-a-kind rock and roll icon, Tom Petty. Comprised of five top-notch, seasoned musicians, Tom Petty's iconic catalog, both top hits and \"deep cuts\", are performed in expert, high energy fashion.", "otherInfo": "Petty Rocks brings all the hits of Tom Petty & The Heartbreakers to Rohnert Park, CA's \"Party on the Plaza\". Free community event!"}, {"Address": "1 E 14th St, San Leandro, CA 94577", "Artist": "Hog Mob Ministries ", "ArtistImage": "https://photos.bandsintown.com/thumb/11531923.jpeg", "Coordinates": [37.7376381, -122.165871], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Hip-hop, Rap", "Time": "6:00 PM", "Venue": "Hog Mob Release Concert", "moreBioInfo": "HOG MOB ministries was founded in 2000 by Sevin, a former \"BLOOD\" gang member from Oak Park in Sacramento, Ca. After coming to saving faith in Jesus Christ, Sevin set out to create what he believed was the kind of fellowship Jesus always intended for us to have, but the streets have perverted. Since then Hog Mob has grown with members all over the country as well as having many community-based discipleship facilities and projects. HOG MOB is an acronym that stands for: “HOOK’D ON GOD-MINISTRY OVA BIZNESS”. What this basically means is, we addictively desire and actively pursue a relationship with the one true and living God. We also choose to live a life that serves his purpose not our own. As a whole, Hog Mob Ministries is an urban accountability and discipleship fellowship that focuses on living out biblical fellowship with brothers in Christ all over the world as well as helping those who are unaware of the \"good news\" of the Gospel to come to faith in Jesus as Lord and Savior.", "otherInfo": "Dontae, IV Conerly & Bazooka tha Disciple team up for one big release concert! \neach of these dynamic artists are dropping projects this month and in the spirit of Unity and Brotherhood they are doing their release concerts together. \nDon't miss this event! It's FREE to the public and family friendly, so bring everyone you can!"}, {"Address": "Main Street & State Street , Los Altos, CA 94022", "Artist": "Fully Funded ", "ArtistImage": "https://photos.bandsintown.com/thumb/11504057.jpeg", "Coordinates": [37.2230876, -95.70603559999999], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Beer Stroll", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "100 Humboldt Ave, Sausalito, CA 94965", "Artist": "JeConte ", "ArtistImage": "https://photos.bandsintown.com/thumb/11543021.jpeg", "Coordinates": [37.856631, -122.4782352], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Americana, Rock, Blues, Soulful Blues, World Blues, Folk", "Time": "6:00 PM", "Venue": "JeConte & The Salty Dawgs - Blues by the Bay", "moreBioInfo": "Inspirational Northern California Rock 'n' Roll at its best. JeConte brings an energy level and performance that gets the crowd rocking and keeps it rocking. This energy, combined with a deep soulful New Orleans Blues, Jazz & Funk influence, along with JeConte's non-stop lightening harmonica chops, makes this high energy music experience what live Rock, Blues, and Funk music is all about. JeConte has been singing and playing harmonica all of his adult Life, his style is his own and features his soulful, bluesy vocals and a Texas Blues/Jazz/Funk Harmonica style that is one of a kind. He plays his harmonica's through a vintage 1940's Vega Amp and multiple customized and modified microphones: a custom turner, and a modified JT30 top the list. Over the years JeConte has played with a number of musicians throughout the San Francisco Bay Area, New Orleans, Seattle, New York, Los Angeles, Europe, West Africa, Latin America and South America. He has been a member of many projects including, THIC, The Push, & Citronica Muse. JeConte's self-titled debut album 'Sweet Northern California' has received rave reviews and his Sophomore album 'Down by the Bayou' comes out in 2013. You can purchase his first album 'Sweet Northern California' direct from the iTunes. SNC features Mattey Cohen on Vocals and Guitar, Lex Razon on Drums, Mike Sugar on Bass and JeConte on Vocals, Harmonica and Guitar. All tunes are written by JeConte and Mattey Cohen except for 'Macaroon' (JeConte & Chris Haugen) and 'Run to the Sea'(JeConte & Mike Sugar). Special guests include: Derek Brooker, Robin Coomer, Chris Haugen, Glenn Hartman, Wally Ingram, Sean Leahy & Alan Williams. JeConte has shared the stage with: Players: Khaiara Arby, Tab Benoit, Stevie Black, Jackson Browne, Mangala Camera, Les Claypool, Brett Dennen, Carl Dufrene, Kervyn Cole, Cecil 'P-Nut' Daniels, CR Gruver, Eenor, Dale Fanning, Tom Freund, Fuzz, Glenn Hartman, Chris Haugen, Vince Herman, Basekopu Kouyaté, Wally Ingraham, Kirk Joseph, Michael Lamacchia, The Leroi Brothers, Arne Livingston, Eric Lindell, David Lindley, Jessica Lurie, Papa Mali, Bill McKay, Tommy Miller, Eric McFadden, Mike Myers, Anders Osborne, Mighty Dave Pelliccaro, Radio, Lex razon, Christopher Robin, Oumou Sangaré, Pete Sears, Ron Kat Spearman, John 'Stuball' Syewart, Derek Trucks, Vieux Farka Touré, Rob Wasserman, Bob Weir, Andy Widman, Mitch Woods, and many many more... Bands: ALO, Alphabet Soup, Anders Osborne, The Axis Bothers, Tab Benoit, Black Dog, Christopher Robin Band, Les Claypool, John Cleary, Carl Dufrene, Deep Banana Blackout, Jazz Mafia Trio, Dave Gleason's Wasted Days, Living Daylights, Leftover Salmon, Jerry Hannan, Mother Hips, NewMastersounds, Outformation, Papa Mali, Poor Man's Whiskey, Raw Deluxe, Freddie Roulette, Pete Sears, SOULIT, Ron Kat Spearman, Tea Leaf Green, Derek Trucks Band, Transcendental Hayride, Wild Magnolias, World Anthem Band, Vinyl, and many many more... JeConte's new record Down by the Bayou featuring Anders Osborne was also produced by Anders at Dockside Studios in Maurice LA. The band consists of Matty Cohen, Chris Haugen, Carl Dufrene & Wally Ingram. Oh Yeah!!!", "otherInfo": "The City of Sausalito Park and Recreation Department is proud to present Jazz and Blues by the Bay once more in Gabrielson Park featuring JeConte & The Salty Dawgs. \n\nFree for All concert on Friday July 2, 2021 at 6:30 p.m. The entire lawn will be available for lawn seating so bring a (low) chair, some friends and come enjoy the music!!\n\nJeConte is a blues rock singer and harmonica player based in Sausalito California. He travels the World performing at clubs and festivals with his bands based in: San Francisco Bay Area, New Orleans, Paris - France, and Bamako - Mali. Coming off his successful 2013 release of Mali Blues (Winning multiple top 10 playlists and honors - see TheMaliBlues.com) and with multiple European & US tours in 2013 & 2014, and in 2015 we saw the release of ‘Down by the Bayou,’ produced by, and featuring, Anders Osborne and released on Red Parlor Records.\n\n'Down by The Bayou' showcases the bluesy soulful vocals and lightening harmonica chops of renowned live wire JeConte, backed by a ferocious blues rock band featuring New Orleans legend Anders Osborne, veteran LA rocker Wally Ingram, Bayou Bassman Carl Dufrene, San Francisco slide virtuoso Chris Haugen & long time JeConte writing partner and lead guitar maestro Bay Area's Matty Cohen. \n\nDown by the Bayou dips deep into the roots of the Bayou, while simultaneously preserving the NorCal Rock n’ Roll and West African influences of JeConte’s style. Recorded upon his escape from the coup d’etat in Mali at Dockside Studios in Maurice Louisiana, JeConte went directly from the war torn West African country and the The MALI BLUES Sessions, into the heart of the Bayou to carve out a record that inspires deep soulful southern blues, and begs the listener to ask for more."}, {"Address": "371 1st St, Los Altos, CA 94022", "Artist": "The Song Gardeners ", "ArtistImage": "https://photos.bandsintown.com/thumb/11384641.jpeg", "Coordinates": [37.37602, -122.1160291], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Indie, New Age", "Time": "6:00 PM", "Venue": "Los Altos Beer Stroll", "moreBioInfo": "The Song Gardeners are at the forefront of the New Age Pop genre – creating well-crafted contemporary #chill, #groove, #pop songs with positive, empowering messages. The band includes singer/songwriters and multi-instrumentalists Corrie Dunn and Mary Gospe. Time to Soar, Mary Gospe's debut album of 12 original songs with multi-instrumentalist/producer David Vito Gregoli of Dharmapala Records was released on November 15, 2019. The band has performed at private concerts, retreats, churches, fundraising events, wineries and in cafes and retail businesses. For booking information, email thesonggardeners@gospe.com.", "otherInfo": "Join The Song Gardeners as they perform a two hour set of original music. #NewAgePop #Chill #Groove #Singer-songwriter #MusicWithAMessage #LOVE #MaryGospe #CorrieDunn"}, {"Address": "20 Grey St, Petaluma, CA 94952", "Artist": "Derek Irving and His Combo ", "ArtistImage": "https://photos.bandsintown.com/thumb/11020404.jpeg", "Coordinates": [38.2372463, -122.6386736], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "Derek Irving & His Combo", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Elevener ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Switchblade ", "ArtistImage": "https://photos.bandsintown.com/thumb/6180180.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Sludge Metal, Experimental, Metal, Doom, Avant Garde", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "In the cold winter of 1997 turning to 1998, Switchblade slowly took form as a quartet with 2 bassplayers who both screamed their lungs out. A 7\" and a few extra songs for a split 7\" were recorded with Fireside´s mastermind Pelle Gunnerfelt (Fireside, Hives, Breach) in the spring of 1998. In March 1999 Switchblade recorded their groundbreaking and very well received 10\". This time with a newly recruited 2:nd bassplayer/singer. The 10\" was recorded by Breach´s mastermind Anders Ekström. The 10\" turned out very chaotic and fast in tempo. A few months later a few more songs were recorded by Anders Ekström and those songs ended up as the split 7\"´s with Cult of Luna and The Jam Session. Then in late 1999 Switchblade took the decision to go on as a three-piece. During 2000 and 2001, switchblade recorded 2 albums together once again with Breach´s Anders Ekström turning the knobs. Switchblade toured both Sweden (with Cult of Luna) and Europe (twice) in support of the albums. Then in March 2003, Switchblade recorded their third selftitled full length album. The album was a 6 song, 47 minute sonic journey that ranged from subtle ambient soundscapes to monotonous, dark, instrumental passages to full on stoner flirting, yet epic heaviness. All with just sparse use of vocals. Previously having had some problems in truly capturing their sound and dynamics on tape, Switchblade turned to Carl Wikman at EAR Studios who is known for his big and true to nature sounding recordings. The album turned out to be the most powerful and focused material so far, and showcased a huge leap forward in the never ending evolution of Switchbladeï¿½s sound and songwriting. The album received great reveiws both in Europe and in the US, where the album was released by Jake Banon´s (CONVERGE) Deathwish/Icarus imprint. A 4 week European tour in support of the album took place in early 2004 and a shorter tour took place in the summer of 2004 based around an apperance at the legendary Ieper Festival in Belgium. In May 2004 Switchblade wanted to try out some new song ideas and approaches so they packed the gear and headed down to the Mission Hall studio located in the countryside in the south of Sweden. The weekend worth of recording together with Mattias Oldén from LOGH resulted in a 2 track 7\" with guestvocals and guitar, on one of the songs, by Mathias Friberg of LOGH. The 2 songs showed, by far, the most dynamic Switchblade material to that date. Come late summer of 2005, Switchblade packed up their gear and headed down to Mission Hall Studio once again. Having felt so relaxed and enjoyed working with Mathias Oldén, the choice was easy when picking a studio for the recording of the fourth selftitled Switchblade album. The 43+ minutes album consists of 2 long tracks and sees the band more dynamic than ever before. Insted of a constant wall of sound and riffing, every riff and every tone get alot of space and time to \"breathe\". To add further bleakness, beauty and depth to the album there´s guestvocals by \"E\" of swedish blackmetal band WATAIN and once again, guestvocals and guitar by Mattias Friberg of LOGH. The tempo of the songs has slowed down for each release and the vocals has taken a more subtle place in the music and more instrumental passages has been brought forward to create a very dark and almost instrumental soundtrack to the apocalypse. Switchblade are currently working on their 5th seftitled album to be recorded in the autumn of 2008.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Roxas ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "330 Virginia Street, Vallejo, CA 94590", "Artist": "Ronstadt Revival ", "ArtistImage": "https://photos.bandsintown.com/thumb/11357277.jpeg", "Coordinates": [38.1024202, -122.2571691], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Linda Ronstadt", "Time": "7:00 PM", "Venue": "Empress Theatre", "moreBioInfo": "Ronstadt Revival is the premier tribute to Linda Ronstadt, bringing you the songs you love and remember from this legendary artist. From Linda’s 1967 beginnings with The Stone Poneys to her amazing renditions in the 70s of songs by beloved songwriters like Smokey Robinson, Warren Zevon, Lowell George, The Eagles and The Rolling Stones to her 80s smash album Mad Love with it’s New Wave vibe. Ronstadt Revival will take you on timeless journey of all of your favorites including, You're No Good, Blue Bayou, When Will I Be Loved, Tracks of My Tears and so much more! https://www.ronstadtrevival.com - Sign up on our email list! Follow us on Facebook • Instagram • Bandsintown • Reverbnation", "otherInfo": "Come join Ronstadt Revival - A Tribute to Linda Ronstadt for their debut at the beautiful Empress Theatre!"}, {"Address": "982 Market St, San Francisco, CA 94102", "Artist": "Lucinda Williams ", "ArtistImage": "https://photos.bandsintown.com/thumb/10404379.jpeg", "Coordinates": [37.7827039, -122.4103578], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Folk Rock, Rock, Americana, Alternative Country", "Time": "7:00 PM", "Venue": "The Warfield", "moreBioInfo": "Three time Grammy Winner Lucinda Williams. Currently on tour!", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Tommie Sunshine ", "ArtistImage": "https://photos.bandsintown.com/thumb/7218103.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Electronic, Electro House", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "\"[Tommie Sunshine] just might be the guy who could make dance music fun and important again this year...\" Paper, 2006 Influenced by equal parts of Kraftwerk, AC/DC, and Farley Jackmaster Funk, mid-west rave legend and Brooklyn, NY resident Tommie Sunshine is raising the bar. Covering ground as artist, remixer, producer, vocalist, radio jock, label owner, DJ and songwriter and with his legendary hybrid of live performance and DJ sets now traveling the globe it wont be long before there will be, at least a little, Tommie Sunshine in your life. \"Need big-room house mixes of Sarah Conner or Andy Hunter? Check. How about a rock-house hybrid for The Stills? Got it. Gary Glitter shuffle-beat for Good Charlotte? Not a problem. And lets not get started on the weird quirky techno. All of this is leading Sunshine somewhere. Perhaps as a producer with a platinum record on his wall.\" DJ Times Magazine, 2005 His studio collaborations have included Felix Da Housecat, James Murphy, Arthur Baker, Mylo and DJ Hell; he has played everywhere from Hong Kong to Reykjavik. As an established remixer, Tommie (alongside long time collaborator Mark Verbos) has been requested to retouch work from a diverse list that includes Louis XVI, Yeah Yeah Yeahs, Good Charlotte, Kid Alex, Princess Superstar, Elvis Presley, Fallout Boy, Gang of Four, My Robot Friend, The Killers, Da Brat, P.O.D., Fischerspooner, The Faint, Kill Hannah, Ima Robot, Ladytron and Avril Lavigne. Furthermore, major fashion houses have asked Tommie for his deck time such as Versace, Raf Simons, Chanel, Xavier Delcour and Jeremy Scott Beverly Hills. Tommies original music has also been featured in a film by designer Jeremy Scott; NY hotel Tribeca Grands website, Blockbuster Video radio spots, a cd advertisement for the fashion label Chanel and on the CBS show Without A Trace. His work was also featured in Entertainment Tonights coverage of the Academy Awards, as well as the Hollywood release Kiss Kiss Bang Bang. Not one to wait for innovative outlets for his music, his tunes have been in video games such as NBA 2K6 which features an unreleased track titled And Then as well as Need For Speed: Underground 2. Now with all this under his belt, Tommie is setting the international stage for the release of his debut album to hit next year, prefaced by his first compilation CD coming fall 2005 After six years in Georgia where he ran Satellite Records - Atlanta and held down two residencies at Club Sol and Fusion, he moved back to Chicago for four years establishing club nights ElectroSweat and Degeneration. He also held down the position of promotional director of the Midwest dance mecca Dust Traxx and being named in URB magazines Next 100. As a member of Thee Maddkatt Courtship with longtime collaborator Felix Da Housecat, Tommie co-produced \"Cosmic Pop\" for ffrr/London Records and worked again with Felix & Miss Kittin - co writing Silver Screen, Happy Hour and Glitz Rock - on the award winning 2002 Kittenz & Thee Glitz LP. Thom Yorke of Radiohead is quoted in URB Magazine saying, That should have been fucking number one all over the world. The single \"Silver Screen (Shower Scene)\" continues to be a dancefloor classic around the world years after release. The duo returned to the studio again for the single Rocket Ride which is co-produced and co-written, as well as the track Everyone Is Someone In LA. Tommie also worked with International Deejay Gigolo records supremo DJ Hell and DFAs James Murphy on Hells NY Muscle LP. \"...Sunshines quirky ear, knack for being ahead of the curve and an enthusiasm bordering on the obsession for music cant be understated.\" DJ Times, 2005 His long history in the mid west rave scene made him a major source for those who wanted to learn more about the underground dance culture. He wrote the preface to Mireille Silcotts novel, Rave America and his knowledge on all things centric to this particular music cycle earned him an appearance in Peter Jennings Reporting on ABC, two separate BBC documentaries on House Music as well as the just out on DVD rave documentary Rise and featured DJing in Billy Corgans post smashing-Pumpkins band Zwans video for the song Lyric He has also been establishing his own presence as A&R and label owner with xylophone jones Recordings to include a cast of shocking newcomers alongside well established artists and Tommie himself. His xylophone jones Recordings Showcase at WMC 2004 was named by URB Magazine as the number 2 event of Conference in between Ultra Music Festival and BBC Radio 1 Essential Selection. ). 2004 also brought Tommie to radio, doing a monthly feature on XM Channel 80: The Move - nominated for a DanceStar award in 2004. 2005 proved to be the year of expose for Tommie, as his face graced both DJ Times and URB Magazines covers. He then went on to win Best DJ of Hong Kong 05, which in turn got him his first International Residency at Hong Kongs famous nightclub Volar. \"Having DJd everywhere from the dirtiest rock n roll dive bar to the Guggenheim Museum, Sunshine spins a unique blend of modern rock and future-forward dance music.\" HX, 2006 Stay tuned in 2006 as Tommie preps us all for his two releases. The first will be the Systematic Sessions Vol. 2 - Tommie Sunshine & Marc Romboy is out on German label Systematic Recordings in late June/early July, followed by the Ultra Records release of his double CD chock full of his remix and production work, past and present, with many surprises in store.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Selecta ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "CurZe ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "R A Y N E ", "ArtistImage": "https://photos.bandsintown.com/thumb/9358144.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Alternative, Pop, Electronic, Dance Pop", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Rayne is a South African singer, songwriter, actor and dancer. Stitched together from various elements and influences in a Warholian fashion, Rayne exhibits a theatrical and avant-garde persona, with a raw centre. He prides himself on his art and seeks to bring change to the world with his music.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Blessed Curse ", "ArtistImage": "https://photos.bandsintown.com/thumb/8518804.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Metal, Thrash Metal", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Blessed Curse, based in Sacramento California, have been making a name for themselves through selfless hard work, playing countless shows, and unleashing some of the most punishing true heavy metal. The band began with humble beginnings as childhood friends forging their love of music into their own band, and over the past 16 years they've grown to become a meticulous killing militia primed to join the bigger league and take things to a more international playing field. Forming under the name \"Atrosity\" in 2001, the band recorded their debut 5-song E.P. in early 2005 after many formative years of learning old school metal classic tunes from the likes of Metallica, Iron Maiden, Slayer and Judas Priest. This 5-song EP, appropriately titled \"Fuck Everything\", was the group's first step in their long journey from leaving the confines of Colfax, CA to the world beyond as Atrosity quickly established themselves as the true, young thrash metal band in the Northern California area. 2005 also cemented the young band's reputation further as they opened for thrash metal legends Kreator and Overkill in Sacramento, CA giving them a taste of professional live performances. In 2006, Atrostiy was forced to undergo a name change due to their being an established death metal band from Germany using the proper English spelling of Atrocity. Quickly deciding on the ultra-heavy alternate name of Devastator, the band continued the metal mayhem as the now revamped headbanging force and needed a release with the new name to get the word out to all the ravenous followers as well as potential new fans they would set out to convert. Devastator recorded a 5-song EP, titled \"Crush and Kill\", which was recorded completely live in the studio in two days. Released on Friday, October 13th, \"Crush and Kill\" quickly lived up and passed its predecessor to further spread the band's name and reputation. Devastator spent most of 2007 playing up and down California with fellow up and coming new thrash bands such as Merciless Death, Hatchet, and Warbringer, as well as with national touring acts such as Kreator (twice), Sodom, Three Inches of Blood, Napalm Death, Overkill (twice), Hirax, and Dragonlord. In the fall of 2007, Devastator once again headed off to the studio, this time in Petaluma, CA, to record their follow-up EP, \"Slaughtered Like Pigs\", with the help of the then current drummer of Hatchet and Slave Productions. With their new recording Devastator joined their Bay Area brothers-in-arms Hatchet on a west coast tour blazing a path of destruction. Pushing ever forward, Devastator spent 2008 touring all over the west coast doing random dates alongside notable names like M.O.D., Heathen and Agent Steel, in addition to signing a publishing agreement with Marco Barbieri's Salem Rose Music. In 2009, Devastator geared up to record their next demo recording, the far more professional \"Burn the Beast\" EP sessions at Trident Studios, which was recorded, mixed and mastered in a week by Juan Urteaga (Testament, Machine Head, Sadus). \"Burn the Beast\" received rave press reviews and metal radio airplay across the country and to build upon the momentum the band embarked on a full US tour that summer, dubbed the \"Slaughtering the Masses\" tour, spreading their music and making new fans in over 40 cities. Upon returning home the band realized they had learned a lot from the experience and pulled back making themselves inactive despite a few one-off stints in 2010 from the aggressive live show routine and began making general improvements to their sound, musicianship, vocals and new material. Aiming to join the big leagues Devastator felt the need for another new name that was more unique and original and dubbed themselves Blessed Curse - because being in a band is both a blessing and a curse. In 2011 with an arsenal of new songs the band headed back to Trident Studios with producer Juan Urteaga to record the full-length album of their self-titled Blessed Curse debut. True metal performed with integrity highlighting the band's distinct take on their metal influences and capturing the past, present and future of Blessed Curse. Packaged with a killer original artwork piece from Marc Sasso (Dio, Halford, Cage), Blessed Curse are ready to take it to the next level and have partnered with Cyclone Empire Records to make that next leap possible. Released in the US under Marco Barbieri's record label M-Theory Audio, the Blessed Curse debut album is available world-wide for the metal masses. Since the completion of their debut, the band returned to the live front assaulting audiences with their intense barrage of metal mayhem and sharing stages all over the west coast with bands like Death Angel, Destruction, D.R.I., Evil Dead, Bonded by Blood, Exmortus, Sacrificial Slaughter, and Witchaven. 2016 has brought a new era to the band. Enlisting 6-string shredder Gregg Laubacher on guitar alongside original members Tyler Satterlee on guitar and vocals as well as Derek Bean on drums, B.C. completed the brand new recording titled \"Beware of the Night\" in 2017. Bringing the band back to Trident Studios with the work of Juan Urteaga the recording session marked the third experience of working at Trident and the result was the most punishing, crushing, and pummeling cut of sonic metal music that Blessed Curse has released to date. Bringing five new tracks to life including the first lyric video for the featured song \"Nightbreed\", Beware of the Night was released in the U.S. under the M-Theory Audio label. Pushing forward with new music and an even more fierce determination to bring B.C. to the wider world, countless shows and more headbanging music await the future of Blessed Curse. Bringing a full on metal assault to the USA since 2001.", "otherInfo": "Performing Live:\n EXMORTUS -- https://www.facebook.com/exmortusofficial\n GÜRSCHACH -- https://www.gurschach.com/\n BLESSED CURSE -- https://www.facebook.com/blessedcurseofficial\nWhen you think of Whittier, California, two things come to mind: cruising and Richard Nixon. Now you can add a third thing to that list: metal band Exmortus. The band touches on the many metal sub genres, from death and black metal to technical, with a penchant for thrash. Hard and heavy with non stop aggression, Exmortus has been slinging the thrash for close to two decades. Founded by cousins (guitarist/songwriter) Conan and Mario (drums), the metal band started as a boyhood extracurricular activity. And even as band members came and went, Exmortus grew and changed, eventually releasing four full lengths filled with brutal tunes. These dudes make the kind of music your catholic parents hate, complete with images of flesh-feasting and decay, not to mention pounding drums and song titles like \"Swallow Your Soul\" (you can tell your parents that this metal band covers Beethoven to even things out). Along with the dark imagery and lyrics comes a technical precision and neoclassical flourishes that you don't always hear in thrash - the instrumentals are sharp and on point, and live the band is tight (being together for almost 20 years will do that to a live set). Exmortus is ready to give what every metal head craves: ferocious vocals, shredding guitars, high energy battle anthems, long hair and leather, and all around mayhem.\nmetal.\ndoors @ 7pm;\nshow @ 7:30pm.\nall ages.\n$15 advance;\n$18 day of show.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23d.html\nWatch and listen:\n Exmortus: Metal Is King: http://youtu.be/JT7q4fpxL0U\n Exmortus: Feast of Flesh: http://youtu.be/1XFj6p6PoYo\n Gürschach: St. Anger: http://youtu.be/urRruX2PrY0"}, {"Address": "41 Wharf Rd, Bolinas, CA 94924", "Artist": "Caitlin Jemma ", "ArtistImage": "https://photos.bandsintown.com/thumb/11366664.jpeg", "Coordinates": [37.9101935, -122.6851545], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Caitlin Jemma's Single Release + Birthday Party ", "moreBioInfo": "Caitlin Jemma is a small-town girl with a big country heart. Raised in the high desert of Northern Nevada, her songwriting is influenced by a sense of adventure, reverie, and discovery. With a sound tempered by country and delivered with soul, Caitlin Jemma brings a wholesome and enlivened energy to the deep-rooted traditions of storytelling folk. Jemma's sweet and salty twang has earned comparisons to a young Iris Dement, with echoes of Gillian Welch & Valerie June. Whether performing solo or with her band, The Goodness, Jemma’s dynamic sound, timeless songwriting, & playful stage presence is captivating audiences everywhere from her Pacific Northwest home to Europe. Discography: Old Joy (2016), Lick Them Wounds (2014), Home Means The Hills (2013).", "otherInfo": "w/ Anna Moss + The Nightshades"}, {"Address": "41 Wharf Rd, Bolinas, CA 94924", "Artist": "Anna Moss & the Nightshades ", "ArtistImage": "https://photos.bandsintown.com/thumb/11433452.jpeg", "Coordinates": [37.9101935, -122.6851545], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Smiley's Schooner Saloon & Hotel", "moreBioInfo": "New Orleans, bedroom pop. The Soul-O project of Anna Moss of Handmade Moments", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Rob Gee ", "ArtistImage": "https://photos.bandsintown.com/thumb/6280850.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Hardcore & Hardstyle", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Rob GEE is famous all across The Universe as \"the hardest DJ to ever play the Limelight in NYC.\" In the club's early 90's heyday, the versatile GEE kept delirious audiences going through spinning at Limelight's \"Future Shock\" dance/techno nights and performing with his live band as well as spinning at the club's \"Rock And Roll Church\" metal/ rock/ industrial nights. The crowds kept coming back to Limelight, just like they did in Australia, Japan, Italy, Spain, Scotland, Austria, Hungary and Belgium to name a few. GEE is a recurring headliner at Sensation,Thunderdome, Mysteryland, and Love Parade, where GEE played before one million people. His diverse appeal keeps him performing weekly at all types of musical events and concerts. GEE has shared the stage with everyone from Hatebreed and Biohazard to Crystal Method, Busta Rhymes, Kurtis Blow, and Afrika Bambaataa. His GEEness has also has spun at many Slipknot and Korn after parties with his good friend, DJ Starscream a.k.a. #0 of Slipknot. GEE's history of DJing and live performances shows his dedication of bringing the fusion of organic and electronic music to a wide variety of listeners. GEE's love of hip-hop, hardcore, techno, metal and every other genre for that matter set him apart from the rest. While other DJs make tracks and spin records, GEE is an Artist who writes original songs. His indecisiveness as to whether or not he wanted to breakdance and spin hip-hop or jump in the mosh pit and play in a metal band was one of the reasons he began to cultivate his own style of both. Rob GEE is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hip-hop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down (just to name a few) creating a unification of Rock, Electronic, & Metal as well any other style GEE chooses to use. The GEEsult is Rob GEE gabber music. Rob GEE says, \"There are no boundaries in music\" . GEE is writing history launching gabber into the scene of the galaxy...... \"The Gabber Guru,\" as GEE is known for his constant motivation of #PositivianVibes gained worldwide fame after the release of \"Ecstasy You Got What I Need\". The song went Gold and was the #1 video on The Box for 13 straight weeks. At the same time, \"Ecstasy\" rose to #9 on the pop charts and earned him Best Artist, Best Producer and Best Song of the year at The Thunder Awards in Holland. The GEE Man has recently enjoyed more worldwide success along band mates Neophyte and Tieum with their collective efforts \"Coming At You Strong\", \"Anxiety\", & \"Rage With Pride\" under the name \"Riot Squad\". Rob GEE is still pushing solo success globally with his most recent hit \"RIght Now\". GEE always with his open mind has enjoyed recent Hardstyle & Rawstyle bangers teaming up with heavy hitters like The Prophet and Adaro. While in the same breath has been rocking the mainstream airwaves collaborating with hardcore giants Noize Suppressor, Mad Dog, & Furyan. Look out later this year, nu metal will meet hardcore in the studio ring when Rob GEE teams up with no other than Shavo Odadjian of System Of A Down. Rob GEE won't be stopped!!!!!! The sound is 100% Rob GEE, which means eclectic, unexpected and completely unique. Much #GEEspect & #PositivianVibes", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Gürschach ", "ArtistImage": "https://photos.bandsintown.com/thumb/11509609.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Heavy Metal, Progressive Metal, Metal, Experimental Metal, Dark Matter, Thrash Metal", "Time": "7:00 PM", "Venue": "Exmortus @ DNA Lounge", "moreBioInfo": "Gürschach (pronounced Ger-shock) is a four-piece Experimental Metal band from the San Francisco Bay Area, whose main vision is to create an unfamiliar, yet captivating listening experience for their audience.", "otherInfo": "DNA Lounge & Olympus Present:\nEXMORTUS\nFriday July 23rd\nAll Ages\nDoors @ 7pm\nShow @ 8pm\nTickets on sale at www.dnalounge.com"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Brizzy ", "ArtistImage": "https://photos.bandsintown.com/thumb/6026344.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Anglerfish ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Exmortus ", "ArtistImage": "https://photos.bandsintown.com/thumb/9420744.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Shred, Power Metal, Thrash Metal, Metal, Death Metal", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "EXMORTUS are an entity amongst themselves and their music, both complex and thoroughly hook-laden, refuses to lend itself to easy categorization. From the technical death-thrash riffage and surgically precise drumming to their neo-classical, twin virtuoso lead guitar attack, fans of death metal, thrash, prog metal, traditional heavy metal and all true metal sub-genres alike enjoy having their craniums crushed by the fury of EXMORTUS.", "otherInfo": "Performing Live:\n EXMORTUS -- https://www.facebook.com/exmortusofficial\n GÜRSCHACH -- https://www.gurschach.com/\n BLESSED CURSE -- https://www.facebook.com/blessedcurseofficial\nWhen you think of Whittier, California, two things come to mind: cruising and Richard Nixon. Now you can add a third thing to that list: metal band Exmortus. The band touches on the many metal sub genres, from death and black metal to technical, with a penchant for thrash. Hard and heavy with non stop aggression, Exmortus has been slinging the thrash for close to two decades. Founded by cousins (guitarist/songwriter) Conan and Mario (drums), the metal band started as a boyhood extracurricular activity. And even as band members came and went, Exmortus grew and changed, eventually releasing four full lengths filled with brutal tunes. These dudes make the kind of music your catholic parents hate, complete with images of flesh-feasting and decay, not to mention pounding drums and song titles like \"Swallow Your Soul\" (you can tell your parents that this metal band covers Beethoven to even things out). Along with the dark imagery and lyrics comes a technical precision and neoclassical flourishes that you don't always hear in thrash - the instrumentals are sharp and on point, and live the band is tight (being together for almost 20 years will do that to a live set). Exmortus is ready to give what every metal head craves: ferocious vocals, shredding guitars, high energy battle anthems, long hair and leather, and all around mayhem.\nmetal.\ndoors @ 7pm;\nshow @ 7:30pm.\nall ages.\n$15 advance;\n$18 day of show.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23d.html\nWatch and listen:\n Exmortus: Metal Is King: http://youtu.be/JT7q4fpxL0U\n Exmortus: Feast of Flesh: http://youtu.be/1XFj6p6PoYo\n Gürschach: St. Anger: http://youtu.be/urRruX2PrY0"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Christopher Lawrence ", "ArtistImage": "https://photos.bandsintown.com/thumb/8461025.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Underground Trance, Trance, Electronic, Tech Trance, Psy Trance", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Christopher Lawrence is an American disc jockey and producer specializing in progressive trance music. He has released 7 mix CDs since the mid 1990s. Voted the #14 DJ in the world by DJ Magazine’s prestigious ‘Top 100’ poll for 2005 and a recent winner of the \"Best DJ\" award at the Dancestar US Awards, Christopher Lawrence is recognized worldwide as one of the World's top DJs and producers. Dubbed \"A Superstar DJ\" by the US’s URB and “One Of The Most Popular DJs On The Global Circuit” by DJ Magazine, Christopher Lawrence is one of the biggest, most respected and popular names in dance music today. Winner of the “Best American DJ” at the IDMA’s at WMC 2005, Christopher's production skills, coupled with his ability to take international dancefloors by storm with his tough techno trance sets, place him in high demand worldwide. Once an outsider in a world dominated by European and UK DJs, Lawrence has risen to the top of the international dance music heap. He is now considered one of the key global players and one America’s leading dance music exports, playing main stage at the world’s biggest festivals and superclubs. Christopher was the only US DJ invited to headline all three of the inaugural Ministry Of Sound, Cream and Gatecrasher tours of America.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - after hours.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "176 2nd St, San Francisco, CA 94105", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/11546571.jpeg", "Coordinates": [37.7868529, -122.3987619], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Comedy", "Time": "7:00 PM", "Venue": "The Setup", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Mo Mandel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619297.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "This show is 18 & over with valid, government-issued photo ID. There is a two drink minimum per person. Cameras and video/audio recording devices are not permitted. Ticket sales shut off online before doors open; there may be tickets available at the show. Reserved Premium Seating: $35 General Admission: $25 in advance, $28 day of show"}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Miramar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8244550.jpeg", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Boléros, Love And Anti-love Songs", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "Boleros from Puerto Rico & Beyond. Debut album on Barbés Records. Booking Europe: Derapage Prod @miramarboleros, #miramarboleros", "otherInfo": "No event info available"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Russell Peters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619761.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "San Jose Improv", "moreBioInfo": "No artist bio available", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Los Kinos ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Tommy Guerrero ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8077498, -122.2726995], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "The New Parish", "moreBioInfo": "Originally known as a member of the old school skateboarding gang \"The Bones Brigade\". He spent several years in the group Jet Black Crayon before releasing his first solo-Single in 1995, entitled \"Backintheday.\" He mixes a variety of jazz, ambient, and hip-hop styles to create a very soulful and chill vibe throughout his followup cds. On his CD \"Soul Food Taqueria\" he collaborated with both Gresham Taylor and the rapper Lyrics Born to add vocal tracks to several of his creations.", "otherInfo": "No event info available"}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Los Sagitarios ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Lillias White ", "ArtistImage": "https://photos.bandsintown.com/thumb/135098.jpeg", "Coordinates": [37.7860081, -122.4092959], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "No artist bio available", "otherInfo": "We will try to seat all parties of two or more together and appreciate your patience and understanding as we operate to maintain all safety guidelines. Doors open 45-minutes prior to curtain time. Seating will be based on party size, arrival time, and is up to the discretion of the management."}, {"Address": "1900 Market St, San Francisco, CA 94102", "Artist": "Jim McVeigh ", "ArtistImage": "https://photos.bandsintown.com/thumb/11513578.jpeg", "Coordinates": [37.7706537, -122.4253067], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Standup Comedy, Clean Comedy, Comedy", "Time": "8:00 PM", "Venue": "Orbit Room", "moreBioInfo": "Jim McVeigh is a comedian based in Oakland. His comedy stems from feeling like an alien in most parts of life. He’s been described as having both dorky-dad, and cool-mom energy on stage. His act is vulnerable and silly, as he tries to process the world happening at him. Jim is a recent addition to the rosters of Punch Line, Cobb’s, and Rooster T Feathers. He’s opened for Eddie Pepitone, and Pauly Shore, and selected to perform in SF Sketchfest. He co-hosts the popular weekly comedy show, Critical Hit, in Oakland every Saturday.", "otherInfo": "No event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Late for the Train ", "ArtistImage": "https://photos.bandsintown.com/thumb/11196924.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Bluegrass, Traditional Celtic, Folk Revival, Folk, Folk-blues, Traditional Bluegrass, Indie Folk", "Time": "8:00 PM", "Venue": "One Grass Two Grass w/ Late for the Train", "moreBioInfo": "Late for the Train is a modern string band that feels both fresh and familiar. Drawing heavily from American folk & bluegrass, the San Francisco-based group delivers soulful and articulate arrangements of original and traditional music. The core ensemble consists of songwriters and multi-instrumentalists David Pascoe (guitar/mandolin), Laura Benson (fiddle), and Thom Beneduci (stand-up bass).", "otherInfo": "Late for the Train opens the night for One Grass Two Grass, bringing harmonies and original folk stylings to set the mood for a night of good vibes and lots of dancing. \n\nOne Grass Two Grass delivers high energy, hard driving, fun-loving, old-timey, new-timey, good-timey, rockin’ California string band music. One Grass Two Grass forges its own style of folk meets old-time, meets rock, meets bluegrass."}, {"Address": "201 Washington St, Petaluma, CA 94952", "Artist": "DJ Cal ", "ArtistImage": "https://photos.bandsintown.com/thumb/11542649.jpeg", "Coordinates": [38.2348823, -122.6430848], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Hip Hop, Top40, Edm, Trap, Open Format", "Time": "8:00 PM", "Venue": "The Phoenix Theater", "moreBioInfo": "A native of Sonoma County, DJ CAL is from Bay Area / North Bay. His setlists are Multi/Genre designed to move the crowds with a blend of Trap, EDM,Hip-Hop and Reggaeton.He calls the city of Santa Rosa his home, but you might’ve have heard his mixes on-air across the nation (San Francisco, Las Vegas, Orlando, Palms Springs, etc.). He also holds a spot as a mixshow DJ on Fresno California B95, with Teezzy Radio, Last Call and Friday night street party. DJ CAL has several Bay Area and Northern California venues under his belt. Catch him performing and hanging out with the hottest names in music around the Bay. More recently, DJ CAL got awarded for “Best Live DJ” 2018 from “Bohemian” he constantly working on music. Every day he’s working on new edits and remixes. His is work has been supported and featured by various blogs, websites and record pools, DJ City, MyMP3Pool, BpmSupreme and SmashTheClub.com DJ CAL is also working hard to make his own mark in the music industry.", "otherInfo": "Lil Bean and ZayBang hit the Phoenix!"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "French Cassettes ", "ArtistImage": "https://photos.bandsintown.com/thumb/7443738.jpeg", "Coordinates": [37.7760033, -122.4204681], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Indie Pop Rocks", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "FAST TIMES presents FRENCH CASSETTES"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Juan Wayne ", "ArtistImage": "https://photos.bandsintown.com/thumb/9952762.jpeg", "Coordinates": [37.7760033, -122.4204681], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "Call it the alcoholic lovechild of two roving delinquents. Los Angeles-based Juan Wayne emerged in the middle of 2018 from the dark outer recesses of the minds of songwriters Andrew St. James and César Maria while out on tour in support of the former's 2017 solo album The Big Ole Veronica Apology Record. Once returned home from the road and huddled in seclusion in Maria's Koreatown apartment, the pair recorded two albums on an 8 track tape machine. Part concept, part earnest autobiographical reflection, the collaboration quickly gained traction through their native San Francisco songwriting community, resulting in live performances replete with cowboy hats and boots and a bevy of supporting players culled from acts as diverse as Tino Drima and Deltron 3030. Their upcoming first release, Juan Wayne 1, clocks just over 16 minutes. But there in its brevity is the undeniable kismet. The duo's lifelong friendship yields a profound connection and what results is a sorrowful lofi pop dreamscape melded together by two distinct narrative voices so intertwined - both through personal history and heartache, and shared influence - that it becomes difficult to distinguish where one ends and the other begins. Herein the root of new beginning takes shape. Best seen and heard to be believed, Juan Wayne rides.", "otherInfo": "FAST TIMES presents FRENCH CASSETTES"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Clyde Shankle ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "L.O.E. Gino"}, {"Address": "726 1st St, Benicia, CA 94510", "Artist": "Jeffrey James Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/11447658.jpeg", "Coordinates": [38.0501532, -122.1578947], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Blues", "Time": "8:30 PM", "Venue": "Live @ The Rellik", "moreBioInfo": "Jeffrey James Horan is an American guitarist/singer/songwriter, based in the San Francisco Bay Area. Born in Santa Clara, CA. in 1986, Jeffrey has been playing guitar for 28 years, professionally for 19 years. He started playing gospel music in church as a young child and later in his teens Jeffrey started playing traditional blues and soul music with local bay area artists. It was at this time that his talent had progressed to a level that was to be desired and started his professional career. At 16 years old Jeffrey joined force with the son of the legend John Lee Hooker. As guitarist for John Lee Hooker, Jr. he was featured on 2 Grammy Nominated albums in 2004 and 2009. In the last 12 years Jeffrey has been touring with John Lee Nationally and Internationally. Together they have shared the bill and stages with the likes of B.B King, Buddy Guy, Santana, Lenny Kravitz, and with The Rolling Stones in 2017. In the last few years Jeffrey has been working on a solo career making his way into position as the front man. Jeffrey's passion is in blues and rock music but you can hear the influence of country, gospel, and funk seasoned throughout his guitar styling. Jeffrey James describes his sound as modern blues. Live shows are an energetic, powerful, and dynamic with catchy originals and smoking covers. Some of Jeffrey's influences are B.B. King, Albert King, Buddy Guy, Jimi Hendrix, The Vaughan Brothers, Santana, and Eric Clapton.", "otherInfo": "No event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Shante ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "L.O.E. Gino"}, {"Address": "3553 Mt Diablo Blvd, Lafayette, CA 94549", "Artist": "Audiorage ", "ArtistImage": "https://photos.bandsintown.com/thumb/6159724.jpeg", "Coordinates": [37.8916028, -122.1204661], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Alternative Rock, Hard Rock, Rock", "Time": "9:00 PM", "Venue": "Audiorage at the Roundup Saloon", "moreBioInfo": "Audiorage plays the best alternative rock of the 90's and 00's: Smashing Pumpkins, Red Hot Chili Peppers, White Stripes, Muse, Rage Against The Machine, Weezer and much, much more. Audiorage brings back a musical style that's been missing from local stages for too long: the huge guitar sounds, driving beats and soaring vocals of 90's alternative rock. Our performances are a potent cocktail of favorites, new interpretations and original music. Contact us: info@audiorage.com", "otherInfo": "Audiorage's first post-lockdown gig!\n\nRed Hot Chili Peppers, Smashing Pumpkins, Green Day, Rage Against the Machine, White Stripes and much more. An electrifying night of '90s and '00s alternative rock!"}, {"Address": "765 Laurel St, San Carlos, CA 94070", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.5045343, -122.2584098], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Singer Songwriter, Cabaret, Broadway, Cover Songs", "Time": "9:00 PM", "Venue": "Faith & Spirits", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "One Grass Two Grass ", "ArtistImage": "https://photos.bandsintown.com/thumb/8230821.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Bluegrass, Country", "Time": "9:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "One Grass Two Grass delivers high energy, hard driving, fun loving, old-timey, new-timey, good-timey, rocking California string band music. Through richly lyrical, naturally inspired originals cushioned by a bed of old mountain tunes and a dash of stomping rock and roll, their unique sound is expressed as a mesh of yesterdays established, deep rooted protocols with the need to bring strings to the times in their own exciting way. Standing on the shoulders of the contemporary string band movement One Grass Two Grass forge their own style of this folk meets old-time meets rock meets bluegrass craze. Getting their start in late 2012 in the San Francisco Bay Area, there have been many highlights in One Grass Two Grass’s upward trajectory through the years. They capped off 2016 with an appearance at The Yonder Mountain String Band’s Northwest String Summit, near Portland, OR , The Telluride Bluegrass Festival’s Band Competition in Telluride, CO, and preforming one of the main stage evening slots for The Hoes Down Harvest Festival at Full Belly Farm in Guinda, CA. 1G2G then could not have been more thrilled to kick off an action packed 2017 summer season with an exciting headlining show at one of San Francisco’s fanciest venues, The Great American Music Hall. The group has been seen accompanying many great artists on stage such as Larry Keel of Keller and the Keels and Natural Bridges, Vince Herman of Leftover Salmon, Poor Man’s Whiskey, James Nash, and John Cragie and have opened for contemporary string bands such as Fruition, Hot Buttered Rum, The Lil Smokies, Danny Barnes, Grant Farm, Front Country, Mipso, Whiskey Shivers, The Last Revel, and Reverend Peyton and the Big Damn Band. With their second album on the way in 2017 and being produced by Hot Buttered Rum’s Nat Keefe, One Grass Two Grass is excited to take the next studio album step. One of the bands defining moments was when Jacob Groopman of Front Country helped the crew produce their debut album in 2014. Released in February 2015 the collaboration proved to produce a rich self titled album which catapulted the group full speed into an exciting and eventful journey that is ever growing and evolving to this day. With 2017 taking the band all across the state of California, Oregon, Nevada, Utah, Montana, Idaho, and Colorado, the excitement is not slowing down. One Grass Two Grass is sure to have you swaying with your lover, stomping with your brother, smiling with your mother, and having just a plain old good time with one another. They deliver hard driving, fun loving, old-timey, new-timey, good-timey, rocking California string band music. Come join em! http://www.onegrasstwograss.com/", "otherInfo": "One Grass Two Grass"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Garth ", "ArtistImage": "https://photos.bandsintown.com/thumb/8340394.jpeg", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "Originally raised in the distant D.C. suburbs, Garth. is a singer, producer & multi-instrumentalist now based in New York City. Human Nature, his first musical offering as a solo artist, blends influences ranging from 90s R&B and 80s pop to the more electronic production of today.", "otherInfo": "Legendary House DJ Garth comes to Monarch for one night only."}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Mike Bee ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "Legendary house DJ Garth comes to back to the Bay."}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Pete Henry ", "ArtistImage": "https://photos.bandsintown.com/thumb/11496740.jpeg", "Coordinates": [37.6366586, -122.4905276], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Acoustic, One Man Band, Blues", "Time": "9:00 PM", "Venue": "Winters Tavern", "moreBioInfo": "Pete Henry Fisk, b. 1985, is a multi-instrumentalist from California. He began playing guitar at age ten, studying with Craig Sorrenti, and forming his first band with his mother on keys. By age thirteen, Pete had begun playing professionally around the Stockton and Modesto areas in Northern California. At age sixteen, he was being recognized for his skills on the guitar, competing in several different styles of music, winning 1st prize at the Stairway to Stardom concert in 2002 with his group, Concrete Rose, as well as the Louis Armstrong Award and Most Outstanding Jazz Soloist Award as a member of the Escalon High School Jazz Band. Pete went on to study with guitar virtuoso, John Schneiderman, at the University of California, Irvine, where he obtained his MFA. He was involved in a number of highly talented musical ensembles, including the UCI Guitar Ensemble, the IVC Guitar Ensemble, the Cal State Fullerton Orchestra, and the Orange Coast Guitar Society, where he traveled regularly and performed in concert halls across the nation. Meanwhile, Fisk maintained a love and commitment to jazz by attending blues and jazz jams around Orange and Stanislaus Counties of California. Since graduating college, Pete has stayed busy as a professional musician, composing works for screen and film, forming the band HIYA, the 21st Century Woody Guthrie Project, the 21st Century Gershwin Project, all the while teaching guitar and music for the South Orange County Community College District. Most recently, he has focused on guitar and mandolin transcriptions of modern music, from jazz, early Americana, to the latest contemporary songs. Though mostly a soloist now, Pete enjoys collaborating with other musicians as often as possible. He has since spread his musical arrangements and styling around the world, coast to coast of the United States, to the Caribbean Islands, Europe and the Eastern Mediterranean.", "otherInfo": "Peter Henry Fisk, b. 1985, is an American singer and instrumentalist. A performer since age 9, Pete has been recognized for his skills on guitar in several styles, completing a Master of Fine Arts in music from UC Irvine in 2010. Having played in a number of bands and ensembles, he has settled in as a singer soloist, touring internationally with his one-man band arrangements of popular tunes and original music."}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "Hot Since 82 ", "ArtistImage": "https://photos.bandsintown.com/thumb/8663744.jpeg", "Coordinates": [37.7781117, -122.4058001], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Electronic, Deep House", "Time": "10:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "No artist bio available", "otherInfo": "Hot Since 82"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "J. Holiday ", "ArtistImage": "https://photos.bandsintown.com/thumb/8653461.jpeg", "Coordinates": [37.7962494, -122.2785582], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "R&b/soul, R&b, Soul, Rnb-soul", "Time": "10:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "J. Holiday doesn’t pull any punches when he offers his take on the current state of R&B. “Rhythm and Blues is lacking storytellers right now,” insists the candid 22-year-old singer/songwriter. Holiday then pauses, name checks the late legendary singer Otis Redding as if to show his soul credentials and asks, “Where’s our generations’ ‘Sitting on the Dock of the Bay?’ Lately, it seems hip-hop has been birthing all of the great storytellers. It’s time to show that R&B is way more than just dance music. That’s what I’m trying to convey with my music. I won’t settle for less.” While such a statement may seem like a bold proclamation from the fresh-faced newcomer, the Washington D.C. native more than backs it up with his debut album, Back of My Lac. The buzz-heavy Music Line Group/Capitol Records release spotlights a burgeoning talent whose diverse influences range from the heartfelt soul of Marvin Gaye to the provocative street poetry of rap icon Tupac Shakur. “My sound is old school soul with a little mix of hip-hop,” explains Holiday. “If I had to give it a name I would call it ‘street soul.’ Nowadays the ‘hood has little to listen to within R&B. I want my music to be the soundtrack to their lives and beyond.” Indeed, an ambitious J. Holiday is poised to live up to such lofty aspirations. The hypnotic first-single “Be with Me,” produced by Rodney Jerkins, finds Holiday offering the age-old tale of a man wanting to be more than just friends with the object of his affections. “You be giving me the coldest shoulder/‘cause you don’t want your emotions taking over,” he croons. “Instead of talking about you looking for a soldier/are you trying to say you don’t see that in me?” On the title track “Back Of My Lac,” J. Holiday gives listeners a glimpse of his life struggles with heartfelt lines like “I grew up in a house with my mother/I didn’t have my punk ass father/because he felt it was time to move on.” “Without You” builds on a 70’s groove complete with soulful horns and lush strings as Holiday pushes to win back the love of a woman he’s lost. The bass-heavy hardened blues of “City Boy” (featuring dirty south rhyme royalty 8 Ball & MJG) is a two-fisted anthem of ghetto empowerment. And on “Thug Commandments,” Holiday is backed by a swinging, piano-driven break beat as he drops much-needed jewels for the block: “Stop cuffing that young girl, let her breathe/Be a father to your kids…no doo-rags in the Lord’s house/Put trust in the Lord, but keep a glock in the house.” For Holiday, such songwriting comes naturally for a young man who has never forgotten his humble beginnings. “I can say that I’ve lived that street life,” he testifies of his time growing up in Washington D.C. “The streets are not anything to glamorize. I’m trying to let my people back home know that I’m with them. DC has a lot of talent and I’m just trying to show people that we are here.” J. Holiday is a preachers’ son. Raised in the church by a hardworking mother, the pull of secular music was still too much for him to ignore. Fascinated by the early ‘90s R&B vocal groups such as Boyz II Men, H-Town and Jodeci, J. Holiday soon became enamored with hip-hop, marveling in the intricate rhymes of Jay-Z and OutKast. But it was during a high school talent show when a 14-year-old Holiday knew he had a passion for singing. However, local bands were unable to recruit the budding vocalist, whose mother had plans for her son to finish school before seriously pursuing music. Two years later, J. Holiday would discover the music of Marvin Gaye, an experience he calls a “revelation.” “At the time, I didn’t really know that much about him,” he says of the late soul icon. “Marvin became my major influence. He opened me up to folks like Donny Hathaway and Al Green. Those artists had a real honest soul about them. I just wanted to mix that feeling with hip-hop.” The gifted vocalist had found his calling. Holiday skipped college and began recording demos in a local studio. He also found himself increasingly caught up in street activities, but music offered a more positive path. Soon, Holiday met up with current manager Corey Green and formed the group 295, named after the D.C. highway. Buzz for 295 was growing but by 2003 the R&B act disbanded. Fortunately for J. Holiday, his vocal prowess and dynamic stage presence was too much of a commodity to pass up. A&R veteran, Anthony “T.A” Tate, of Music Line Group (Ciara, Teairra Marie) quickly set up a meeting with Capitol Records and a deal was made on the spot. “You just have to stay true to yourself,” Holiday says of his turbulent journey to becoming a recording artist. “A lot of artists nowadays are trying to be something that they are necessarily not. I don’t care how good a song is…if I don’t feel it personally, I’m not going to sing it because it’s not true to me. I feel very personal about my album. There’s nothing fake about it. This is my life. There are a lot of different stories out here and people just need to listen to them.”", "otherInfo": "Yoshi's Oakland Presents J. Holiday"}, {"Address": "Mission San Jose District, CA", "Artist": "SICK INDIVIDUALS ", "ArtistImage": "https://photos.bandsintown.com/thumb/11478899.jpeg", "Coordinates": [37.5334266, -121.920106], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Pop, Electronic Dance Music, House", "Time": "10:00 PM", "Venue": "Hacienda", "moreBioInfo": "Meeting at the conservatory for music in The Netherlands, Rinze ‘Ray’ Hofstee and Joep ‘Jim’ Smeele formed an instant connection bound by a shared love of music composition and electronic dance music. Drawing influences from Daft Punk, Bingo Players and Swedish House Mafia, their infectious blend of big beats and progressive house melodies quickly garnered them serious attention in all the right places. Coming from the Netherlands, where there genuinely seems to be something in the water when it comes to electronic dance music success, the pair have released on some of the world's most influential imprints - Revealed Recordings, Spinnin' Records, Warner, Interscope, Armada Music, Def Jam and Atlantic Records. Official remixes for Rihanna & David Guetta, Madonna, Moby, Rita Ora, Avicii and Icona Pop have peppered the global radio airwaves, ensuring their sound reaches millions of ears in all four corners of the planet. Recognising the power that the internet gave them to give fans constant access to their music, SICK INDIVIDUALS launched their own radio show; ‘THIS IS SICK’. Reaching tens of thousands of listeners every month and eventually morphing into the major new live 'THIS IS SICK' concept, created exclusively for their stage performances. The pair manipulate visuals and audio in real time direct from the DJ booth, creating a whole new immersive experience for fans who flock to see them play. With more new music to come from the pair this year, and a constantly inundated international tour diary, it’s safe to say it looks set to be another truly ‘SICK’ year from one of the Netherland’s most successful musical exports.", "otherInfo": "No event info available"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "Bruja ", "ArtistImage": "https://photos.bandsintown.com/thumb/7785741.jpeg", "Coordinates": [37.7781117, -122.4058001], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Sludge Metal, Metal", "Time": "10:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "BANDCAMP: https://bruja14.bandcamp.com/merch SOUNDCLOUD: https://m.soundcloud.com/bruja-band YOUTUBE: http://youtu.be/189Wwg4fC1k", "otherInfo": "Hot Since 82"}]