var sf_events_3 = [{"Address": "560 Broadway, San Francisco, CA 94133", "Artist": "The Bloozdogz", "ArtistBio": "Rodney Lee Castillo and Midnight train ,Now known as the Bloozdogz. we are a blues rock band performing songs written by Rodney Lee Castillo", "ArtistImage": "https://photos.bandsintown.com/thumb/8428559.jpeg", "Coordinates": [-122.40676, 37.798204], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "The Bloozdogz at The Condor Club: The Condor Club is most famous as the place where stripper Carol Doda got her start in the '60s. This topless a-go-go has been heating up North Beach off and on for nearly 50 years and still maintains the old charm (the sultry red velvet boudoir theme has a vintage Playboy feel to it). Customers of this gentleman's club can enjoy different forms of athletic entertainment, whether it be the diverse bevy of dancing ladies or the baseball or football players on the flat-screen TVs. There is a spacious VIP room for more private affairs if the main area gets crowded on Fridays and Saturdays, which it does thanks to the two-for-one appetizers and martini specials. Even Sundays get a special treatment with discount Jägerbombs (a shot of Jägermeister dropped in a pint of Red Bull). There is a $10-$15 cover every day of the week, but early bird specials and passes on the website can get you in for free or at reduced prices - just be sure to tip the dancers and the bartenders.", "Time": "3:00 PM", "Venue": "The Condor Club"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Night", "ArtistBio": "New album 'Raft of the World' out now! Youtube: https://www.youtube.com/watch?v=y4fuE_Fwn6E Spotify: https://open.spotify.com/album/4La5LsJ0a3svPbaavPQjym?si=pKoffz7DTyOcqT--L0Dhww iTunes: https://itun.es/se/xgzLhb", "ArtistImage": "https://photos.bandsintown.com/thumb/8002126.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Rock, Hard Rock", "OtherInfo": "Closed for private event at 3 p.m.", "Time": "3:00 PM", "Venue": "Sweetwater Music Hall"}, {"Address": "2155 3rd St, Livermore, CA 94550", "Artist": "Jesse Loren Strickman", "ArtistBio": "SF Bay Area singer-songwriter Jesse Loren Strickman is known for potent lyrics and powerfully minimal acoustic music. Emotionally charged vocals sail over jaunty acoustic chords in songs about personal love and social change.\n\nStrickman’s music features many deep recurring themes. Personal stories of intimacy and heartbreak color a lot of his repertoire. He writes of depression, highlighting some of the darker chapters of his past, offering a bridge to those who are currently struggling. A songwriter since grade school, his music has also explored childhood, innocence, morality, romance, heartbreak, poverty, politics, equality, the environment, and the spiritual universe.\n\nAnnually touring the Pacific West Coast as the frontman of Indie Folk bands, Strickman has played everywhere from intimate cafes to outdoor amphitheaters and festivals. He’s opened for national and world acts such as Damien Jurado, Jay Brannan, CAKE, The T Sisters, Aaron Ross (Hella), Night Riots, Lech Wierzynski (California Honeydrops), Jhameel, and many more.\n\nMid 2018 marked a new beginning for Strickman as he began performing under his own name as a singer/songwriter. He is currently in the studio for his debut full-length album at Tiny Telephone Recording in San Francisco.", "ArtistImage": "https://photos.bandsintown.com/thumb/9121741.jpeg", "Coordinates": [-121.768542, 37.679643], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Indie, Singer, Songwriter, Acoustic, Folk", "OtherInfo": "Jesse Loren Strickman will perform solo at the farmers market from 4-8pm. All ages. Free!", "Time": "4:00 PM", "Venue": "Livermore Farmer's Market"}, {"Address": "2001, Gayley Rd, Berkeley, CA", "Artist": "Social Distortion", "ArtistBio": "Here's how you know you've made it in the music business: You've stayed strong for three decades on your own terms, on your own time, by your own rules, and over that time your influence has only grown. Each of your albums has been stronger than your last. You've been brought onstage by Bruce Springsteen, because he wanted to play one of your songs. You've seen high times and low ones, good days and tragic days, but every night you give 100%, and every morning you wake up still swinging.\n\nThis is the short version of the Social Distortion bio — the long version could be a 10-part mini-series. But over the past 30 years, the punk godfathers in the band have all but trademarked their sound, a brand of hard rockabilly/punk that's cut with the melodic, road-tested lyrics of frontman Mike Ness. Their searing guitars and a locomotive rhythm section sound as alive today as they did in '82, as do Ness' hard-luck tales of love, loss and lessons learned. \"The most common thing I hear is, 'Man, your music got me through some hard times,'\" Ness says. \"And I just say, 'Me too.'\"\n\nHard Times And Nursery Rhymes (produced, for the first time, by Ness himself) is the band's first record since 2004, but the break hasn't changed them much. It maintains Social Distortion's key components — an all-but-perfected mix of punk, bluesy rock n’ roll and outlaw country — but it also finds them stretching the boundaries of their signature sound. \"I didn't want any one style of writing,\" Ness says. \"I didn't want it to be all heavy, like \"White Light, White Heat, White Trash.\" I wanted some heavy and some light. I wanted some fiction and some nonfiction. I wanted versatility.\"\n\nThat's evident right away. The record's first vocal track, \"California (Hustle and Flow),\" finds Ness and the band not roaring out of the gate so much as swaggering behind a chunky Stones-style locomotive groove. \"This record has a lot of my influences,\" Ness says, \"But how far you go with those influences is up to you. With this record I wanted to go a little farther. I wanted people to hear that second track and realize, 'Wow, this is not just another Social Distortion record.'\" (For good measure the track has hints of \"Ball and Chain\" and the Stones' \"All Down The Line\" and, for the first time, female backing vocals. \"I've been listening to records for years with (backing vocals), and I was like, \"Hey, why don't I do that?\" Ness laughs.)\n\nNot that the band's punk foundations have eroded; the first single \"Machine Gun Blues,\" a piece of gangland fiction set in 1934, could hail from \"Somewhere Between Heaven and Hell.\" But the record is evidence of the band's ability to evolve. \"Bakersfield,\" a setlist staple in recent years, is a waking-on-the-railroad-tracks story of wrecked love, forgiveness and Buck Owens; it closes with a spoken-word verse to make Merle Haggard smile. \"Can't Take It With You\" sports a Jerry Lee-style piano solo that scorches paint. And set closer \"Still Alive\" is a soaring carpe diem with an added emotional weight that can't be described or duplicated.\n\n\"The album is reminiscent to me of \"Somewhere,\" but it also has some of the darkness that \"White Light\" had. It has some of the flavor of \"Mommy's Little Monster,\" Ness said. \"I think it's very signature. We've never been afraid to evolve and show people what we can do.\"\n\n***\n\nNow in their fourth decade, Ness and Social Distortion have officially done one of the most non-punk things possible: They've failed to burn out.\n\nMixing Springsteen’s factory-overalls ethic with Southern California punk energy and black leather, Social Distortion formed with Ness and high school buddy, the late Dennis Danell, in the late 1970s; the group broke in 1983 with the thrashing plate of punk and displeasure \"Mommy's Little Monster.\" Their 1988 follow-up, \"Prison Bound,\" hinted at a sonic change to come, and by the band's self-titled 1990 record and 1992's \"Somewhere Between Heaven and Hell,\" their sound had solidified into the instantly recognizable brand of rock n’ roll that's defined them since.\n\nFor Hard Times, Social Distortion consists of Ness and longtime guitarist Jonny Wickersham, along with bassist Brent Harding and drummer David Hidalgo, Jr.\n\nThese days the band is rarely off the road for long, and continues to grip fans who have been around since \"Mommy's Little Monster\" while drawing new ones who discover the band through hand-shot YouTube clips. \"I see people bringing their kids to shows,\" Ness says. \"And I see kids bringing their parents.\"\n\nSocial Distortion is a mix of potent power, appeal across all age brackets and a genuine satisfaction at reaching as many people as they have. \"I write songs for myself, and I hope that other people will like them too,\" Ness says. \"I think every record you make is showing people what you've learned over the past few years. It's showing people, 'This is what I know.' \"", "ArtistImage": "https://photos.bandsintown.com/thumb/9092674.jpeg", "Coordinates": [-115.922472, 34.18126], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Pure Rock N Roll!, Punk", "OtherInfo": "http://bit.ly/2YfvfhG", "Time": "5:00 PM", "Venue": "Greek Theatre At UC Berkeley"}, {"Address": "34 S B St, San Mateo, CA 94401", "Artist": "Michelle Lambert", "ArtistBio": "“Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!” - Dennis Willis, Soundwaves TV", "ArtistImage": "https://photos.bandsintown.com/thumb/8758436.jpeg", "Coordinates": [-122.32445, 37.56726], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Acoustic Folk Pop", "OtherInfo": "Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!", "Time": "5:00 PM", "Venue": "O'Neills Irish Pub"}, {"Address": "103 Harvard Ave #4, Half Moon Bay, CA 94019", "Artist": "Chenot", "ArtistBio": "I play and sing whatever eclectic covers strike my fancy, from classic rock to Motown to that 90s jam you forgot you loved. I’m based in The San Francisco Bay Area, but I also play in the world-spanning band Sister Willow.", "ArtistImage": "https://photos.bandsintown.com/thumb/8140997.jpeg", "Coordinates": [-122.493806, 37.503305], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Classic Rock, Motown, Pop", "OtherInfo": "No other event info available", "Time": "5:00 PM", "Venue": "Half Moon Bay Distillery"}, {"Address": "229 Water St North, Petaluma, CA 94952", "Artist": "Fog Holler", "ArtistBio": "Mysteriously lonesome, hard driving bluegrass from the San Francisco Bay Area.", "ArtistImage": "https://photos.bandsintown.com/thumb/8667096.jpeg", "Coordinates": [-122.63913, 38.23188], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Brewster's regulars Fog Holler return for a can't-be-beat evening of bourbon and bluegrass. Come for the tunes, stay for the excellent food and drinks.", "Time": "5:00 PM", "Venue": "Brewsters Beer Garden + Restaurant"}, {"Address": "600 Stockton St, San Francisco, CA 94108", "Artist": "Sam Johnson", "ArtistBio": "Sam Johnson’s love for music goes back to his adolescent years, when he learned Bob Marley and Sublime songs on hand me down instruments, and started a reggae band at his high school in Huntington Beach, California. This early influence inspired him to create his laid-back, soulful blend of pop, rock, and reggae styles that he describes as “quintessential California music”.\n\nBut he says his music career really started 8 years ago in San Francisco, where he street performed 5 days a week in the hectic, carnival-like atmosphere of Fisherman’s Wharf. Dodging seagulls and competing with the other street performers for the tourists’ attention, Sam’s chops developed at an accelerated rate. “The first day I played in the wharf, I made $60. I knew one day I would make $600!” In this way Sam supported himself full-time for more than 2 years - one CD at a time, one dollar at a time. He says “it was like touring the world from a street corner.”\n\nMany of the successes and relationships Sam has had since then are directly related to his time spent busking. During his street performing years, he made thousands of fans from all around the world who support him to this day. So much, in fact, that his fans fully funded his third EP “The City” through Kickstarter, backing the project with nearly $10,000. The album’s lead single “The City” received airplay on San Francisco’s Live 105 FM for several weeks.\n\nAlthough he is no longer street performing, Sam maintains a busy performance schedule with over 200 shows per year touring at college campuses across the US, performing at festivals, and corporate and private events, and the Ritz Carlton San Francisco invited him to be their resident performer, a spot which he has held for the past 5 years. In 2016, Sam joined top 40 artist Andy Grammer on his west coast tour, performing for thousands of fans each night as his opening act. Since then, Sam has shared stages with many big pop and reggae artists including Shwayze, Collie Buddz, Flipsyde, Common Kings, The Holdup, Leilani Wolfgramm, Anuhea, Mike Love, and more.\n\nSam’s original music is also frequently featured in TV shows on MTV, FOX, NBC, BRAVO, and SPIKE. Macy’s used Sam’s version of “In The Midnight Hour” for their popular nationwide Black Friday ad campaign for 2 years in a row. He has also written songs specifically for the UFC (Ultimate Fighting Championship) that they keep in regular rotation.\n\nSam signed a deal with start-up label Text Me Records in 2018, and has since released half a dozen singles, with hundreds of thousands of Spotify plays, and his song “Faded” debuted at #3 on the iTunes singer-songwriter charts. A new full length album is on the way in 2019.", "ArtistImage": "https://photos.bandsintown.com/thumb/9124994.jpeg", "Coordinates": [-122.406829, 37.791845], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: The California Sound, Pop, Rock, Reggae", "OtherInfo": "No other event info available", "Time": "6:00 PM", "Venue": "The Ritz-Carlton, San Francisco"}, {"Address": "4549 Cross Road, Livermore, CA 94550", "Artist": "Spa", "ArtistBio": "Sam Johnson’s love for music goes back to his adolescent years, when he learned Bob Marley and Sublime songs on hand me down instruments, and started a reggae band at his high school in Huntington Beach, California. This early influence inspired him to create his laid-back, soulful blend of pop, rock, and reggae styles that he describes as “quintessential California music”.\n\nBut he says his music career really started 8 years ago in San Francisco, where he street performed 5 days a week in the hectic, carnival-like atmosphere of Fisherman’s Wharf. Dodging seagulls and competing with the other street performers for the tourists’ attention, Sam’s chops developed at an accelerated rate. “The first day I played in the wharf, I made $60. I knew one day I would make $600!” In this way Sam supported himself full-time for more than 2 years - one CD at a time, one dollar at a time. He says “it was like touring the world from a street corner.”\n\nMany of the successes and relationships Sam has had since then are directly related to his time spent busking. During his street performing years, he made thousands of fans from all around the world who support him to this day. So much, in fact, that his fans fully funded his third EP “The City” through Kickstarter, backing the project with nearly $10,000. The album’s lead single “The City” received airplay on San Francisco’s Live 105 FM for several weeks.\n\nAlthough he is no longer street performing, Sam maintains a busy performance schedule with over 200 shows per year touring at college campuses across the US, performing at festivals, and corporate and private events, and the Ritz Carlton San Francisco invited him to be their resident performer, a spot which he has held for the past 5 years. In 2016, Sam joined top 40 artist Andy Grammer on his west coast tour, performing for thousands of fans each night as his opening act. Since then, Sam has shared stages with many big pop and reggae artists including Shwayze, Collie Buddz, Flipsyde, Common Kings, The Holdup, Leilani Wolfgramm, Anuhea, Mike Love, and more.\n\nSam’s original music is also frequently featured in TV shows on MTV, FOX, NBC, BRAVO, and SPIKE. Macy’s used Sam’s version of “In The Midnight Hour” for their popular nationwide Black Friday ad campaign for 2 years in a row. He has also written songs specifically for the UFC (Ultimate Fighting Championship) that they keep in regular rotation.\n\nSam signed a deal with start-up label Text Me Records in 2018, and has since released half a dozen singles, with hundreds of thousands of Spotify plays, and his song “Faded” debuted at #3 on the iTunes singer-songwriter charts. A new full length album is on the way in 2019.", "ArtistImage": "https://photos.bandsintown.com/thumb/157166.jpeg", "Coordinates": [-121.676803, 37.668266], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "6:00 PM", "Venue": "The Purple Orchid Wine Country Resort  Spa"}, {"Address": "55 Music Concourse Dr, San Francisco, CA 94188", "Artist": "Nightlife", "ArtistBio": "Nightlife is a professional tribute band that plays fresh new arrangements in the form of complete shows by different artists.", "ArtistImage": "https://photos.bandsintown.com/thumb/8598142.jpeg", "Coordinates": [-122.466863, 37.769883], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Dance", "OtherInfo": "NightLife It doesn't get more sophisticated than a cocktail in one hand and no children in sight. Add some jellyfish, dim lights, and a second cocktail in the other hand and you've got NightLife at the Academy of Sciences held every Thursday night from 6-10 p.m. The evening caters specifically to the 21+ crowd and offers a new theme each week. The night is perfect for those in the mood to mingle and explore the wonders of our world. Don't forget your IDs!", "Time": "6:00 PM", "Venue": "California Academy of Sciences"}, {"Address": "4549 Cross Rd, Livermore, CA 94550", "Artist": "Crawdad Republic", "ArtistBio": "Crawdad Republic is an American band from the Bay Area's wine country with a vocally driven style inspired by folk and bluegrass instrumentation.", "ArtistImage": "https://photos.bandsintown.com/thumb/9196108.jpeg", "Coordinates": [-121.676803, 37.668266], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Bluegrass, Folk, Americana, Pop", "OtherInfo": "6pm-9pm // Tix $18 ($20 at the door)\n\nMark your calendars June, July, August and September for the popular Music in the Orchard concert series in its sixth year at the Purple Orchid Wine Country Resort and Spa. Bring a blanket or lawn chair and relax under the olive trees of Livermore’s finest resort at 4549 Cross Road to enjoy talented musicians while supporting local students.\n\nThe Pedrozzi Foundation is once again a beneficiary of the enjoyable outdoor concert series presented by the Purple Orchid, Nottingham Cellars, and Altamont Beer Works. The Foundation was established by Livermore businessman Mario Pedrozzi, so it is appropriate for local businesses to join together to support local students.\n\nAwarding winning wines by Nottingham Cellars, beer from local breweries and food by area favorite Posada on Wheels will be available for purchase. No outside food or beverage allowed.\n\nA portion of proceeds from ticket, beverage and food sales supports the work of the Pedrozzi Foundation, helping expand the Foundation’s impact. In addition to awarding scholarships to Livermore students, the Foundation works to help create a career and college bound culture among all Livermore students and families – especially those in underrepresented and underserved communities. Partnering with the school district to fund PSAT testing for all sophomores and hosting free workshops on applying for financial aid are a few ways the Foundation is helping students reach their potential. The Foundation recently awarded $408,500 in scholarships to 112 local students. Learn more at Pedrozzi.org.", "Time": "6:00 PM", "Venue": "Purple Orchid Wine Country Resort & Spa"}, {"Address": "924 Gilman St, Berkeley, CA 94706", "Artist": "VEIN.FM", "ArtistBio": "This is all that you were programmed to be afraid of", "ArtistImage": "https://photos.bandsintown.com/thumb/9195551.jpeg", "Coordinates": [-122.299296, 37.879505], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Metalcore", "OtherInfo": "No other event info available", "Time": "6:00 PM", "Venue": "924 Gilman"}, {"Address": "4050 Port Chicago Hwy, Concord, CA 94520", "Artist": "Groovy Judy", "ArtistBio": "Groovy Judy puts a new face on the late 60’s, early 70’s sound that made the Bay Area what it is. From the songwriting influences of Sly and The Family Stone, Jimi Hendrix, to touches of the melodic Beatles sound, San Francisco’s own brings forth her dominating style with the energy of some of today’s most known artists. Groovy Judy focuses on making people smile and raising vibrations by delivering her own blend of funk/rock. Her stellar guitar playing, original lyrics, colorful dress, and upbeat personality, speak to all ages.\n\nHer second CD “Life,” is about commonplace life experiences such as love, relationships and being happy. The title track, \"Be Who You've Got to Be,\" sparks an inspirational vibe of being true to yourself, \"Your Life\" encourages enjoying life to the fullest, and \"Get Along\" is Judy's peace anthem about living together harmony. It also contains Judy’s signature psychedelic rock song, “Jimi’s Sister,” her tongue-in-cheek tribute to her guitar mentor, Jimi Hendrix, as well as the haunting instrumental, “Sunrise,” inspired by Carlos Santana.\n\nBorn and raised in the San Francisco Bay Area, Groovy Judy picked up is committed to giving back. She teaches guitar to up and coming musicians and donates performances to non-profit organizations, such as Amnesty International, The Leukemia Society, Bread and Roses, Guitars Not Guns and The American Red Cross.\n\nA featured artist at She Rocks San Francisco Music Festival 2005, a finalist at the Emergenza Music Festival 2006, and a featured artist at the 2007 40th Anniversary of the Summer of Love Festival in Monterey, Groovy Judy is an artist who loves inspiring people to be the best they can be, love one another and spread peace and love through the universal language of music. She prefers to look on the lighter side of life and put out positive vibrations that make people smile, laugh, feel happy and enjoy life.", "ArtistImage": "https://photos.bandsintown.com/thumb/9415180.jpeg", "Coordinates": [-122.023507, 38.013561], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: R&b/soul, Rnb-soul, Rock, Funk, Pop", "OtherInfo": "Groovesters!\nOn Thursday, September 26, The band is doing what we do best - rocking! Come join us at the Legends at Diablo Creek Golf Course. I'll be playing my groovy originals and a little Hendrix, Sly & Stone and Beatles. It's free and it's fun! See you there!\n\nThursday, September 26\nThe Groovy Judy Rocks!\nLegends at Diablo Creek Golf Course\n4050 Port Chicago Hwy\nConcord, CA 94520\n925-687-4111\n6:00pm – 9:00pm\nAll Ages, FREE", "Time": "6:00 PM", "Venue": "Legends at Diablo Creek"}, {"Address": "4117 Judah St, San Francisco, USA", "Artist": "Pulling It Off", "ArtistBio": "Pulling It Off is Pulling It Off. Their Rip Tide grooves and dynamics will make you feel like you've been washed up in the desert one too many times, only for you to just enjoy it, unwind, and be yourself. You'll Dance along to the Rhythm & Blues of these 4 honest hard-working Dudes of the Future.", "ArtistImage": "https://photos.bandsintown.com/thumb/9277626.jpeg", "Coordinates": [-122.50636, 37.760158], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Rock, Indie Rock, groove rock", "OtherInfo": "Redshift\n\nPulling It Off (on tour from Portland!)\n\nRush Hour X\n\nThe Hidden Schematic\n\nDoors at 6:30, music 7-10\nAll Ages, no substances\n$10 donation", "Time": "6:30 PM", "Venue": "The Honey Hive Gallery"}, {"Address": "1000 E Hillsdale Blvd, Foster City, CA 94404", "Artist": "Sarah McQuaid", "ArtistBio": "Sarah McQuaid is a singer, guitarist and songwriter, based in the UK and touring internationally. See http://www.sarahmcquaid.com for more info.", "ArtistImage": "https://photos.bandsintown.com/thumb/8772763.jpeg", "Coordinates": [-122.270226, 37.558792], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Singer, Songwriter, Guitarist, Acoustic, Folk", "OtherInfo": "Foster City Library -- 1000 East Hillsdale Blvd, Foster City, CA 94404, USA\nTel (650) 574-4842 -- Free library event -- 6:30pm (Doors 6:15pm)\nhttp://smcl.org\n\nSarah will be giving a free one-hour concert beginning at 6:30pm (the library closes at 6pm but will reopen shortly afterwards for concertgoers). Refreshments will be provided. For more info, visit http://smcl.org or ring (650) 574-4842. Visit http://www.sarahmcquaid.com for other tour dates and more information about Sarah.", "Time": "6:30 PM", "Venue": "Foster City Library"}, {"Address": "5927 California St, San Francisco, CA 94121", "Artist": "Acoustic Open MIc", "ArtistBio": "Sarah McQuaid is a singer, guitarist and songwriter, based in the UK and touring internationally. See http://www.sarahmcquaid.com for more info.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.481196, 37.783825], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Acoustic Open Mic with Josh Beemish at Bazaar Cafe: No cover, tasty food, a beer and wine bar, and a hearty appreciation for the arts make Bazaar a cafe for those with taste. On warm, sunny days, be sure to head out to the verdant back patio for a seat in their lovely garden.", "Time": "7:00 PM", "Venue": "Bazaar Cafe"}, {"Address": "1 Loraine Ct, San Francisco, USA", "Artist": "Tomo Nakayama", "ArtistBio": "Booking/Information - tomosongs@gmail.com Tomo Nakayama is a multi-instrumentalist, singer, and songwriter from Seattle, Washington. His music has been praised by NPR, New York Times, and KEXP, and he has toured throughout the US and Japan at fests such as SXSW, CMJ, Sasquatch, and Bumbershoot. Fog On The Lens is his first solo album, made after nearly a decade fronting beloved Seattle chamber-pop band Grand Hallway, and composing for an acting in Lynn Shelton’s Sundance Grand Jury nominated film \"Touchy Feely\". Fog On The Lens was written and recorded during a residency at Town Hall Seattle. Literally handed the keys to the historic building for three months, Tomo utilized the 92 year old Roman-revival style hall as his own personal recording studio. Recording alone at odd hours of the night, Tomo used a single microphone plugged directly into his laptop to capture the natural acoustics of the various rooms of Town Hall. Emphasis was placed on first takes and keeping the performances as raw and unedited as possible. In essence and in spirit, Fog On The Lens is a bedroom album created in a cathedral-sized room. To mix the record, Tomo enlisted the help of producer/multi-instrumentalist Yuuki Matthews (of The Shins and Teardrops). Yuuki displayed an immediate and intuitive understanding of Tomo’s vision, mixing onto analog 4-track cassette tape and overdubbing his own wildly imaginative array of analog synthesizers and homemade keyboard sounds which heighten the album’s evocative, dream-like atmosphere. Throughout the album’s 10 songs, Tomo explores the dual dynamics of love and solitude. Textures and moods bend and transform, from the piano driven blast of pop harmonies of “Open Room”, to the delicate, cascading flurry of fingerpicked guitars of “Nightingale”, and the slow, gorgeous melancholy of “Magnolias (for Philip)”, an ode to the late Philip Seymour Hoffman. Fog On The Lens finds Tomo pursuing a rawer, more spontaneous and intimate sound than the densely orchestrated sound of Grand Hallway. It combines elements of the acoustic and electronic, analog and digital, lo-fi and hi-fi, the urban and the pastoral. The past and future collide in a colorful, hazy collage. It bears the influence of Tomo’s favorite musicians like Arthur Russell, Bjork, Paul Simon, and The Velvet Underground, yet exists in a world entirely of its own. Fog On The Lens is a quietly confident step forward from a restless soul, unafraid to follow his muse, wherever it leads him. Initially self-released in the fall (Tomo and Yuuki played 14 shows in one day for the record’s release, and the duo toured in Japan on & Records), Fog On The Lens was picked up by Porchlight Records, and it will be re-released on vinyl/CD/digital on March 3, 2015. New album, \"Pieces of Sky\", coming September 2017", "ArtistImage": "https://photos.bandsintown.com/thumb/9353400.jpeg", "Coordinates": [-122.457077, 37.780615], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Folk, Alternative, Indie", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "San Francisco Columbarium"}, {"Address": "924 Gilman St, Berkeley, CA 94706", "Artist": "Higher Power", "ArtistBio": "For the moshers, by the moshers. Debut LP 'Soul Structure' out now on Flatspot and Venn Records", "ArtistImage": "https://photos.bandsintown.com/thumb/7870197.jpeg", "Coordinates": [-122.299296, 37.879505], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Punk, Hardcore", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "924 Gilman"}, {"Address": "2001 Gayley Rd, Berkeley, CA 94720", "Artist": "The Devil Makes Three", "ArtistBio": "\"There's a road that goes out of every town. All you've got to do is get on it,\" Pete Bernhard says.\n\nThe guitarist/singer and his cohorts in the raw and raucous trio The Devil Makes Three have found their way onto that road numerous times since they first left their picaresque rural hometown of Brattleboro, Vermont. Back then, they had no idea it would lead them to such auspicious destinations as the Newport Folk and Austin City Limits Festivals, Bonnaroo and Lollapalooza, and on tours with Willie Nelson, Emmylou Harris and Rodney Crowell and Trampled By Turtles. Along the way, they drew numerous accolades from a growing fan base and press alike.\n\nTDM3's travels and travails serve as inspiration for their fourth album and their New West Records debut, I'm a Stranger Here, produced by Buddy Miller and recorded at Dan Auerbach's (Black Keys) Easy Eye Sound in Nashville.\n\nWith upright bassist Lucia Turino and guitarist Cooper McBean, Bernhard crafted a dozen tunes, part road songs, part heartbreak songs and part barnburners. While most bands are propelled from behind by a drummer, TDM3 builds exuberant rhythms from the inside out, wrapping finger-picked strings and upsurging harmonies around chugging acoustic guitar and bass, plying an ever-growing audience onto its feet to jump, shake and waltz.\n\nTDM3's sound is garage-y ragtime, punkified blues, old n' new timey without settling upon a particular era, inspired as much by mountain music as by Preservation Hall jazz. \"We bend genres pretty hard,\" Bernhard says.\n\nThe combination could only have happened via the circuitous route each of them took to forming the band. As kids in Vermont, \"all raised by sort of hippie parents\" who exposed them to folk, blues and jugbands, Bernhard says, they blazed a path to nearby Boston, Massachusetts in search of punk rock shows. They found venerable venues like The Rat and The Middle East, drawn to east coast bands like the Dropkick Murphys and Aus-Rotten.\n\n\"It would be like 6 bucks for 13 bands, everyone playing for 20 minutes,\" Bernhard says. \"I had so much fun going to shows like that. The energy coming off the stage makes a circle with the crowd and comes back. We were really attracted to that energy.\"\n\nBernhard and McBean, a multi-instrumentalist who plays banjo, musical saw and bass, forged a particular bond. Unlike most of their mutual friends, they both liked to play acoustic music, with McBean showing Bernhard the wonders of Hank Williams and Bob Wills & the Texas Playboys. They kept in touch after high school, when nearly everyone in their clique relocated to the west coast like the characters in Delbert McClinton's song \"Two More Bottles of Wine.\"\n\n\"It was a mass exodus of kids who went out to start bands and be creative, searching for the unknown, dreaming of something different,\" Bernhard says. \"We wanted to get away from where we were from, as many kids do, and California was the farthest we could get.\" Eventually they landed in sunny Santa Cruz, California, where TDM3 took shape in 2001. Their early gigs were house concerts, then small bars, punk shows, bigger rock clubs and theaters and festivals, all the while defying genre and delighting whomever turned up to listen.\n\nTurino learned bass to join the band, but her unremitting sense of rhythm comes naturally from being raised by parents who were dance teachers, and from her own dance background. Attacking the strings of her upright, she understands how to infuse songs with the force it takes to get a crowd moving.\n\nAnd the songs on I'm a Stranger Here tell the rest of the story, with the music often joyously juxtaposed against lyric darkness...the rootless nature of being in a touring band, traveling from town to town with little sense of community, represented by a devil-like character (\"Stranger\")...thorny transitions into adulthood...struggling with relationships (\"Worse or Better\"), watching friends succumb to addiction (\"Mr. Midnight\"), coming to terms with mortality (\"Dead Body Moving\"), nostalgic notions of childhood (\"Spinning Like a Top\"). Bernhard even considers the destruction of changing weather patterns, inspired in part by Hurricane Katrina as well as a flood that wreaked havoc in Brattleboro (\"Forty Days,\" a gospel rave-up recorded with the Preservation Hall Jazz Band).\n\nBernhard wrote more than 20 songs for the album and turned them over to producer Buddy Miller, who gravitated toward the darker material but insured that the recording was lit up by the band's innate ebullience. It was Miller's idea to record at Easy Eye rather than his renowned home studio. \"Easy Eye is like Sun Records,\" Bernhard says. \"There's one live tracking room filled with amazing gear, and that defines the kind of record you're going to make. That was exactly the record we wanted to make, and we knew Buddy was the one who could capture us playing together like we do.\"\n\nFor a band that made its bones with dynamic performances, recording an album is almost like coaxing lightning into a bottle, but Miller and TDM3 succeed on I'm a Stranger Here. Now they're continuing the journey that began when they found their way to the road that led them out of Vermont. \"I can't wait to get onstage, I love it,\" Bernhard says. \"Playing music for a living is a blessing and a curse, but for us there's no other option.\"", "ArtistImage": "https://photos.bandsintown.com/thumb/9092554.jpeg", "Coordinates": [-122.25063, 37.86976], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Americana", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Hearst Greek Theatre"}, {"Address": "1111 California St, San Francisco, CA 94108", "Artist": "Sabrina Claudio", "ArtistBio": "Singer/Songwriter", "ArtistImage": "https://photos.bandsintown.com/thumb/7832285.jpeg", "Coordinates": [-122.412938, 37.791183], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: alternative r&b, pop, R&B/Soul", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "The Masonic"}, {"Address": "1807 Telegraph Ave, Oakland, CA 94612", "Artist": "Oliver Tree", "ArtistBio": "Soundcloud: https://soundcloud.com/olivertree Twitter: https://twitter.com/olivertree Instagram: https://www.instagram.com/olivertree", "ArtistImage": "https://photos.bandsintown.com/thumb/7999273.jpeg", "Coordinates": [-122.27017, 37.80785], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Fox Theater"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Poldoore", "ArtistBio": "http://poldoore.bandcamp.com\n\nhttp://www.soundcloud.com/poldoore\n\nhttp://www.twitter.com/poldoore\n\nhttp://www.instagram.com/poldoore\n\nhttp://www.youtube.com/poldooremusic", "ArtistImage": "https://photos.bandsintown.com/thumb/5005830.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Beats, Trip Hop, Hip Hop, Instrumental, Jazz, Soul, Reggae, Dub, Funk, Downtempo", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Rickshaw Stop"}, {"Address": "420 Mason St, San Francisco, CA 94102", "Artist": "CHERUB", "ArtistBio": "Cherub began in 2010 at Middle Tennessee State University. The two met as Jason was playing around town with local bands and Jordan was crafting what would become known as their first album, Man Of The Hour. A few years later, it was the song \"Doses & Mimosas\" that caught the attention of the public eye. Their 4-year major label run brought their fans two LP's, Year Of The Caprese and Bleed Gold, Piss Excellence, while also sending them around the world playing festivals such as Lollapalooza, Bonnaroo, Glastonbury, Outside Lands, Osheaga, Summer Camp, Summer Sonic, and headlining 4 US tours. Now, a gold record and 130 million Spotify streams later, the bond between them remains \"unfuckwithable,\" as they construct their newest batch of genre-defying anthems.\n\n2018 brings new music, with a series of singles including \"All In,\" \"Dancin' Shoes,\" \"Body Language,\" \"Want That,\" and \"So What?\" and the Free Form Tour in Fall 2018. There's no doubt that the latest Cherub efforts will win over their existing audience and draw new listeners to their established brand of debauchery. From your ears to your heart, like searching for room on their bodies for a new tattoo, they'll find a way.", "ArtistImage": "https://photos.bandsintown.com/thumb/8663392.jpeg", "Coordinates": [-122.409593, 37.787565], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: R&b/soul, Rnb-soul, Alternative, Funk, Electro, Electronic, Indie, Dance, Pop", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "August Hall"}, {"Address": "400 Eddy St, San Francisco, CA 94109", "Artist": "Claffy", "ArtistBio": "Cherub began in 2010 at Middle Tennessee State University. The two met as Jason was playing around town with local bands and Jordan was crafting what would become known as their first album, Man Of The Hour. A few years later, it was the song \"Doses & Mimosas\" that caught the attention of the public eye. Their 4-year major label run brought their fans two LP's, Year Of The Caprese and Bleed Gold, Piss Excellence, while also sending them around the world playing festivals such as Lollapalooza, Bonnaroo, Glastonbury, Outside Lands, Osheaga, Summer Camp, Summer Sonic, and headlining 4 US tours. Now, a gold record and 130 million Spotify streams later, the bond between them remains \"unfuckwithable,\" as they construct their newest batch of genre-defying anthems.\n\n2018 brings new music, with a series of singles including \"All In,\" \"Dancin' Shoes,\" \"Body Language,\" \"Want That,\" and \"So What?\" and the Free Form Tour in Fall 2018. There's no doubt that the latest Cherub efforts will win over their existing audience and draw new listeners to their established brand of debauchery. From your ears to your heart, like searching for room on their bodies for a new tattoo, they'll find a way.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.414392, 37.78382], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "From NYC, C.L.A.F.F.Y. Not only is Alex Claffy is one of the most sought after young bassists in NYC, he tours internationally with his own innovative projects — which should surprise no one given his incredible jazz heritage. Having studied with the renowned Ron Carter, Claffy has performed with numerous jazz legends including Christian Scott, Jimmy Cobb, Harold Mabern, Joey Alexander, Chris Botti and others.", "Time": "7:00 PM", "Venue": "Black Cat"}, {"Address": "2367 Shattuck Ave, Berkeley, USA", "Artist": "THE MAIN SQUEEZE", "ArtistBio": "From their origins as a jam/party band in Indiana, The Main Squeeze, has been weaving the veins of Rock, Funk, Blues, and R&B into modern song stylings. Now LA-based and with three albums under their belt (last one being 2017’s Without A Sound), festival appearances from KABOO to Bonnaroo, and features from Billboard and Rolling Stone, they are on the verge of turning over a new sonic leaf this fall.\n\nThe Main Squeeze will be releasing their forthcoming single “It Ain’t Me” on October 5th. This marks the start of something new and fresh for the Indiana-to-Chicago-to-Los Angeles transplants. The new single plays up the modern dance-pop vibes of Bruno Mars and Charlie Puth - while channeling the swag, grit and soulful sounds of 70s bands like The Rolling Stones and Sly and the Family Stone. Produced by MARØ (whose credits include Lindsey Stirling and LostBoyCrow), “It Ain’t Me” is a heartfelt soul song that turns into a tongue in cheek, self aware anthem for anyone who’s ever felt claustrophobic in a relationship.\n\nWith a rich touring history including opening slots for The Roots, Jane’s Addiction, D.R.A.M., Mac Miller, Aloe Blacc, and Umphrey’s McGee, The Main Squeeze are launching into a new musical orbit with plans for a fourth LP in 2019. Pre- save the new single, “It Ain’t Me” now on your favorite streaming site: https://ffm.to/itaintme", "ArtistImage": "https://photos.bandsintown.com/thumb/8851563.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Funk, Rock, Jam Rock, Jam Bands", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "The Cornerstone"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Hermitude", "ArtistBio": "Studio, stage, everything. Good music, good times.", "ArtistImage": "https://photos.bandsintown.com/thumb/6378512.jpeg", "Coordinates": [-122.272395, 37.80758], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Hip-hop, Electronic, Hiphop, Instrumental, Hip Hop, Other", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "The New Parish"}, {"Address": "2001 Gayley Rd, Berkeley, CA 94720", "Artist": "Le Butcherettes", "ArtistBio": "New album 'A Raw Youth' now available.", "ArtistImage": "https://photos.bandsintown.com/thumb/9079192.jpeg", "Coordinates": [-122.25063, 37.86976], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Rock, garage punk, garage rock, punk rock, Punk", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Hearst Greek Theatre"}, {"Address": "1801 E Cotati Ave, Rohnert Park, CA 94928", "Artist": "Diana Krall", "ArtistBio": "New album 'A Raw Youth' now available.", "ArtistImage": "https://photos.bandsintown.com/thumb/7643035.jpeg", "Coordinates": [-122.673536, 38.340121], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Jazz", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Green Music Center"}, {"Address": "2001, Gayley Road, Berkeley, CA 94720", "Artist": "Flogging Molly", "ArtistBio": "New Album LIFE IS GOOD out now! http://flogging.lnk.to/lifeisgood", "ArtistImage": "https://photos.bandsintown.com/thumb/7675472.jpeg", "Coordinates": [-122.25063, 37.86976], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Punk, Rock, Folk", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Greek Theatre at UC Berkeley"}, {"Address": "155 Fell St, Sf, CA 94102", "Artist": "The Geek x Vrv", "ArtistBio": "The Geek x Vrv (TGXV) have had an explosive year and a half since being catapulted into the spotlight at the end of 2013 when they released their track “It’s Because”. Since then, TGXV have been busy splitting their time between touring in Europe and hitting the studio to craft tunes bearing their signature sound: a dynamic, sample-heavy blend of genres like funk, jazz, and soul with an electro-hip-hop twist. Within a few months, “It’s Because” hit 2 million plays and was featured on the French radio station ‘Radio Nova’, paving the way to open for electro-soul heavyweights such as Pretty Lights, Gramatik, and GRiZ, and allowing them to perform at festivals including ‘Foreztival’, and ‘Positiv Festival’. Their live show is bursting at the seams with raw, unadulterated energy that they bring to the stage with their live-production APC and Maschine setup. TGXV have had several popular remixes of artists including Stevie Wonder, Kill Paris, Jabberwocky, 20syl, and Flume, and most recently won the famed remix contest for Odesza’s “Say My Name”. They have seen support from big-name artists including Pretty Lights, Odesza, Kygo, Gramatik, 20Syl and GRiZ, who released their EP “Electric City” on his label ‘All Good Records’ earlier this year. Keep a close eye on this dynamic duo over the coming months. Thump : \"The Geek x VRV Are the Next Big Thing in Electro-Soul Music\" The Untz : \"You’re the new the princes of electro-soul from France!\" Production duo from Paris (France) -MGMT : thomas@allofloride.com", "ArtistImage": "https://photos.bandsintown.com/thumb/8781665.jpeg", "Coordinates": [-122.42055, 37.77597], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Electronic, Rnb-soul, Electro, R&b/soul, Hip Hop, Jazz, Soul", "OtherInfo": "No other event info available", "Time": "7:00 PM", "Venue": "Rickshaw Stop"}, {"Address": "2236 Martin Luther King Jr Way, Oakland, CA 94612", "Artist": "Zap Mama", "ArtistBio": "The Geek x Vrv (TGXV) have had an explosive year and a half since being catapulted into the spotlight at the end of 2013 when they released their track “It’s Because”. Since then, TGXV have been busy splitting their time between touring in Europe and hitting the studio to craft tunes bearing their signature sound: a dynamic, sample-heavy blend of genres like funk, jazz, and soul with an electro-hip-hop twist. Within a few months, “It’s Because” hit 2 million plays and was featured on the French radio station ‘Radio Nova’, paving the way to open for electro-soul heavyweights such as Pretty Lights, Gramatik, and GRiZ, and allowing them to perform at festivals including ‘Foreztival’, and ‘Positiv Festival’. Their live show is bursting at the seams with raw, unadulterated energy that they bring to the stage with their live-production APC and Maschine setup. TGXV have had several popular remixes of artists including Stevie Wonder, Kill Paris, Jabberwocky, 20syl, and Flume, and most recently won the famed remix contest for Odesza’s “Say My Name”. They have seen support from big-name artists including Pretty Lights, Odesza, Kygo, Gramatik, 20Syl and GRiZ, who released their EP “Electric City” on his label ‘All Good Records’ earlier this year. Keep a close eye on this dynamic duo over the coming months. Thump : \"The Geek x VRV Are the Next Big Thing in Electro-Soul Music\" The Untz : \"You’re the new the princes of electro-soul from France!\" Production duo from Paris (France) -MGMT : thomas@allofloride.com", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.2727, 37.81239], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: International, African, R&b/soul, Rnb-soul, Soul", "OtherInfo": "MATATU presents Congolese musician Zap Mama in conversation with Raoul Peck's 'Patrice Lumumba: la mort du Prophete.", "Time": "7:30 PM", "Venue": "Starline Social Club"}, {"Address": "1801 E Cotati Ave, Rohnert Park, CA 94928", "Artist": "Joe Lovano", "ArtistBio": "Grammy-winning saxophonist and composer Joe Lovano stands alone at the vanguard of large and small group jazz. From his Grammy-nominated symphonic work to his role as Gary Burton Chair of Jazz Performance at Berklee College of Music, the Cleveland native fearlessly challenges and pushes his conceptual and thematic ventures in a quest for new modes of artistic expression and new ways to define the jazz idiom. In 2014 Lovano won awards for Multi-reeds Player and Tenor Saxophonist of the Year from the Jazz Journalists Association and Tenor Saxophonist of the Year from Down Beat Magazine. He has released 23 celebrated albums on the Blue Note label; with the last three focusing on his quintet Us Five. www.joelovano.com", "ArtistImage": "https://photos.bandsintown.com/thumb/9018517.jpeg", "Coordinates": [-122.673536, 38.340121], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Jazz", "OtherInfo": "No other event info available", "Time": "7:30 PM", "Venue": "Green Music Center"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Katie Day", "ArtistBio": "Grammy-winning saxophonist and composer Joe Lovano stands alone at the vanguard of large and small group jazz. From his Grammy-nominated symphonic work to his role as Gary Burton Chair of Jazz Performance at Berklee College of Music, the Cleveland native fearlessly challenges and pushes his conceptual and thematic ventures in a quest for new modes of artistic expression and new ways to define the jazz idiom. In 2014 Lovano won awards for Multi-reeds Player and Tenor Saxophonist of the Year from the Jazz Journalists Association and Tenor Saxophonist of the Year from Down Beat Magazine. He has released 23 celebrated albums on the Blue Note label; with the last three focusing on his quintet Us Five. www.joelovano.com", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.430418, 37.766622], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "This show is 21+ / Doors at 7:30 PM. All sales are final.", "Time": "7:30 PM", "Venue": "Cafe Du Nord"}, {"Address": "1 Amphitheatre Pkwy, Mountain View, CA 94043", "Artist": "the Silver Bullet Band", "ArtistBio": "Grammy-winning saxophonist and composer Joe Lovano stands alone at the vanguard of large and small group jazz. From his Grammy-nominated symphonic work to his role as Gary Burton Chair of Jazz Performance at Berklee College of Music, the Cleveland native fearlessly challenges and pushes his conceptual and thematic ventures in a quest for new modes of artistic expression and new ways to define the jazz idiom. In 2014 Lovano won awards for Multi-reeds Player and Tenor Saxophonist of the Year from the Jazz Journalists Association and Tenor Saxophonist of the Year from Down Beat Magazine. He has released 23 celebrated albums on the Blue Note label; with the last three focusing on his quintet Us Five. www.joelovano.com", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.080678, 37.426767], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "7:30 PM", "Venue": "Shoreline Amphitheatre"}, {"Address": "1 Amphitheatre Pkwy, Mountain View, CA 94043", "Artist": "BOB SEGER", "ArtistBio": "Grammy-winning saxophonist and composer Joe Lovano stands alone at the vanguard of large and small group jazz. From his Grammy-nominated symphonic work to his role as Gary Burton Chair of Jazz Performance at Berklee College of Music, the Cleveland native fearlessly challenges and pushes his conceptual and thematic ventures in a quest for new modes of artistic expression and new ways to define the jazz idiom. In 2014 Lovano won awards for Multi-reeds Player and Tenor Saxophonist of the Year from the Jazz Journalists Association and Tenor Saxophonist of the Year from Down Beat Magazine. He has released 23 celebrated albums on the Blue Note label; with the last three focusing on his quintet Us Five. www.joelovano.com", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.080678, 37.426767], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "7:30 PM", "Venue": "Shoreline Amphitheatre"}, {"Address": "1 Amphitheatre Pkwy, Mountain View, CA 94043", "Artist": "The Wild Feathers", "ArtistBio": "All signs point to The Wild Feathers becoming the next great American rock ‘n’ roll band. The Nashville-based group—Ricky Young [guitar, vocals], Taylor Burns [guitar, vocals], Joel King [bass, vocals] and Ben Dumas [drums]—spent more than two years on the road supporting their 2013 self-titled full-length album alongside everybody from Bob Dylan to Gary Clark Jr. The record hit #1 on Billboard’s Heatseekers Chart, and they received invites to appear on Jimmy Kimmel, Conan O Brien, Seth Meyers, Craig Ferguson, ABC’s Nashville, and more. Unanimous critical praise arrived courtesy of Rolling Stone, New York Times, Huffington Post, USA Today, and countless others. Along the way, evolution stayed on their minds as they started writing songs for what will become their 2016 sophomore effort, Lonely Is A Lifetime [Warner Bros. Records]. Lonely Is a Lifetime reflects a richer confluence of influences, while maintaining their signature soul and spirit and a nod to all that time on the road together. They’ve grown as men and musicians, and they’re ready to claim their spot in the canon of American rock music. Lonely Is A Lifetime featuring Overnight & Into The Sun available now. See us on the road this Spring!", "ArtistImage": "https://photos.bandsintown.com/thumb/7202221.jpeg", "Coordinates": [-122.080678, 37.426767], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Folk, Alternative", "OtherInfo": "No other event info available", "Time": "7:30 PM", "Venue": "Shoreline Amphitheatre"}, {"Address": "1 Amphitheatre Pkwy, San Francisco, CA 94043", "Artist": "Bob Seger & The Silver Bullet Band", "ArtistBio": "There is a signature richness and power to the music that Bob Seger has been making for four decades, and as succeeding generations have discovered those qualities, his reputation as an artist and songwriter has only grown. His work represents the honest best of what rock & roll can be. It’s passionate, unpretentious, uplifting and true to itself and its audience. Perhaps most of all it is distinctly American, a plainspoken testament to the dignity, hopes and aspirations of ordinary working people. In a time as obsessed with glamour, celebrity, fame and materialism as ours, his songs remain a bracing tonic, an emblem of the belief that everyone’s life is a worthy subject of art. That’s one of the reasons why Seger’s songs have lasted so well and continue to be so well-loved. His Greatest Hits collection has sold more than seven million copies, and albums like Beautiful Loser (1975), Live Bullet (1976), Night Moves (1976), Stranger in Town (1978), Against the Wind (1980) and Nine Tonight (1981) have all enjoyed multiplatinum sales. In March of 2004 Seger was more than deservedly inducted into the Rock and Roll Hall of Fame. Seger’s songs tell stories about characters with whom listeners can readily identify. They are often about people who are trying to find their way through a world that has proven more complex, challenging and perhaps even dangerous than they could have imagined. Innocence drains away, and what’s left is a combination of knowledge, experience and an aching nostalgia for something that has been lost along the way and must be recovered. His characters cross a line, frequently without realizing it, like a car passing over an invisible borderline at night. By the time they figure out that they are no longer in the world they knew, that world is simply a receding image in the rear-view mirror. Getting back to it isn’t always easy. Sometimes it’s not possible. As Thomas Wolfe wrote, “You can’t go home again.” That road is one that Seger has traveled himself, though he has fortunately always proven able to find his way back home. One of Michigan's finest, he grew up outside the media's spotlight and soaked up the muscular rock & roll and seductive soul sounds for which Detroit remains famous. Drawing on those sources, he defined a musical voice for the American heartland years before John Mellencamp and Bruce Springsteen or any of the other artists who have mined similar territory. But, while rollicking statements of hell-raising intent like \"Ramblin' Gamblin' Man\" and \"Heavy Music\" earned him a reputation among hardcore music fans, he struggled for many years to break out of his regional scene. Bad luck and bad timing conspired to keep him a secret from audiences outside Michigan, Florida and a few other hotbeds of support. When people heard and saw Seger, they fell under his spell. It just seemed for a time as if he would have to personally perform in front of every single person he wanted to win over. Finally, he more or less found a way to do that. The album that brought Seger significant national attention was Live Bullet, a double-vinyl-record set that was recorded live in Detroit in 1975 with the Silver Bullet Band, which he had formed the year before. Whatever recognition Seger had garnered to that point was based on two elements: the emotional power of his songs and the intensity of his live shows. Riveting performances of such soon-to-be classics as “Beautiful Loser” and “Turn the Page” combined those two virtues on Live Bullet. The mood was further heightened by the make-or-break ardency that Seger and the band palpably felt. Happily, the album broke and perfectly set the stage for the moment of Seger’s true dramatic rise: Night Moves. That album’s title track, needless to say, ranks with the likes of American Graffiti, the film that inspired it, in its evocative depiction of sexual discovery and the bittersweet passage from adolescence into adulthood. The album’s virtue is that its other songs – like “Mainstreet,” “The Fire Down Below” and “Rock and Roll Never Forgets,” for example – each isolate an aspect of that journey (lust, yearning, the search for lost youth), which lends it a satisfying sense of unity. It is one of the seminal records of the Seventies, and the ongoing life that “Night Moves” has found on the radio attests to how strongly listeners of all ages have felt their lives represented in it. But Seger was only beginning to find his voice – or, more accurately, to have his voice heard. He was a superstar now, even if an unusually grounded one, and each of his albums routinely gathered the sort of attention (and often sales) that he had sought so futilely early in his career. The six studio albums he has recorded since that time have generated a catalogue of songs that have entered the pantheon of contemporary popular music: “Hollywood Nights,” “Still the Same,” “Old Time Rock and Roll” (which is not a Seger original), “Fire Lake,” “You’ll Accomp’ny Me,” “Against the Wind,” “Like a Rock,” “American Storm,” “The Fire Inside” and “Lock and Load,” to compile a list that is by no means complete. Now Seger is back with Face the Promise, an album that extends his legacy into the 21st century. His raw, rough-edged voice still seethes with the conviction that charged it decades ago, but the years have lent him the stature of experience and authority. Not that such authenticity was ever a quality that either Seger or his songs lacked. He has expressed the frustrations, hopes and dreams not simply of people like himself, but that he himself has felt. When he sings, you believe it. The breadth, energy and cinematic beauty of Bob Seger’s music speak eloquently for themselves. His struggle for recognition may have been fought and won long ago, but the battle to convey his vision precisely as he experiences it within himself goes on unabated. Not giving up until he’s satisfied that he’s gotten it right fulfills the promise he has made to his fans and to himself. He faces it every time he steps into the studio, and he delivers on it every time people hear one of his songs and respond, as they so often do, “Yes, that’s exactly what it felt like.” www.bobseger.com", "ArtistImage": "https://photos.bandsintown.com/thumb/8713609.jpeg", "Coordinates": [-122.080678, 37.426767], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Rock, Classic Rock", "OtherInfo": "No other event info available", "Time": "7:30 PM", "Venue": "Shoreline Amphitheatre"}, {"Address": "3049 20th Street at Alabama , San Francisco, CA 94110", "Artist": "Bluegrass", "ArtistBio": "There is a signature richness and power to the music that Bob Seger has been making for four decades, and as succeeding generations have discovered those qualities, his reputation as an artist and songwriter has only grown. His work represents the honest best of what rock & roll can be. It’s passionate, unpretentious, uplifting and true to itself and its audience. Perhaps most of all it is distinctly American, a plainspoken testament to the dignity, hopes and aspirations of ordinary working people. In a time as obsessed with glamour, celebrity, fame and materialism as ours, his songs remain a bracing tonic, an emblem of the belief that everyone’s life is a worthy subject of art. That’s one of the reasons why Seger’s songs have lasted so well and continue to be so well-loved. His Greatest Hits collection has sold more than seven million copies, and albums like Beautiful Loser (1975), Live Bullet (1976), Night Moves (1976), Stranger in Town (1978), Against the Wind (1980) and Nine Tonight (1981) have all enjoyed multiplatinum sales. In March of 2004 Seger was more than deservedly inducted into the Rock and Roll Hall of Fame. Seger’s songs tell stories about characters with whom listeners can readily identify. They are often about people who are trying to find their way through a world that has proven more complex, challenging and perhaps even dangerous than they could have imagined. Innocence drains away, and what’s left is a combination of knowledge, experience and an aching nostalgia for something that has been lost along the way and must be recovered. His characters cross a line, frequently without realizing it, like a car passing over an invisible borderline at night. By the time they figure out that they are no longer in the world they knew, that world is simply a receding image in the rear-view mirror. Getting back to it isn’t always easy. Sometimes it’s not possible. As Thomas Wolfe wrote, “You can’t go home again.” That road is one that Seger has traveled himself, though he has fortunately always proven able to find his way back home. One of Michigan's finest, he grew up outside the media's spotlight and soaked up the muscular rock & roll and seductive soul sounds for which Detroit remains famous. Drawing on those sources, he defined a musical voice for the American heartland years before John Mellencamp and Bruce Springsteen or any of the other artists who have mined similar territory. But, while rollicking statements of hell-raising intent like \"Ramblin' Gamblin' Man\" and \"Heavy Music\" earned him a reputation among hardcore music fans, he struggled for many years to break out of his regional scene. Bad luck and bad timing conspired to keep him a secret from audiences outside Michigan, Florida and a few other hotbeds of support. When people heard and saw Seger, they fell under his spell. It just seemed for a time as if he would have to personally perform in front of every single person he wanted to win over. Finally, he more or less found a way to do that. The album that brought Seger significant national attention was Live Bullet, a double-vinyl-record set that was recorded live in Detroit in 1975 with the Silver Bullet Band, which he had formed the year before. Whatever recognition Seger had garnered to that point was based on two elements: the emotional power of his songs and the intensity of his live shows. Riveting performances of such soon-to-be classics as “Beautiful Loser” and “Turn the Page” combined those two virtues on Live Bullet. The mood was further heightened by the make-or-break ardency that Seger and the band palpably felt. Happily, the album broke and perfectly set the stage for the moment of Seger’s true dramatic rise: Night Moves. That album’s title track, needless to say, ranks with the likes of American Graffiti, the film that inspired it, in its evocative depiction of sexual discovery and the bittersweet passage from adolescence into adulthood. The album’s virtue is that its other songs – like “Mainstreet,” “The Fire Down Below” and “Rock and Roll Never Forgets,” for example – each isolate an aspect of that journey (lust, yearning, the search for lost youth), which lends it a satisfying sense of unity. It is one of the seminal records of the Seventies, and the ongoing life that “Night Moves” has found on the radio attests to how strongly listeners of all ages have felt their lives represented in it. But Seger was only beginning to find his voice – or, more accurately, to have his voice heard. He was a superstar now, even if an unusually grounded one, and each of his albums routinely gathered the sort of attention (and often sales) that he had sought so futilely early in his career. The six studio albums he has recorded since that time have generated a catalogue of songs that have entered the pantheon of contemporary popular music: “Hollywood Nights,” “Still the Same,” “Old Time Rock and Roll” (which is not a Seger original), “Fire Lake,” “You’ll Accomp’ny Me,” “Against the Wind,” “Like a Rock,” “American Storm,” “The Fire Inside” and “Lock and Load,” to compile a list that is by no means complete. Now Seger is back with Face the Promise, an album that extends his legacy into the 21st century. His raw, rough-edged voice still seethes with the conviction that charged it decades ago, but the years have lent him the stature of experience and authority. Not that such authenticity was ever a quality that either Seger or his songs lacked. He has expressed the frustrations, hopes and dreams not simply of people like himself, but that he himself has felt. When he sings, you believe it. The breadth, energy and cinematic beauty of Bob Seger’s music speak eloquently for themselves. His struggle for recognition may have been fought and won long ago, but the battle to convey his vision precisely as he experiences it within himself goes on unabated. Not giving up until he’s satisfied that he’s gotten it right fulfills the promise he has made to his fans and to himself. He faces it every time he steps into the studio, and he delivers on it every time people hear one of his songs and respond, as they so often do, “Yes, that’s exactly what it felt like.” www.bobseger.com", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.41092, 37.75903], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Country, Bluegrass", "OtherInfo": "Bluegrass & Old-Time Music Jam Session at Atlas Cafe: What's not to love about Atlas Cafe? With strong coffee and delicious California-style menu selections, this cool little spot, located in the heart of the Mission also has free Wifi, magazines to peruse, and local art featured on its walls. It offers several microbrews on tap, plus bottled beer and wine. Vegans rejoice -- the café offers a delicious selection of items like a beetloaf sandwich and cheeseless pizzas. Head to the back patio, which also welcomes furry friends, and show up on Thursdays and Saturdays for some free, toe-tapping bluegrass.", "Time": "8:00 PM", "Venue": "Atlas Cafe"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "QUIX", "ArtistBio": "HI, MY NAME IS JONO\n⠀⠀⠀⠀⠀⠀\nI'm a bass producer from Auckland, NZ. I started as a drummer when I was pretty young, and ended messing around with production a few years back. Can't believe how far music has taken me so quickly. I got married in 2016 and was working as a groundsman, then early 2017 I had my first North American tour and haven't looked back. I have been to CHINA, INDIA, CANADA, AUSTRALIA & the USA in my first year of full time touring. Couldn't do what I do without my wife Olivia, my family, the big man upstairs and you guys!\n⠀⠀⠀⠀⠀⠀\nCHUR", "ArtistImage": "https://photos.bandsintown.com/thumb/9045696.jpeg", "Coordinates": [-122.405681, 37.778048], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Electronic, Trap, Bass, Dance Music, EDM", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "1015 Folsom"}, {"Address": "1030 Main St, Napa, CA 94559", "Artist": "Grass Child", "ArtistBio": "HI, MY NAME IS JONO\n⠀⠀⠀⠀⠀⠀\nI'm a bass producer from Auckland, NZ. I started as a drummer when I was pretty young, and ended messing around with production a few years back. Can't believe how far music has taken me so quickly. I got married in 2016 and was working as a groundsman, then early 2017 I had my first North American tour and haven't looked back. I have been to CHINA, INDIA, CANADA, AUSTRALIA & the USA in my first year of full time touring. Couldn't do what I do without my wife Olivia, my family, the big man upstairs and you guys!\n⠀⠀⠀⠀⠀⠀\nCHUR", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.285583, 38.29958], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Full Food and Bar Menu Available in all sectionsDont miss this special reunion! One show only!Due to the growing popularity of the band and the success of their first full-length release, over the years that followed Grass Child garnered numerous invitations for mainstage performances at regional festivals and engagements in support of headline acts such as The Cure, No Doubt, The Avett Brothers, Ziggy Marley, Gregg Allman, Los Lonely Boys, Los Lobos, Blues Traveler, Michael Franti and Spearhead, The Cold War Kids, Houndmouth, Ozomatli, Jimmy Cliff and many more.2019 marks the 10th Anniversary of Grass Child and 23 years of Grass Child Gypsy. Today, the members of both groups remain close friends and collaborators and continue to create music and appear on stage together.Ages 8+BLUE NOTE NAPA is located on the 1st floor of the Historic Napa Valley Opera House at 1030 Main St. We are an intimate 144-seat Live Music club and Restaurant, where you can enjoy performances of world renowned and local Bay Area artists alike. We offer a full menu with an elegant wine and cocktail list. Enjoy fantastic main courses, sharing plates, and desserts while you take in a show.All ticket prices are per person.Dinner is served in all sections.Your ticket is also your dining reservation.Every Ticket does get a seat in area purchased.Our Seating Policy is First Come, First Seated in area purchased.We recommend arriving 30 min before door time to get best choice of seating. We do not have a standing room only sectionPairs are sat across from each other, not next to each other.No Refunds, Professional cameras or outside food and drink.Ear Plugs are available for free at the Box OfficeAny special needs or accommodation requests, please call our Box Office.A portion of all ticket fees goes to the historic preservation of the Napa Valley Opera House.Tickets are the same price whether purchased in person, over the phone or onlineSapphire Booth Seating: Booth seating for parties of 4, 5- 6 personsPremier level of seating! Sold only in units of 4 or 5/6, and are not available as singles or pairs. You will be seated when you arrive. (Dark Blue on map)Royal Blue Center Table Seating: Center table area in front of stage: Pairs are seated across from each other. (Light Blue on map)Standard Side Table Seating: Side table areas left and right of center section: Pairs are seated across from each other. (Yellow on map)Bar Area Seating (only 21+ may sit at bar): Great View! Bar Chairs are tall with backs and comfy padded seats. Purse hooks too. (Pink on map). 1030 Main Street, Napa CA 94559Box Office: 707.880.2300 (Wed - Sat, 2:30-9:00 pm, Sun, 1 hr. before doors)", "Time": "8:00 PM", "Venue": "Blue Note Napa"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "De Lux", "ArtistBio": "Booking North & South America - Jake@Circletalentagency.com UK Booking julesdelattre@theagencygroup.com Manager scotty@innovativeleisure.net just a bunch of dx7's and dead drums", "ArtistImage": "https://photos.bandsintown.com/thumb/8193487.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Doors open at 7pm All methods of delivery will be delayed until Thursday Sept. 5", "Time": "8:00 PM", "Venue": "The Fillmore"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Boris", "ArtistBio": "Boris tour dates are here: https://sargenthouse.com/boris", "ArtistImage": "https://photos.bandsintown.com/thumb/7787517.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Japan, International", "OtherInfo": "Boris", "Time": "8:00 PM", "Venue": "Great American Music Hall"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Jake Nielsen's Triple Threat", "ArtistBio": "Boris tour dates are here: https://sargenthouse.com/boris", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433417, 37.784563], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Jake Nielsen's Triple Threat at Boom Boom Room: Couches and cocktails complement a blues and funk boogie, which makes shaking it on the checkerboard dance floor an old-fashioned must. Nightly, up-and-coming national acts play sweaty, steamy sets on the venue's small stage - always a rollicking time.", "Time": "8:00 PM", "Venue": "Boom Boom Room"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "The Good Ones", "ArtistBio": "For The Good Ones’ new album, Rwanda, You Should Be Loved, bandleader Adrien Kazigira composed over forty songs. Most were meditations on his now thirteen-year-old daughter, Marie-Claire, and the life-threatening tumor that has afflicted her left-eye. The recording was done live without overdubs on Adrien’s farm and was imbued with the passing of producer Ian Brennan’s mother during the days that they were there together as well as a former founding band member recently having succumbed to his own demons.\n\nThe Good Ones renown is evidenced by the stellar musicians who collaborated with them on the new album: Wilco’s Nels Cline, TV on the Radio’s Tunde Adebimpe, Sleater-Kinney’s Corin Tucker, My Bloody Valentine’s Kevin Shields, and Fugazi’s Joe Lally. In 2009, Grammy-winner Brennan (Tinariwen, Ramblin’ Jack Elliott, Zomba Prison Project) traveled to Rwanda in search of local music with his Italian-Rwandan wife, filmmaker and photographer, Marilena Delli. After two weeks of crisscrossing the country and listening to countless artists, they met The Good Ones.\n\nFrom the moment he laid eyes on them, Brennan said he knew, “What these guys do is precious and rare. Don't fuck it up!”\n\nBeginning in 1978 when they were still children, the group’s core members were taught music by Janvier’s older brother who was blind and later perished in the 1994 genocide. They formed the band as a healing process after the genocide and the original trio’s membership reunited Rwanda’s three tribes (with one member each from the Tutsi, Hutu, and Abatwa tribes). It was an active attempt to seek out “the good ones,” after having endured and witnessed unthinkable horrors.\n\nSince they live without electricity and have had little access to devices to reproduce musical recordings, The Good Ones’ vocalizations are based on the singing traditions and dialect of their local immediate, agricultural district more than by outside and Western influences. Primary songwriter Adrien Kazigira interweaves intricate harmonies with co-singer, Janvier Havugimana, in a style frequently referred to as “worker songs from the streets.” With the musicians rural and remote hilltop origins, the harmonic similarities to American Bluegrass vocals is often eerie. Third member, Javan Mahoro, lends additional background vocals and percussion on select songs.\n\nThey utilize one-of-a-kind instruments in their music, often incorporating their own farming tools as percussion. Adrien continues to subsist as a farmer on the land that he and his children were born on, where he hid for months and survived the genocide, and the place where his wife died.\n\nTheir music and original songs have received great acclaim globally and the group has appeared on various BBC-radio programs, as well as on The Netherlands VPRO national-television breakfast show. In fact, they also have been publicly praised by the likes of legendary Led Zeppelin lead-singer, Robert Plant, and Grammy-winning, platinum-selling group, Mumford & Sons.\n\nIn 2010, The Good Ones released their debut album, Kigali Y Izahabu (“Kigali of Gold”), making them the first Rwandan artists to distribute internationally songs in the language of Kinyarwanda. In 2015, they released their follow-up album, Rwanda Is My Home. It was named one of the “Top 50 Albums of the Year” by the Sunday London Times.\n\n2019 year marks the 25th anniversary of the Rwandan genocide during which over just a three- month period more than 12.5% of the population was killed, resulting in over 1-million deaths by conservative estimates. Most victims were murdered by hand, and many were tortured (often, by slicing their Achilles Tendons with machetes so they would be unable to flee) and raped before being killed.", "ArtistImage": "https://photos.bandsintown.com/thumb/9296153.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Folk, Indie, World Fusion", "OtherInfo": "The Good Ones (Rwanda)", "Time": "8:00 PM", "Venue": "Ivy Room"}, {"Address": "1807 Telegraph Ave, Oakland, CA 94612", "Artist": "Tommy Cash", "ArtistBio": "For The Good Ones’ new album, Rwanda, You Should Be Loved, bandleader Adrien Kazigira composed over forty songs. Most were meditations on his now thirteen-year-old daughter, Marie-Claire, and the life-threatening tumor that has afflicted her left-eye. The recording was done live without overdubs on Adrien’s farm and was imbued with the passing of producer Ian Brennan’s mother during the days that they were there together as well as a former founding band member recently having succumbed to his own demons.\n\nThe Good Ones renown is evidenced by the stellar musicians who collaborated with them on the new album: Wilco’s Nels Cline, TV on the Radio’s Tunde Adebimpe, Sleater-Kinney’s Corin Tucker, My Bloody Valentine’s Kevin Shields, and Fugazi’s Joe Lally. In 2009, Grammy-winner Brennan (Tinariwen, Ramblin’ Jack Elliott, Zomba Prison Project) traveled to Rwanda in search of local music with his Italian-Rwandan wife, filmmaker and photographer, Marilena Delli. After two weeks of crisscrossing the country and listening to countless artists, they met The Good Ones.\n\nFrom the moment he laid eyes on them, Brennan said he knew, “What these guys do is precious and rare. Don't fuck it up!”\n\nBeginning in 1978 when they were still children, the group’s core members were taught music by Janvier’s older brother who was blind and later perished in the 1994 genocide. They formed the band as a healing process after the genocide and the original trio’s membership reunited Rwanda’s three tribes (with one member each from the Tutsi, Hutu, and Abatwa tribes). It was an active attempt to seek out “the good ones,” after having endured and witnessed unthinkable horrors.\n\nSince they live without electricity and have had little access to devices to reproduce musical recordings, The Good Ones’ vocalizations are based on the singing traditions and dialect of their local immediate, agricultural district more than by outside and Western influences. Primary songwriter Adrien Kazigira interweaves intricate harmonies with co-singer, Janvier Havugimana, in a style frequently referred to as “worker songs from the streets.” With the musicians rural and remote hilltop origins, the harmonic similarities to American Bluegrass vocals is often eerie. Third member, Javan Mahoro, lends additional background vocals and percussion on select songs.\n\nThey utilize one-of-a-kind instruments in their music, often incorporating their own farming tools as percussion. Adrien continues to subsist as a farmer on the land that he and his children were born on, where he hid for months and survived the genocide, and the place where his wife died.\n\nTheir music and original songs have received great acclaim globally and the group has appeared on various BBC-radio programs, as well as on The Netherlands VPRO national-television breakfast show. In fact, they also have been publicly praised by the likes of legendary Led Zeppelin lead-singer, Robert Plant, and Grammy-winning, platinum-selling group, Mumford & Sons.\n\nIn 2010, The Good Ones released their debut album, Kigali Y Izahabu (“Kigali of Gold”), making them the first Rwandan artists to distribute internationally songs in the language of Kinyarwanda. In 2015, they released their follow-up album, Rwanda Is My Home. It was named one of the “Top 50 Albums of the Year” by the Sunday London Times.\n\n2019 year marks the 25th anniversary of the Rwandan genocide during which over just a three- month period more than 12.5% of the population was killed, resulting in over 1-million deaths by conservative estimates. Most victims were murdered by hand, and many were tortured (often, by slicing their Achilles Tendons with machetes so they would be unable to flee) and raped before being killed.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.27017, 37.80785], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Hip-hop, Rap, Hip Hop, Country", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Fox Theater"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Del Bombers", "ArtistBio": "Del Bombers play high energy, timeless rock and roll that is dark, melodic, and intoxicating.", "ArtistImage": "https://photos.bandsintown.com/thumb/9395673.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Winters Tavern"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Blues Jam", "ArtistBio": "Del Bombers play high energy, timeless rock and roll that is dark, melodic, and intoxicating.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.416775, 37.739269], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe"}, {"Address": "510 Embarcadero West, Oakland, CA 94607", "Artist": "Rodney Franklin", "ArtistBio": "Del Bombers play high energy, timeless rock and roll that is dark, melodic, and intoxicating.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.279289, 37.796471], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Jazz, Rnb-soul, R&b/soul, Funk", "OtherInfo": "RODNEY FRANKLIN", "Time": "8:00 PM", "Venue": "Yoshi's Oakland"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "Melvin Seals and JGB", "ArtistBio": "In 1980 Melvin Seals joined the Jerry Garcia Band and remained a member until Jerry Garcia's untimely death in 1995. After Garcia's death Seals took charge. Under his leadership, the slightly renamed 'Melvin Seals and JGB' pays tribute to Garcia by performing his songs and remaining faithful to his style.\n\n\n\nWe are the Keepers of the Flame!", "ArtistImage": "https://photos.bandsintown.com/thumb/9190692.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Jam Bands, Rock, Soul, Rock n Roll, R&B, soul", "OtherInfo": "Melvin's Pre-Birthday Show with Phil Lesh sitting in!", "Time": "8:00 PM", "Venue": "Terrapin Crossroads"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "SWIMM", "ArtistBio": "Dear SWIMM,\n\nExcuse my indulgence but I’m feeling as though a preface is necessary in this letter to you. So here is the preface SWIMM. My dick hasn’t been hard since before Nü metal gave shirtless cock-rock a platform to pirate a once glorified stage of bravado and turn anything with a little meat and potatoes into a creatine shake. My proverbial pendulum hasn’t approached high noon in so long that I’ve considered leaving my job as the lead music journalist at Vegan Sprong. But just as I approached accepting that this industry is as hollowed out as its collective nasal cavity… I stumbled upon hope in the form of a misspelled oasis in thin font. What I’m getting at is this. Through the twists and turns of objectifying the subjective and hocking my own daily projections onto someone’s precious musing whilst transmogrifying my opinions into printed fact I stumbled upon something that made it matter again. It was SWIMM. And well Hallelujah is right, cause guys… I think it moved a little.\n\nSWIMM is a band. Though truly it feels as though I’m slighting you to define it so irreverently. Sure… the semantics. It is a group of guys playing indie music. Genres, directions and influence oh my. The way I see it? You don’t blur genre lines as much as you weave in and around them. Like a dancer trained in the art of the pole, you wrap yourself around every angle of that steel, climbing to exhilarating heights, effortlessly spinning off in exciting directions but still poised and comfortable in the intimacy of an eye-locking ass-clap. Again… even thinking about it… It moved a little. The ambition to strive for a singular voice and sincerity in music is often the ‘unapproachable model sitting alone smoking a menthol at the bar blankly staring above her glass of sherry’. So the mirabilia in you finding that is not lost on me. But to this there is that and to that there is this! An innate humor that often detracts the listener from ever taking you too seriously. Well let’s say more seriously than you would ever want. And in that my SWIMM friends the truth you are tapping into does not beg for recognition nor does it parry those listeners with phlegmatic constitution. Cause let’s face it, apathy has near and far replaced ‘easy listening’.\n\nIn your new single “Man’s Man” you relay the hilarity of a cliche Los Angeles artist type molding sincerity in heartbreak through conjured New Age justifications. You sing “horoscopes for answers please, a whore before but now I see my actions don’t define me. // I’m existential ego free, waiting for the feels to leave// still I’d rather hear you cry and than to hear you say you love me.”\n\nYour writing process. Well I find it reflects the corybantic nature of our fast food society and well… how else could we all relate? In one moment a plea with reality and a bargain with aspirations and in another the possibility that all the secrets of the universe are tied up in the banal observations we may be too preoccupied to ruminate upon.\n\nTake “Beverly Hells”, the title track of your last EP and the first sign that you were willing to go a little deeper. In one sense a satirical rant on the absurdity of Hollywood. In another sense, a love song simply pining for the genuine to reveal itself.\n\nBut what would these words be than just someone’s drunk uncle slurring his ethos in late night text messages without a marriage of palpable sonic elements. Palpable in the way your brain gets chills and softly vibrates much like an underwater eel garden when clean MDMA introduces itself to your senses. (Or so I’ve heard) Or the way your whole body feels a chord when just the right amount of psilocybin is ingested. (Also, i’ve heard) Perhaps SWIMM, you knew you must create the world in which these lyrics live, in just the right way to express the sentiments they speak to your easily detracted, Ritalin generation.\n\nBut here is the clincher for me. Let’s see. How can I explain this. Ok, every once in a while I want to forget our technological advances and the jejune twinkling of Apple laptop music and swing my cock (again, proverbial) around like a freshman named Max or Cooper, who wears tie-dye with unapologetic naiveté and doesn’t fear the capricious pathways of the subconscious that can be opened by LSD. Pardon but can someone just fuck me up a little? Well SWIMM you do that for me too. Cause boys, even though you will only grow softer in your quarter life crisis… much like my metaphorical member, I can tell it is within you to need that same release. And sooner or later, after Cookie gets his fill of slowly dry humping the audience’s ears via his crush velvet whispers he too will reach for his balls (must I reiterate at this point?). He will kick a pedal and lose his shit and we will all get the kick in the dick we’ve been waiting for.\n\nCorrect me if I’m wrong but the sound of distorted guitars and live drums is still a thing right? In some remote corner of the music world? Well when I walked into their warehouse in downtown LA, aptly named The Cube, and the entire place was transformed into a sexedelic space hub of wild abandonment, I started to believe again. Adam whipped his curly locks to and fro whilst pounding those drums and well you could color me convinced. Forgive me now if my musical latissimus dorsi are bulging like Henry Rollins without his shirt on but why does testosterone in music have to feel so barbaric? And to that, why does the term singer/songwriter make me want to barf sparkles and kleenex drenched in unrequited tears. Oh Ritalin Generation!!! I ask you! Must we choose? Must we either gaze or rock? Must we either sway or shimmy? Must we either make love or fuck? Must we choose? SWIMM I feel I don’t need to choose with you. And for that, from the bottom of my “not flaccid, not yet a hard cock” I thank you.\n\n-Donni Leiberman,\nVegan Sprong", "ArtistImage": "https://photos.bandsintown.com/thumb/9236343.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Alternative, Indie", "OtherInfo": "Crooked Colours", "Time": "8:00 PM", "Venue": "The Independent"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Crooked Colours", "ArtistBio": "Crooked Colours burst onto the scene in 2014 when they were handpicked by triple j Unearthed to perform at St. Jerome’s Laneway Festival after the breakout success of hit single ‘Come Down’. The band quickly followed up with singles ‘Capricious’ & ‘Another Way’ catching the attention of bands RÜFÜS & San Cisco who invited the band on their national album tours.\n\n\n\nAfter signing with Sydney indie label Sweat It Out, the band took an 18-month hiatus to develop their craft further and record a full-length record of more diverse and layered productions than ever before. The first single ‘Flow’ released at the start of the year received high praise from the likes of triple j, Radio 1, Majestic Casual, Complex UK and fans alike, packing out shows across their sold-out national tour in April.\n\n\n\nThier debut album 'VERA' out on June 23rd will be toured across Australia, New Zealand, Germany, Switzerland, Austria, France, U.K., Netherlands, U.S.A. & Canada through the back end of 2017 and into 2018.", "ArtistImage": "https://photos.bandsintown.com/thumb/8811694.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Alternative, Electronic, Indie", "OtherInfo": "Crooked Colours", "Time": "8:00 PM", "Venue": "The Independent"}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Coastal Clouds", "ArtistBio": "This is the beginning of a new project in Venice, CA", "ArtistImage": "https://photos.bandsintown.com/thumb/8933435.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Bottom Of the Hill"}, {"Address": "859 O'Farrell St, San Francisco, CA 94109", "Artist": "Uniform", "ArtistBio": "Uniform is the duo of New York based musicians Ben Greenberg and Michael Berdan. \"Wake In Fright\" is out January 20, 2017 on Sacred Bones.", "ArtistImage": "https://photos.bandsintown.com/thumb/7336634.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Noise", "OtherInfo": "Boris", "Time": "8:00 PM", "Venue": "Great American Music Hall"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "Bombargo", "ArtistBio": "Bombargo drops a vibrant splash of soul on their funky indie vibes with layers of rock and R&B infused throughout. The band brings an unrivalled energy to the stage with sing along anthems, magical harmonies, and a powerful message that combined; make for one of the most passionate live shows ever! Even billionaire and Virgin Records founder Sir Richard Branson was impressed, quoting: “I haven’t seen this type of energy since The Rolling Stones!”.\n\nManagement: https://madisonhouseinc.com/bombargo\n\nUS Booking:\nhttps://madisonhouseinc.com/bombargo\n\nCanadian Booking:\nhttps://www.paquinartistsagency.com/roster/artist/bombargo\n\nTaylor Swift also has a soft spot for Bombargo, adding their single ‘Mr. No Good’ to her Spotify playlist ‘Songs Taylor Loves’ alongside Ed Sheeran, Camilla Cabello, and Kendrick Lamar. Being part of this star-studded playlist saw Bombargo featured on CBC’s the Q, NME, Exclaim, Fashion, Noisey, People, Billboard and more – leading to their follow up single ‘All the Same’ which reached #1 on Spotify’s Indie All Star playlist.\n\nFrom headlining festivals to opening for legendary acts like John Butler Trio, Michael Franti & Spearhead, The Dead South, and Joel Plaskett; Bombargo has rapidly made a name for themselves globally with their life changing live performances, captivating music, and The Good Time GuaranteeTM. Just ask lead singer Nathan Thoen - “A lot of bands try to promise you a good time, but we actually guarantee it.”\n\nThere’s no doubt that Bombargo is one of the hardest working bands in Canada, setting out for their Spring Fling tour across Canada, releasing yet another single, and recording their 2nd full length record while shooting their feature length film set to coincide with the release.", "ArtistImage": "https://photos.bandsintown.com/thumb/9045723.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Rock, Rock Alternative, Soul, Funk, Pop, Classic rock, Pop influenced by Funk, Rock \\, Roll", "OtherInfo": "THE MAIN SQUEEZE and Bombargo will be live in Berkeley Thursday, September 26, 2019 at Cornerstone Craft Beer & Live Music\n\nOn Sale: 6/21 @ 10am PST\n\nAges: All Ages\nDoors 7:30pm / Show 8:30pm\n\nFrom their origins as a jam/party band in Indiana, The Main Squeeze, has been weaving the veins of Rock, Funk, Blues, and R&B into modern song stylings. Now LA-based and with three albums under their belt (last one being 2017’s Without A Sound), festival appearances from KABOO to Bonnaroo, and features from Billboard and Rolling Stone, they are of turning over a new sonic leaf this year.\n\nThe Main Squeeze released their newest single, “Fancy Clothes” on January 18th. Following in the wake of the release of “It Ain’t Me” last October, these two singles mark the start of something new and fresh for the Indiana-to-Chicago-to-Los Angeles transplants. The singles play up the modern dance-pop vibes of Bruno Mars and Charlie Puth - while channeling the swag, grit and soulful sounds of 70s bands like The Rolling Stones and Sly and the Family Stone. Produced by Teddy Roxpin “Fancy Clothes” is a tongue in cheek dance track that reflects the spotlighted LA culture in which The Main Squeeze lives.\n\nWith a rich touring history including opening slots for The Roots, Jane’s Addiction, D.R.A.M., Mac Miller, Aloe Blacc, and Umphrey’s McGee, The Main Squeeze are launching into a new musical orbit with plans for a fourth LP in 2019.\n\nCornerstone\n2367 Shattuck Ave.\nBerkeley, CA 94704\nPhone: (510) 214-8600", "Time": "8:00 PM", "Venue": "Cornerstone Craft Beer & Live Music"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Otis McDonald", "ArtistBio": "Bombargo drops a vibrant splash of soul on their funky indie vibes with layers of rock and R&B infused throughout. The band brings an unrivalled energy to the stage with sing along anthems, magical harmonies, and a powerful message that combined; make for one of the most passionate live shows ever! Even billionaire and Virgin Records founder Sir Richard Branson was impressed, quoting: “I haven’t seen this type of energy since The Rolling Stones!”.\n\nManagement: https://madisonhouseinc.com/bombargo\n\nUS Booking:\nhttps://madisonhouseinc.com/bombargo\n\nCanadian Booking:\nhttps://www.paquinartistsagency.com/roster/artist/bombargo\n\nTaylor Swift also has a soft spot for Bombargo, adding their single ‘Mr. No Good’ to her Spotify playlist ‘Songs Taylor Loves’ alongside Ed Sheeran, Camilla Cabello, and Kendrick Lamar. Being part of this star-studded playlist saw Bombargo featured on CBC’s the Q, NME, Exclaim, Fashion, Noisey, People, Billboard and more – leading to their follow up single ‘All the Same’ which reached #1 on Spotify’s Indie All Star playlist.\n\nFrom headlining festivals to opening for legendary acts like John Butler Trio, Michael Franti & Spearhead, The Dead South, and Joel Plaskett; Bombargo has rapidly made a name for themselves globally with their life changing live performances, captivating music, and The Good Time GuaranteeTM. Just ask lead singer Nathan Thoen - “A lot of bands try to promise you a good time, but we actually guarantee it.”\n\nThere’s no doubt that Bombargo is one of the hardest working bands in Canada, setting out for their Spring Fling tour across Canada, releasing yet another single, and recording their 2nd full length record while shooting their feature length film set to coincide with the release.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421188, 37.760565], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Abbey Road 50th Anniversary Show Otis McDonald & Abbey Bowed String Quartet", "Time": "8:00 PM", "Venue": "The Chapel"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Haydn", "ArtistBio": "Bombargo drops a vibrant splash of soul on their funky indie vibes with layers of rock and R&B infused throughout. The band brings an unrivalled energy to the stage with sing along anthems, magical harmonies, and a powerful message that combined; make for one of the most passionate live shows ever! Even billionaire and Virgin Records founder Sir Richard Branson was impressed, quoting: “I haven’t seen this type of energy since The Rolling Stones!”.\n\nManagement: https://madisonhouseinc.com/bombargo\n\nUS Booking:\nhttps://madisonhouseinc.com/bombargo\n\nCanadian Booking:\nhttps://www.paquinartistsagency.com/roster/artist/bombargo\n\nTaylor Swift also has a soft spot for Bombargo, adding their single ‘Mr. No Good’ to her Spotify playlist ‘Songs Taylor Loves’ alongside Ed Sheeran, Camilla Cabello, and Kendrick Lamar. Being part of this star-studded playlist saw Bombargo featured on CBC’s the Q, NME, Exclaim, Fashion, Noisey, People, Billboard and more – leading to their follow up single ‘All the Same’ which reached #1 on Spotify’s Indie All Star playlist.\n\nFrom headlining festivals to opening for legendary acts like John Butler Trio, Michael Franti & Spearhead, The Dead South, and Joel Plaskett; Bombargo has rapidly made a name for themselves globally with their life changing live performances, captivating music, and The Good Time GuaranteeTM. Just ask lead singer Nathan Thoen - “A lot of bands try to promise you a good time, but we actually guarantee it.”\n\nThere’s no doubt that Bombargo is one of the hardest working bands in Canada, setting out for their Spring Fling tour across Canada, releasing yet another single, and recording their 2nd full length record while shooting their feature length film set to coincide with the release.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419994, 37.777441], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "MTT: Stravinky & Haydn In an inspired pairing of the Classical and the Neoclassical, Michael Tilson Thomas presents Stravinsky and Haydn together. The superb SF Symphony Chorus joins the Orchestra in Stravinsky’s kaleidoscopic three-movement choral masterpiece, Symphony of Psalms. A tireless advocate for young musicians, MTT welcomes cellist Oliver Herbert, an alumnus of the San Francisco Symphony Youth Orchestra, as soloist in Haydn’s Cello Concerto No. 2.", "Time": "8:00 PM", "Venue": "Davies Symphony Hall"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Jake Nielsen's Triple Threat", "ArtistBio": "Bombargo drops a vibrant splash of soul on their funky indie vibes with layers of rock and R&B infused throughout. The band brings an unrivalled energy to the stage with sing along anthems, magical harmonies, and a powerful message that combined; make for one of the most passionate live shows ever! Even billionaire and Virgin Records founder Sir Richard Branson was impressed, quoting: “I haven’t seen this type of energy since The Rolling Stones!”.\n\nManagement: https://madisonhouseinc.com/bombargo\n\nUS Booking:\nhttps://madisonhouseinc.com/bombargo\n\nCanadian Booking:\nhttps://www.paquinartistsagency.com/roster/artist/bombargo\n\nTaylor Swift also has a soft spot for Bombargo, adding their single ‘Mr. No Good’ to her Spotify playlist ‘Songs Taylor Loves’ alongside Ed Sheeran, Camilla Cabello, and Kendrick Lamar. Being part of this star-studded playlist saw Bombargo featured on CBC’s the Q, NME, Exclaim, Fashion, Noisey, People, Billboard and more – leading to their follow up single ‘All the Same’ which reached #1 on Spotify’s Indie All Star playlist.\n\nFrom headlining festivals to opening for legendary acts like John Butler Trio, Michael Franti & Spearhead, The Dead South, and Joel Plaskett; Bombargo has rapidly made a name for themselves globally with their life changing live performances, captivating music, and The Good Time GuaranteeTM. Just ask lead singer Nathan Thoen - “A lot of bands try to promise you a good time, but we actually guarantee it.”\n\nThere’s no doubt that Bombargo is one of the hardest working bands in Canada, setting out for their Spring Fling tour across Canada, releasing yet another single, and recording their 2nd full length record while shooting their feature length film set to coincide with the release.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433417, 37.784563], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Jake Nielsen's Triple Threat at Boom Boom Room: Couches and cocktails complement a blues and funk boogie, which makes shaking it on the checkerboard dance floor an old-fashioned must. Nightly, up-and-coming national acts play sweaty, steamy sets on the venue's small stage - always a rollicking time.", "Time": "8:00 PM", "Venue": "Boom Boom Room"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "The Good Ones", "ArtistBio": "For The Good Ones’ new album, Rwanda, You Should Be Loved, bandleader Adrien Kazigira composed over forty songs. Most were meditations on his now thirteen-year-old daughter, Marie-Claire, and the life-threatening tumor that has afflicted her left-eye. The recording was done live without overdubs on Adrien’s farm and was imbued with the passing of producer Ian Brennan’s mother during the days that they were there together as well as a former founding band member recently having succumbed to his own demons.\n\nThe Good Ones renown is evidenced by the stellar musicians who collaborated with them on the new album: Wilco’s Nels Cline, TV on the Radio’s Tunde Adebimpe, Sleater-Kinney’s Corin Tucker, My Bloody Valentine’s Kevin Shields, and Fugazi’s Joe Lally. In 2009, Grammy-winner Brennan (Tinariwen, Ramblin’ Jack Elliott, Zomba Prison Project) traveled to Rwanda in search of local music with his Italian-Rwandan wife, filmmaker and photographer, Marilena Delli. After two weeks of crisscrossing the country and listening to countless artists, they met The Good Ones.\n\nFrom the moment he laid eyes on them, Brennan said he knew, “What these guys do is precious and rare. Don't fuck it up!”\n\nBeginning in 1978 when they were still children, the group’s core members were taught music by Janvier’s older brother who was blind and later perished in the 1994 genocide. They formed the band as a healing process after the genocide and the original trio’s membership reunited Rwanda’s three tribes (with one member each from the Tutsi, Hutu, and Abatwa tribes). It was an active attempt to seek out “the good ones,” after having endured and witnessed unthinkable horrors.\n\nSince they live without electricity and have had little access to devices to reproduce musical recordings, The Good Ones’ vocalizations are based on the singing traditions and dialect of their local immediate, agricultural district more than by outside and Western influences. Primary songwriter Adrien Kazigira interweaves intricate harmonies with co-singer, Janvier Havugimana, in a style frequently referred to as “worker songs from the streets.” With the musicians rural and remote hilltop origins, the harmonic similarities to American Bluegrass vocals is often eerie. Third member, Javan Mahoro, lends additional background vocals and percussion on select songs.\n\nThey utilize one-of-a-kind instruments in their music, often incorporating their own farming tools as percussion. Adrien continues to subsist as a farmer on the land that he and his children were born on, where he hid for months and survived the genocide, and the place where his wife died.\n\nTheir music and original songs have received great acclaim globally and the group has appeared on various BBC-radio programs, as well as on The Netherlands VPRO national-television breakfast show. In fact, they also have been publicly praised by the likes of legendary Led Zeppelin lead-singer, Robert Plant, and Grammy-winning, platinum-selling group, Mumford & Sons.\n\nIn 2010, The Good Ones released their debut album, Kigali Y Izahabu (“Kigali of Gold”), making them the first Rwandan artists to distribute internationally songs in the language of Kinyarwanda. In 2015, they released their follow-up album, Rwanda Is My Home. It was named one of the “Top 50 Albums of the Year” by the Sunday London Times.\n\n2019 year marks the 25th anniversary of the Rwandan genocide during which over just a three- month period more than 12.5% of the population was killed, resulting in over 1-million deaths by conservative estimates. Most victims were murdered by hand, and many were tortured (often, by slicing their Achilles Tendons with machetes so they would be unable to flee) and raped before being killed.", "ArtistImage": "https://photos.bandsintown.com/thumb/9296153.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Folk, Indie, World Fusion", "OtherInfo": "The Good Ones (Rwanda)", "Time": "8:00 PM", "Venue": "Ivy Room"}, {"Address": "1984 Bonita Ave, Berkeley, CA 94704", "Artist": "The Salty Suites", "ArtistBio": "The Salty Suites played their first show together in a high security prison for the criminally insane. They enjoy spending time with their cats, drinking whiskey and taking long walks on the beach. Their music is heavily influenced by small woodland creatures and traveling encyclopedia salesmen. Lyrically their inspiration derives from fortune cookies and grumpy cat memes. Don't miss this functionally dysfunctional band of hooligans. BUY CDs, T-SHIRTS AND GOODIES HERE http://mkt.com/the-salty-suites", "ArtistImage": "https://photos.bandsintown.com/thumb/7909145.jpeg", "Coordinates": [-122.272093, 37.871966], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: New Roots Music", "OtherInfo": "The Salty Suites played their very first show together in a high security prison for the criminally insane. That's no joke, and it was a very fitting beginning for this plucky bunch of misfits. Their brand of original Americana encompasses a wide spectrum of musical styles from bluegrass to blues from classic country swing to heady jam band rock (as rocking as you can get with mandolin, stand up bass and acoustic guitar).\nThe three lead singers’ voices could not be more different from one another and yet, when they come together in three-part harmony, the powerful sound delivers a heavy dose of musical charm.\nThe Salty Suites are Scott Gates (mandolin, vocals), Chuck Hailes (stand up bass, vocals) and Chelsea Williams (vocals, acoustic guitar). Scott Gates, a native to the Southern California bluegrass scene, plays the mandolin with a healthy mix of finesse and mayhem. His ear-bending tones can go from sounding like classical mandolin to electric guitar and everything in between. And to add insult to injury Scott is also an exceptional singer and songwriter. Chuck Hailes, who started out playing jazz and classical bass, has evolved into quite the musical mischief-maker. His playing style ranges from dulcet bowing tones to off-kilter funky grooves, and he might just break your heart with his beautifully poignant original songs. Singer Chelsea Williams has a voice that is one part honey and two parts whiskey. Her sweet sound can turn to gravel in an instant and her bittersweet songs tempt you into believing that you might actually enjoy a little bit of heartache.\nTickets are $15 in advance and $18 at the door, general admission; $10 advance, $13 at the door for students with ID. Children under 12 are free. Advance tickets are available at the link below, or you may purchase your tickets at the door the night of the show. Doors open one half hour before show time. We accept cash only at the door (ATMs are nearby). The Back Room is an all-ages, BYOB (for those 21+) space, dedicated to (mostly) acoustic music of all kinds. You are welcome to bring your own adult beverage with no additional corkage fee. If you need more information or have any questions, please call us: #510-654-3808. Thank you for your support!", "Time": "8:00 PM", "Venue": "The Back Room Music"}, {"Address": "1807 Telegraph Ave, Oakland, CA 94612", "Artist": "Tommy Cash", "ArtistBio": "The Salty Suites played their first show together in a high security prison for the criminally insane. They enjoy spending time with their cats, drinking whiskey and taking long walks on the beach. Their music is heavily influenced by small woodland creatures and traveling encyclopedia salesmen. Lyrically their inspiration derives from fortune cookies and grumpy cat memes. Don't miss this functionally dysfunctional band of hooligans. BUY CDs, T-SHIRTS AND GOODIES HERE http://mkt.com/the-salty-suites", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.27017, 37.80785], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Hip-hop, Rap, Hip Hop, Country", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Fox Theater"}, {"Address": "8240 Old Redwood Hwy, Cotati, CA 94931", "Artist": "Aki Kumar", "ArtistBio": "Dynamic frontman & harp player Aki Kumar is a rising star among the next generation of SF Bay Area blues artists. A master of the amplified Chicago blues sound, Kumar inherits his style from the harp legends of the 1950s and 60s. Aki has a unique voice in the blues, blending elements of blues harmonica pioneers of yesteryear with a signature sound of his own.\n\nBorn and raised in Bombay - India, Kumar established his mark on the West Coast blues scene starting in 2009 as frontman of the SF Bay Area's highly acclaimed blues outfit Tip of the Top. His latest venture, The Aki Kumar Blues Band, involves several Bay Area blues luminaries and has been the culmination of his journey through American roots music. The band performs vintage blues with tremendous skill and energy and is guaranteed to entertain audiences across all venues, from intimate listening rooms to large festivals. When not performing under his own name, Aki Kumar can also be found working with the heavy-hittin' blues band, Little Jonny and The Giants.", "ArtistImage": "https://photos.bandsintown.com/thumb/7311121.jpeg", "Coordinates": [-122.705214, 38.325608], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Blues", "OtherInfo": "About Aki Kumar:\"..old school blues at its finest by way of India. And the lad has soul to spare.\" Dan Aykroyd aka Elwood BluesIndian-born, San Jose-based Aki Kumar, aka \"The Only Bombay Blues Man,\" left his home in Mumbai for the United States with the intention of working as a software engineer. Then he discovered the blues, and his life dramatically changed. With his Little Village Foundation debut, \"Aki Goes to Bollywood\", Kumar began integrating elements of Indian music into his musical and visual presentation, making for a multi-cultural mash-up that sounds like no one else, yet never loses touch with its blues foundation. Kumar’s follow-up album, \"Hindi Man Blues\", boasts his most ambitious cross-cultural fusion to date, and features liner notes by veteran blues great Charlie Musselwhite. Kumar recently performed at the prestigious Hardly Strictly Bluegrass festival, has been featured on PRI “The World,” and has toured in Russia, South America and Scandinavia.Hailed as a star among the next generation of West Coast blues artists and versatile in many different styles of roots music, Kumar is equally at ease rocking a Jimmy Reed number in English as he is belting out a signature, swingin' re-interpretation of a Bollywood classic in Hindi. Cleverly crafted originals featuring his masterful blues harmonica riffs are a highlight of this charismatic entertainer's live performances.https://www.pri.org/stories/2016-07-05/i-wanted-be-bigger-bill-gates-i-fell-love-bluesAki Kumar | akikumar.com | bollywoodblues.comResident DJ Loisaida too!", "Time": "8:00 PM", "Venue": "Redwood Cafe"}, {"Address": "122 10th St, San Francisco, CA 94103", "Artist": "Imin J. Love", "ArtistBio": "Dynamic frontman & harp player Aki Kumar is a rising star among the next generation of SF Bay Area blues artists. A master of the amplified Chicago blues sound, Kumar inherits his style from the harp legends of the 1950s and 60s. Aki has a unique voice in the blues, blending elements of blues harmonica pioneers of yesteryear with a signature sound of his own.\n\nBorn and raised in Bombay - India, Kumar established his mark on the West Coast blues scene starting in 2009 as frontman of the SF Bay Area's highly acclaimed blues outfit Tip of the Top. His latest venture, The Aki Kumar Blues Band, involves several Bay Area blues luminaries and has been the culmination of his journey through American roots music. The band performs vintage blues with tremendous skill and energy and is guaranteed to entertain audiences across all venues, from intimate listening rooms to large festivals. When not performing under his own name, Aki Kumar can also be found working with the heavy-hittin' blues band, Little Jonny and The Giants.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.415753, 37.774764], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Urban Pharm"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Del Bombers", "ArtistBio": "Del Bombers play high energy, timeless rock and roll that is dark, melodic, and intoxicating.", "ArtistImage": "https://photos.bandsintown.com/thumb/9395673.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Winters Tavern"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Coco Montoya", "ArtistBio": "Between his white-hot guitar playing and his soulful, emotional vocals, Coco Montoya has talent to burn. In a career that spans almost four decades, he's gone from drumming for blues icon Albert Collins to holding the lead guitar spot in John Mayall's Bluesbreakers to leading his own band and touring worldwide. Montoya is revered for his ability to move from subtly melodic guitar playing to slash-and-burn pyrotechnics. Equally forceful are his deep, soul-baring vocals. Years of constant touring, playing unforgettable shows at clubs, concert halls and festivals, have earned him his position at the top of the contemporary blues world. And it all started with a chance meeting in the mid-1970s with legendary bluesman Albert Collins, who offered Montoya a spot in his band, where he stayed for the next five years. Coco was initially hired as Collins' drummer and later—with Albert mentoring him on the guitar—became the band's rhythm guitarist. A few years after leaving Collins' band, British blues star John Mayall heard Coco jamming onstage and was so impressed that he hired him for the newly reformed Bluesbreakers.\n\nWhen Montoya launched his solo career in 1993, he already had an instantly recognizable burning-hot sound and style all his own. His debut album solidified his stature as the blues' newest rising star. Over the course of his nine previous solo albums, Montoya has consistently delivered piping hot blues, rock and soul. His new album (his fifth for Alligator), Coming In Hot, is another instant classic. Montoya's fiery, melodic guitar playing and passionate vocals fuel one memorable song after another. Guitar Player says Montoya plays \"stunning, powerhouse blues with a searing tone, emotional soloing, and energetic, unforced vocals.\"\n\nComing In Hot, produced by Tony Braunagel (Eric Burdon, Curtis Salgado, Taj Mahal, Bonnie Raitt), features 11 songs, ranging from the blistering, hard-rocking title track to the gritty and potent blues shuffle Water To Wine to the emotional ballad What Am I?. He delivers Albert Collins' Lights Are On But Nobody's Home with uncompromising, dynamic energy. Montoya's unpredictable guitar playing and smoking, soulful vocals are inspired by a backing band featuring renowned musicians including bassists Bob Glaub (Bob Dylan, Bruce Springsteen, Jerry Lee Lewis) and Mike Mennell (Jimmy Buffett, John Fogerty), keyboardist Mike Finnigan (Jimi Hendrix, Etta James, Taj Mahal), rhythm guitarists Billy Watts (Eric Burdon) and Johnny Lee Schell (Bonnie Raitt), and Braunagel on drums.\n\nHenry \"Coco\" Montoya was born in Santa Monica, California, on October 2, 1951, and raised in a working class family. Growing up, Coco immersed himself in his parents' record collection. He listened to big band jazz, salsa, doo-wop and rock 'n' roll. His first love was drums; he acquired a kit at age 11. He got a guitar two years later. \"I'm sure the Beatles had something to do with this,\" Montoya recalls. \"I wanted to make notes as well as beats.\" But guitar was his secondary instrument. Montoya turned his love of drumming into his profession, playing in a number of area rock bands while still in his teens and eventually becoming an in-demand drummer.\n\nIn 1969, Montoya saw Albert King opening up a Creedence Clearwater Revival/Iron Butterfly concert at the Shrine Auditorium in Los Angeles. He was transformed. \"After Albert got done playing,\" says Montoya, \"my life was changed. When he played, the music went right into my soul. It grabbed me so emotionally that I had tears welling up in my eyes. Nothing had ever affected me to this level. He showed me what music and playing the blues were all about. I knew that was what I wanted to do.\"\n\nThen fate took over. In the early 1970s, Albert Collins was booked to play a matinee at the same small club in Culver City, California, where Montoya had played the night before. The club owner gave Collins permission to use Montoya's drums. Montoya continues the story: \"I show up to pick up my equipment and I see that someone had been playing my drums and I got a little angry with the club owner. So Albert called me up at the club and was real nice and apologetic. I went down to see his show and it just tore my head off. The thing that I had seen and felt with Albert King came pouring back on me when I saw Albert Collins.\"\n\nA few months later, Collins desperately needed a drummer for a tour of the Northwest and he called Coco. During the tour, Albert took Montoya under his wing, teaching him about blues music and life on the road. After the tour ended, Montoya remained in the band for five more years. It was during this time that Coco began doubling on guitar. And Albert went out of his way to teach him. \"We'd sit in hotel rooms for hours and play guitar,\" remembers Montoya. \"He'd play that beautiful rhythm of his and just have me play along. He was always saying, 'Don't think about it, just feel it.' He was like a father to me,\" says Coco, who often crashed at Collins' home. When he declared Montoya his \"son,\" it was the highest praise and affection he could offer. In return, Montoya learned everything he could from the legendary Master of the Telecaster.\n\nIn 1984, John Mayall needed a guitarist for the newly reformed Bluesbreakers. Hearing Coco at a jam session, he was blown away, and offered Coco this prestigious spot in his legendary band. Filling the shoes of previous Bluesbreaker guitarists Eric Clapton, Peter Green and Mick Taylor would not be easy, but Montoya knew he could not pass up the opportunity to play with another blues legend. For the next ten years he toured the world and recorded with Mayall, soaking up the experience of life on the road and in the recording studio. Along with fellow Bluesbreaker guitarist Walter Trout, Montoya was a featured member of the band, and often opened shows with his own blistering blues.\n\nBy the early 1990s, Montoya struck out on his own. His debut as a leader, 1995's Gotta Mind To Travel (originally on Silvertone Records in England and later issued in the USA on Blind Pig Records), became an instant fan favorite. Blues fans, radio programmers and critics sent praise from all corners. The album immediately made it clear that Montoya was a guitarist and vocalist who ranked among the best players on the contemporary blues scene. In 1996, he won the Blues Music Award for Best New Blues Artist. Two more Blind Pig albums followed, and Coco was well on his way to the top of the blues-rock world.\n\nIn 2000, Coco's Alligator debut, Suspicion, quickly became the best-selling album of his career, earning regular radio airplay on over 120 stations nationwide. Montoya's fan base exploded. After two more highly successful and massively popular Alligator releases—2002's Can't Look Back and 2007's Dirty Deal—Montoya signed with Ruf Records, cutting both a live and a studio album. Returning to Alligator with 2017's Hard Truth, Montoya delivered another fan and critical favorite. \"Montoya unleashes one career-topping performance after another.\" declared Blues Matters, \"the music immediately ranking among the best he's ever recorded.\"\n\nNow, with Coming In Hot, Coco Montoya again turns the burners to high and cooks from start to finish. Still an indefatigable road warrior, Montoya continues to tour virtually nonstop, bringing audiences to their feet from New York to New Orleans to Chicago to San Francisco. Across the globe, he's performed in countries including Australia, Belgium, Switzerland, Germany, Norway, England, Brazil, Argentina, Spain, Mexico, Ecuador, Italy, Poland, Russia, the Czech Republic and Canada. According to Living Blues, \"Montoya is a show-stopper...heartfelt singing and merciless guitar with a wicked icy burn...he swings like a jazz man and stings like the Iceman, Albert Collins. He is one of the truly gifted blues artists of his generation.\"", "ArtistImage": "https://photos.bandsintown.com/thumb/8970356.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Blues, Rock, Rhythm", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Nyxen", "ArtistBio": "Crafting a relationship between a passion and a love for music, births the rise of a humble-grounded Sydney-sider who has made strong waves from the beginning of her music career in 2015 with her adoption to the Unknown Records family. Nyxen’s care free and chilled attitude is reflected in the production of Nyxen’s cruisy and calm records, solely producing her own vocals and instrumental sounds.\n\nHaving been able to play the guitar for 10 years, Nyxen also became intrigued in an early 2000 synthetic band phase which opened her eyes to the likes of Ou Est le Swimming Pool and MGMT. Incorporating influences by Tycho, Miike Snow and Bag Raiders this creative mind brings enjoyable sounds which form a high-vibe atmosphere for all her listeners.", "ArtistImage": "https://photos.bandsintown.com/thumb/8927710.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Crooked Colours", "Time": "8:00 PM", "Venue": "The Independent"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Elvin Bishop", "ArtistBio": "Ever since Rock & Roll and Blues Hall Of Famer Elvin Bishop first hit the scene with the Paul Butterfield Blues Band back in 1965, he’s blazed his own musical trail. Whether he was playing raw, eye-popping blues, or penning the evergreen radio hit Fooled Around And Fell In Love, or touring the world for decades delivering his original, good-time countrified blues, Bishop has always inspired his fans with his rowdy guitar playing and witty, slice-of-life songs. Rolling Stone calls Bishop “a legendary guitarist” whose playing is “impeccable and spirited...a distinguished American player.”\n\nLate in 2015, Elvin Bishop formed The Big Fun Trio, with Bishop on guitar and vocals, and his friends Bob Welsh on piano and guitar and Willy Jordan on cajón (a hand-played Peruvian drumbox) and vocals. After playing just a handful of live dates, the group’s instantly crowd-pleasing music and undeniable chemistry took the blues world by storm. With the release of their self-titled CD in 2017, media and fan response was immediate and overwhelming. DownBeat celebrated Bishop’s “verbal hijinks, outstanding guitar work and country boy friendliness.” OffBeat said The Big Fun Trio was “intricate, funky and uplifting,” declaring them, “consistently great.” With its top-shelf musicianship and front-porch vibe, the album earned a Grammy Award nomination, and won Blues Music Awards for Album Of The Year and Song Of The Year (for the title track) from The Blues Foundation.\n\nThe Big Fun Trio quickly discovered the more they played live, the more fun they had making music together. So a follow-up recording was an easy decision. The new album, Something Smells Funky ‘Round Here, finds the group fearlessly laying it all on the line. According to Elvin, “With a trio there’s no place to hide­—you’ve got to be pourin’ everything you got right out front. You need to be totally into it all the time. It’s really cool to see how people react to the goin’-for-it feel of the music.”\n\nThe album mixes rousing, new originals, reinventions of three Bishop classics and some unexpected, soul-shaking covers. Something Smells Funky ‘Round Here was produced by Bishop and Steve Savage and recorded at Bishop’s Hog Heaven Studio in Lagunitas, California. Bishop wrote or co-wrote five songs (including two by the entire trio). The potent title track—a tongue-in-cheek State Of The Union address as only Elvin can deliver— kicks the album off with Bishop aiming his lyrical truths at those in power. The humorous but piercingly direct lyrics take aim at the current political scene while Bishop’s deep blues guitar playing drives the point home.\n\nLookin’ Good finds Bishop autobiographically gazing in the rearview mirror with sharp, wry lyrics accompanied by Welsh’s perfect blues piano. Willy Jordan sings lead on four songs, including blistering reinventions of Jackie Wilson’s Higher And Higher and Ann Peebles’ I Can’t Stand The Rain. Bob Welsh, whose guitar or piano playing highlight every song, pounds the ivories on his own Bob’s Boogie. “This album fell together easily,” says Bishop. “Everything I visualized about the songs—from Bob’s playing to Willy’s singing, came true. Bob and Willy are great musicians.”\n\nAccording to San Francisco Bay native Jordan, who has decades of experience playing drums with artists including John Lee Hooker, Joe Louis Walker and Angela Strehli, playing in the Big Fun Trio is “crazy different. It’s rootsy but also new. We all stayed simple to stay strong.” Welsh, originally from Covington, Louisiana, has performed and toured with Bishop, Rusty Zinn, Charlie Musselwhite, Billy Boy Arnold, James Cotton and others. Welsh says he too loves playing in the Trio. “Playing this music is fun and fresh and new to us. It keeps us on our toes. We’re always surprising each other. We have to be fearless.”\n\nBorn in Glendale, CA on October 21, 1942, Bishop grew up on a farm in Iowa before relocating to Oklahoma when he was ten. He first got hooked on the blues listening to late night R&B radio as a teenager, and began collecting, listening to and absorbing blues music. Once Bishop realized that many of his favorite records were recorded in Chicago, he used his 1959 National Merit Scholarship as a way to get closer to his blues heroes by enrolling in the University of Chicago, whose campus was located near dozens of the South Side clubs.\n\nAfter Elvin crossed paths with harmonica player and fellow University of Chicago student Paul Butterfield, the two began sitting in together at South Side clubs, often jamming with Buddy Guy and Otis Rush. They first formed The Paul Butterfield Blues Band in 1963, adding Jerome Arnold on bass, Sam Lay on drums and later Mark Naftalin on keyboards. Prior to cutting their debut LP in 1965, Michael Bloomfield joined the group as second lead guitarist, creating a groundbreaking, all-star band. The self-titled The Paul Butterfield Blues Band introduced electric Chicago blues to the rock audience for the first time. With the release of East/West in 1966, the band’s popularity hit an all-time high. Their straight Chicago blues sounds drifted further into progressive and experimental rock ‘n’ roll and—with two world-class lead guitarists on board—the band helped pave the way for groups featuring multiple virtuoso guitarists, like The Allman Brothers Band and Derek and the Dominos. The band, including Bishop, was inducted into the Rock & Roll Hall Of Fame in 2015.\n\nTowards the end of the 1960s, after recording three albums with The Paul Butterfield Blues Band, Elvin decided to move on, heading for the San Francisco area. He became a regular at the famed Fillmore Auditorium jam sessions, playing alongside Jimi Hendrix, Eric Clapton, B.B. King and many others before embarking on a solo career. He recorded first for Fillmore Records, then Epic and then for Capricorn, where his career took off. He charted with Travelin’ Shoes before scoring big in 1975 with Fooled Around And Fell In Love (the song reached number three on the pop charts and was prominently featured in the blockbuster film, Guardians Of The Galaxy).\n\nAfter a seven-year recording hiatus, Elvin returned to his blues roots in 1988, signing with Alligator and releasing five albums between 1988 and 2000. After a few releases on other labels, Bishop returned to Alligator with 2014’s Can’t Even Do Wrong Right, and once again turned the music-loving world on its head. Reviews poured in from NPR’s Fresh Air, Rolling Stone, Living Blues, No Depression and many others. He appeared on TBS-Television’s CONAN and performed numerous times on A Prairie Home Companion, most recently with The Big Fun Trio.\n\nWith Something Smells Funky ‘Round Here, Elvin Bishop’s Big Fun Trio are clearly having a very good time. Having spent almost three years performing, these three tremendously talented musicians continue to inspire each other to new heights. As Elvin Bishop’s Big Fun Trio take their music back on the road, fans will once again have a chance to experience the big fun first hand. According to Living Blues, “Elvin Bishop’s Big Fun Trio has wonderful chemistry and are a joy to hear.”", "ArtistImage": "https://photos.bandsintown.com/thumb/8965579.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Blues, Rock", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Bart Davenport", "ArtistBio": "Ever since Rock & Roll and Blues Hall Of Famer Elvin Bishop first hit the scene with the Paul Butterfield Blues Band back in 1965, he’s blazed his own musical trail. Whether he was playing raw, eye-popping blues, or penning the evergreen radio hit Fooled Around And Fell In Love, or touring the world for decades delivering his original, good-time countrified blues, Bishop has always inspired his fans with his rowdy guitar playing and witty, slice-of-life songs. Rolling Stone calls Bishop “a legendary guitarist” whose playing is “impeccable and spirited...a distinguished American player.”\n\nLate in 2015, Elvin Bishop formed The Big Fun Trio, with Bishop on guitar and vocals, and his friends Bob Welsh on piano and guitar and Willy Jordan on cajón (a hand-played Peruvian drumbox) and vocals. After playing just a handful of live dates, the group’s instantly crowd-pleasing music and undeniable chemistry took the blues world by storm. With the release of their self-titled CD in 2017, media and fan response was immediate and overwhelming. DownBeat celebrated Bishop’s “verbal hijinks, outstanding guitar work and country boy friendliness.” OffBeat said The Big Fun Trio was “intricate, funky and uplifting,” declaring them, “consistently great.” With its top-shelf musicianship and front-porch vibe, the album earned a Grammy Award nomination, and won Blues Music Awards for Album Of The Year and Song Of The Year (for the title track) from The Blues Foundation.\n\nThe Big Fun Trio quickly discovered the more they played live, the more fun they had making music together. So a follow-up recording was an easy decision. The new album, Something Smells Funky ‘Round Here, finds the group fearlessly laying it all on the line. According to Elvin, “With a trio there’s no place to hide­—you’ve got to be pourin’ everything you got right out front. You need to be totally into it all the time. It’s really cool to see how people react to the goin’-for-it feel of the music.”\n\nThe album mixes rousing, new originals, reinventions of three Bishop classics and some unexpected, soul-shaking covers. Something Smells Funky ‘Round Here was produced by Bishop and Steve Savage and recorded at Bishop’s Hog Heaven Studio in Lagunitas, California. Bishop wrote or co-wrote five songs (including two by the entire trio). The potent title track—a tongue-in-cheek State Of The Union address as only Elvin can deliver— kicks the album off with Bishop aiming his lyrical truths at those in power. The humorous but piercingly direct lyrics take aim at the current political scene while Bishop’s deep blues guitar playing drives the point home.\n\nLookin’ Good finds Bishop autobiographically gazing in the rearview mirror with sharp, wry lyrics accompanied by Welsh’s perfect blues piano. Willy Jordan sings lead on four songs, including blistering reinventions of Jackie Wilson’s Higher And Higher and Ann Peebles’ I Can’t Stand The Rain. Bob Welsh, whose guitar or piano playing highlight every song, pounds the ivories on his own Bob’s Boogie. “This album fell together easily,” says Bishop. “Everything I visualized about the songs—from Bob’s playing to Willy’s singing, came true. Bob and Willy are great musicians.”\n\nAccording to San Francisco Bay native Jordan, who has decades of experience playing drums with artists including John Lee Hooker, Joe Louis Walker and Angela Strehli, playing in the Big Fun Trio is “crazy different. It’s rootsy but also new. We all stayed simple to stay strong.” Welsh, originally from Covington, Louisiana, has performed and toured with Bishop, Rusty Zinn, Charlie Musselwhite, Billy Boy Arnold, James Cotton and others. Welsh says he too loves playing in the Trio. “Playing this music is fun and fresh and new to us. It keeps us on our toes. We’re always surprising each other. We have to be fearless.”\n\nBorn in Glendale, CA on October 21, 1942, Bishop grew up on a farm in Iowa before relocating to Oklahoma when he was ten. He first got hooked on the blues listening to late night R&B radio as a teenager, and began collecting, listening to and absorbing blues music. Once Bishop realized that many of his favorite records were recorded in Chicago, he used his 1959 National Merit Scholarship as a way to get closer to his blues heroes by enrolling in the University of Chicago, whose campus was located near dozens of the South Side clubs.\n\nAfter Elvin crossed paths with harmonica player and fellow University of Chicago student Paul Butterfield, the two began sitting in together at South Side clubs, often jamming with Buddy Guy and Otis Rush. They first formed The Paul Butterfield Blues Band in 1963, adding Jerome Arnold on bass, Sam Lay on drums and later Mark Naftalin on keyboards. Prior to cutting their debut LP in 1965, Michael Bloomfield joined the group as second lead guitarist, creating a groundbreaking, all-star band. The self-titled The Paul Butterfield Blues Band introduced electric Chicago blues to the rock audience for the first time. With the release of East/West in 1966, the band’s popularity hit an all-time high. Their straight Chicago blues sounds drifted further into progressive and experimental rock ‘n’ roll and—with two world-class lead guitarists on board—the band helped pave the way for groups featuring multiple virtuoso guitarists, like The Allman Brothers Band and Derek and the Dominos. The band, including Bishop, was inducted into the Rock & Roll Hall Of Fame in 2015.\n\nTowards the end of the 1960s, after recording three albums with The Paul Butterfield Blues Band, Elvin decided to move on, heading for the San Francisco area. He became a regular at the famed Fillmore Auditorium jam sessions, playing alongside Jimi Hendrix, Eric Clapton, B.B. King and many others before embarking on a solo career. He recorded first for Fillmore Records, then Epic and then for Capricorn, where his career took off. He charted with Travelin’ Shoes before scoring big in 1975 with Fooled Around And Fell In Love (the song reached number three on the pop charts and was prominently featured in the blockbuster film, Guardians Of The Galaxy).\n\nAfter a seven-year recording hiatus, Elvin returned to his blues roots in 1988, signing with Alligator and releasing five albums between 1988 and 2000. After a few releases on other labels, Bishop returned to Alligator with 2014’s Can’t Even Do Wrong Right, and once again turned the music-loving world on its head. Reviews poured in from NPR’s Fresh Air, Rolling Stone, Living Blues, No Depression and many others. He appeared on TBS-Television’s CONAN and performed numerous times on A Prairie Home Companion, most recently with The Big Fun Trio.\n\nWith Something Smells Funky ‘Round Here, Elvin Bishop’s Big Fun Trio are clearly having a very good time. Having spent almost three years performing, these three tremendously talented musicians continue to inspire each other to new heights. As Elvin Bishop’s Big Fun Trio take their music back on the road, fans will once again have a chance to experience the big fun first hand. According to Living Blues, “Elvin Bishop’s Big Fun Trio has wonderful chemistry and are a joy to hear.”", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Singer/songwriter, Pop, Indie Pop, Folk", "OtherInfo": "The Good Ones (Rwanda)", "Time": "8:00 PM", "Venue": "Ivy Room"}, {"Address": "500 4th St, San Francisco, CA 94107", "Artist": "Vollmer", "ArtistBio": "Ever since Rock & Roll and Blues Hall Of Famer Elvin Bishop first hit the scene with the Paul Butterfield Blues Band back in 1965, he’s blazed his own musical trail. Whether he was playing raw, eye-popping blues, or penning the evergreen radio hit Fooled Around And Fell In Love, or touring the world for decades delivering his original, good-time countrified blues, Bishop has always inspired his fans with his rowdy guitar playing and witty, slice-of-life songs. Rolling Stone calls Bishop “a legendary guitarist” whose playing is “impeccable and spirited...a distinguished American player.”\n\nLate in 2015, Elvin Bishop formed The Big Fun Trio, with Bishop on guitar and vocals, and his friends Bob Welsh on piano and guitar and Willy Jordan on cajón (a hand-played Peruvian drumbox) and vocals. After playing just a handful of live dates, the group’s instantly crowd-pleasing music and undeniable chemistry took the blues world by storm. With the release of their self-titled CD in 2017, media and fan response was immediate and overwhelming. DownBeat celebrated Bishop’s “verbal hijinks, outstanding guitar work and country boy friendliness.” OffBeat said The Big Fun Trio was “intricate, funky and uplifting,” declaring them, “consistently great.” With its top-shelf musicianship and front-porch vibe, the album earned a Grammy Award nomination, and won Blues Music Awards for Album Of The Year and Song Of The Year (for the title track) from The Blues Foundation.\n\nThe Big Fun Trio quickly discovered the more they played live, the more fun they had making music together. So a follow-up recording was an easy decision. The new album, Something Smells Funky ‘Round Here, finds the group fearlessly laying it all on the line. According to Elvin, “With a trio there’s no place to hide­—you’ve got to be pourin’ everything you got right out front. You need to be totally into it all the time. It’s really cool to see how people react to the goin’-for-it feel of the music.”\n\nThe album mixes rousing, new originals, reinventions of three Bishop classics and some unexpected, soul-shaking covers. Something Smells Funky ‘Round Here was produced by Bishop and Steve Savage and recorded at Bishop’s Hog Heaven Studio in Lagunitas, California. Bishop wrote or co-wrote five songs (including two by the entire trio). The potent title track—a tongue-in-cheek State Of The Union address as only Elvin can deliver— kicks the album off with Bishop aiming his lyrical truths at those in power. The humorous but piercingly direct lyrics take aim at the current political scene while Bishop’s deep blues guitar playing drives the point home.\n\nLookin’ Good finds Bishop autobiographically gazing in the rearview mirror with sharp, wry lyrics accompanied by Welsh’s perfect blues piano. Willy Jordan sings lead on four songs, including blistering reinventions of Jackie Wilson’s Higher And Higher and Ann Peebles’ I Can’t Stand The Rain. Bob Welsh, whose guitar or piano playing highlight every song, pounds the ivories on his own Bob’s Boogie. “This album fell together easily,” says Bishop. “Everything I visualized about the songs—from Bob’s playing to Willy’s singing, came true. Bob and Willy are great musicians.”\n\nAccording to San Francisco Bay native Jordan, who has decades of experience playing drums with artists including John Lee Hooker, Joe Louis Walker and Angela Strehli, playing in the Big Fun Trio is “crazy different. It’s rootsy but also new. We all stayed simple to stay strong.” Welsh, originally from Covington, Louisiana, has performed and toured with Bishop, Rusty Zinn, Charlie Musselwhite, Billy Boy Arnold, James Cotton and others. Welsh says he too loves playing in the Trio. “Playing this music is fun and fresh and new to us. It keeps us on our toes. We’re always surprising each other. We have to be fearless.”\n\nBorn in Glendale, CA on October 21, 1942, Bishop grew up on a farm in Iowa before relocating to Oklahoma when he was ten. He first got hooked on the blues listening to late night R&B radio as a teenager, and began collecting, listening to and absorbing blues music. Once Bishop realized that many of his favorite records were recorded in Chicago, he used his 1959 National Merit Scholarship as a way to get closer to his blues heroes by enrolling in the University of Chicago, whose campus was located near dozens of the South Side clubs.\n\nAfter Elvin crossed paths with harmonica player and fellow University of Chicago student Paul Butterfield, the two began sitting in together at South Side clubs, often jamming with Buddy Guy and Otis Rush. They first formed The Paul Butterfield Blues Band in 1963, adding Jerome Arnold on bass, Sam Lay on drums and later Mark Naftalin on keyboards. Prior to cutting their debut LP in 1965, Michael Bloomfield joined the group as second lead guitarist, creating a groundbreaking, all-star band. The self-titled The Paul Butterfield Blues Band introduced electric Chicago blues to the rock audience for the first time. With the release of East/West in 1966, the band’s popularity hit an all-time high. Their straight Chicago blues sounds drifted further into progressive and experimental rock ‘n’ roll and—with two world-class lead guitarists on board—the band helped pave the way for groups featuring multiple virtuoso guitarists, like The Allman Brothers Band and Derek and the Dominos. The band, including Bishop, was inducted into the Rock & Roll Hall Of Fame in 2015.\n\nTowards the end of the 1960s, after recording three albums with The Paul Butterfield Blues Band, Elvin decided to move on, heading for the San Francisco area. He became a regular at the famed Fillmore Auditorium jam sessions, playing alongside Jimi Hendrix, Eric Clapton, B.B. King and many others before embarking on a solo career. He recorded first for Fillmore Records, then Epic and then for Capricorn, where his career took off. He charted with Travelin’ Shoes before scoring big in 1975 with Fooled Around And Fell In Love (the song reached number three on the pop charts and was prominently featured in the blockbuster film, Guardians Of The Galaxy).\n\nAfter a seven-year recording hiatus, Elvin returned to his blues roots in 1988, signing with Alligator and releasing five albums between 1988 and 2000. After a few releases on other labels, Bishop returned to Alligator with 2014’s Can’t Even Do Wrong Right, and once again turned the music-loving world on its head. Reviews poured in from NPR’s Fresh Air, Rolling Stone, Living Blues, No Depression and many others. He appeared on TBS-Television’s CONAN and performed numerous times on A Prairie Home Companion, most recently with The Big Fun Trio.\n\nWith Something Smells Funky ‘Round Here, Elvin Bishop’s Big Fun Trio are clearly having a very good time. Having spent almost three years performing, these three tremendously talented musicians continue to inspire each other to new heights. As Elvin Bishop’s Big Fun Trio take their music back on the road, fans will once again have a chance to experience the big fun first hand. According to Living Blues, “Elvin Bishop’s Big Fun Trio has wonderful chemistry and are a joy to hear.”", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.398131, 37.779293], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "No genre available", "OtherInfo": "Vollmer, The Little Miss, Josiah Flores, Albert Kass at the Hotel Utah Saloon in San Francisco ! Show begins at 8pm.", "Time": "8:00 PM", "Venue": "Hotel Utah Saloon"}, {"Address": "311 Broadway, Oakland, USA", "Artist": "Abstracter", "ArtistBio": "Noisy and dark Black/Death/Doom/Crust from Oakland CA.\n\nabstracterband.com\nabstracter.bandcamp.com\nfacebook.com/abstracter", "ArtistImage": "https://photos.bandsintown.com/thumb/9177313.jpeg", "Coordinates": [-122.276005, 37.797178], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Blackened Doom, Sludge, Doom", "OtherInfo": "https://www.facebook.com/events/459149591318870", "Time": "8:00 PM", "Venue": "Elbo Room Jack London"}, {"Address": "1517 Franklin, Oakland, CA 94612", "Artist": "B Wiley", "ArtistBio": "B Wiley is Ben Wiley, a producer and musician whose mission is to bridge the gaps between many styles of music. He is currently influenced by the soulful sounds of electronic, hip hop, funk and psychedelic. Born in Bloomington, Indiana, he grew up playing guitar and piano, then learned to DJ shortly after being introduced to the electronic music scene. Check him out on the first Thursday of every month over djing at Jupiter in Berkeley.", "ArtistImage": "https://photos.bandsintown.com/thumb/9290968.jpeg", "Coordinates": [-122.269511, 37.805131], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Electronic, hip hop, funk, psychedelic", "OtherInfo": "Starting a new monthly focused on funk and good vibes, classic hip hop, soul, house and anything else to put you in a positive state! Let's bring back the Funk!", "Time": "8:00 PM", "Venue": "The Layover"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "Friendly Fires", "ArtistBio": "B Wiley is Ben Wiley, a producer and musician whose mission is to bridge the gaps between many styles of music. He is currently influenced by the soulful sounds of electronic, hip hop, funk and psychedelic. Born in Bloomington, Indiana, he grew up playing guitar and piano, then learned to DJ shortly after being introduced to the electronic music scene. Check him out on the first Thursday of every month over djing at Jupiter in Berkeley.", "ArtistImage": "https://photos.bandsintown.com/thumb/8165558.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Alternative, Electronic, Indie", "OtherInfo": "No other event info available", "Time": "8:00 PM", "Venue": "The Fillmore"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Rock", "ArtistBio": "B Wiley is Ben Wiley, a producer and musician whose mission is to bridge the gaps between many styles of music. He is currently influenced by the soulful sounds of electronic, hip hop, funk and psychedelic. Born in Bloomington, Indiana, he grew up playing guitar and piano, then learned to DJ shortly after being introduced to the electronic music scene. Check him out on the first Thursday of every month over djing at Jupiter in Berkeley.", "ArtistImage": "https://photos.bandsintown.com/thumb/6643774.jpeg", "Coordinates": [-122.416775, 37.739269], "Date": "Thu Sep 26 2019", "EventDate": "2019-09-26", "Genre": "Genres: Hip-hop, Rap, Hip Hop", "OtherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe"}]