var sf_events = [{"Address": "641 Santa Cruz Ave, Menlo Park, CA 94025", "Artist": "Rebecca DuMaine and the Dave Miller Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/11511597.jpeg", "Coordinates": [37.452688906249996, -122.18351150000001], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "Jazz", "Time": "6:30 PM", "Venue": "Bastille Day @ Bistro Vida", "moreBioInfo": "Jazz Music", "otherInfo": "French and American Jazz with Rebecca DuMaine on Bastille Day!"}, {"Address": "315 5th St, San Francisco, CA 94107", "Artist": "Mission Hot Club ", "ArtistImage": "https://photos.bandsintown.com/thumb/10007471.jpeg", "Coordinates": [37.78021085, -122.40306156940865], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "Jazz,Gypsy Jazz,Jazz Manouche,Swing", "Time": "7:30 PM", "Venue": "Bastille Day Dinner @ Mathilde!", "moreBioInfo": "Hailing from France, Belarus, Israel, Mexico, NYC, Alabama and Indiana, this hot club began playing together in the Mission District of San Francisco in 2018. Their lineup brings the big sound of a full Gypsy Swing/Bal-musette group, including violin, clarinet, accordion, upright bass, and both nylon and steel string acoustic guitars! A core repertoire of lightning hot gypsy jazz evokes the ambience of a smoky Parisian café, complimented with sounds from neighboring acoustic genres including the Spanish, Irish, Balkan, New Orleans, and Klezmer traditions.", "otherInfo": "See https://www.mathildesf.com/bastille-menu for menu and reservation details!"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Bardot A Go Go ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7759904, -122.42047537588323], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "BARDOT A GO GO Bastille Day Dance Party"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Pezzner ", "ArtistImage": "https://photos.bandsintown.com/thumb/8631564.jpeg", "Coordinates": [37.78097205, -122.40833445460233], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "House Tech House", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "David Brian Pezzner was born in Tarzana, California in 1975 and currently lives in Seattle, Washington. He is 5 foot 7 inches in height and weighs about 165 lbs. His brother, Bill works at the Port Of Seattle and has four children, two of whom are actually step-children. Bill’s wife owns a local publication and is a skilled bicyclist (even though she has not gone professional.) When David works in his studio where he makes electronic music, his wife brings him a drink and discusses her day. The door-keeper comes in to give him a telegram sent the previous year from the Eolian Islands. In 2010 he wrote an album of music which was released by Freerange records. A year later David’s first and only daughter, Eloise Sylvia was born. She was 5 pounds 11 ounces at birth. David spoke only English and cooked meals for his family every day until 2013 when a company called Systematic Recordings contracted him for another album. Besides writing music for night clubs and headphones, Pezzner composes music for vision and function, and teaches electronic music writing concepts to private students. He sleeps exactly like any other man but, as you will no doubt have noticed, he is not an orthodox painter of the old school, but rather a modern artist. A designer.", "otherInfo": "HOUSEPITALITY: GRAND OPENING AT MONARCH\nWe are besides ourselves to announce our official \"Grand Opening\" at Monarch!"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Lil' T ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.78097205, -122.40833445460233], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "HOUSEPITALITY: GRAND OPENING AT MONARCH\nWe are besides ourselves to announce our official \"Grand Opening\" at Monarch!"}, {"Address": "765 Laurel St, San Carlos, CA 94070", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.504345067680404, -122.2584649513785], "Date": "2021-07-14", "EventDate": "Jul. 14th, 2021", "Genre": "Singer Songwriter,Cabaret,Broadway,Cover Songs", "Time": "9:00 PM", "Venue": "Faith & Spirits", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "Susan ", "ArtistImage": "https://photos.bandsintown.com/thumb/6144900.jpeg", "Coordinates": [37.7790262, -122.419906], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "New Wave Alternative,Decades,Alternative,Rock Rollers,Pop,80s", "Time": "5:00 PM", "Venue": "PinkLabel.TV", "moreBioInfo": "Susan is comprised of three humanoids who happen to play instruments and share a love for champagne cocktails. Bobby B. + Bass + Jessica O. + Guitar + Katie Fern + Drums= Susan Is A Band", "otherInfo": "No other event info available"}, {"Address": "84 Bartlett St, San Francisco, CA 94110", "Artist": "Manos Lindas ", "ArtistImage": "https://photos.bandsintown.com/thumb/9916746.jpeg", "Coordinates": [37.75568089583333, -122.41999195833333], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Instrumental,Progressive Alternative,Math Rock", "Time": "5:00 PM", "Venue": "Mission Community Market", "moreBioInfo": "Manos Lindas is the product of what its name suggests. Blurring an array of genres and origins, each member contributes their individual hands for a collective sound that can't be pinpointed. San Francisco is a cultural melting pot and certain aspects of that culture are fading, natives would tell you. The heterogeneity, the color, the nerve, the beauty, and the edge: this is what Manos Lindas sounds like. manoslindas.net manoslindas.bandcamp.com", "otherInfo": "Come and support the Mission Farmer's Market and enjoy some Manos Lindas! \n\nBartlett and 22nd between Mission and Valencia Streets."}, {"Address": "San Francisco, CA", "Artist": "Sandra ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7790262, -122.419906], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Decades,80s,Pop", "Time": "5:00 PM", "Venue": "PinkLabel.TV", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "Julie ", "ArtistImage": "https://photos.bandsintown.com/thumb/8671592.jpeg", "Coordinates": [37.7790262, -122.419906], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Pop", "Time": "5:00 PM", "Venue": "PinkLabel.TV", "moreBioInfo": "Julie Ivalo Broberg Berthelsen (born June 7, 1979 in Aarhus, Denmark) is a Danish singer and songwriter. She is known largely for her success on the TV series Popstar, a Danish version of the popular American Idol. Although she finished in second place, she has become more popular and successful than the first place winner. She grew up in Nuuk, the capital of Greenland. This city has also become a popular nickname. Julie has given a variety of performances, the most noteworthy of which was at Christiansborg Palace, in front of the Danish Royal family for the wedding of Crown Prince Frederik and Crown Princess Mary.", "otherInfo": "No other event info available"}, {"Address": "50 E 5th Ave, San Mateo, CA 94401", "Artist": "Native Elements ", "ArtistImage": "https://photos.bandsintown.com/thumb/6273896.jpeg", "Coordinates": [37.562148993178205, -122.32360318611165], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Island Soul,Roots,Lovers Rock,Reggae,Folk", "Time": "6:00 PM", "Venue": "Music in the Park", "moreBioInfo": "San Francisco powerhouse, Native Elements has been keeping the energetic, feel-good reggae tradition alive in the Bay Area for over 18 years. Comprised of 10 seasoned musicians with decades of experience in rock, metal, blues, jazz, r&b and hip hop, this eclectic and fearless crew meld their unique influences into a contemporary melodic horn-driven party. Fans are treated with improvisational peaks and valleys from blazing guitar to soulful saxophone solos. Having grown up together since elementary school (jamming in garage bands and skateboarding) in and around Daly City, South City and San Francisco the Native Elements bring a uniquely warm experience to the stage that is both entertaining and uplifting. Music available on I tunes, Amazon and Rhapsody!", "otherInfo": "FREE All ages outdoor twilight concert."}, {"Address": "1558 Canyon Rd, Moraga, CA 94556", "Artist": "Tawnee Kendall ", "ArtistImage": "https://photos.bandsintown.com/thumb/11242325.jpeg", "Coordinates": [37.83344515, -122.12858450122461], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Country,Folk,Americana,Bluegrass", "Time": "6:00 PM", "Venue": "TK + SG: Canyon Club Brewery", "moreBioInfo": "Tawnee Kendall is a Nashville-sounding independent Folk musician born and raised in the San Francisco Bay Area. Her 2017 EP, Release The Ghost, was dubbed \"heart-on-your-sleeve artistry\" by Huffington Post. Kendall is known for delivering gritty, sultry, and commanding folk melodies which emotionally arrest listeners. Kendall's heartfelt songs and electric live performances are not to be missed. Release The Ghost is available everywhere you stream and download music. Her upcoming EP \"Whale Fall\" is set to release June 2019. LINKS: www.tawneekendall.com YouTube: www.youtube.com/tawneekendall Instagram: www.instagram.com/tawneemusic Facebook: www.facebook.com/tawneemusic Spotify: https://open.spotify.com/user/nixrue/playlist/45uvvA2nz9i5tfujRVlzJx?si=wRHt5E_yR0O4NFR1sD3d2w", "otherInfo": "Tawnee Kendall + Steven Gregory are back! Covers and originals with a Nashville twist. Come enjoy tasty food, an extensive drink list, and stellar entertainment.\n\nwww.taw..."}, {"Address": "2074 Second St, Livermore, CA 94550", "Artist": "Michelle Lambert ", "ArtistImage": "https://photos.bandsintown.com/thumb/11443807.jpeg", "Coordinates": [37.6806732, -121.77004518948368], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Acoustic Folk Pop,Pop,Female Vocals", "Time": "6:00 PM", "Venue": "Michelle at Monica's", "moreBioInfo": "“Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!” - Dennis Willis, Soundwaves TV", "otherInfo": "~Reservations recommended~\n\nJoin Michelle at this awesome downtown Livermore hotspot for an evening of music! Tables fill up quickly so be sure to call for reservations!\n..."}, {"Address": "201 Franklin St, San Francisco, CA 94102", "Artist": "Villalobos Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8471615.jpeg", "Coordinates": [37.77636975, -122.4215395], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Latin Band,Latin,Latin Alternative,Folklore,Vocal Music,Mexican Traditions,New Acoustic,Native American,Folk Jazz,Acoustic,Jazz Fusion,Jazz Instrument,Folk", "Time": "7:00 PM", "Venue": "VIllalobos Brothers at SF JAZZ", "moreBioInfo": "VILLALOBOS BROTHERS The Villalobos Brothers have been acclaimed as one of today’s leading Contemporary Mexican ensembles.Their original compositions and arrangements masterfully fuse and celebrate the richness of Mexican folk music with the harmonies of jazz and classical music. The ensemble’s virtuosic performances have delighted audiences throughout Latin America, India, Russia, Canada and in more than 30 states across the US.They have performed in historic venues and events including Carnegie Hall, Lincoln Center, the Latin Grammy Awards, Davies Symphony Hall, Montreal Jazz Festival, the Ford Theatre in Hollywood, the 60th Anniversary of the United Nations, the New Victory, Theatre on Broadway,The San Jose Jazz Fest, Celebrate Brooklyn,the 66th FIFA Congress in Mexico City, the Blue Note Jazz Festival and the Apollo Theatre. In 2018, they joined forces with Arturo O’Farrill and the Afro Latin Jazz Orchestra for the “Fandango at the Wall” project. This ambitious undertaking, produced by Kabir Sehgal, united legendary international musicians for a live concert at the Tijuana - San Diego border wall which resulted in a live album and documentary film to be released in 2019. The Villalobos Brothers recently premiered their Symphonic Project, performing sold-out concerts with both the San Francisco Symphony Orchestra and the Walla Walla Symphony Orchestra. The ensemble has collaborated with legendary musicians including Grammy winners Dan Zanes, Ana Tijoux, Arturo O’Farrill, Antonio Sánchez, Regina Carter and Eduardo Magallanes. The Villalobos brothers are actively touring the United States, delivering a powerful message of love, brotherhood and social justice with brilliance, cadence and virtuosity. Their new album “Somos” will be released in 2019. PRESS: “Aliens of Extraordinary Ability…is the latest CD from these young brothers who grew up in Veracruz, Mexico, and now live in New York…a crazy ball of sound: Mexican coastal traditions meet Sam Cooke in the Bronx!” – Dan Zanes, Grammy Award Winner, USA TODAY. “I am glad I lived long enough to see you! This is amazing! All I can say is, I hope the world gets to experience this. Before starting you said something very important, you said: “we try to embody the miracle of music”…well, you certainly are a carrier of that disease…may we all catch it!…I don’t know what else to say, I am speechless!” – Marion J. Caffey, Producer of “Amateur Night” at the Apollo Theatre “I loved your style of music. The blend was amazing, the band was tight, it kept me going… I felt like I was part of the band, except I was sitting out here. I didn’t understand a word you were saying, but I felt it! where can I buy your CD? For real!” – Steve Pageot, Grammy Award Winner “Oh my God, that was fantastic! Let me tell you something, you guys transformed the environment of the venue…I was exactly where you wanted me to be. Your voices! You’re gonna get this reaction every time you play, and that is an amazing thing. Your music was a tidal wave of fire and it hit you really strong. You have excellent showmanship, but you also have the talent and skill to back it up” – Alicia Olatuja, Mezzo-Soprano “I’m speechless, I’m blown away…I have never seen anything like this before…” -Leital Molad, Senior Producer of WNYC Studio 360 “They played with exuberant intensity for the appreciative audience…with their heads bowed…fingers jumping and feet tapping, they weren’t just playing music, they were living it…” – Devan Sipher, THE FORWARD.", "otherInfo": "No other event info available"}, {"Address": "1160 Polk St, San Francisco, CA 94109", "Artist": "Gaucho ", "ArtistImage": "https://photos.bandsintown.com/thumb/11463601.jpeg", "Coordinates": [37.7875516, -122.4199558], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "", "Time": "7:00 PM", "Venue": "Gaucho live at DecoDance", "moreBioInfo": "Gaucho is a masterful Bay Area band that combines the influence of gypsy jazz of 1930’s Europe with the rhythmic drive and collective improvisation of New Orleans swing music, gutbucket blues and elements of ragtime. Their sound, a uniquely American concoction, blends instrumental acuity and lighthearted humor that keep their audience coming back for more. As founder, guitarist, and main composer Dave Ricketts says, the band is “in love with the music of Louis Armstrong, Fats Waller and Jimmie Rodgers, as well as the stories, the life styles and the foot steps of hundreds of other great jazz, blues, country and rock musicians that created the sound of American Music from roughly 1900-1950’s” Led by eminent guitarist, Dave Ricketts, the group has been a San Francisco mainstay for over fifteen years, and one of the busiest bands in the bay area playing 5 to 10 gigs a week. Together with virtuosos Rob Reich–accordion and Craig Venetresco–guitar, superlative bassist Ari Munkres and versatile percussionist Steve Apple, these guys keep crowds moving with their beats and complex rhythms. Gaucho has recorded seven albums, tours regularly, and has an increasing repertoire of over forty original tunes. Seven of their tunes are featured in the 2012 film \"Trattoria\"; one was chosen by the Metropolitan Museum of Art for their website; and another is featured in the outtakes section of the Pixar DVD CARS 2.", "otherInfo": "No other event info available"}, {"Address": "270 Capistrano Rd #22,, Half Moon Bay, CA 94019", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/11493205.jpeg", "Coordinates": [0.0, 0.0], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Comedy", "Time": "7:30 PM", "Venue": "Comedy Sharks", "moreBioInfo": "Comedian", "otherInfo": "Live stand-up comedy on the coast featuring some of the best stand-up comedians in the Bay Area and beyond!"}, {"Address": "351 Lasuen St, Stanford, CA 94305", "Artist": "Robert Glasper ", "ArtistImage": "https://photos.bandsintown.com/thumb/11469350.jpeg", "Coordinates": [37.43064565, -122.16591449913417], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "Jazz Fusion,Hip Hop & Rnb,Jazz-funk,Hip Hop Fusion", "Time": "7:30 PM", "Venue": "Glasper Martin Presents Dinner Party featuring  Ft Christian Scott aTunde Adjuah", "moreBioInfo": "“Real music is crash protected,” state the liner notes of Black Radio, a landmark album by the Robert Glasper Experiment that boldly stakes out new musical territory and transcends any notion of genre, drawing from jazz, hip-hop, R&B and rock, but refusing to be pinned down by any one tag. Like an aircraft’s black box for which the album is titled, Black Radio holds the truth and is indestructible. Rapper yasiin bey (Mos Def) illuminates the metaphor on the title track: Big bird falling down on a mountain pass Only thing to survive the crash Black Radio You wanna fly free go far and fast Built to last We made this craft From Black Radio Robert Glasper has long kept one foot planted firmly in jazz and the other in hip-hop and R&B. He’s worked extensively with Q-Tip, playing keyboards on the rapper’s 2008 album The Renaissance and co-writing the album single “Life Is Better” which featured his label mate Norah Jones. Glasper also serves as the music director in yasiin bey’s touring band, and has toured with the multi-platinum R&B singer Maxwell. The Los Angeles Times once wrote that “it's a short list of jazz pianists who have the wherewithal to drop a J Dilla reference into a Thelonious Monk cover, but not many jazz pianists are Robert Glasper,” adding that “he's equally comfortable in the worlds of hip-hop and jazz,” and praising the organic way in which he “builds a bridge between his two musical touchstones.” Glasper drove that point home with his last album, 2009’s Double-Booked, which was split neatly in half. The first part featured his acoustic Trio, which had gathered a great deal of acclaim in the jazz world and beyond over the course of two previous Blue Note albums (2005’s Canvas and 2007’s In My Element). The second part featured his electric Experiment band and hinted at things to come, even earning the keyboardist his first GRAMMY nomination for “All Matter,” a collaboration with the singer Bilal that was among the contenders in the Best Urban/Alternative Performance category in 2010. With Black Radio, the Experiment band has fully arrived. Featuring Glasper on piano and Fender Rhodes, Casey Benjamin on vocoder and saxophone, Derrick Hodge on electric bass, and Chris Dave on drums, the band is plugged in and open source. Each of the band members is prodigiously talented and lives naturally in multiple musical worlds, distilling countless influences into a singular voice. “That’s what makes this band unique,” says Glasper. “We can go anywhere, literally anywhere, we want to go. We all have musical ADD and we love it.” Black Radio also features many of Glasper’s famous friends from across the spectrum of urban music, seamlessly incorporating appearances from a jaw-dropping roll call of special guests including Erykah Badu, Bilal, Lupe Fiasco, Lalah Hathaway, Shafiq Husayn (Sa-Ra), KING, Ledisi, Chrisette Michele, Musiq Soulchild, Meshell Ndegeocello, Stokley Williams (Mint Condition), and yasiin bey. “I wanted to do a record that showcased the fact that we play with artists in other genres,” explains Glasper, adding that the album has “more of an urban, hip-hop, soul kind of vibe, but the spine of it all is still a jazz spine.” What may be most remarkable about Black Radio is how Glasper (who also produced the record) was able to weave all these different voices into a cohesive album, avoiding the random patchwork feel that many “special guest” projects suffer from. “The record doesn’t seem like it’s a special guest record because of the relationships we all have,” he says. “These are all friends. All the guests on the album have musical similarities.” That common ground and comfort level is what created the spontaneous spirit of adventure and experimentation that permeated the recording sessions, which all the band members describe as being more fun than work. Friends would drop by the studio in Los Angeles to hang out, listen to the band, get inspired, and jump into the vocal booth to lay down a track. “These are all people who are known for being in another genre,” says Glasper, “but at heart they’re jazz musicians, so they’re like ‘Let’s hit it. We don’t really know what’s going to happen but let’s go for it and see what happens.’ We all have that in common, which is why I chose the people I chose.” “You can’t pigeonhole what we’re going to do or how we’re going to do it,” Glasper declares. The Experiment wears its eclecticism on its sleeve throughout Black Radio, presenting new collaborative originals and surprising cover songs. They transform the Afro-Cuban standard “Afro Blue” with Badu, Sade’s “Cherish the Day” with Hathaway, David Bowie’s “Letter to Hermione” with Bilal, and Nirvana’s “Smells Like Teen Spirit” with Benjamin’s vocoder vocal. Glasper and Lupe Fiasco (whose recent gig together at the Blue Note Club in New York became a freestyle jam session when Kanye West and yasiin bey crashed the stage) co-wrote “Always Shine” which features Fiasco’s lyrical flow as well as a searing chorus sung by Bilal. On “Gonna Be Alright,” the R&B singer Ledisi highlights Glasper’s bright melodicism by writing new lyrics for his instrumental “F.T.B.” from the In My Element album. The track “Ah Yeah” (a co-production with Glasper’s high school friend, the GRAMMY-winning producer Bryan-Michael Cox) is illustrative of the good fate that hung over the sessions. Glasper went to Atlanta to record with Musiq Soulchild at Cox’s studio. At a show the night before the session Glasper ran into singer Chrisette Michele and asked her to come by the studio as well the next day. The resulting duet is one of the album’s highlights. Reflecting back, Glasper is rightly proud of Black Radio, but also humbled and grateful for the outpouring of support and talent that it took to bring the album into being. “Everyone just said yes, period, we’ll do it. It was smoother than I ever thought it would be to get all these great, amazing artists to come together and do this project.” Career-wise, this creates a constant balancing act, and on occasion literally being double-booked, appearing with the Trio and the Experiment on the same night. Such is the storyline that emerges on Double-Booked, with conflicting voicemail messages from Terence Blanchard and Roots drummer Ahmir ?uestlove Thompson, each pulling for a different Glasper band. “Most people, if they have different bands, they do separate albums,” says Glasper. “But I felt I’d be making more of a statement if I put it all on one joint.” The result, in essence, is a snapshot of Glasper’s life. “This is what I’m dealing with,” he continues. “It’s not like I play jazz but I also play hip-hop now and then. I’m in it, for real, both sides of the spectrum. That’s my life. A lot of people go in stages—they might focus on trio for a long time, then they change or whatever. My thing is both, all the time.” The first six tracks on Double-Booked feature Glasper in Trio setting with longtime bassist Vicente Archer as well as drummer Chris Dave, who plays in Glasper’s Experiment band but recently came on board the Trio as well. “It’s hard to find that common thread in one cat,” Glasper enthuses. “Very few cats out there are extremely convincing in all genres of music. There’s always a wink-wink somewhere, like they play jazz really good but the hip-hop’s a little strange, or vice versa. Chris has both sides down on an even level, and he keeps on creating. He and Vicente used to play together with Kenny Garrett, so they have a history that made the linkup a lot easier. He knows the Chris-isms and Chris knows the Vicente-isms.” As on In My Element, Glasper underlines the Trio’s hip-hop leanings with short fade-in interludes (“little Pete Rock-isms,” Glasper says) that function as short codas to some of the tunes. From the outset, with the lyrical flow and supple interaction of “No Worries,” one hears what Nate Chinen of The New York Times describes as “spongey, changeable adaptations of hip-hop rhythm tracks…Glasper himself plays as if he’s a living sample…in a kind of real-time loop.” “This is a little ditty I came up with when I was in London at a soundcheck,” Glasper recalls. “We played it that night at the show. I kept hearing people in London say ‘no worries,’ and that seemed like the title. It has a real positive, bright, ‘It’s ok’ vibe.” “Downtime,” set mainly in 7/4, evokes a memory of Glasper looking out the window at the rain—“kind of like the ‘F.T.B.’ of this record, if you will,” Glasper says, referencing a standout track from In My Element. Both “Yes I’m Country (And That’s OK)” and “59 South,” meanwhile, touch upon Glasper’s hometown environment in Texas. The latter references a heavily trafficked highway in Houston, a cultural reference not unlike the Brooklyn Bridge in Glasper’s current home base, New York. “Yes I’m Country” prompts Glasper to explain: “I have a country swing when I play sometimes, and I like playing that way.” The vamp of the tune, an intriguing five-bar phrase, exemplifies the sort of off-kilter rapport that sets the Glasper Trio apart. “I love odd phrases that vamp,” he adds. “It brings a whole different feeling than a regular vamp.” The Trio portion of Double-Booked culminates with an astonishing treatment of Thelonious Monk’s “Think of One.” In an ingenious and totally natural overlay, Glasper seizes an opportunity in last A section to quote Ahmad Jamal’s “Swahililand,” the chord progression that formed the basis of De La Soul’s 1996 hip-hop classic “Stakes Is High,” co-written by Glasper’s hero and friend, the late beatmaster J Dilla. “Monk and Dilla are both passed away, so when I play live I sometimes say they’re both probably in heaven, chillin’. Maybe they’re talking about this arrangement! I always wanted to mix a jazz joint with a hip-hop joint but make it dope, not contrived. Chris’s drumbeat is so crazy at the end, the hi-hat with the placement of the bass drum—you don’t get this on a jazz record, ever. That’s why I made it the last Trio tune, because it’s a perfect segue.” From that point forward, we are firmly in Experiment-land, with Chris Dave remaining on drums—although the drum sound on this half of the album can be markedly different from the first. “4Eva,” a live excerpt featuring rap icon Mos Def, leads us straight into another world. “Butterfly” is originally from Thrust, Herbie Hancock’s 1974 landmark album. Hancock, as both a pianist and a genre-crossing innovator, is of course a huge influence on Glasper. “It just happens that every one of my records has a Herbie tune—it seems like I’m doing it on purpose,” Glasper says. “I’m not. But I had to put this on the record because it’s dope.” Casey Benjamin’s vocoder effects heighten the mystery of the melody, and a J Dilla beat called “F--- the Police” serves as a rhythmic foundation. Benjamin’s arsenal of sonic effects is at the fore of “Festival,” colored by Glasper’s Fender Rhodes, taking wild, digressive turns over the course of 10 minutes—the Experiment sound at its most representative and expansive. “Casey has so many pedals, it’s a whole thing when he sets up, he has to go to the gig before us,” says Glasper with a laugh, noting that Benjamin is playing only alto saxophone and “nothing’s overdubbed.” A short transitional piece, “For You” by Benjamin and drummer Sameer Gupta, leads into “All Matter,” a striking, unclassifiable original by vocalist Bilal Oliver. Glasper offers: “You can really do this song in any situation, and it does stick with you. So pretty.” Derrick Hodge, the Experiment’s bassist, an accomplished composer as well as a top-shelf jazz and hip-hop sideman, contributes the final track, “Open Mind,” also featuring Bilal. It’s “a spiritual tune” in Glasper’s words, with additional textures and voice elements from turntablist Jahi Sundance, the son of alto saxophone great Oliver Lake. Hailed by listeners and critics, Glasper has also garnered the respect of the toughest audience of all: musicians from across the jazz spectrum. In a May 2008 Blindfold Test for Down Beat magazine, a fellow pianist instantly identified Glasper and praised him as “a fantastic musician,” pinpointing characteristics of his unique style: “a harmonic maze, but also an insistent rhythm, certain turns and filigrees and ornaments, some of them sort of gospelish.” With Double-Booked, Glasper further develops all these elements and pulls them together in a new synthesis, continuing his ascent to the top ranks of modern jazz artistry.", "otherInfo": "A collaboration between two longtime friends, Dinner Party brings together keyboardist and composer Robert Glasper and saxophonist / producer Terrace Martin for a project..."}, {"Address": "915 Columbus Ave, San Francisco, CA 94133", "Artist": "Grant Lyon ", "ArtistImage": "https://photos.bandsintown.com/thumb/6188983.jpeg", "Coordinates": [37.8029233, -122.4142026], "Date": "2021-07-15", "EventDate": "Jul. 15th, 2021", "Genre": "", "Time": "8:00 PM", "Venue": "Cobb's Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}]