var sf_events = [{"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Rosie Tucker ", "ArtistImage": "https://photos.bandsintown.com/thumb/9948552.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Los Angeles, California", "Time": "2:00 AM UTC", "Venue": "Cafe Du Nord", "moreBioInfo": "clever, hopefully", "otherInfo": "No other event info available"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Citizen ", "ArtistImage": "https://photos.bandsintown.com/thumb/9940665.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Pop, Pop Punk", "Time": "2:00 AM UTC", "Venue": "Cafe Du Nord", "moreBioInfo": "Everybody Is Going To Heaven", "otherInfo": "No other event info available"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Ruen Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9615876.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Mon Apr 13 2020", "EventDate": "2020-04-13", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "Whether it’s their collaboration with the legendary producer Rick Rubin, kudos from the likes of Zane Lowe and the BBC, or a string of memorable performances from the hills of Glastonbury to the deserts of Coachella, multi-instrumentalist and songwriter siblings Henry and Rupert Stansall, known by their amalgam-created moniker Ruen Brothers, are making a mark with a throwback rock and roll sound that intersects the early days of the genre with a dynamic present day act. The two have gone from sleepy English steel town obscurity to craft-smiths ready to make a global impact.\n\nInspired by their music aficionado father who raised the duo on a steady diet of The Rolling Stones and The Everly Brothers, the two would rehearse in the family kitchen while scrounging for gigs in their blue-collar hometown of Scunthorpe, England. Laughs Rupert, “We’d walk into pubs and clubs as kids and ask the owner if we could play something for the local drunks at 2pm.” It wasn’t until a move to London and the success of their track “Aces,” a song recorded in their studio apartment, that the boys from Scunthorpe went from pub performers to BBC radio staples.\n\nThe brothers quickly collected a global audience of fans, none more influential than iconic producer Rick Rubin, who quickly recognized their talent and promptly took the brothers under his wing. “I liked that their songwriting seemed like it was from another era,” explains Rubin. “It’s making something new again with these traditional influences.” Henry adds, “The album was recorded using all real instruments and a live band, resulting in a different sound than what’s present in much of today’s popular music.” Adds Rupert of the collaboration, “It was incredibly exciting - he’s worked with some of our favorite artists of all time and is such a versatile producer. He helped us recognize the strength of Henry and I playing and singing together; it was a foundation to build upon and the guidance we needed.”\n\nThe brothers’ artistic background and pedigree come into full focus on their debut studio album ALL MY SHADES OF BLUE (out 6/01 via Ramseur), produced by Rubin and featuring Henry on acoustic guitar and Rupert on electric and acoustic guitar, harmonica, and bass. The album also includes the talents of such boldface names as Chad Smith of the Red Hot Chili Peppers on drums, along with The Killers’ Dave Keuning on strings and Faces and Small Faces legend Ian McLagan on keyboards. The record features both music and lyrics written by the boys throughout their improbable journey. Says Rupert, speaking about both the album and the duo’s entire career, “We’re very lucky in the sense that we’ve been able to do whatever we’ve wanted musically and had it all recorded to the best quality with the best musicians and collaborators. In today’s industry, you don’t usually get that freedom. If nothing else, we’re making the music we want to make and that’s enough for me. Hopefully people will appreciate and enjoy it as much as we do.”", "otherInfo": "No other event info available"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/9361550.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "West Coast Blues, Blues, R&b, Soul Jazz", "Time": "11:30 PM UTC", "Venue": "The Saloon", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her organ trio The GG3 play their weekly After-Work Blues Party.\n\nFeaturing Parris Bertolucci on keyboards/bass & Randy Lee Odell on drums.\n\n4:30-8:30pm - 1232 Grant Ave. SF, CA 94133"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "B3B4 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9255051.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Jazz, Soul Jazz, Jazz-funk", "Time": "1:00 AM UTC", "Venue": "Club Deluxe", "moreBioInfo": "TOM GRIESSER was first exposed to jazz at age five, when he stumbled upon his father's Benny Goodman and Duke Ellington records. He has been performing professionally in the San Francisco Bay Area since 1992. Tom performed regularly in the swing revival scene with St. Vitus Dance, toured nationally with The New Morty Show, and was also the leader of The Section 8 Project, his ensemble which featured the tunes of bassist Charles Mingus. Since 1999, he has played frequently with the Marcus Shelby Jazz Orchestra and Brass Monkey Brass Band, as well as leading his own trio, the Tom Griesser 3. Outside of the jazz world, Tom has performed with the singer/songwriter Rodriguez, the subject of the 2012 documentary Searching for Sugar Man, and recorded with Third Eye Blind on their 2009 release Ursa Major.\n\nSCOTT FOSTER is the chair of the performing arts department at the Urban School of San Francisco, teaching Jazz Band, Music Theory and MP&E. He provides private guitar lessons for performers of all levels. When asked who he was studying with, Guitarist Kirk Hammett told Guitar World Magazine: “This local player Scott Foster… He’s a jazz guy but also a shredder”. Scott’s CD Night Blooming Jazz Men can be found on cdbaby.com. He's been a major contributor to the music community in the Bay Area for over 25 years, currently playing with the Americano Social Club, the Fil Lorenz Orchestra, Dave Scott Quartet, and The Scott Foster Ensemble.\n\nKEVIN GERZEVITZ works as a performer, composer and teacher in the San Francisco Bay Area. He has performed and/or recorded with James Newton, Jose Feliciano, Matt Eakle, Jimbo Trout, Jason Bowman, Jude Gold, Michael Manring, Kathryn Keats, and Andrew Hagar. He studied piano, improvisation, and composition at the University of Michigan School of Music. His musical genre range is diverse and stretches beyond organist, performing rebetika violin with The Disciples of Markos, jazz manouche accordion with Gaucho, and ‘80s pop synth with Tainted Love. He enjoys teaching as the Music & Movement specialist at Pacific Primary School in San Francisco. His composition endeavors have led to scoring several independent films, and producing several recordings which are showcased on his website: kevingerzevitz.com\n\nDANIEL FOLTZ, a very active freelancer, has played the drums professionally since 1996, touring internationally and sharing the stage with Lavay Smith, Linda Perry, Jon Evans, and Shelby Lynne. He has been the drummer with Storm and Her Dirty Mouth, Black Lab, and The Giant Trio. He has been featured on several CDs, including One Hour Mama by Lavay Smith & The Red Hot Skillet Lickers, Headlights and Other Constellations by Sonya Hunter, Under These Skies by Noelle Hampton, and Tatamonk by Alex Degrassi and Quique Cruz. Daniel is on the roster of artists for Vic Firth drumsticks.", "otherInfo": "No other event info available"}, {"Address": "1111 Solano Ave, Albany, CA 94706", "Artist": "George Cole ", "ArtistImage": "https://photos.bandsintown.com/thumb/8682442.jpeg", "Coordinates": [-122.298349, 37.890478], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Acoustic, Gypsy Jazz, American Song, Composer Songbook, Guitar Virtuoso, Consumate Entertainer, Performer, Acoustic Guitar", "Time": "1:30 AM UTC", "Venue": "Rendez-Vous Café Bistro", "moreBioInfo": "GEORGE COLE: Singer and breakneck acoustic guitarist George Cole inhabits a musical world all his own.... a world in which Django Reinhardt, The Ramones, Nat King Cole and Doc Watson get equal billing with Irving Berlin, George Gershwin, Willie Nelson and the Great American Songbook. Cole currently occupies the guitar chair for the David Grisman Quintet and has 2 releases on Grisman’s highly regarded Acoustic Disc Label. George was guitar teacher and mentor to Rock and Roll Hall of Fame Inductees Billie Joe Armstrong and Mike Dirnt of Green Day for 10 years in the East Bay. Cole, a San Francisco native and BAMMIE award winner brings an expertise to his guitar playing and singing that is filtered through Rock and Roll, Gypsy Jazz and All things American. The music he makes brings to mind the old adage “Everything Old Is New Again”. David Grisman tapped Cole to play on his most recent Sextet record and Cole in turn featured Grisman on his release “George Cole Live”. Jazz legend Keely Smith handpicked Cole to play guitar and sing duets with her on her last tour. Chris Isaak also had Cole lay down guitar tracks on his platinum selling Forever Blue release. Cole is currently performing at festivals, performing arts centers, top nightclubs, and vintage theaters. www.GEORGECOLE.net\nwww.georgecole.net", "otherInfo": "Back again by popular demand, George Cole's San Francisco Guitar Trio with George Cole, Tony Darren, and Nick Koutsoukis.\nHands down, best thing to do on a Tuesday night in the EastBay, join those 'in the know' to enjoy George Cole’s amazing, world class music, and superb french cuisine at Rendez-Vous Café Bistro Tuesday 6:30-8:30"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Parker McCollum Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8705340.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Parker McCollum, Brady Beal, Charlie Magnone, Jason Newberry, Beau Johnson", "Time": "2:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "Parker McCollum comes from a particular type of family — the no-nonsense, hard working kind. His was the sort of upbringing where “if you’re going to do something and you’re not going to do it one-hundred percent you shouldn’t do it all.” It’s why the 25-year-old singer-songwriter treats each song he writes with a painstaking level of dedication, reverence, respect and, as he’ll readily admit, even a bit of obsession. McCollum says that when a particular melody or lyric or emotion is tugging at him, hell, he might just stay in his room for days at a time working it out. He can’t help himself.\n\nThat’s because for the Austin-based singer and multi-instrumentalist the end result is worth the occasional pain in the process. “That’s where I find my identity,” McCollum, who broke out with the revealing and critically adored 2013 debut The Limestone Kid and now returns with his highly anticipated follow-up album, Probably Wrong, says of penning soul-baring, honest and forthright Americana anthems. “It just takes over,” he says of the songwriting muse and, one senses, his ever-winding, sometimes gut-wrenching journey as an introspective musician.” “I didn’t choose this life. It chose me.“\n\nSet for release on November 10 independently, Probably Wrong, pulls back the curtain and reveals McCollum like never before. The 10-track LP, written after the dissolution of a long-term relationship, is equal parts introspective, self-flagellating and transcendent. It’s also the most honest McCollum has ever been in song. There’s an inherent pain that bleeds through in the raw honesty of stunning songs including “I Can’t Breathe” and “Hell of a Year.” For McCollum, putting his most intimate thoughts and feelings to song is more of a welcome relief than an act of bloodletting. “I don’t talk about my feelings very often,” he notes. “I keep a lot of things in most of the time and I don’t want anybody else to have to deal with my shit. I just write songs instead.”\n\nIn the wake of The Limestone Kid’s release, and its lead single “Meet Me in the Middle” finding success at regional radio, McCollum says “in the blink of an eye” his life drastically changed.” The then-22-year-old went from a life of smoking pot on his couch and passing his days strumming the guitar to traveling from one gig to the next not as a nobody but rather a revered traveling musician with a fervent fanbase. McCollum always wanted to be a singer-songwriter but he admits he was caught a bit off guard by the buzz around Limestone. “I was playing catch up for two years,” he says.\n\nIn speaking with McCollum, it’s easy to detect the sense of wonderment and romance he still attaches to the brutally honest songwriters he first revered during his teenage years. Men like Townes Van Zandt, Todd Snider, Steve Earle and James McMurtry — even as a wide-eyed and innocent young man, McCollum sensed these musicians were speaking to a more powerful truth. “It would jerk my soul out of me,” he says of encountering and quickly becoming enamored with their music and subsequently dedicating his life to molding songs of a similarly revealing bent. “There’s nothing else I’ve ever encountered that has had as much influence on me,” he explains. “That’s all I wanted to listen to. It was my thing.”\n\nTo that end, when he began writing the songs that would ultimately comprise Probably Wrong, McCollum felt it necessary to be alone with little more than his emotions and a guitar. “I needed to write this record and be on my own,” he says of what led him to end a two-year relationship and retreat inward. “I felt very misunderstood throughout the entire situation,” he adds. “I broke my own heart for the first time just to write this record.” For six weeks, McCollum did nothing but stare at a piece of paper filled with soul-crushing lyrics and engage with his sadness. “And I’m not a sad person,” he says with a laugh. “But I had done it to myself intentionally.”\n\nThe pain still lingers, but McCollum says accessing it to write his new album allowed him to pen some of his most poignant material to date. “Hell of a Year,” which he calls his “sleeper favorite of the record,” came from McCollum breaking down one night in his truck in a fast-food parking lot. “My heart’s out of love/I fell out of line/I swore I’d never leave again/And I lied,” he sings over a gentle acoustic guitar figure. “When I set out to write this record this was the type of song I was gunning for,” he says of “Hell of a Year.” “It was the hardest song I’ve ever written as far as being that honest. But after doing so I could go back to being happy for a little bit.” On the slow rolling “Misunderstood,” the singer throws his hands in the air and makes peace with what he can’t control. “You told me I was no good/It’s alright babe/I’m pretty used to being misunderstood.”\n\nSinging such soul-baring songs is a decidedly therapeutic act for McCollum. “When the melody is so spot-on and it hooks me everything that I have been bottling up or not talking about comes out.” It’s why the singer says he lives to perform. “Next to the songwriting the live show is most important,” he offers. Though, seeing as many of his gigs are rowdy, upbeat affairs, he says he searches for the right moments to pepper his set with more emotional numbers. “I’m constantly trying to find ways to make our live show better,” McCollum says. “And my confidence level keeps going up and up. Most of the time onstage I’m running around like I’m the man,” he adds with a laugh, “but I’m definitely not.”\n\nThe goal going forward then, McCollum insists, is to never remain stagnant. He idolizes musicians like John Mayer whom he says are always redefining their creativity. He intends to do the same. “My goal is to totally evolve and reinvent myself with each record I make,” McCollum says. “It’s about changing with each record and really not giving a shit. And if you can pull that off, well, that’s a pretty special thing.”", "otherInfo": "No other event info available"}, {"Address": "2236 Martin Luther King Jr Way, Oakland, CA 94612", "Artist": "Snotty Nose Rez Kids ", "ArtistImage": "https://photos.bandsintown.com/thumb/10068195.jpeg", "Coordinates": [-122.2727, 37.81239], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Hip-hop, Rap, Indigenous Hip-hop, Hip Hop, Trap", "Time": "2:30 AM UTC", "Venue": "Starline Social Club", "moreBioInfo": "Snotty Nose Rez Kids is a Haisla Hip-Hop duo from Kitimat, BC, composed of rappers Yung Trybez & Young D. Formed in 2016, SNRK released back-to-back albums in 2017, self-titled debut in Jan 2017 & The Average Savage in Sept 2017. The latter secured them Best Hip Hop Artist at the Western Canadian Music Awards, cemented them 2018’s Polaris Music Prize Short List, & landed them a 2019 Juno Nomination for Best Indigenous Music Album. The group toured heavily in Canada with appearances in NYC, Seattle and Darwin, Australia. They quickly gained notoriety for their energetic, inspiring and thought provoking shows.\n\nSNRK led 2019 with their 3rd album, TRAPLINE, which received stellar reviews and press from Exclaim!, Beatroute, Bandcamp, Hip Hop Canada, CBCMusic, Complex, Hype Magazine, Okayplayer, Noisey, & FADER. The duo embarked on a 60+ show tour of Canada, US, Mexico, UK & Australia receiving a groundswell of support for their live show, scoring 9/9 on multiple Exclaim! show reviews. That same year, SNRK won Breakout Artist at the WCMA's & the album was Shortlisted for the Polaris Music Prize, marking SNRK as one of only three artists to ever be shortlisted back-to-back years. They wrapped up 2019 with TRAPLINE listed on numerous Best Album of the Year lists. Exclaim! named TRAPLINE one of the 50 Best Albums of the 2010’s, Top 10 Hip Hop Album of the Year, & Top 50 Songs of the 2010’s for Boujee Natives. SNRK begin 2020 with their first headlining US Tour, the Born Deadly Tour.", "otherInfo": "Born Deadly Tour\n21+"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Ruen Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9615876.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "The New Parish", "moreBioInfo": "Whether it’s their collaboration with the legendary producer Rick Rubin, kudos from the likes of Zane Lowe and the BBC, or a string of memorable performances from the hills of Glastonbury to the deserts of Coachella, multi-instrumentalist and songwriter siblings Henry and Rupert Stansall, known by their amalgam-created moniker Ruen Brothers, are making a mark with a throwback rock and roll sound that intersects the early days of the genre with a dynamic present day act. The two have gone from sleepy English steel town obscurity to craft-smiths ready to make a global impact.\n\nInspired by their music aficionado father who raised the duo on a steady diet of The Rolling Stones and The Everly Brothers, the two would rehearse in the family kitchen while scrounging for gigs in their blue-collar hometown of Scunthorpe, England. Laughs Rupert, “We’d walk into pubs and clubs as kids and ask the owner if we could play something for the local drunks at 2pm.” It wasn’t until a move to London and the success of their track “Aces,” a song recorded in their studio apartment, that the boys from Scunthorpe went from pub performers to BBC radio staples.\n\nThe brothers quickly collected a global audience of fans, none more influential than iconic producer Rick Rubin, who quickly recognized their talent and promptly took the brothers under his wing. “I liked that their songwriting seemed like it was from another era,” explains Rubin. “It’s making something new again with these traditional influences.” Henry adds, “The album was recorded using all real instruments and a live band, resulting in a different sound than what’s present in much of today’s popular music.” Adds Rupert of the collaboration, “It was incredibly exciting - he’s worked with some of our favorite artists of all time and is such a versatile producer. He helped us recognize the strength of Henry and I playing and singing together; it was a foundation to build upon and the guidance we needed.”\n\nThe brothers’ artistic background and pedigree come into full focus on their debut studio album ALL MY SHADES OF BLUE (out 6/01 via Ramseur), produced by Rubin and featuring Henry on acoustic guitar and Rupert on electric and acoustic guitar, harmonica, and bass. The album also includes the talents of such boldface names as Chad Smith of the Red Hot Chili Peppers on drums, along with The Killers’ Dave Keuning on strings and Faces and Small Faces legend Ian McLagan on keyboards. The record features both music and lyrics written by the boys throughout their improbable journey. Says Rupert, speaking about both the album and the duo’s entire career, “We’re very lucky in the sense that we’ve been able to do whatever we’ve wanted musically and had it all recorded to the best quality with the best musicians and collaborators. In today’s industry, you don’t usually get that freedom. If nothing else, we’re making the music we want to make and that’s enough for me. Hopefully people will appreciate and enjoy it as much as we do.”", "otherInfo": "No other event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Grant Lyon ", "ArtistImage": "https://photos.bandsintown.com/thumb/6188983.jpeg", "Coordinates": [-122.399943, 37.795514], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Brijean ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.269962, 37.871601], "Date": "Tue Apr 14 2020", "EventDate": "2020-04-14", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "The UC Theatre & DoTheBay Present: Snail Mail with Brijean, Hotline TNT on Tuesday, April 14, 2020"}, {"Address": "401 Van Ness Ave, San Francisco, CA 94102", "Artist": "Edward Simon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8506585.jpeg", "Coordinates": [-122.420688, 37.779613], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Latin Jazz, Latin Jazz World Music, Venezuelan, Jazz", "Time": "1:30 AM UTC", "Venue": "War Memorial Veterans Building", "moreBioInfo": "Edward Simon was born in the coastal town of Punta Cardón, Venezuela where he grew up in a family of musicians surrounded by the sounds and rhythms of Latin and Caribbean music. The talent he showed as a youth led his father to send him to study in the US, where he won scholarships in classical piano at The University of the Arts in Philadelphia under the tutelage of concert pianist Susan Starr and in jazz at the Manhattan School of Music where he studied with Harold Danko. While a student in his teens, Simon performed with Philly guitarist Kevin Eubanks and saxophonist Greg Osby.\nSettling in New York City in 1989, he performed with many jazz masters, including Herbie Mann, Paquito D'Rivera, Bobby Hutcherson, Bobby Watson, Terence Blanchard, Jerry Gonzalez and The Fort Apache Band, Arturo Sandoval, Many Oquendo and Libre and Don Byron. Simon quickly discovered that if he wanted to use jazz as a medium of expression he needed to immerse himself in this tradition. Membership in Bobby Watson's influential group Horizon (1989-94) and the Terence Blanchard Group (1994-2002) were instrumental to this end during his formative years. The experience of playing with Paquito D'Rivera proved to be pivotal, as it sparked an interest in the music of his native country.\nSimon made his first recording as a leader in 1994 (Beauty Within, on Audioquest), giving birth to the Edward Simon Trio. That same year he became a Thelonious Monk International Jazz Piano Competition finalist. Since then he has written extensively for the trio, using it as a platform for other projects and developing his unique compositional voice. In 1995 Edward received his first commission and composed Rumba Neurotica for the Relache Ensemble.\nIn recognition of his distinctive accomplishments, Chamber Music America awarded Edward Simon the New Works: Creation and Presentation grant to compose the Venezuelan Suite. In recognition for his outstanding work in jazz composition. In 2005, he received a Pennsylvania Council on the Arts Fellowship. Simon has served as adjunct faculty at the University of the Arts and continues to teach clinics, seminars and workshops at music schools and universities around the world. Currently, he serves as adjunct faculty at The New School for Jazz & Contemporary Music in New York City. Simon has participated on more than forty recordings, including several Grammy nominated albums, lead by jazz greats such as Terence Blanchard, John Patitucci, Bobby Watson, and Herbie Mann among others and numerous soundtracks. He has produced eleven critically acclaimed albums as a leader including two New York Times Top Ten jazz records of the year: Edward Simon (Kokopelli, 1994) and Simplicitas (Criss Cross, 2005). Today, Simon keeps himself busy writing for and leading his trio, Ensemble Venezuela, Afinidad - a quartet co-lead with long time collaborator saxophonist David Binney and Simon, Simon & Simon, a project co-lead with his two brothers. While he may be considered as part of a new generation of \"multilingual\" musicians which have grown up studying classical, jazz and Latin American music, Edward is inventing a language that transcends any rigid genre.", "otherInfo": "Edward Simon - Piano\nMarcos Granados - Flute\n\nTwo Venezuelan virtuosos perform a blend of South American music including favorites by the iconic Venezuelan singer/songwriter Simón Díaz as well as Edward Simon’s own Venezuelan Suite from his acclaimed album of the same name. All About Jazz marveled, “Venezuelan Suite is pianist Edward Simon’s love letter to his homeland, but that’s not all it is; it’s also the perfect confluence of Venezuelan ideals, jazz language and chamber-esque sophistication. In short, it’s a masterpiece.”\n\nEdward Simon, a native of Venezuela, has made a name for himself over decades in America as a jazz improviser, composer-arranger, band leader and educator. DownBeat has called him “one of the strongest pianists of his generation, with intuitive empathy and drum-like ingenuity,” while Jazz Journal International has singled out “his deep emotional statements” as a composer and improviser. Based in the San Francisco Bay Area as a member of the all-star SFJAZZ Collective, he has been a Guggenheim Fellow along with being awarded multiple composition grants as part of the Chamber Music America’s New Jazz Works initiative. Simon, a Yamaha artist, has recorded 15 albums as a leader or co-leader. His latest is Sorrows and Triumphs, released via Sunnyside Records in April 2018; the album was declared “unmissable” in Nate Chinen’s Take Five column on WBGO.org, and the pianist was featured in an extensive DownBeat interview upon the disc’s release. This follows Simon’s 2016 album Latin American Songbook, which won him an NAACP Image Award for Outstanding Jazz Album; a four-and-a-half-star DownBeat review also praised his fresh vision of classic Latin American songs as “grand and sophisticated.”\n\nAnother key release for Simon was his 2014 Sunnyside album Venezuelan Suite, which saw the pianist blend the tuneful, buoyant sounds of his native country with the harmonically sophisticated, forward-looking manner of jazz. All About Jazz marveled: “Venezuelan Suite… is the perfect confluence of Venezuelan ideals, jazz language and chamber-esque sophistication. In short, it’s a masterpiece.” One of Simon’s most recent collaborative projects is the trio Steel House, with the pianist joined by bassist Scott Colley and drummer Brian Blade for a group that blends acoustic jazz improvisation with electronic-tinged atmospherics for an inviting, song-oriented sound. This virtuoso trio has performed at top venues across the country, with L.A. Weekly saying: “All-star bands can be a hit-and-miss prospect, but Steel House exceeds expectations…These extraordinary instrumentalists convert their shared histories into poetic, genre-leaping music.” The group presented its debut album, Steel House, via ArtistShare in 2017. Simon is on the faculty of the Roots, Jazz & American Music program at the San Francisco Conservatory of Music, and he has also served on the faculties of the New School for Jazz and Contemporary Music, City College of New York and University of the Arts.\n\nMarco Granados epitomizes the 21st century musician, having maintained a versatile career as an innovative chamber and orchestral musician, an international concerto and recital soloist, and a lead teaching artist and educator. He is one of the world’s leading flutists on Latin American music, and his diverse repertoire spans from folk to classical music.\n\nSince his New York City debut recital at Carnegie Hall’s Weill Recital Hall in 1991, Mr. Granados has gone on to perform in Carnegie Hall’s Stern Auditorium for Sonidos Latinos, a celebratory festival of Latin American music. He has performed the Jacques Ibert Flute Concerto and the Mozart Concerto for Flute and Harp with the New York City Symphony at Lincoln Center’s Alice Tully Hall and Merkin Concert Hall, and has been a featured soloist at Wigmore Hall in London. Mr. Granados has performed with many of the leading symphony orchestras in Venezuela, his native country, premiering both the Jacques Ibert and Aram Khachaturian flute concerti with the Maracaibo and Venezuelan Symphony Orchestras. In Peru, he gave the South American premiere of the Concerto for Flute and Orchestra by Mexican composer Samuel Zyman with the Philharmonic Orchestra of Lima. As an international soloist, his performances have taken him all over the world, including South Africa, Slovenia, Scotland, Japan, and China to name a few.\n\nIn the United States, Mr. Granados has frequently been a featured artist at the National Flute Convention, flute associations, and multiple artist series. Highlights of his 2016 and 2017 season include solo recitals at the New Jersey Flute Society, the Colorado Flute Association, the Arizona Flute Society, and the Utah Flute Association. Other solo recitals this season include performances at the Wilson Center in Milwaukee, the Art Institute of Chicago, the Suzuki Association of the Americas Biannual Conference, Four Seasons Arts in Oakland, and the Chamber Music Society of Detroit.\n\nMr. Granados has served as principal flute with The New York City Symphony Orchestra, Opera Northeast, and L’Orchestra in the Berkshires, and as associate principal flute with the Venezuelan Symphony Orchestra. In New York City, he performed with the Mostly Mozart Festival, and on Broadway for the musicals Miss Saigon, Annie, Showboat, and The Sound of Music.\n\nAn avid chamber musician, Mr. Granados has performed at The Chamber Music Society of Lincoln Center, the Chamber Music Society of Detroit, and with such distinguished artists as clarinetist Paquito D’Rivera, flutist William Bennett, flutist Ransom Wilson, harpist Nancy Allen, and oboist Heinz Holliger. He is a founding member of the chamber ensemble Classical Jam and has been a member of many critically acclaimed ensembles, among which are Triangulo, a Latin American Chamber Trio, and Quintet of the Americas. While with Quintet of the Americas, he performed at Carnegie Hall, The Bermuda International Music Festival, Chamber Music Northwest, Alice Tully Hall and Merkin Concert Hall.\n\nOn radio broadcasts, Mr. Granados has been featured nationwide as both a host and performer on NPR’s Performance Today. With host Fred Child, he was the featured artist for the program Around New York on WNYC. Other radio appearances include live performances on WQXR in New York City with Classical Jam. Mr. Granados can be heard on such recording labels as CRI, Chesky Records, MMC Records, Koch World, XLNT Records and Soundbrush Records. His solo recording are: Music of Venezuela, virtuoso flute music by living Venezuelan composers; Luna, a romantic serenade of songs from Venezuela and South America for flute and guitar; Tango Dreams, a compilation of works by Astor Piazzolla; and Amanecer, a collection of Venezuelan flute favorites.\n\nA devoted educator, Mr. Granados is a professional teaching artist, having hosted, presented and developed programs for Lincoln Center Education, Chamber Music Society of Lincoln Center, The New York Philharmonic, and Carnegie Hall to name a few. Mr. Granados has been on faculty at the Longy School of Music of Bard College in Boston. Most recently, he is the founder of The Granados Music Institute, a training program to educate young professional flutists in 21st century skills."}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Seun Anikulapo Kuti ", "ArtistImage": "https://photos.bandsintown.com/thumb/7257536.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Afrobeat, African, Jazz Fusion, World Fusion, Jazz-funk, Funk, Worldbeat", "Time": "2:00 AM UTC", "Venue": "The New Parish", "moreBioInfo": "Seun Kuti is the youngest son of legendary Afrobeat pioneer Fela Kuti. At the age of nine, Seun expressed the wish to sing to his father. A short while later Seun started performing with his father and the band, until his father’s untimely death in 1997. Seun, then only 14 years old, assumed the role as lead singer of Egypt 80. Ever since, Seun has followed the political and social ethos of his father. Along the way, he began to add his own twist to the music, digging deep into various African traditions to reflect the continent's struggles and cultures. About three quarters of the current Egypt 80 line-up consists of musicians that not only played with Fela Kuti, but often were arrested and harassed alongside the founder of the Afrobeat movement. Seun Kuti has toured the world and released many albums.", "otherInfo": "No other event info available"}, {"Address": "101 Yolano Dr, Vallejo, CA 94589", "Artist": "Adrian West Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8534863.jpeg", "Coordinates": [-122.258671, 38.131665], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Acoustic, Worldly Rock, Rock", "Time": "2:00 AM UTC", "Venue": "Napa Smith Brewery", "moreBioInfo": "Ask him what kind of music The Adrian West Band plays and Adrian will answer \"Yes.\" Or if he's feeling cocky, he'll answer \"Good.\"\n\nThe long answer: the band plays original acoustic rock songs that have drawn comparison to Paul Simon, Talkingheads & Dave Matthews.\n\nAdrian is an exciting performer to watch. With an uplifting, almost child-like singing voice, he moves seamlessly between guitar & violin, sometimes making tasteful use of live looping to enhance the listening experience. He's not afraid to tackle difficult topics in his songwriting; Safe Streets is about police violence, Close Your Eyes is about the beauty bias in the mass media, and Random Serenade is about the meaninglessness of life. Featuring vocal harmonies, guitar, electric violin, bass, drums, and live \"looping”.\n\nAdrian started playing violin at the age of four and in his teens studied classical violin at the McGill Conservatory of Music in Montreal. He later learned to play drums, guitar and developed his vocal and songwriting technique.\n\nHe moved to the San Francisco Bay Area in 1995 where as a sideman violinist he began supporting local Bay Area bands, playing some of the area's better known venues including the Fillmore, Yoshi's SF (main stage), Slim’s, The Independent and The Sweetwater.\n\nWhen Adrian began performing solo, he combined violin, guitar, mandolin, beatboxing and vocals into a live performance that relied heavily on 'looping'. He recorded an all-instrumental demo CD called The One-Man String Quartet which got airplay on Keller Williams' nationally syndicated radio show Keller's Cellar, as well as on Derk Richardson's Hear and Now show on KPFA in Berkeley.\n\nIn 2005 he formed the Adrian West Trio and in 2010 he released his first full-length CD Chameleons and Butterflies.\n\nSince then the band has performed at small venues and festivals all over the Bay Area.\n\nRecently Adrian combined his love of music with his love of science in a multimedia show called An Evening of Music & Science which weaves his music with synchronized videos and presentations on the subject of how life began on Earth. The show was put on twice in Berkeley in 2017 and there are plans for more shows.", "otherInfo": "No other event info available"}, {"Address": "6320 San Pablo Ave, Oakland, CA 94608", "Artist": "Honey of the Heart ", "ArtistImage": "https://photos.bandsintown.com/thumb/7941575.jpeg", "Coordinates": [-122.28445, 37.846541], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "World Fusion, Soul, Roots Reggae, Folk", "Time": "2:00 AM UTC", "Venue": "Strings", "moreBioInfo": "Justin Ancheta and Maren Metke have musical nectar flowing through their veins. The dynamic Grass Valley duo are the driving force behind a project that is even sweeter than it sounds. Honey of the Heart is an ambrosial mix of musical interpretations influenced by folk, soul, roots and world/flamenco styles. Built upon a repertoire of uplifting original material, they join together with other phenomenal musicians to create in an organic state of symbiosis. Many of their songs come forth like ancient incantations, casting angelic spells on all in their path. Honey of the Heart weaves soaring harmonies and hypnotic polyrhythms into an alchemical semblance of groove intended for dancing, rejoicing and blissful recalibration. Let's join them in celebrating the impending release of their debut studio album and the beginning of a pivotal year ahead.\n\nCredentials\nFrequent performers around the Bay Area, they were featured twice at WorldFest 2015, Prana Festival 2014, Foreverland Festival 2014, had the honor of opening for Taj Mahal in March 2015, and Rising Appalachia in Fall 2014. They made appearances at SOUP Fest '14-'17, Bicycle Music Festival, Wild and Scenic Film Festival '14- '17, High Sierra Music Festival '15-'19, Makers Faire '15-'18, SoulPlay, Celtic Fest and Leonard Cohen Fest '19. They have produced 3 EP’s since Fall 2014, including ‘Live @ CFTA’, ‘Best of Live’ \"Duo Live' in Nevada City, and their brand new debut studio album “Dive Deep” released 1/1/2020. Justin Ancheta and Maren Metke of Honey of the Heart are often joined by other talented musicians and collaborators.\n\nLocally, they play venues such as Strings, Swedish American Music Hall, Center for the Arts, and the Great American Music Hall, while their tour schedule has taken them from Barcelona to Hawaii. After more than a decade of shows and touring, they have shared the stage with Taj Mahal, Rising Appalachia, Blues Traveler, The Wailers, Joan Baez and many more musical luminaries.\n\nFor more information, please visit:\nWebsite: www.honeyoftheheart.com\nSoundCloud: https://soundcloud.com/honey-of-the-heart\nFaceBook: www.facebook.com/honeyoftheheart\nInstagram: https://www.instagram.com/honeyoftheheart\nTwitter: https://twitter.com/honeyheartmusic\nBandCamp: https://honeyoftheheart.bandcamp.com\nReverbnation: https://www.reverbnation.com/honeyoftheheart\nEPK: https://drive.google.com/open?id=0B60sB8GoS65DNi0xN1VYWDlGaVk", "otherInfo": "Soul Graffiti Presents:\n\nHoney of the Heart just completed their full length studio album and are releasing it in 2020. They are honored to be playing at one of the coolest and oldest underground listening rooms in the Bay Area.\n\n\"Justin Ancheta and Maren Metke have musical nectar flowing through their veins. The dynamic Grass Valley duo are the driving force behind a project that is even sweeter than it sounds. Honey of the Heart is an ambrosial mix of musical interpretations influenced by folk, soul, jazz and world/flamenco styles. Built upon a repertoire of uplifting original material, they join together with other phenomenal musicians to create in an organic state of symbiosis. Many of their songs come forth like ancient incantations, casting angelic spells on all in their path. Honey of the Heart weaves soaring harmonies and hypnotic polyrhythms into an alchemical semblance of groove intended for dancing, rejoicing and blissful recalibration. Let's join them in celebrating the impending release of their debut studio album and the beginning of a pivotal year ahead. \""}, {"Address": "201 Washington St, Petaluma, CA 94952", "Artist": "Grade 2 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9251024.jpeg", "Coordinates": [-122.643119, 38.23494], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Streetpunk, Punk, Rock", "Time": "2:00 AM UTC", "Venue": "The Phoenix Theater", "moreBioInfo": "Grade 2 are an English punk band from Ryde, Isle of Wight, formed in 2013. The young three-piece is made up of Sid Ryan - Bass & Lead Vocals, Jack Chatfield - Guitar & Vocals and Jacob Hull - Drums.\n\nTheir music can be described as a classic punk sound, hard and fast whilst also including melodic guitar and vocal parts. Influence taken from classics such as The Clash, The Jam and The Stranglers.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "330 Virginia Street, Vallejo, CA 94590", "Artist": "Red's Blues ", "ArtistImage": "https://photos.bandsintown.com/thumb/9034428.jpeg", "Coordinates": [-122.257147, 38.102407], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Americana, Blues Some Original, Blues", "Time": "2:00 AM UTC", "Venue": "Empress Theatre", "moreBioInfo": "Red’s Blues~~You Knock Me Out\nWith this second release, You Knock Me Out, Red’s Blues has stepped up another notch into blues big league with the exemplary songwriting team of singer Beth Reid-Grigsby and her Blues Music Award-winning stand up (bass-playing and singing) husband RW Grigsby. Couple that with all their music friends joining in on the fun, and this new CD makes a very strong case for Northern California being the new torch-bearing center of the classic Chicago and Texas blues sound.\nSix stellar originals tell the couple’s individual and combined personal histories in an honest and cosmic way. Beth & RW’s love of the classic blues vibe pays off and yet, these songs could easily be covered by well-known singers in many roots music idioms.\nNestled alongside are songs by their mid-20th century heroes Jimmy Reed (lead track, “There’ll Be a Day”, “Ain’t That Loving You Baby”), Memphis Minnie (“Lookin’ the World Over”), Big Bill Broonzy (“Lonesome Road Blues”), jump blues brother-sister act, Buddy & Ella Johnson (“Why Don’t You Stop It”) and Memphis Slim (“Mother Earth.”)\nRed’s Blues has a finger-poppin’ attitude—straight outta the afore-mentioned golden years when blues, R&B and swing all meshed together and dance floors every night were filled with snake hips and slow drags. Beth, with her sensual, southern voice and classy behind-the-beat phrasing is more a Julie London or Bobbie Gentry-styled singer: smoky with languid, sexy sophistication. She can swing too, just check out the big fun on “Why Don’t Ya Stop It.” This rich nightclub feel is missed on too many modern singers. The yearning confidentiality, the wise heart that Beth brings to her true-life stories reveal tales of youth seen through grown up reflection.\nRW, who has not lost his hometown Rome, Georgia accent has this quality also. Upright bass never had a better companion—it’s no wonder that RW has anchored the doghouse rhythm for Mark Hummel’s legendary Harmonica Blowouts for ten years. Together, Beth & RW have a rare and beautiful combination of poetry, humor and groove in their music. What other couple in more recent music memory had this? Could they be the blues Sonny & Cher? Johnny & June? Whether up-tempo or ballad, this makes for a great live show —part juke joint, part nightclub. They are uptown and lowdown.\nTheir friends on this release are California harp masters Rick Estrin and Mark Hummel, Texas guitar masters Anson Funderburgh and Mike Keller, Texas drummer and RW Grigsby’s childhood music sidekick, Wes Starr (the dazzling team from Hummel’s Golden State-Lone Star Revue) guitarist and harmonica player Dave Earl and two Sacramento Hall of Famers, guitarists Robert Sidwell and Steve Randall.\nVeteran Bay Area Musician Dave Earl, now living in the Sierra foothills, played guitar and rack harmonica in Red’s Blues for two years. “Doug Crumpacker of Hucklebucks reknown, is currently Red’s Blues’ guitar player. When we have another guitar player on stage with us, he knows when to drop back and support the other artist. He’s a fine addition to our band and is up there with the best. Also a great part of our rhythm section is Tim Wilbur, Sacramento’s own shuffle king.” Doug, Tim and RW are all members of the Sacramento Blues Hall of Fame.\nDrummer/studio owner/engineer Larry Carr understands the great 1950s Chicago drummers like Jimmy Reed’s great shuffle drummer Earl Phillips. He also has a terrific beatnik bongo/shakers turn on one of the album highlights, “I’m Trouble (Hillbilly Bongo Blues)” penned by RW. If Robert Mitchum were still around, THIS 2-minute warning would absolutely be his theme song.\nYoung Hammond B-3 lions are here too. James Pace (Tommy Castro) and Kid Andersen (award-winning blues producer; and formerly with Terry Hanck, Charlie Musselwhite, now Rick Estrin & The Nightcats), and John Cocuzzi all take turns and elegant swingman Cocuzzi adds his deep blues piano touch on three songs.\nIt is always good to know what the artists themselves want to say about each song choice they carefully made and the originals they wrote:\n1. There’ll Be A Day- the flip side of Jimmy Reed’s 1963 hit “Shame, Shame, Shame.” Original 3rd verse written by Beth contains the album title You Knock Me Out.\n2. Poor Girl- inspired by RW and Beth’s time managing a ghetto bingo hall in Montgomery, Alabama and a girl with a gambling problem.\n3. Lookin’ The World Over- Memphis Minnie’s tale of travels with her righteous man. Killer Estrin harp solo.\n4. That’s All- written after Beth found a picture of her mother’s. A family tale of living, loving and dying.\n5. Ain’t That Loving You Baby- Jimmy Reed cover features Mark Hummel on harp and the Golden State Lone Star Revue.\n6. Baby Walk On- RW original inspired by Mose Allison. Solos by Hummel, Mike Keller and Anson Funderburgh.\n7. Stonebroke- originally recorded in 1992 with RW on Gary Primich’s My Pleasure on Austin’s Amazing Records. Rick Estrin plays some fine solos. A Primich original.\n8. Why Don’t You Stop It- Buddy and Ella Johnson tune, Lou Ann Barton used to sing this with Roomful of Blues.\n9. Pat’s Blues-Original tune about our friend who went on a binge and woke up with a stranger who’s name she didn’t know....yep it’s true. Only we changed it to a tune about our friend, a guy, because it didn’t sound right, Beth singing about a girl.....)\n10. Lonesome Road Blues- Big Bill Broonzy road tune.\n11. I’m Trouble (Hillbilly Bongo Blues)- RW original, Larry Carr on bongos, hillbilly beatnik.\n12. Somewhere Down The Line- Another RW&B original, trying to channel the feel of south Louisiana in this song of reconciliation. Nice soloing from John Cocuzzi and Steve Randall. Another family tale.\n13. Mother Earth- Memphis Slim cover brings it all home. Solos by John Cocuzzi and Robert Sidwell. On a Blues Cruise in 2012, Barrelhouse Chuck asked Beth if she knew “Mother Earth.” She said “no, but I know Blues is Everywhere.” He said, “I love your voice. Learn that song.” So she did—\"never got to sing it with him, though. I was glad RW thought of putting it on the CD.”\n\nA little more Beth & RW back story:\nBeth, thanks to her older brother, grew up listening to Huddie Ledbetter, Muddy Waters and Mississippi John Hurt records and as a kid, learned from and sang songs at home with her Mom-- “ Summertime,” “God Bless the Child,” and St. Louis Blues.” Across the street in her hometown of south Santa Barbara though, the shy 7 year old redhead was bold enough to go perch on the neighbor’s porch listening to a Cuban salsa band rehearse, and from that learned to love the rhythms, the bass and percussion in particular. She and RW met through the local Santa Barbara blues scene years later in 1977, and have lived in his home state of Georgia and then Texas before heading back to sunny Sacramento, California in 2006.\n2014 Grammy-nominated and Blues Music Award (BMA) winner bassist RW Grigsby has been playing since he was 14 years old, and began his professional career when still a teenager. He's toured the U.S., Canada and Europe since the '80s, and currently juggles playing with Red's Blues, Mark Hummel and the Blues Survivors and The Golden State/Lone Star Blues Revue. He played and recorded with Texas blues stars Gary Primich and Black Top Records’ Mike Morgan and the Crawl in the 1990s. RW is the bassist on the 2014 Grammy-nominated and BMA-winning CD, Remembering Little Walter. He was nominated for a BMA “Best Bassist” Award in 2017, and was inducted into the Sacramento Blues Hall of Fame in 2018.\nRed’s Blues draw their audiences into a grown-up music world—southern music with downhome simmer, dance floor fun and stellar, sophisticated players who know they have no need to blast at earsplitting volumes to make the biggest impact.\n– Bio by Mindy Giles, © 2018\n\nhttps://www.facebook.com/redsbluessac\n(916) 342-4281 bethgrigsby@comcast.net", "otherInfo": "Red’s Blues is back at the lovely Empress Lounge. Doug Crumpacker, guitar, RW Grigsby, bass, Tim Wilbur, drums, Beth Reid-Grigsby, lead vocals. Mighty fine blues and original Roots music. CDs on sale. New CD coming out June 10."}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Raul Midon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9094569.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Raul Midón", "Time": "2:00 AM UTC", "Venue": "Yoshi's Oakland", "moreBioInfo": "Raul Midón is a Two Time Grammy Nominated singer, songwriter and guitarist from New Mexico. He combines his distinct voice, strumming, beats, and acapella instruments to create a one-man performance. His unique style shows influence of virtually every musical genre which came before him, including jazz, blues, R&B, folk and soul. He's collaborated with both Jazz and Pop artists alike from Jason Mraz to Herbie Hancock.", "otherInfo": "No other event info available"}, {"Address": "452 1st St E g, Sonoma, CA 95476", "Artist": "DJ Cal ", "ArtistImage": "https://photos.bandsintown.com/thumb/8712667.jpeg", "Coordinates": [-122.45648, 38.29271], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Trap, Top40, Hip Hop, Edm, Open Format", "Time": "2:00 AM UTC", "Venue": "Sonoma Speakeasy and American Music Hall", "moreBioInfo": "“One of Sonoma County’s hottest acts, DJ CAL is one of the youngest up-and-coming DJ in the Bay Area. His setlists are meticulously designed to move the crowds with a blend of Trap, EDM, and Hip-Hop. He calls the city of Sonoma his home, but you can catch his edits and mixes on-air across the nation (San Francisco, Las Vegas, Orlando, Palms Springs, Bakersfield etc.). At just a young age of 25, DJ CAL has several Bay Area and Northern California venues under his belt. Catch him performing and hanging out with the hottest names in music around the Bay.\n\nDJ CAL constantly works on music; every day he’s working on a new edits and remixes. His work has been supported and featured by various blogs, websites and record pools, such as Club Killers, DJ City, MyMP3Pool, BpmSupreme and Smash The Club. He’s also supported by DJs and Producers in the industry such as Kronic, 219 Boys, etc. As music is his passion, DJ CAL is also working hard to make his own mark by producing his own sounds and beats. ”", "otherInfo": "No other event info available"}, {"Address": "3434 Balboa St, San Francisco, CA 94121", "Artist": "Jared Rabin ", "ArtistImage": "https://photos.bandsintown.com/thumb/7960844.jpeg", "Coordinates": [-122.495814, 37.776028], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Chicago, Illinois", "Time": "2:00 AM UTC", "Venue": "Simple Pleasures Cafe", "moreBioInfo": "Jared Rabin's debut record, \"Something Left to Say\" was called \"An Americana masterpiece\" by American Songwriter Magazine. The title track won First Place Folk Song in the 2016 USA Songwriting Competition, and the self-produced record reached #15 on the Roots Music Report Americana Radio charts after receiving nationwide airplay.\n\nJared started learning music at age five from his grandfather, who was the first chair violinist for the Chicago Symphony Orchestra. Jared became a proficient multi-instrumentalist, went on to study jazz composition and has traveled the world performing an array of music.\n\nJared's latest EP, \"Wondering About the Weather\" came out May 11 2018. Midwest Action called it, \"unabashedly honest and warm, nothing short of a great album.\" Jared will be on tour throughout the year playing both solo dates and with his band.", "otherInfo": "No other event info available"}, {"Address": "327 Lasuen St, Stanford, CA 94305", "Artist": "DJ Spooky ", "ArtistImage": "https://photos.bandsintown.com/thumb/7060233.jpeg", "Coordinates": [-122.1722, 37.4215], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Alternative, Hip Hop, Trip Hop, Electronic, Electronica", "Time": "2:30 AM UTC", "Venue": "Bing Concert Hall", "moreBioInfo": "Paul D. Miller, aka DJ Spooky, is a composer, multimedia artist, and writer whose work immerses audiences in a blend of genres, global culture, and environmental and social issues. Miller has collaborated with an array of recording artists, including Metallica, Chuck D, Steve Reich, and Yoko Ono. His 2018 album, DJ Spooky Presents: Phantom Dancehall, debuted at #3 on Billboard Reggae.\n\nHis large-scale, multimedia performance pieces include “Rebirth of a Nation,” Terra Nova: Sinfonia Antarctica, commissioned by the Brooklyn Academy of Music, and Seoul Counterpoint, written during his 2014 residency at Seoul Institute of the Arts. His multimedia project Sonic Web premiered at San Francisco’s Internet Archive in 2019. He was the inaugural artist-in-residency at the Metropolitan Museum of Art’s The Met Reframed, 2012-2013.\n\nIn 2014, he was named National Geographic Emerging Explorer. He produced Pioneers of African American Cinema, a collection of the earliest films made by African American directors, released in 2015. Miller’s artwork has appeared in the Whitney Biennial, The Venice Biennial for Architecture, the Miami/Art Basel fair, and many other museums and galleries.\n\nHis books include the award-winning Rhythm Science, published by MIT Press in 2004; Sound Unbound, an anthology about digital music and media; The Book of Ice, a visual and acoustic portrait of the Antarctic, and; The Imaginary App, on how apps changed the world. His writing has been published by The Village Voice, The Source, and Artforum, and he was the first founding Executive Editor of Origin Magazine.", "otherInfo": "Stanford Live at Bing Concert Hall"}, {"Address": "2400 1st St, Livermore, CA 94551", "Artist": "Robert Cray ", "ArtistImage": "https://photos.bandsintown.com/thumb/9945280.jpeg", "Coordinates": [-121.768321, 37.683395], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Robert Cray Band Music", "Time": "2:30 AM UTC", "Venue": "Bankhead Theater", "moreBioInfo": "“Funky, cool and bad,” is how Robert Cray describes his latest album, That’s What I Heard, out February 28. “I thought if it we could get this thing that Sam Cooke used to have, the kind of sound that early Sam Cooke records had, that we could pull this off,” says producer Steve Jordan.\n\nOver the past four decades, Cray has created a sound that rises from American roots, blues, soul and R&B, with five Grammy wins, 20 acclaimed studio albums and a bundle of live albums that punctuate the Blues Hall of Famer’s career. On That’s What I Heard, Robert celebrates the music of Curtis Mayfield, Bobby “Blue” Bland, The Sensational Nightingales and more, alongside four newly written songs. Listen to the first single “Anything You Want” here (by Robert Cray), available now on all streaming services.\n\nCray and Jordan go way back, having met during the making of the Chuck Berry documentary Hail! Hail! Rock ’n’ Roll, in 1987. They started working together in 1999, when Jordan produced the Grammy-winning Take Your Shoes Off, and the recent Grammy-nominated LP, Robert Cray & Hi Rhythm. That’s What I Heard is their sixth album. “Once you start working with Steve, it’s kind of hard to get away from him,” said Robert.\n\nThe music on That’s What I Heard falls into two camps, the sweet and the funky. Of the former, “You’re the One” comes from the Bobby “Blue” Bland songbook. “There’s this thing where I feel you kind of gotta get out of your own head when you're covering one of your heroes,” Cray explained. “Bobby’s one of those. You just let yourself go, and do the song because you love it.”\n\nDon Gardner’s “My Baby Likes to Boogaloo” and the Billy Sha-Rae minor hit, “Do It” are acknowledged rarities (the originals can be heard on the compilation, Groove & Grind: Rare Soul). “Do It” is leaner and meaner, the sort of bare-bones funk that defined the Detroit club sound in the early ’70s with Sha-Rae, Dennis Coffey, and Earl Van Dyke. Cray’s steamroller rendition gets a little extra push from guest guitarist Ray Parker, Jr., who played in Sha-Rae’s band as a teen.\n\n“Burying Ground” is a sacred song from the Sensational Nightingales, inspired by Cray’s youth, when Sundays on the stereo were reserved for his parents’ gospel records. Curtis Mayfield wrote “You’ll Want Me Back” for Major Lance, and Cray wrote “To Be with You” for his late friend, Tony Joe White. “Hot” is another Cray original. “As for the lyrics, “We always say to ourselves, ‘I’m old, but I’m hot,’” he said, and laughed. Spotted hanging around the studio, Steve Perry sang harmony vocals on “Promises You Can’t Keep,” written by Steve Jordan, Kim Wilson and Danny Kortchmar.\n\n“Robert is just a great person besides being extraordinary talent,” adds Jordan. “People gravitate to his guitar playing first, but I think he’s one of the best singers I’ve heard in my life. Not only because of his singing ability, but his interpretations. He’s such an honest soul in my opinion.”\n\nRobert’s band features Richard Cousins (bass), Dover Weinberg (keyboards), Terence F. Clark (drums), and Steve Jordan (drums, percussion).", "otherInfo": "No other event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Anthony Krayenhagen ", "ArtistImage": "https://photos.bandsintown.com/thumb/10117650.jpeg", "Coordinates": [-122.399943, 37.795514], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Standup Comedy, Stand Up Comedy, Stand-up Comedy", "Time": "3:00 AM UTC", "Venue": "Punch Line Comedy Club", "moreBioInfo": "Charming and acerbic, this 10 year veteran is at the top of his story telling prowess. Spinning highly personal stories, ranging from being raised by a single mother, to the pitfalls of growing up in a small CA town. His engaging manner, and slick wordplay make this \"old soul\" a fit for any, and all audiences.\n\nHe has been a finalist at Big Sky Comedy Festival and SF International Comedy Comp. SF Sketchfest and Comedy Centrals Clusterfest, SLO Comedy Festival, Skankfest (NY) featured performer. He has opened for: Rich Vos, Big Jay Oakerson, Cristela Alonzo, Deon Cole, Ryan Stout, Bill Bellamy, Craig Shoemaker, Michael Blackson, Aries Spears, Frankie Quinones, and Damon Wayans Jr.", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "The Third Mind ", "ArtistImage": "https://photos.bandsintown.com/thumb/10078538.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "The Third Mind: Introducing Dave Alvin, David Immergluck, Michael Jerome, Victor Krummenacher and featuring Jesse Sykes at The Chapel"}, {"Address": "1600 17th St, San Francisco, CA 94107", "Artist": "Slow Crush ", "ArtistImage": "https://photos.bandsintown.com/thumb/9138283.jpeg", "Coordinates": [-122.399885, 37.765168], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Postrock, Shoegaze, Dreamrock, Indie, Indiepop, Dreampop, Postpunk, Noisepop", "Time": "3:00 AM UTC", "Venue": "Thee Parkside", "moreBioInfo": "Slow Crush is a shoegaze indie postpunk band.\nFrom the ruins of many great but more negligible bands.\n\nSlow Crush their sound is heavily rooted in 90's indie music. From floaty shoegaze to grooving alt. rock.\nSometimes drowning in reverb bursting into catchy fuzzed out melodies, a haze of overdriven guitars.", "otherInfo": "No other event info available"}, {"Address": "6551 Telegraph Ave, Oakland, CA 94609", "Artist": "Rebel Kings of Oakland ", "ArtistImage": "https://photos.bandsintown.com/thumb/9131376.jpeg", "Coordinates": [-122.26047, 37.85161], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Oakland, California", "Time": "3:30 AM UTC", "Venue": "White Horse Inn", "moreBioInfo": "We are a drag king troupe based in Oakland, CA. We perform every first and third Wednesday at the White Horse in Oakland, CA.", "otherInfo": "No other event info available"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Clementine Darling ", "ArtistImage": "https://photos.bandsintown.com/thumb/9268259.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "Alt-country, Acoustic, Folk, Americana, Indie", "Time": "4:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "lementine Darling is a folk singer-songwriter making waves in San Francisco’s music scene. Originally hailing from Seattle, Washington, she busked her way down the West Coast in 2010 on a road trip that led her to put down roots in Sonoma County, California. The two locals heavily influenced her first two albums— Americana Folk songs and Indie ballads, with dusty undertones of Seattle 90’s grunge. Clementine has played festivals including SXSW, The Emerald Cup, Railroad Square Music Festival, and Balanced Breakfest.", "otherInfo": "No other event info available"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Luke Hogan ", "ArtistImage": "https://photos.bandsintown.com/thumb/8773209.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Wed Apr 15 2020", "EventDate": "2020-04-15", "Genre": "No genre available", "Time": "4:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "Lukehogan.bandcamp.com", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9969782.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "7:00 PM UTC", "Venue": "Second Life - Steamworkz - THROB", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "Live Stream: http://sc.idjstream.com:9584\nhttp://maps.secondlife.com/secondlife/BOYSTOWN/59/194/25"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "10 Ave of the Flags, San Rafael, CA 94903", "Artist": "AbbaFab ", "ArtistImage": "https://photos.bandsintown.com/thumb/8072786.jpeg", "Coordinates": [-122.533538, 38.002387], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Kayla Kenzior, Anne Davies, Terry Davies, Scotty Pearson, Nick Davies", "Time": "2:00 AM UTC", "Venue": "Marin Center Showcase Theater", "moreBioInfo": "AbbaFab is the ultimate ABBA concert. 2 hours of unadulterated FUN!! Click on TOUR DATES to see when AbbaFab are performing at a venue near you!", "otherInfo": "No other event info available"}, {"Address": "522 2nd St, Oakland, CA 94607", "Artist": "Grade 2 ", "ArtistImage": "https://photos.bandsintown.com/thumb/9251024.jpeg", "Coordinates": [-122.277791, 37.797058], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Streetpunk, Punk, Rock", "Time": "2:00 AM UTC", "Venue": "Oakland Metro", "moreBioInfo": "Grade 2 are an English punk band from Ryde, Isle of Wight, formed in 2013. The young three-piece is made up of Sid Ryan - Bass & Lead Vocals, Jack Chatfield - Guitar & Vocals and Jacob Hull - Drums.\n\nTheir music can be described as a classic punk sound, hard and fast whilst also including melodic guitar and vocal parts. Influence taken from classics such as The Clash, The Jam and The Stranglers.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "2:00 AM UTC", "Venue": "Sofar Sounds", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "No other event info available"}, {"Address": "13160 Central Ave, Boulder Creek, CA 95006", "Artist": "The Rough & Tumble ", "ArtistImage": "https://photos.bandsintown.com/thumb/9905529.jpeg", "Coordinates": [-122.121327, 37.124938], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk, Americana", "Time": "2:00 AM UTC", "Venue": "lille aeske arthouse", "moreBioInfo": "The Rough & Tumble are a folk/Americana duo comprised of Mallory Graham and Scott Tyler. Formerly from Nashville, they now live full-time in a 16ft camper with their two dogs playing shows across the US.", "otherInfo": "On April 16, 2020, Lille Aeske Arthouse presents The Singer & The Songwriter and The Rough & Tumble. Join us at 7PM for a great night of music. Tickets are $20.\n\nThe Rough & Tumble are a dumpster-folk, thriftstore-Americana duo, consisting of Mallory Graham & Scott Tyler and their menagerie of homemade instruments and noise makers, have been hobbling around the country in their 16ft camper with their dogs since 2015, taking their songs to the far corners of the US and to the weird little towns they pass along the way. Written during a time of doggedly trying despite the odds and a self-proclaimed “year of honesty,” The Rough & Tumble released their latest studio album Howling Back at the Wounded Dog in September 2019. Join the pack and see the show that has been described as \"restorative Americana, highly entertaining, with jokes and stories worthy of an HBO special.\"\n\nwww.theroughandtumble.com.\n\nThe Singer and The Songwriter is the musical duo of vocalist/songwriter Rachel Garcia and guitarist/songwriter Thu Tran. “The duo creates soft melodic songs, that could just as easily exist as poems. Beautiful, and full of sound and emotion” (Playlist Play) while their multi-cultural backgrounds bring depth and diversity to the rich traditions of folk, jazz and blues music; genres they navigate between with ease and fluidity.\n\nThe duo has been captivating audiences across the US with their intimate live shows at house concerts, theaters, listening rooms, and coffeehouses. At times heartbreaking and at times hilarious, their performances are open-hearted conversations with the audience where they share their stories full of honesty, humor and wit, while delivering their songs with riveting, economical precision. Their live shows are filled with “inimitable storytelling, musical mastery, and soul-baring honesty. These two are truly a gift.”"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Týr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10165861.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Classic Metal, Viking Metal, Progressive Metal, Death Metal, Classic Rock, Symphonic Metal, Folk Metal, Heavy Metal, Pagan Metal, Melodic Metal, Hard Rock", "Time": "2:00 AM UTC", "Venue": "DNA Lounge", "moreBioInfo": "With Hel, the Faroe Islands' Týr provide even more irrefutable evidence that they stand at the vanguard of Scandinavian metal. Their eighth full-length is a collection of ruthlessly melodic and irresistibly compelling progressive folk metal that will immediately resonate with any who have followed the band at any point over the two decades of their storied career. \"Being so close to the album, it's almost impossible for us in the band to have an objective opinion about it, but my impression is that it's a more diverse collection that's also more extreme in some ways. There are more instrumental passages than on 'Valkyrja' (2013), and there are a lot of guitar and bass details,\" states guitarist/vocalist Heri Joensen. \"I really feel we've realized the vision we set out to create all those years ago, and as I listen through the album, I am satisfied with every aspect: the epicness, the intricacy, the melodies and harmonies, and the sheer heaviness of it. I love the whole atmosphere of it.\"\n\nKnown for their prolific nature - dropping their first five full-lengths in the space of just seven years - the six-year gap between Valkyrja and Hel is by far the longest between any two of their records. During that period the band toured hard, taking the album around the world, including a support run with Children Of Bodom in North America and an appearance on the 70,000 Tons Of Metal cruise. However, other factors played into this extended break between releases. \"We approached this one differently because I learned that if I continue doing albums in the way we had up to now, I would die from a heart attack before I'm 50!\" says Joensen. \"That's one of the reasons we changed our method and took such a long time on this one.\" That this tactic - which also includes more songwriting contributions from bassist/vocalist Gunnar Thomsen and guitarist Terji Skibenæs than on previous releases - has been beneficial is borne out in the finished product, which is perhaps more immersive than those that came before. \"Musically it leans a bit towards our album, 'Ragnarok' (2005),\" states Thomsen. \"It's a bit more epic and also much better worked through than any of our previous albums.\" It also marks the recording debut of drummer Tadeusz Rieckmann, who has manned the drum throne for Týr's live shows since 2016. \"We had some problems finding the right guy some years back, but Tadeusz is the man for the job,\" says Joensen. \"He's a very technically able drummer, but at the same time, he has a very natural old-school heaviness to his style, and he plays with deep emotion, which is just what we need.\"\n\nConceptually, the album is informed by a combination of mythology, personal experience and observations of current international events, making for a multifaceted experience that can be processed and understood on many levels. Starting not with a specific story to tell but with an atmosphere in mind, Joensen prefers not to disclose too much detail when it comes to lyrics, keen for listeners to have a chance to take what they want from the songs, though he provides a basic description of that which inspired him. \"Hel is the realm of death in Norse mythology, the underworld where those who die a natural death, not in battle, go. A bit confusingly, it is also the name of the goddess who rules over the same realm. She's the daughter of Loki and a terrifying creature to look upon.\" Two of the songs - \"Ragnars Kvæõi\" and \"Álvur Kongur\" - are traditional Faroese ballads and are as such sung in Joensen's native tongue. Followers of Týr will be aware that they have on numerous occasions strayed from English, which Joensen acknowledges as the \"language of metal\", though this time out it is only the ballads that feature non-English lyrics. \"If I have a good folky melody, I always have the thought that I should write the lyrics in Faroese, but I seldom have the time. The traditional songs come with lyrics, so it's just about picking out the verses I want to use.\" These tracks were in actuality selected even before the release of Valkyrja and have had a long gestation period, Joensen feeling that in adapting them they very much fit with the band's signature sound. \"I am always trying out melodies and chose 'Ragnars Kvæði' first for the fascinating melody in the chorus, and secondly for the storyline. The other ballad I picked first because of the lyrics, which refer to Odin extensively, and secondly for the melody and chorus. I was very satisfied with the harmonies and epic feel of the arrangements I'd come up with, and to tell you the truth, I wish there were more songs of this kind on the album.\"\n\nHel was tracked entirely by Thomsen and Joensen, with sessions split between the latter's studio in Søldarfjørður, drums lain down at Jacob Hansen's studio in Denmark, Skibenæs working in his home studio, and some solos and bass details recorded while they were on the road in North America. \"The sessions took us a long time because we did it all on our own. But we gathered a lot of knowhow while doing it, so it will be a good reference for the future,\" states Thomsen. Joensen concurs, adding, \"It was a bit more relaxing than usual, which was good for me. It took some discipline, and creative people are not typically the most disciplined types. I am definitely not, so I guess it could have gone faster with someone else at the whip!\" That the delay in getting the record out means it's emerging in the twentieth year of Týr's existence is quite poignant. It has definitely not been an easy road to this point, with several members having come and gone, and those that remain having had to endure some very difficult periods, but despite all of it, they have managed to make it through, and achieved a great deal in the process. \"I did dream about becoming an internationally successful professional when I started. It's what I aimed at, but still it's a bit surreal that we've made it this far,\" Joensen admits. \"I didn't in my wildest dreams think I could put survive such misery and abject poverty that this career has lead me through. Still, here I am.\" Thomsen \"could not be prouder\" when he looks back at the string of records they have released, also acknowledging the ups and downs experienced along the way, but making an important point: \"We've done something nobody from where we're from has done before,\" he states plainly. \"But there's a lot more to come!\"\n\nKeep up to date with TÝR at the following locations:\nhttp://www.tyr.fo\nhttps://www.facebook.com/tyrband\nhttps://twitter.com/tyrband\nhttps://www.instagram.com/tyr_official\nhttps://www.youtube.com/tyrband\n\n\nBand History:\nProfession of the Christian Faith or Decapitation: This was the choice given by Sigmundur to his Faroese Viking compatriot Tróndur í Gøtu. And so it was that in 999 A.D., the Christianization of the small “Faeroe Islands” began, casting a veil of oblivion over the ancient Scandinavian gods and only leaving the relics of forgotten heathenry buried deep within the Christian ritual. Or so it was believed...\n\nExactly 999 years later, a small group fondly remembering the archaic gods and rites came together to form the Faroese Viking metal band, TÝR. The one-armed God of War —the bravest of all— became the eponym of the Nordic quartet. Yet TÝR mastermind Heri Joensen is no war monger in disguise and points out that TÝR (also known as the God of Justice) is also revered for first seeking the avenues of diplomacy—an attribute that does not take away from this god of war’s drive.\n\nA distinctive trademark that sets TÝR apart from most other bands of the Viking metal genre is the authenticity of their music: “Traditional music dating back to the Vikings, that is not preserved anywhere else in the world, not even in Iceland, is passed on in an oral tradition here and it is still alive and well. That is what we build our music on and draw great inspiration from,” explains Joensen.\n\nAlmost every song is based on Faroese or Norwegian lore, and is riveted in the garb of the folk metal genre. Its approach unmistakably creates very true Viking metal.\n\nFollowing the release of a demo, the Ólavur Riddararos single, full-length How Far to Asgard, six years of innumerable gigs, and several domestic television appearances, TÝR’s second full-length Eric the Red became the Islands’ best-selling album, coming to the attention of Napalm Records, the label that finally made the album available worldwide in 2006.\n\nImmediately, the unique approach of TÝR´s music, melting traditional Nordic songs and dances with Celtic influences, doom, heavy, and progressive metal found fans around the globe. “Hail to The Hammer” became the hymn to the new generation of folk, pagan, and Viking metal fans.\n\nIn late 2006, TÝR refined their trademark sound with Ragnarok. Technically brilliant and 100 percent authentic, Ragnarok was nothing less than a masterpiece within the true Viking metal genre. The Faroese band embarked on a European tour with Die Apokalyptischen Reiter and a few months later with AMON AMARTH. Though musically different, TÝR gained legions of new fans, impressed by the four men on stage, who were able to turn every show into a demonstration of musical prowess.\n\nFestival appearances throughout Europe and continued touring followed until TÝR enjoyed their biggest live triumph ever at the very over-crowded Wet Stage in Wacken.\n\nLand was released in 2008 and proved to be yet another milestone in the band’s career. Traditional Faroese lyrics marked tracks such as “Gátu Ríma,” “Fípan Fagra” and “Lokka Táttur,” and “Gandkvæði Tróndar,” which is a poem by J.H.O. Djurhuus about the Faroese chieftain Tróndur, who fought against the dying of the old beliefs and for the independence of the Faeroes. A video clip was produced to the fan favorite “Sinklars Vísa.” Land received overwhelming positive feedback and a new audience was able to experience the power of TÝR for the first time.\n\nFollowing the release of Land, TÝR embarked on numerous tours through Europe. One of the highlights was without a doubt the Aaskereia Festival tour with then label-mates Alestorm and Hollenthon. Thanks to their efforts, the band reached many new fans with their memorable concerts. 2008 ended with TÝR being nominated as “Band of the Year” by the Faroese National TV and radio. However, the band had no time to rest on its laurels and embarked on yet another tour through North America in the spring of 2009.\n\nDespite their busy touring schedule, TÝR worked on new songs recorded in early 2009. The band chose to produce the album on native soil. Jacob Hansen mixed the new material with finishing touches provided by the mastering experts at Finnvox. By the Light of the Northern Star met with great feedback from fans and critics alike. The new anthem “Hold the Heathen Hammer High“ was regarded as the legitimate successor to “Hail to the Hammer.” After the release of the album By the Light of the Northern Star, the band played numerous concerts and festivals, as well as taking part in the 70.000 Tons of Metal cruise, while still finding the time to work on new material for their upcoming release.\n\nThe story of King Thrym, who dared steal Thor´s hammer \"Mjollnir,\" may set the lyrical stage on TÝR's latest album, but it does not prevent them from covering more current topics like in the track \"Shadow of the Swastika.\" The Lay of Thrym follows the path of the band's previous releases by uniting classic heavy metal riffs with impressive drumming, traditional melodies, and powerful choruses. The result is a number of epic anthems, such as \"Take Your TÝRant\" and \"Hall of Freedom,\" both of which will most certainly earn a permanent spot on TÝR's future set lists. Frontman Heri Joensen continues to give TÝR a unique and unmistakable edge with magnificent vocals and superb guitar work. Jacob Hansen was again responsible for recording, mixing, and mastering the album, complementing this fascinating Faeroese sound universe with finishing touches that allow every last detail to shine. The Lay of Thrym is a genuine Viking metal album that will undoubtedly secure TÝR's hold on this genre with its heroic melodies and glorious riffs.\n\nValkyrja, the 7 full-length album from the Faroe Islands natives TÝR, is a concept album with a story line based loosely around an nameless Viking age warrior who leaves his woman and goes off to impress the Valkyrie on the battlefield so that she may bring him to Valhalla, or to Fólkvangr, the home of Freyja—the goddess associated with love, sexuality, beauty, fertility, gold, sorcery, war, and death. One can say the album is also indirectly about women and how they affect men and what men will do to impress and obtain women. Frontman and founder Heri Joensen goes on to explain; “the woman that the warrior leaves may represent the earthly women. Freyja, The Lady Of The Slain, may represent the perfection of Women, and the Valkyrie is the link between the two, taking men from earthly to godly women.”\n\nRecorded at Hansen Studios in Ribe, Denmark with Jacob Hansen who handled production, mixing and mastering, the band began writing guitars and drums for Valkyrja over a year ago with melody lines and arrangements being handled in the studio. “I had the story outline and approximate titles very early in the writing process, but only very late, maybe almost too late, did I write the actual lyrics,” comments Heri Joensen. The band’s drummer, Kári Streymoy, parted ways with TÝR after the band completed their US run on Pagan Fest and before they entered the studio so TÝR enlisted George Kollias who stepped in to handle recording duties on Valkyrja. In terms of what the band hopes fans take away from the album, bassist Gunnar H. Thomsen states “I hope they will enjoy it and they like the new direction as well as (guitarist) Terji's bigger involvement in writing and George's drumming. We had a more upbeat direction without changing TÝR's style.”\n\nDiscography:\nÓlavur Riddararos (2002)\nHow Far to Asgard (2002)\nEric the Red (2003)\nEric the Red re-released (2006)\nRagnarok (2006)\nLand (2008)\nHow Far to Asgard re-released (2008)\nBy the Light of the Northern Star (2009)\nThe Lay of Thrym (2011)\nValkyrja (2013)\nHel (2019)", "otherInfo": "No other event info available"}, {"Address": "1710 Mission St, San Francisco, CA 94103", "Artist": "Honey Gold Jasmine ", "ArtistImage": "https://photos.bandsintown.com/thumb/8182717.jpeg", "Coordinates": [-122.420383, 37.769717], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Jazz, Hip Hop", "Time": "2:00 AM UTC", "Venue": "Brick & Mortar Music Hall", "moreBioInfo": "Honey Gold Jasmine is a singer-songwriter, visual artist and ARTivist from Vallejo, CA known for her eclectic and innovative sound that combines experimental elements of hip-hop, R&B, and jazz. Her raw, authentic style, signature smooth voice, poetic lyrics, and genre-bending instrumentals all add up to a sound that grows as she flows. She describes this musical experience as \"from my mind, body and soul to yours.\"\n\nVisit her website www.officialhoneygold.com for her latest music and news.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Ian George ", "ArtistImage": "https://photos.bandsintown.com/thumb/10207176.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Indie, Folk Rock, Avant-garde Music, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Ian George + the Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. the ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Madeline Tasquin ", "ArtistImage": "https://photos.bandsintown.com/thumb/10179736.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Folk Jazz, Vocal, Doo Wop", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Singing in both English and French, Canadian-Californian songcrafter Madeline Tasquin weaves nimbly from jazz folk to odd-meter soul, and from sassy pyschpop ballad to delicately dark fairy-tale, delivering it all with a stage presence that radiates. With influences ranging from Primus and Mr.Bungle to Rachmaninoff and Chopin, it's no surprise that her songs takes unexpected harmonic and rhythmic twists and turns, though she manages to pull this off without leaving anyone in the room behind.", "otherInfo": "Ian George (the mischievous Minnesota ballad singer backed by a peculiar experimental folk rock band) + Madeline Tasquin Musik (the equally mischevious Canada-raised Oakland-based singer-songcrafter) team up on an intimate night of musics at The Lost Church, SF's fave sexy lil' cabaret-style non-profit music venue within a 1-minute walk from a BART station!! A sure fire way to recharge your heart batteries for a harrowing election year in which your heart batteries will be sorely needed.\n\nHOT TIP: Grabbing advance tickets lets the musicians spend more time preparing music and less time getting your lovely rear ends in seats. {INSERT ADV TICKET LINK HERE}\n\nIan George + The Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. The ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…\nhttps://www.iangeorge.com/stories\n\nMadeline Tasquin just woke up after a long nap and is hellbent on inspiring you, dear human, to make the most of your life force and that big heart of yours on this beautiful planet smack dab in the Goldilocks Zone of the Solar System in the Milky Way Galaxy of our known universe. Her strangely addictive musical potions – concocted from the rhythmic seeds of balkan and doo-wop, the squishy flavourful fruit of pop, with hints of the tart rind of jazz – may cause side effects including talking to strangers, being kinder to yourself, and gas.\nhttp://madelinetasquin.bandcamp.com\n\nWow, you read all the way to the bottom! You and your impressive attention span in the Internet Age get a kiss. x"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Anthony Krayenhagen ", "ArtistImage": "https://photos.bandsintown.com/thumb/10117650.jpeg", "Coordinates": [-122.399943, 37.795514], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Standup Comedy, Stand Up Comedy, Stand-up Comedy", "Time": "3:00 AM UTC", "Venue": "Punch Line Comedy Club", "moreBioInfo": "Charming and acerbic, this 10 year veteran is at the top of his story telling prowess. Spinning highly personal stories, ranging from being raised by a single mother, to the pitfalls of growing up in a small CA town. His engaging manner, and slick wordplay make this \"old soul\" a fit for any, and all audiences.\n\nHe has been a finalist at Big Sky Comedy Festival and SF International Comedy Comp. SF Sketchfest and Comedy Centrals Clusterfest, SLO Comedy Festival, Skankfest (NY) featured performer. He has opened for: Rich Vos, Big Jay Oakerson, Cristela Alonzo, Deon Cole, Ryan Stout, Bill Bellamy, Craig Shoemaker, Michael Blackson, Aries Spears, Frankie Quinones, and Damon Wayans Jr.", "otherInfo": "No other event info available"}, {"Address": "8240 Old Redwood Hwy, Cotati, CA 94931", "Artist": "Small Hat ", "ArtistImage": "https://photos.bandsintown.com/thumb/9523631.jpeg", "Coordinates": [-122.705214, 38.325608], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Blues-rock, Alternative, Rock, Soul", "Time": "3:00 AM UTC", "Venue": "Redwood Cafe", "moreBioInfo": "Delivering their unique sound of soulful alternative southern rock, Small Hat features Mandy Brooks, Cosmos Harrison, and ZOZ, along with various special guests, with the intention to inspire and connect with their audience. Based out of Northern California, Small Hat has been awarded for songwriting, with their first single released spring of 2018. smallhatband.com", "otherInfo": "No other event info available"}, {"Address": "1928 Telegraph Ave, Oakland, CA 94612-2202", "Artist": "Tay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8445474.jpeg", "Coordinates": [-122.26958, 37.80952], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Abuja,Nigeria", "Time": "3:00 AM UTC", "Venue": "Uptown", "moreBioInfo": "tayiwar.com/biography", "otherInfo": "Join Tay and the JangLahDahs (OAK), Boot Juice (SAC) and Levi Thomas (OAK) and TBA"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Country, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk, Rock", "Time": "3:00 AM UTC", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Adam Brookes ", "ArtistImage": "https://photos.bandsintown.com/thumb/9635055.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Pop, Indie", "Time": "3:00 AM UTC", "Venue": "Rickshaw Stop", "moreBioInfo": "\"Adam Brookes' solo project is a deviation from Dangermaker's dark pop sound. The minimal use of guitar paired with electronic production creates a chill and light attitude, suitable for summertime vibes.\"\n– RIFF MAGAZINE\n\n\"San Francisco’s Adam Brookes has never been an artist easily pigeonholed, he’s increasingly on quests to expand his range. His first solo single, All I Got is You, is less vast Arctic Monkeys type rock and more akin to airy Spandau Ballet synth-pop (with his signature Northern California flair of course).\"\n– GLOBAL TEXAN\n\n\"With its breezy, minimal, electronic feel, the new tune All I Got is You from Dangermaker's Adam Brookes is your perfect summer soundtrack.\"\n– GLIDE MAGAZINE", "otherInfo": "ADAM BROOKES (of Dangermaker)\nSAICS\nSloome\n8 pm\n$10"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Teddy Abrams ", "ArtistImage": "https://photos.bandsintown.com/thumb/6264505.jpeg", "Coordinates": [-122.419994, 37.777441], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Davies Symphony Hall", "moreBioInfo": "Teddy Abrams is an American conductor, composer, pianist, and clarinetist.", "otherInfo": "This week, the San Francisco Symphony brings together two composers—one past and one present—for an inspired pairing of audience favorites. Guest conductor Teddy Abrams leads the orchestra in the West Coast premiere of Philharmonia Fantastique by the internationally renowned Bay Area composer Mason Bates. A fixture as a DJ in the splashiest nightclubs around town, Bates turns his ear for layering sound, rhythm and texture upon the infinitely variable palette of the symphony orchestra (plus a pair of laptops). Bates' work appears side-by-side with another master musical colorist—but in a nineteenth-century aesthetic—Tchaikovsky, who delivers a volcanic rush of irresistible melodies in his thundering Symphony No. 5.\n\nConductor/Performers\n\nTeddy Abrams\nconductor\n\nSan Francisco Symphony\nProgram\n\nBarber\nSecond Essay for Orchestra\n\nMason Bates\nPhilharmonia Fantastique: The Making of the Orchestra West Coast Premiere, SFS Co-commission\n\nTchaikovsky\nSymphony No. 5"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "The Cookout ", "ArtistImage": "https://photos.bandsintown.com/thumb/8374877.jpeg", "Coordinates": [-122.405681, 37.778048], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Bass, Electronic, Trap, R&b, Hip Hop, House, Edm, Dance, Deep House, Tech House", "Time": "3:00 AM UTC", "Venue": "1015 Folsom", "moreBioInfo": "Tuesdays @ 9pm ET / 6pm PT\n#TheCookout", "otherInfo": "No other event info available"}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "The Groovebirds ", "ArtistImage": "https://photos.bandsintown.com/thumb/8788706.jpeg", "Coordinates": [-122.49051, 37.636718], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Soft Rock, Alternative", "Time": "4:00 AM UTC", "Venue": "Winters Tavern", "moreBioInfo": "The Groovebirds are American songwriters and recording artists. Their music is lyric-based Alternative Soft Rock; influenced by the sounds of the 60s, 70s and 80s. Tracks from the band's \"Looking In From The Outside\" album were featured on radio and television programs in the United Kingdom, Australia, and the Pacific Northwest; and their latest release, “Time It Takes,” has appeared in music rotations globally since 2017. Both albums are currently available at Music Millennium in Portland; bandcamp.com, !tunes, Spotify and CD Baby; and through Groovebirds Music at https://thegroovebirds.com", "otherInfo": "No other event info available"}, {"Address": "800 Post St, San Francisco, CA 94109", "Artist": "itchtheband ", "ArtistImage": "https://photos.bandsintown.com/thumb/10063294.jpeg", "Coordinates": [-122.415268, 37.7876], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Transylvanian, Jazz, Electro", "Time": "4:30 AM UTC", "Venue": "The Royale", "moreBioInfo": "Striptease music", "otherInfo": "No other event info available"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "Sonamó ", "ArtistImage": "https://photos.bandsintown.com/thumb/9317059.jpeg", "Coordinates": [-122.437364, 37.774222], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Acid Jazz, Funk", "Time": "4:30 AM UTC", "Venue": "Madrone Art Bar", "moreBioInfo": "If Jamiroquai and Stevie Wonder were Italians, they would sound like Sonamó.\n\nWith a dynamic, passionate blend of melodic lines shot through with hefty doses of R&B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree. One of the strongest characteristics of Sonamó is their high energy that’s well expressed in their memorable live performances.\n\nThe San Francisco band, whose roots are spread all over the world, released on August 2019 their latest new single, their funky fresh version of the 1956 classic Tu Vuó Fà L’Americano (You Want To Be American)…but with a TWIST!\n\nSonamó flipped the script and replaced the lyrics, so their version is called… ”You Wanna Be an ITALIANO”. You will enjoy the fierce funk and clever wordplay.\n\n\nSonamó started when Giuseppe Pinto moved to San Francisco in 2010. As a passionate musician from Italy, Pinto searched for inspiration in his new city by exploring its eclectic scene and open-mindedness. As Pinto mentioned: “[...] my experience in the United States completely changed me. I had to reconsider all my values and understand that there are many ways of doing things and seeing things. That’s what I call the American miracle: a huge diversity that brings the best part of all of us”.\nThose feelings of freedom and love in Pinto’s journey came to life with Sonamó after the meeting with creative guitarist Trent Berry who says: ”[...] as a kid growing up in the midwest it was like discovering a lost cousin almost like a parallel evolution, if American funk is like Nascar then Italian funk is like Formula 1”.\n\n\nThe name Sonamó is inspired by an album of Pino Daniele (E Sona Mo’) that means “and play now”, It is sometimes used among musicians in Southern Italian as a slang term meaning, “show me what you got!” and boy, do they ever!", "otherInfo": "If Jamiroquai and Stevie Wonder were Italians, they would sound like Sonamó.\n\nWith a dynamic, passionate blend of italian melodic lines shot through with hefty doses of R&B, funk, and acid jazz, Sonamó music is both danceable yet introspective, at once familiar yet exotic, intense yet energetic, romantic and yet somehow carefree.\n\nwww.sonamomusic.com"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "Junk Parlor ", "ArtistImage": "https://photos.bandsintown.com/thumb/8142032.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Thu Apr 16 2020", "EventDate": "2020-04-16", "Genre": "Rock, Junk", "Time": "4:30 AM UTC", "Venue": "Club Deluxe", "moreBioInfo": "JUNK PARLOR Biography A galvanizing force on the Bay Area indie rock scene since launching serendipitously in 2013, Junk Parlor is that crazy-rare band whose vibe is so driven by joyful schizophrenia that it transcends easy genre trappings. Born from the wild musical wanderings of Jason Vanderford, renowned for his five years recording and touring with gypsy jazz sensation The Hot Club of San Francisco, their energizing musical collage includes 50’s rock and roll rumbling atop gypsy rhythms, a bit of Gipsy Rhumba, tango, Eastern Euro/Hungarian music, bellydance, punk…Vanderford was raised on “rock and roll and punk and everything under the sun,” so other sounds are certain to appear as the hybrid junk rockers continue their jam. The songs on their mostly vocal 2013 debut Wild Tones and predominantly instrumental follow-up Melusina (2015) have earned them comparisons to Nick Cave, Leonard Cohen, Gogol Bordello, Dead Kennedys and Tom Waits. One fan called it “Crooner Punk” because of Vanderford’s beckoning, low range vocals – but those are just the centerpiece of a vibe that includes the singer’s acoustic banjo and rhythm guitar, the polyrhythmic grooves of drummer, cajon player and group cofounder Rt Goodrich, Laela Peterson-Stolen’s soaring violin and viola and the growling electric fretless bass of Tim Bush. At the heart of Junk Parlor’s desire to get their audiences dancing and singing along is Vanderford’s passion for storytelling. He taps into an offbeat influence for their latest single, the haunting rockabilly heartbreak tune “Mick Jagger’s Heart.” Drawing thematic inspiration from The Rolling Stones’ countrified ballad “Dear Doctor” (which appeared on Beggar’s Banquet), the band creates a fresh twist on the pain of lost love via the juxtaposition of dark lyrics and bouncy rhythms. Vanderford artfully describes the piece as what happens “when the heartache of Leonard Cohen decides to lament under the sun amidst the California surf…The moment of goodbye…the lingering sigh that begs to turn back time…Doctor won’t you please…tear it out.” The compelling, gut punchingly beautiful video for the track by Jeannie Jo uses scenes of San Francisco cityscapes as a metaphor for heartbreak. Building a solid, ever expanding West Coast fan base, Junk Parlor has played several hundred gigs these past few years. Beyond a batch of hotspots in San Francisco and throughout the Bay Area, the band has headlined numerous times in Seattle, Portland, Eugene, Los Angeles and Reno. Aiming each time out to capture a room for a few hours, and aware of today’s short musical attention spans, Vanderford always creates fresh set lists using previous tunes to frame or set the mood for the next, building waves of energy in an arc like fashion. Not surprisingly, Junk Parlor’s fan base is as demographically eclectic as their music. Remembering a certain trip to Seattle, the singer says, “One night we played a punk club in Bremerton, with people wearing Mohawks and going crazy in a mosh pit, and the next we were at the Triple Door jazz club, with an older audience in suits and ties, drinking fancy martinis. The sonic shift reminds us a lot of the MTV Unplugged era, when heavy rockers gained new popularity by playing softer acoustic music.” As Vanderford tells it, Junk Parlor began almost by accident. In the years since his stint with The Hot Club of San Francisco, he had emerged as one of the region’s “go-to” musicians for his rhythm guitar and gypsy jazz expertise. In early 2013, his uncle, Tim Bush, asked him to come play his acoustic at a wine bar in Petaluma that he tended bar at. Vanderford agreed, but only if Bush played bass. “He’s been a professional bassist for 30 years and took me to buy my first guitar when I was 14,” says the singer. As he got into his once a month residency, Robin Goodrich showed up, telling Vanderford he wanted to put a group together. “I had never met him before, but he said he knew who I was,” Vanderford says. “I was hesitant but asked him to sit in with me for a few months. Then he shows up one day saying he booked the band. I told him we didn’t have a name and he said we better get one. So then I took it seriously.” As the idea of a larger ensemble took shape, Vanderford decided he wanted an original, more experimental band rather than another traditional gypsy jazz outfit. He began pulling out songs he had never shown anyone. The clever band name came from his younger days, when his bedroom stored his collection of vintage furniture and pictures he’d bought at antique stores. He vowed then that if he ever had a band of his own, he would call it what he called that space: Junk Parlor. Adding Bush on bass, the band played their first gig that May and five months later they made their debut album Wild Tones and started touring. While the singer writes all the original songs, the band works together on the arrangements and each member writes their own parts. Vanderford and Goodrich are financial partners in the band who do everything DIY, including booking, social media, poster making and promotion. Junk Parlor's members have played the gamut of festivals and prestigious venues including Outside Lands, Kate Wolfe Fest, Djangofest, Gaia Fest and SXSW. Vanderford has played, recorded and toured with the Americano Social Club, The Hot Club of San Francisco, Clint Bakers New Orleans Jazz Band, Little Charlie's Caravan, Avatar Ensemble and Seth Ford Young Quartet. Rt Goodrich has laid down rhythms and toured with Staggerwing, Beso Negro and Standing Room Only. Bush has played extensively with Danny Montana, Sweetie Pie and the Doughboys, Chuck Day, Sam Andrew, Jim Martin, and Freddie Roulette. Wild Tones included two instrumentals that resonated with the local bellydance community. The band started getting videos of dance troupes from all over, dancing to these tracks. Kami Liddle from the Gold Star Dane Company asked Vanderford if he wanted to collaborate, and he dove into a fresh project, aiming to create an album for dancers to choreograph to. They put together a Kickstarter campaign and raised enough money to make Junk Parlor’s instrumental dominated Melusina and go on tour with the Gold Star girls. He had been collecting vintage bellydance records for years, so he started picking out the ones he loved to learn. He recorded two covers among the originals, “Gold Star Dance Academy” and “Procession.” Looking ahead, Vanderford says that the new album, which will include “Mick Jagger’s Heart,” will build upon what Junk Parlor has been doing since day one. “Our first two records are simply two sides of the same coin,” he says. “I am looking forward to our next project as we already have all the songs and have been playing them out and getting a wonderful response. This one will include a few instrumentals, but have more of an emphasis on vocals. “What I’m learning through all of these recording and performing experiences is that it doesn’t matter if you’re a jazz musician, singer or dancer, the goal is always telling a great story. I love getting out there and hearing people’s stories and then transforming those into songs that can be interpreted in unique ways by the band, dancers and everyone in the audience that it touches.” \"A dream falling off the edge of a cliff.\"", "otherInfo": "No other event info available"}, {"Address": "77 Harrison Ave, Campbell, CA 95008", "Artist": "123 Andrés ", "ArtistImage": "https://photos.bandsintown.com/thumb/10235218.jpeg", "Coordinates": [-121.9425, 37.28829], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Alternative", "Time": "5:30 PM UTC", "Venue": "Campbell Library", "moreBioInfo": "123 Andrés is the bilingual music duo made up of Christina & Andrés. Their songs in both Spanish and English celebrate language and culture, and get the whole family moving and singing. They play guitar, saxophone, clarinet - and the kids get up and dance and sing, do sign language, jump, and they get the parents up, too. They even won a Latin Grammy for kids’ music and they’ve been nominated 3 times. The songs are about letters, numbers, geography, and it’s in Spanish and English, and they also incorporate sign language.", "otherInfo": "Latin Grammy-winners 123 Andrés are the bilingual music duo made up of Christina & Andrés. Their songs in both Spanish and English celebrate language and culture, and get the whole family moving and singing. Come jump and dance - don't miss this high-energy show!\n¡Volvemos a California! 4 conciertos GRATIS en Bibliotecas Públicas del condado de Santa Clara. Acompáñanos con tus peques. ¡Van a estar divertidísimos!\nWe’re coming back to California! We start April with 4 FREE concerts for all our amigos in Santa Clara public libraries. Join us for a super fun time!"}, {"Address": "425 Mission St, San Francisco, CA 94105", "Artist": "Mother & The Boards ", "ArtistImage": "https://photos.bandsintown.com/thumb/8829955.jpeg", "Coordinates": [-122.39792, 37.78993], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Kazoo Studios, Elandis V Brooks, Ken Burton", "Time": "7:00 PM UTC", "Venue": "Salesforce Park", "moreBioInfo": "Mother & the Boards is a fierce blend of folk, funk and experimental rock with a message to incite and inspire you. Defined by the vocal gymnastics and songwriting prowess of front woman Kazoo Studios, their sound feels like a modern eclectic take on 60s era protest music - with an edge.", "otherInfo": "No other event info available"}, {"Address": "2402 Research Dr, Livermore, CA 94550", "Artist": "Thrive ", "ArtistImage": "https://photos.bandsintown.com/thumb/9730407.jpeg", "Coordinates": [-121.72009, 37.67602], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rnb., Soul, Dub, Reggae", "Time": "7:30 PM UTC", "Venue": "Altamont Beer Works", "moreBioInfo": "“Don’t be a follower when you can be a leader.”\n\n-Thrive, “Freedom of speech”\n\nThrive is an American Reggae group founded in 2008 by singer/songwriter duo Aaron Borowitz and Kenneth Rogers. Based out of northern California, the band eventually made their home in Santa Cruz in 2009.\n\nDuring that time, The American Reggae movement was starting to gain momentum. Bands like SOJA and Rebelution were rising in popularity, and Thrive found themselves opening for these bands and cultivating their own fan base.\n\nIn October 2010 Thrive released their first studio album \"Gratitude Attitude\". Shockingly, the relatively unknown group shot up to #4 on the Itunes Reggae charts, which pushed the band towards many more opportunities.\n\nIn the following years, Thrive found themselves performing at festivals and night clubs all over the West Coast. Their first major tour was \"Everything Changes Tour\" with SOJA in 2011.\n\nMay 7th 2013 Thrive released their second full length studio release \"Relentless\". This album featured the single \"Just Fine\" featuring Eric Rachmany of the band Rebelution, and went to #3 on itunes Reggae charts, as well as #6 on the Billboard Reggae charts. Following this release, Thrive landed a performance at California Roots Music And Arts Festival. During this performance, Eric Rachmany and EN young joined Thrive on stage, and the audience erupted in an explosion of energy.\n\nAfter that incredible experience, The band recorded a single entitled \"Broken\" featuring Hirie. The tune was recorded mixed and mastered by EN Young. This would be the last song their beloved saxophonist Scott Shipper would record on before he passed away from cancer.\n\nIn 2015, Thrive released The \"Thrive EP\". This project featured Trevor Young of the band SOJA on the single \"The Gift\". Following the release of the EP, the group toured relentlessly through established and new markets, gaining new fans and growing their presence in the Reggae community.\n\nCurrently Thrive is recording their 4th studio release, which will feature a few musicians and singers the band has met through their incredible journey. Their latest single \"Not Enemies\" is available for FREE on their website www.thrivingmusic.com. Thrive's brand new full length album is set to release late Summer/ early Autumn, 2017.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9973739.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "9:00 PM UTC", "Venue": "Second Life - Berlin Raw - Entranced", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "Live Stream: http://sc.idjstream.com:9584\nhttp://maps.secondlife.com/secondlife/Thunder Hallows/228/132/2704"}, {"Address": "2 Marina Blvd Building C, San Francisco, CA 94123", "Artist": "Tomorrows Bad Seeds ", "ArtistImage": "https://photos.bandsintown.com/thumb/10015344.jpeg", "Coordinates": [-122.431939, 37.805506], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Reggae Rock", "Time": "1:00 AM UTC", "Venue": "Fort Mason Center for Arts & Culture", "moreBioInfo": "Tomorrows Bad Seeds, “leaders of the new school” is a five piece American band from The South Bay of Los Angeles California, formed in 2004. Their Southern California influences helped yield their unparalleled sound; A perfect mix of reggae, rock & pop. From Hood B-Boy Street to Surf/Skate Beach Culture these boys emerged into a multi-cultural musical phenomenon with a cause. Meet The Seeds: Moises Juarez (lead-vocals), Sean Chapman(vocals/guitar), Matthew McEwan (vocals/guitar), Patrick Salmon (drums), and Andre Davis (bass).\n\nThe band tours an average of 40 weeks a year coast to coast, selling out venues and spreading like wildfire across the nation. Building a solid and loyal following wherever they go. On June 16th, 2012 TBS headed out to appear for their 3rd time at the 2012 Vans Warped Tour. They just released their highly anticipated 3rd album on June 12, 2012 titled “The Great Escape” produced by Grammy winner Damon Elliot. TBS released their first single off the album titled “One Way” co-written with Tim Myers of One Republic fame on March 27, 2012. “One Way” is currently on the radio and made it onto the Top 40 Billboard Indicator Charts 5 weeks in a row. With so much anticipation surrounding the album, “The Great Escape” hit #28 on the Itunes Alternative Charts upon its first day of release. On February 25, 2012 the Bad Seeds concluded their 6week headlining tour with a sold out performance at the Anaheim House Of Blues. On November 12th 2011 they finished 3 nationwide tours all the while promoting their single “Nice & Slow”. The single was released August 8th 2011 along with their sexy summer video recognized for winning MTVU Freshmen Video Pick Of the Week and played on hundreds of media outlets. “Nice & Slow” received notable radio play and climbed its way on to the MB radio charts. No wonder the band’s Facebook page has over two million impressions. On March 3, 2011 TBS appeared on The Late Late Show With Craig Ferguson performing their single “Only For You” off their 2nd album “Sacred For Sale.” On November 18th, 2010 TBS received the “Commercial Success Award” at the Los Angeles Music Awards for having more than 150,000 downloads for 2010\nTomorrows Bad Seeds prove to be extremely talented musicians, vocalists and entertainers as a whole. Their live show provides a high-energy performance that will have you craving more. Since the band’s inception, they have shared the stage with the likes of UB40, 311, Pennywise, Smashing Pumpkins, The Wailers, and Fishbone, to name a few. In 2007 the Seeds’ signed with Urbantone Records releasing their debut album \"Early Prayers\" then on May 25th, 2010 they followed up with their sophomore record entitled “Sacred For Sale” distributed by MRI a subsidiary of Sony/RED. You can find Tomorrows Bad Seeds music online on Itunes, Amazon, CDbaby, etc. Their fans can reach them on top social media sites and on our official web page. “We come with versatility because we come from such a melting pot of music here in the Greater Los Angeles Area,” Moises said. We don’t really fit into a ‘genre’, our sound is best described as an attitude a blend of everything, with something for everyone!”\n\nNOT BAD MEANING BAD BUT BAD MEANING RAD!\n\nSPREAD THE SEED!", "otherInfo": "Rhythms Music Festival\n\nSan Francisco State University, City College of San Francisco, University of California San Francisco, University of San Francisco. A Student ID number will be needed to purchase a ticket. Public Tickets are tiered and will increase as inventory runs out and event date approaches. Buy Early and Save!\n\nYOUR TICKET INCLUDES:\n\n-Special Performance by Bishop Briggs\n\n-Art installations and Interactive Photo Ops... for the 'Gram'\n\n-Free henna tattoos\n\n-Special bedazzled glitter makeup\n\n****TICKETS ARE LIMITED*****\n\n***WILL CALL WILL BE OPEN DAY OF THE SHOW FROM 5-8:30 pm***\n\n--------------------------------------------------------------------------------------------\n\n***SFSU ID CARD NEEDED TO PICK UP WRISTBAND DAY OF SHOW***\n\n***WRISTBAND IS NEEDED TO ENTER SHOW- NO ACCEPTATIONS ***\n\n***ONE MORE TIME: ONE (1) WRISTBAND IS NEEDED PER STUDENT TO GAIN ENTRANCE TO EVENT***"}, {"Address": "535 Main St Ste A, Vacaville, CA 95688", "Artist": "5 O'clock Somewhere ", "ArtistImage": "https://photos.bandsintown.com/thumb/10099572.jpeg", "Coordinates": [-121.986934, 38.356917], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Fairfield, California", "Time": "1:30 AM UTC", "Venue": "Fuso | Italian Restaurant", "moreBioInfo": "A fun dynamic band playing hits from the 50s to today.", "otherInfo": "No other event info available"}, {"Address": "142 Throckmorton Ave, Mill Valley, CA 94941", "Artist": "The Black Market Trust ", "ArtistImage": "https://photos.bandsintown.com/thumb/9069806.jpeg", "Coordinates": [-122.549119, 37.905857], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Swing, Jazz, Vocal Jazz, Gypsy Jazz, Traditional Pop", "Time": "2:00 AM UTC", "Venue": "142 Throckmorton Theatre", "moreBioInfo": "The Black Market Trust are an American Traditional Pop/Vocal Jazz group from Los Angeles who combine the sounds of the legendary American crooners and vocal groups with the fire and energy of Gypsy Jazz guitarist Django Reinhardt. Consisting of five world class musicians who have traveled the globe recording and performing on the world’s biggest stages and with music’s most renowned artists, The Black Market Trust capitalize on their experience and pedigree to deliver a high energy, crowd pleasing performance filled with some of the best songs ever written.\n\nThe live show features material from The Great American Songbook infused with Django’s romantic and virtuosic flavor. Add some intricate vocal harmonies, a dash of Rat Pack-style comedy and it’s clear to audiences why The Black Market Trust have quickly earned a reputation as one of the premier live acts performing in music today. Be transported as they meld two distinctly different vibes- one of a gypsy campfire, the other a slick metropolitan nightclub- into a cohesive, stylish sound.", "otherInfo": "The Black Market Trust are thrilled to return to Mill Valley's historic 142 Throckmorton Theater!"}, {"Address": "San Francisco, CA", "Artist": "Leila Sunier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8789100.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Folk Jazz, Pop", "Time": "2:00 AM UTC", "Venue": "SoFar San Francisco", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Mary Gauthier ", "ArtistImage": "https://photos.bandsintown.com/thumb/8315427.jpeg", "Coordinates": [-122.822691, 38.40115], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country, Alternative Country, Folk Rock, Singer, Americana, Songwriter, Folk, Rock", "Time": "2:00 AM UTC", "Venue": "Hopmonk Tavern", "moreBioInfo": "“With songwriting as powerful as hers, there’s no need to go looking for qualifiers. She’s a unique, intrinsically valuable musical voice. And there’s never a surplus of those.” — Randy Lewis, Los Angeles Time\n\nThe Associated Press named Mary Gauthier as one of the best songwriters of her generation. Her songs have been recorded by dozens of artists, including Jimmy Buffett, Blake Shelton, Tim McGraw, Bettye Lavette Mike Farris, Amy Helm and Candi Staton, and have appeared extensively in Film and Television, most recently on Yellowstone, ABC’s Nashville, HBO’s Banshee, and Masterpiece Theater’s Case Histories. Her second album, Filth and Fire was named Best Independent CD of the year by the New York Times. She was signed to Universal Lost Highway, and her following 3 records were listed in both the LA Times and NY Times top three releases of the year. Her record Mercy Now was named in the top 5 records of the decade by No Depression magazine. She was awarded New Artist of the year by The Americana Music Association in 2005. Mary has released 9 studio albums.", "otherInfo": "No other event info available"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Cam'ron ", "ArtistImage": "https://photos.bandsintown.com/thumb/9761640.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rap, Hip Hop, Hip-hop", "Time": "2:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "Cameron Giles, better known worldwide as the Grammy-nominated, multiplatinum-selling rapper Cam’ron, is one of the few artists in hip-hop who has managed to remain relevant for nearly as long as the music has existed. Born and raised in Harlem, Cam’ron epitomizes the unmatched entrepreneurial spirit of the neighborhood between the 110th and 155th blocks of Upper Manhattan, having successfully tackled the roles of hip-hop artist, director, actor, screenwriter, designer, and entrepreneur with finesse. He is the de facto leader and founding member of The Diplomats, arguably one of the most influential crews in hip-hop, that has left an indelible mark on the style, language, and swagger of both New York City and hip-hop culture.\n\nCam’ron is undoubtedly one of the greatest anti-heroes in hip-hop: he’s the man who spawned a thousand memes, drove an unmistakable “Laffy Taffy” Range Rover, wore head-to-toe pink mink in the 2002 Mercedes Benz NY Fashion Week, told Anderson Cooper he wouldn’t snitch on a hypothetical serial killer neighbor, humiliated Bill O’Reilly on his own show, closed out Mark McNairy's runway show wearing custom Dipset capes, and whose face unofficially re-appropriated on everything from orthopedic shoes to Valentine’s Day cards. Cam’ron is truly one of a kind, a paradoxical living legend in pop culture whose point of view as hysterical as it is harrowing and accessible as it is absurd. Unapologetic and unstoppable, Killa Cam is back with a vengeance.", "otherInfo": "No other event info available"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Seun Anikulapo Kuti ", "ArtistImage": "https://photos.bandsintown.com/thumb/7257536.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Afrobeat, African, Jazz Fusion, World Fusion, Jazz-funk, Funk, Worldbeat", "Time": "2:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "Seun Kuti is the youngest son of legendary Afrobeat pioneer Fela Kuti. At the age of nine, Seun expressed the wish to sing to his father. A short while later Seun started performing with his father and the band, until his father’s untimely death in 1997. Seun, then only 14 years old, assumed the role as lead singer of Egypt 80. Ever since, Seun has followed the political and social ethos of his father. Along the way, he began to add his own twist to the music, digging deep into various African traditions to reflect the continent's struggles and cultures. About three quarters of the current Egypt 80 line-up consists of musicians that not only played with Fela Kuti, but often were arrested and harassed alongside the founder of the Afrobeat movement. Seun Kuti has toured the world and released many albums.", "otherInfo": "No other event info available"}, {"Address": "pa w, Bolinas, CA 94924", "Artist": "Ian George ", "ArtistImage": "https://photos.bandsintown.com/thumb/10207176.jpeg", "Coordinates": [-122.69, 37.91], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Indie, Folk Rock, Avant-garde Music, Folk", "Time": "2:00 AM UTC", "Venue": "Gospel Flats Farm Stand", "moreBioInfo": "Ian George + the Well have appointed a peculiar form of whimsical folk rock to convey a few handfuls of outlandish fairy tale folk ballads, sometimes gently and sometimes not so gently. the ensemble twines folk traditions with the avant - the quotidian with the supernatural - Stone ground barley with taffy neptune berries…", "otherInfo": "Contact Bronwen for more info:\n\nbronwen.halsey@gmail.com\n\nAddress: 140 Olema Bolinas Rd, Bolinas, CA 94924"}, {"Address": "2309 Encinal Ave, Alameda, CA 94501", "Artist": "Quentel the Cryptid ", "ArtistImage": "https://photos.bandsintown.com/thumb/9125508.jpeg", "Coordinates": [-122.244825, 37.762952], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Red Door on Encinal ", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "427 Mendocino Ave, Santa Rosa, CA 95401", "Artist": "Bronze Medal Hopefuls ", "ArtistImage": "https://photos.bandsintown.com/thumb/9132617.jpeg", "Coordinates": [-122.715214, 38.441851], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Groove, Funk", "Time": "2:30 AM UTC", "Venue": "Lost Church Santa Rosa", "moreBioInfo": "We play funky grooves for funky groovers.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Handsome Hound ", "ArtistImage": "https://photos.bandsintown.com/thumb/9112356.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Folk Rock, Americana, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "There's a reason Handsome Hound has been called the \"musical version of 60 mg of Prozac.\" With its energetic, lyric-driven music, the group turns quiet rooms into spirited dance halls, in their home city and beyond. The group sets meaningful lyrics to ear-worm melodies buoyed by guitars, drums, and horns, blending musical styles and influences including folk, rock, pop, Americana, and country.\n\nHandsome Hound was formed in Washington, DC in 2015 by partners Cuchulain Kelly and Claire Daviss, who met through music communities. Collaborating with top musicians in the DC area, the band released their debut EP, I Guess We're Doing Alright, in 2016, featuring the crowd favorite \"Hannah.\"\n\nSince then, the band has rapidly developed a devoted following. They perform in intimate house shows up and down the East Coast, and have headlined some of the DC’s historic music venues and festivals, including the Black Cat, Rock and Roll Hotel, and the John F. Kennedy Center for the Performing Arts’ Millennium Stage. The group has come to be known as a dynamic live band, experimenting with acoustic and electric instrumentation, horns, and strings.\n\nIn 2018, Handsome Hound self-released its ten-song debut LP, Mountain on Fire. Engineered by Beat Baby Studios (Wye Oak, Lower Dens) and mastered by Sarah Register (Big Thief, The Shins), the highly anticipated album captures the band’s energetic live sound while elevating carefully crafted lyrics. Written over the course of several years, the album draws heavily on Claire’s and Cuchulain’s experiences as “weekend warriors” - musicians who work full-time jobs while committing their weekends to writing and performing, a balance typical for artists living in DC. While retaining tongue-in-cheek playfulness, the songs grapple with loneliness, feeling out of place, anxiety, and growing up.\n\nClaire and Cuchulain now live in Palo Alto, CA and call the Bay Area their musical home.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Matt Jaffe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8945081.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Indie Rock, Rock", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Matt Jaffe is a 24 year old rock & roll singer/songwriter from San Francisco. Cutting his teeth on countless open mics around the Bay Area, Matt started taking music (a little bit) more seriously when Jerry Harrison of Talking Heads offered to produce his first record. Since then, Matt has continued to churn out more songs than he can remember the words to, oversaturate the market with gigs (opening and/or touring with the likes of Mavis Staples, Wilco, Jackie Greene, Melissa Etheridge, and Blues Traveler), and collaborate with Chuck Prophet and Tom Higgenson of the Plain White T's. Fresh off the release of his third LP, The Spirit Catches You, Matt Jaffe & Band are street-teaming with the best of them to bring rock & roll back to the masses.", "otherInfo": "No other event info available"}, {"Address": "65 Capp St, San Francisco, CA 94103", "Artist": "Cuchulain ", "ArtistImage": "https://photos.bandsintown.com/thumb/9112338.jpeg", "Coordinates": [-122.418409, 37.765783], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country, Folk Rock, Jazz, Funk, Folk", "Time": "2:30 AM UTC", "Venue": "The Lost Church", "moreBioInfo": "Cuchulain (pronounced \"ka-HOO-lin\") is a singer-songwriter and multi-instrumentalist. The name (yes, his real, legal name, shared a character in Irish mythology) says as much about him as it does his music: unique, creative, lyrical, and story-driven. Cuchulain's tongue-in-cheek wit and activist spirit emerge from his carefully crafted lyrics, drawing comparisons to artists like John Prine, Randy Newman, and Johnny Cash. His self-titled debut album, released in 2017, has been most appreciated for its entrancing story-telling and rich and often surprising compositions, with more instruments than you can count, most of them played by Cuchulain himself. Cuchulain is rapidly developing a cross-country following, with experiences living and performing in places as disparate as Washington, DC, and San Francisco, California. His bass-baritone melodies will capture the attention of any listening room and leave them laughing and crying the whole way home.", "otherInfo": "No other event info available"}, {"Address": "101 W Main St, Los Gatos, CA 95030", "Artist": "Them Slack Jawed SOB's ", "ArtistImage": "https://photos.bandsintown.com/thumb/9995686.jpeg", "Coordinates": [-121.983074, 37.221881], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "2:30 AM UTC", "Venue": "Los Gatos Coffee Roasting Company", "moreBioInfo": "No artist bio available", "otherInfo": "Playing a raw, semi-acoustic show featuring originals and country classics coated in a thick layer of Slack Jawed Sons of Bitches grease!\n\nThe ever amazing, Special Guest, will be opening the show once again!\n\nAll ages.\n\nNo cover.\n\nBeer. Wine. Coffee.\n\nLiquor across the street (Cary Nations) and around the corner (Los Gatos Soda Works)."}, {"Address": "1801 E Cotati Ave, Rohnert Park, CA 94928", "Artist": "Maria Schneider ", "ArtistImage": "https://photos.bandsintown.com/thumb/9174678.jpeg", "Coordinates": [-122.673536, 38.340121], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Big Band, Classical, Classical Crossover, Jazz", "Time": "2:30 AM UTC", "Venue": "Sonoma State University", "moreBioInfo": "Maria Schneider’s music has been hailed by critics as “evocative, majestic, magical, heart-stoppingly gorgeous, and beyond categorization.” She and her orchestra became widely known starting in 1994 when they released their first recording, Evanescence. There, Schneider began to develop her personal way of writing for what would become her 18-member collective, made up of many of the finest musicians in jazz today, tailoring her compositions to distinctly highlight the uniquely creative voices of the group. The Maria Schneider Orchestra has performed at festivals and concert halls worldwide. She herself has received numerous commissions and guest-conducting invites, working with over 90 groups in over 30 countries.\n\nSchneider’s music blurs the lines between genres, making her long list of commissioners quite varied, stretching from Jazz at Lincoln Center, to The Saint Paul Chamber Orchestra, to collaborating with David Bowie. She is among a small few to have received GRAMMYS in multiple genres, have received the award in both jazz and classical categories, as well as for her work with David Bowie.\n\nSchneider and her orchestra have a distinguished recording career with twelve GRAMMY nominations and five GRAMMY awards. Unique funding of projects has become a hallmark for Schneider through the trend-setting company, ArtistShare. Her album, Concert in the Garden (2004) became historic as the first recording to win a GRAMMY with Internet-only sales, even more significantly, it blazed the \"crowd-funding\" trail as ArtistShare’s first release. She’s been awarded many honors by the Jazz Journalists Association and DOWNBEAT and JAZZTIMES Critics and Readers Polls. In 2012, her alma mater, the University of Minnesota, presented Schneider with an honorary doctorate. ASCAP awarded her their esteemed Concert Music Award in 2014. And in 2019, the National Endowment for the Arts bestowed on Schneider the nation's highest honor in jazz, naming her an NEA Jazz Master.\n\nSchneider has become a strong voice for music advocacy and in 2014, testified before the US Congressional Subcommittee on Intellectual Property about digital rights. She has also appeared in CNN, participated in round-tables for the United States Copyright Office, and has been quoted in numerous publications for her views on Spotify, Pandora, YouTube, Google, digital rights, and music piracy.\n\nA collaboration with her orchestra and David Bowie resulted in his single called, \"Sue (Or In A Season of Crime),” and brought Schneider a 2016 GRAMMY (Best Arrangement, Instruments and Vocals). Schneider and her orchestra also received a 2016 GRAMMY for The Thompson Fields (Best Large Jazz Ensemble Album). Their next recording project, Data Lords, is underway (2019) through ArtistShare and is set to be released April 1, 2020.", "otherInfo": "No other event info available"}, {"Address": "201 Van Ness Ave, San Francisco, CA 94102", "Artist": "Teddy Abrams ", "ArtistImage": "https://photos.bandsintown.com/thumb/6264505.jpeg", "Coordinates": [-122.419994, 37.777441], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Davies Symphony Hall", "moreBioInfo": "Teddy Abrams is an American conductor, composer, pianist, and clarinetist.", "otherInfo": "This week, the San Francisco Symphony brings together two composers—one past and one present—for an inspired pairing of audience favorites. Guest conductor Teddy Abrams leads the orchestra in the West Coast premiere of Philharmonia Fantastique by the internationally renowned Bay Area composer Mason Bates. A fixture as a DJ in the splashiest nightclubs around town, Bates turns his ear for layering sound, rhythm and texture upon the infinitely variable palette of the symphony orchestra (plus a pair of laptops). Bates' work appears side-by-side with another master musical colorist—but in a nineteenth-century aesthetic—Tchaikovsky, who delivers a volcanic rush of irresistible melodies in his thundering Symphony No. 5.\n\nConductor/Performers\n\nTeddy Abrams\nconductor\n\nSan Francisco Symphony\nProgram\n\nBarber\nSecond Essay for Orchestra\n\nMason Bates\nPhilharmonia Fantastique: The Making of the Orchestra West Coast Premiere, SFS Co-commission\n\nTchaikovsky\nSymphony No. 5"}, {"Address": "3700 Middlefield Rd, Palo Alto, CA 94303", "Artist": "Liberty Ellman ", "ArtistImage": "https://photos.bandsintown.com/thumb/7728647.jpeg", "Coordinates": [-122.113309, 37.423261], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Jazz Guitar, Jazz", "Time": "3:00 AM UTC", "Venue": "Mitchell Park Community Center", "moreBioInfo": "Based in Brooklyn New York, guitarist / composer Liberty Ellman has performed and or recorded with a host of stand out creative artists including: Joe Lovano, Myra Melford, Wadada Leo Smith, Butch Morris, Vijay Iyer, Steve Lehman, Greg Osby, Rudresh Mahanthappa, JD Allen, Nels Cline, Somi, Matana Roberts, Ledisi, Michele Rosewoman, Adam Rudolph, Barney McAll, Okkyung Lee, Mary Halverson, and Ches Smith. Other projects of interest include working with Jason Moran on Luanda Kinshasa, a video installation by visionary filmmaker Stan Douglas, and a performance in John Zorn's Bagatelles series.\n\nMr. Ellman is perhaps best known for his long tenure in Henry Threadgill's groundbreaking ensemble, Zooid. The group has recorded several critically lauded albums. Their most recent recording \"In For A Penny, In For A Pound\" earned a Pulitzer prize. In addition to playing guitar, Mr. Ellman is credited as producer and mixing engineer on that recording. He has mixed and mastered many other recordings as well, including Gregory Porter's \"Be Good,\" which was nominated for a Grammy.\n\nEllman has released 4 of his own critically acclaimed albums: Orthodoxy, Tactiles, Ophiuchus Butterfly, and 2015’s Radiate on Pi Recordings. His compositional style has been described as \"At once highly controlled and recklessly inventive,” and the Wall Street Journal said: “Ellman, along with his peers, is helping to define post millennial jazz.” Voted #1 Rising Star Guitarist in the 2016 Downbeat Critics Poll, he was also honored in the 2015 Jazz Times expanded critics poll, as one of the four guitarists of the year alongside Bill Frisell, John Scofield and Julian Lage.\n\nLiberty Ellman has also worked beyond the jazz world: hip hop artists Midnight Voices, and The Coup, dance producer DJ Joe Claussell, and worked on remixes of N'Dea Davenport, Chico Freeman, Ann Dyer, Ayo and others. He also made an appearance on the Grammy nominated Groove Collective record, People People Music Music.", "otherInfo": "No other event info available"}, {"Address": "1001 B St, Hayward, CA 94541", "Artist": "Bigelow's Treehouse ", "ArtistImage": "https://photos.bandsintown.com/thumb/6959682.jpeg", "Coordinates": [-122.082413, 37.672754], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Classic Rock, Funk", "Time": "3:00 AM UTC", "Venue": "The Bistro", "moreBioInfo": "Since it's incarnation in 2008, Bigelow's Treehouse has performed in all types of venues in every major city across California and has shared the stage with Bay Area legends such as Tia Carroll and Little Wolf & The Hellcats.\n\nBigelow's Treehouse is currently recording their debut album.\n\nEqually comfortable on a large stage or an intimate coffee house, Bigelow's Treehouse can power through an upbeat blues shuffle with the same ease with which it can lay down a slick Meters style funk groove.", "otherInfo": "No other event info available"}, {"Address": "561 1st St, Brentwood, CA 94513", "Artist": "Jeffrey James Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9013551.jpeg", "Coordinates": [-121.693812, 37.931203], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Blues", "Time": "3:00 AM UTC", "Venue": "The Mannheim Social Club", "moreBioInfo": "Jeffrey James is an american blues and rock guitarist/singer/songwriter, based in the San Francisco Bay Area. Born Jeffrey James Horan in Santa Clara, CA. in 1986. Jeffrey has been playing guitar for 25 years. Professionally for 17 years. He started playing gospel music as preteen at his families church. In high school Jeffrey started playing traditional blues and soul music with local bay area artists. It was at this time that his talent had progressed to a level that was to be desired and started his professional career. At 15 years old Jeffrey joined force with the son of the legend John Lee Hooker. As guitarist for John Lee Hooker, Jr. he was featured on 2 Grammy Nominated albums in 2004 and 2009. In the last 10 years Jeffrey has been touring with John Lee Nationally and Internationally. Sharing the stages with the likes of B.B King, Buddy Guy, Santana, Lenny Kravitz, and with The Rolling Stones last year in 2017. In the last few years Jeffrey has been working on a solo career making his way into position as the front man. Jeffrey's passion is in blues and rock music but you can hear the influence of country, gospel, and funk seasoned throughout his guitar styling. Jeffrey James describes his sound as modern blues. Live shows are an energetic, powerful, and dynamic with catchy originals and smoking covers. Some of Jeffrey's influences are B.B. King, Albert KIng, Buddy Guy, Jimi Hendrix, The Vaughan Brothers, Prince, Eric Gales, Richie Kotzen, Luther and Bernard Allison.", "otherInfo": "No other event info available"}, {"Address": "3101 Shattuck Ave, Berkeley, CA 94705", "Artist": "Earles of Newtown ", "ArtistImage": "https://photos.bandsintown.com/thumb/9293079.jpeg", "Coordinates": [-122.265906, 37.852987], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The Starry Plough Pub", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "752 Natoma St, San Francisco, CA 94103", "Artist": "Hannah Levy MUSIC ", "ArtistImage": "https://photos.bandsintown.com/thumb/10099338.jpeg", "Coordinates": [-122.413155, 37.775879], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Funk, R&b, Balkan, Vocal, Harmony Group, Jazz", "Time": "3:00 AM UTC", "Venue": "Scout’s Artillery", "moreBioInfo": "No artist bio available", "otherInfo": "TELEPATHIC CHILDREN will move your feet and pump your pulse and turn you gayer than you have ever been! *SINGLE RELEASE PARTY*\n\nLITTLE ARCS will melt your heart and turn your ears a lil inside out only to turn them right again! Vocals and a drum machine to make you laugh n cry!\n\n\nOther acts TBA.\nSuggested donation at the door."}, {"Address": "752 Natoma St, San Francisco, CA 94103", "Artist": "Little Arcs ", "ArtistImage": "https://photos.bandsintown.com/thumb/9075703.jpeg", "Coordinates": [-122.413155, 37.775879], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Chamber Pop, Math Rock, Harmony Group, Vocal Music, Dream Pop, Progressive Alternative", "Time": "3:00 AM UTC", "Venue": "Scout’s Artillery", "moreBioInfo": "No artist bio available", "otherInfo": "Telepathic Children and Little Arcs and TBA IRL!"}, {"Address": "2128 Railroad Ave, Livermore, CA 94550", "Artist": "Shane Dwight ", "ArtistImage": "https://photos.bandsintown.com/thumb/8999662.jpeg", "Coordinates": [-121.770686, 37.68337], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Southern Rock, Rock", "Time": "3:00 AM UTC", "Venue": "Railroad Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Eric Roberson ", "ArtistImage": "https://photos.bandsintown.com/thumb/9037148.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Soul, R&b", "Time": "3:00 AM UTC", "Venue": "Yoshi's Oakland", "moreBioInfo": "http://www.EricRobersonMusic.com http://www.Twitter.com/IamEricRoberson http://www.twitter.com/ErroFam", "otherInfo": "Yoshi's Oakland Presents Eric Roberson"}, {"Address": "308 Main St, Vacaville, CA 95688", "Artist": "Rachel Steele ", "ArtistImage": "https://photos.bandsintown.com/thumb/8392760.jpeg", "Coordinates": [-121.989455, 38.356373], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Country", "Time": "3:00 AM UTC", "Venue": "Theatre DeVille", "moreBioInfo": "Rachel Steele, the energetic and “sassy” singer/songwriter brings her pristine vocals and her A-game to every performance. It’s obvious by the way she works the stage, the crowd, and interacts with band members that she’s the ultimate performer. Winner of the 2013 SAMMY award ( Sacramento Area Music Award). The Sacramento News & Review’s Sammie award is determine by votes from readers and fans throughout the Sacramento region. After tallying the thousands of votes this year, Rachel Steele and her band Road 88 won the award for best Americana/Alternative Country band.\n\nRachel has opened for country music greats like Alabama, Big & Rich, Gretchen Wilson, Trace Adkins, The Oak Ridge Boys, Wynonna, Jason Michael Carol and Mark Chesnutt, Confederate Railroad, Jon Pardi, Joe Nichols, Love & Theft, Cowboy Troy and the Marshall Tucker Band.\n\nRachel also has had the privilege of playing events for Facebook and Bogle winery not to mention all of the fairs and festivals.\n\nLook for Rachel’s new CD Stupid Love early in 2018.", "otherInfo": "No other event info available"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "The Coffis Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9521289.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "Terrapin Crossroads", "moreBioInfo": "The Coffis Brothers & The Mountain Men are a rootsy rock n’ roll band born and raised in the Santa Cruz Mountains. Influenced by those early surroundings, songwriters Jamie and Kellen Coffis’ blend of folk, blues, R&B and straight-ahead rock is evidence an upbringing spent listening to all of the right records from Tom Petty, Neil Young, and The Beatles.\n\nOn their third full-length album, Roll With It, The Coffis Brothers put that rock into overdrive, looking ahead to the good things coming and suffering no fools. First single “You Ain’t Got the Heart” is a barn burner and a fan favorite, having already been part of the band’s live set for a couple of years. “There’s a little bit of that sense of angst and that sort of ‘I don’t need this’ attitude,” says Kellen Coffis, “but don’t overthink this one.”\n\nNot that there isn’t plenty to think about on Roll With It. Tracks like “Bad Luck” and “Better Days” reflect on how to live with and learn from rough times, while “You and Me” is a testament to how people can make it through these things together. But on every song, The Coffis Brothers & the Mountain Men stay true to a rock sound that draws from Southern grit and California hills.\n\nRoll With It was recorded on analog tape over a week at Barefoot Studios in Hollywood with producer Andy Zenczak and engineer Cian Riordan. The band’s near-constant touring throughout California and elsewhere has earned them not only devoted fans, but lots of critical praise as well:\n\n“The Coffis Brothers & the Mountain Men have developed a sound that has an easy rock vibe that’s actually hip.” – San Francisco Chronicle\n\n“The Coffis Brothers mix a blend of folk, country and rock with the intensity of personal lyrics into a gritty and often tender harmony of sound… a show that delivers one part Avett Brothers and one part early Neil Young for a full night of dancing and fun.” – Santa Cruz Weekly\n\nJamie and Kellen are joined by Kyle Poppen on lead guitar, Aidan Collins on bass and Sam Kellerman on drums. Their debut self titled full-length album was released in 2011 and was followed by 2012’s Waiting For You EP and 2014’s Wrong Side of the Road.", "otherInfo": "No other event info available"}, {"Address": "460 Capistrano Rd, Half Moon Bay, CA 94019", "Artist": "J.Lately ", "ArtistImage": "https://photos.bandsintown.com/thumb/8836108.jpeg", "Coordinates": [-122.48613, 37.504998], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Hip-hop, Hip Hop", "Time": "3:00 AM UTC", "Venue": "Old Princeton Landing Public House & Grill", "moreBioInfo": "J.Lately distinguishes himself as an emcee with his soulful style and laid back flow. A true appreciation for music along with the unique ability to put everyday life into a relatable perspective has allowed him to flourish in the local Bay Area scene and beyond. His music possesses the rare ability to make you contemplate and vibe out simultaneously, finding the perfect balance between the conscious and the stoner. Coming from the small town of Sebastopol, and having split time between Oakland and Southern California, his influences are eclectic and mesh together effortlessly to form his own individual style. A relentless drive has kept Lately on tour across the country with artists such as Zion I, Locksmith, and A-Plus of the Hieroglyphics. He has released multiple solo and collaborative projects, with his most recent solo release, Be Fucking Happy, garnering the attention of many notable blogs and listeners alike.\n\nGo to www.justlatelymusic.com for more information, updates, and releases.", "otherInfo": "No other event info available"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Nicole Atkins ", "ArtistImage": "https://photos.bandsintown.com/thumb/8974664.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Rock N Roll Epic", "Time": "3:00 AM UTC", "Venue": "Cafe Du Nord", "moreBioInfo": "In each song she creates, Nicole Atkins reveals her incredible power to transport listeners to a much more charmed time and space. On Italian Ice, the New Jersey-bred singer/songwriter conjures the romance and danger and wild magic of a place especially close to her heart: the Jersey Shore in all its scrappy beauty. Inspired by the boardwalk’s many curiosities—the crumbling Victorian mansions, the legendary funhouse, the Asbury Park rock-and-roll scene she played a key part in reviving—Atkins transforms her neverending fascination into a wonderland of her own making.\n\nFor help in capturing the shore’s kinetic spirit, Atkins assembled a studio band whose lineup feels almost mythical. Recorded at the iconic Muscle Shoals Sound Studio in Alabama, Italian Ice finds the Nashville-based artist joined by Spooner Oldham and David Hood (both members of The Muscle Shoals Rhythm Section, who played on classic records from the likes of Aretha Franklin and Etta James), Binky Griptite of The Dap Kings, Jim Sclavunos and Dave Sherman of The Bad Seeds, and drummer McKenzie Smith (St. Vincent, Midlake). With special guests including Spoon frontman Britt Daniel, Seth Avett of The Avett Brothers, Erin Rae, and John Paul White, the album is a testament to Atkins’s uncommon talent for uniting musicians of radically different sensibilities. As Atkins explains, the abundance of collaborations on Italian Ice partly stems from a freak accident in which she stumbled into a sinkhole in a Knoxville parking lot—an incident that left her with a profound longing to fill her life with the people and experiences that bring her the most joy.\n\nCo-produced by Atkins and Ben Tanner of Alabama Shakes, Italian Ice makes brilliant use of its A-list personnel, unfolding in a kaleidoscopic sound that Atkins likens to “an acid trip through my record collection.” At turns as opulent as symphonic pop and gritty as garage punk, the album wanders into shades of psych-rock and honky-tonk and girl-group melodrama, endlessly spotlighting the tightly honed musicianship and unbridled originality at heart of Atkins’s artistry.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Skerik Skerik ", "ArtistImage": "https://photos.bandsintown.com/thumb/6051336.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Punk, Jazz", "Time": "3:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "skerikmusic.com", "otherInfo": "2 nights April 17 and 18!!"}, {"Address": "99 Grove St, San Francisco, CA 94102", "Artist": "Champagne Drip ", "ArtistImage": "https://photos.bandsintown.com/thumb/8996159.jpeg", "Coordinates": [-122.417316, 37.778083], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Electronic", "Time": "3:00 AM UTC", "Venue": "Bill Graham Civic Auditorium", "moreBioInfo": "Champagne Drip, the newest musical incarnation of Los Angeles-based producer Sam Pool, was born out of a philosophy that innovation springs from inspiration. Pool had carved out a unique place for himself in the bass music community; performing under the moniker of SPL for over 10 years and releasing drum & bass, dubstep, and trap-oriented music on respected labels such as Barcode, Tech Itch, Evol Intent, Sub Human, Rottunn, and SMOG Recordings. SPL’s music was fully immersed in sound design, a musical landscape comprised of melodic, dark, and refined touches. By the Summer of 2014, Pool came to the realization that he had pushed the SPL project to its sonic boundaries and in order to evolve musically, he would need a new project to explore lighter textures and richer melodies. Rooted in jungle and bass music and built around elements of blippy 8-bit sounds, arpeggios, and lush 80s synths, Champagne Drip launched as a decidedly tropical and uplifting sounding project. Operating at first in anonymity, Champagne Drip made a big splash thru the release of official remixes of Bassnectar (Amorphous Music) and Elliphant (Mad Decent). Shortly thereafter, he released his debut EP “Radio Bikini” on Mad Decent in September of 2014. Over the first year of the project’s history, press outlets were fascinated with the unique sound, but also with uncovering the identity of the secretive producer behind the music. “Radio Bikini” was subsequently remixed by electronic upstarts Big Wild, Lazerdisk, Mayhem, and Son of Kick and released in the Spring of 2015 as “Remix Bikini”. In the Fall of 2015, Champagne Drip released his 2nd EP for Mad Decent, “Journey Into The Champagne Sea”. Whereas his first EP explored more overtly tropical overtones, “Journey” went into deeper and darker musical territory. After spending one full year refining his sound in the studio, he finally revealed himself as the former SPL in 2016; performing across the US at such festivals as Mysteryland, WTFest?, Imagine, Enchanted Forest, and Lights All Night. Building up anticipation for his next original recordings, Champagne Drip released the stand alone single “Open Your Eyes”, which was featured on the official Bernie Sanders Presidential campaign fundraising compilation “Rave4Bernie”. Official remixes for Grandtheft (Mad Decent), Cardinox (Warner Brothers), and Dillon Francis & NGHTMRE (Mad Decent) followed. Champagne Drip capped off an already busy 2016 with the release of two new EPs; “Poseidon” via Quality Goods Records and “Of Course I Still Love You” via Saturate Records. Official remixes for Zeds Dead & Diplo, UZ, and DAWN all saw early 2017 releases. Champagne Drip is set to have his biggest year yet in 2017, with multiple EPs scheduled for release on Deadbeats Records as well as forthcoming remixes for 12th Planet and Mayhem, which are due for Summer releases. https://twitter.com/champagnedrip https://soundcloud.com/champagnedrip https://www.instagram.com/champagnedrip Bookings: champagnedripbookings@gmail.com", "otherInfo": "No other event info available"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Dilated Peoples ", "ArtistImage": "https://photos.bandsintown.com/thumb/8130142.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Hip-hop", "Time": "3:00 AM UTC", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "Directors Of Photography | New Album http://rse.lnk.to/DilatedDirectors | Management: Kevin Zinger - Info@Regimeinc.com | Tour Dates: http://rhymesayers.com/dilatedpeoples", "otherInfo": "The UC Theatre Presents: Little Brother & Dilated Peoples with Zion I"}, {"Address": "314 11th St, San Francisco, CA 94103", "Artist": "Andy Moor ", "ArtistImage": "https://photos.bandsintown.com/thumb/9034530.jpeg", "Coordinates": [-122.413904, 37.771448], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Progressive Electronic, Trance, Electronica, Ambient", "Time": "4:00 AM UTC", "Venue": "Halcyon SF", "moreBioInfo": "DJ, Producer, Musician - UK", "otherInfo": "No other event info available"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Scott Pemberton Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8652402.jpeg", "Coordinates": [-122.433417, 37.784563], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Psychedelic, Funk, Blues, Rock, Soul-jazz, Rnb-soul, R&b/soul", "Time": "4:00 AM UTC", "Venue": "Boom Boom Room", "moreBioInfo": "Scott is an emerging force on the festival circuit, with his wild approach to the guitar and nimble funky band he is immediately recognizable and undeniably original. He doesn’t use a strap, often plays the guitar like someone would play piano and performs with the uninhibited joy and intensity of someone who recognizes that every time we make music is an honor and a gift.\n\nPemberton's sound is much like the vibe of his native Portland: freaky, fun and just the right amount of weird. The best way to categorize his music is with the moniker “Timber Rock”. Scott naturally applies his own lens/stamp to the sounds of the Pacific North West, the region he has always called home. The deep jazz, NW rock/grunge, blues roots and the west coast funk. It’s all there, and often all in the same song. Listeners are finding this honest, original and to-the-point music refreshing and fun.\n\nThe latest LP “Timber Rock” style has been very well received. He has placed #4 on Billboards Tastemaker Chart, #1 on Portland Pop Charts and has been making waves at clubs and festivals nationwide generating press headlines such as:\n\n\"The Bruce Lee of Guitar” - Tahoe Onstage\n“A modern day Jimi Hendrix” - Chico Enterprise\n“It’s not everyday someone can convey joy while digging deep” - Glide Magazine\n“A stand out artist at this year’s High Sierra Music Festival” - Relix Magazine", "otherInfo": "No other event info available"}, {"Address": "1030 Main St, Napa, CA 94559", "Artist": "SOUL SKA ", "ArtistImage": "https://photos.bandsintown.com/thumb/9555947.jpeg", "Coordinates": [-122.285583, 38.29958], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Ska Revival, Reggae, Ska, Soul", "Time": "4:00 AM UTC", "Venue": "JaM Cellars Ballroom", "moreBioInfo": "Featuring members of Vinyl, Monophonics, Stymie and The Pimp Jones Luv Orchestra, The Right Time, Jethro Jeremiah Band, and El Radio Fantastique. We play 1st and 2nd wave Jamaican and UK Ska classics, from the Skatalites, Don Drummond, Prince Buster, The Specials, Madness, The Selector, The Wailers...and hell of a lot more. It's a 10-piece all star Ska-Tribute Juggernaut! 3 singers and a 3 piece horn section and full rhythm section...Look Out!\"", "otherInfo": "SOUL SKA, GRASS CHILD, AND RAMBLE: RYAN SNYDER BENEFIT CONCERT\n\nJaM Cellars Ballroom at Margrit Mondavi Theatre\n\nThis inaugural concert, being headlined by Soul Ska and graciously supported by Grass Child and Ramble is a fundraiser to benefit the Brayden Snyder Trust, which was set up by his father, Ryan C. Snyder. Ryan was an integral part of live event production, especially within the music industry in both the Bay Area and Ohio. His family and friends miss him and have banded together to honor his wish to help take care of his son.\nFrom Indie, to Jam Band to Ska, this concert promises to be a fun night celebrating our shared love of music!\nHope you will join us for a great night of entertainment featuring some of the Bay Area’s finest musicians and the best part is, it is also for a good cause.\nSee you at the show!\nSOUL SKA is a 9-piece San Francisco Bay Area Ska/Rocksteady collective formed in 2014 dedicated to keeping SKA music alive! The band serves up a high-energy mix of original & 1st and 2nd wave Jamaican/UK ska classics.\nGrass Child a local homegrown group celebrating over a decade performing groove/ska/funk to local audiences and receiving numerous invitations for mainstage performances at regional festivals and engagements in support of headline acts such as The Cure, No Doubt, The Avett Brothers, Ziggy Marley, Gregg Allman, Los Lonely Boys, Los Lobos, Blues Traveler, Michael Franti and Spearhead, The Cold War Kids, Houndmouth, Ozomatli, Jimmy Cliff and many more\nRamble are an indie-rock band from Napa. They started writing music influenced by their different life experiences and musical preferences from surf rock to pop and psychedelic rock. Collectively they achieve a sound unmatched in uniqueness and spirit.\nJaM Cellars Ballroom is UPSTAIRS in the historic Napa Valley Opera House in Downtown Napa\n\nThis show is General Admission.\nFLOOR: $18 Advance / $20 Day of Show ( Standing)\nBALCONY ACCESS: $25 (Standing with limited seating)\n\nEach person does require a ticket for entry.\n\nWe welcome ages 8+ (with children under 16 accompanied by an adult).\n\nNo Refunds. No professional cameras or outside food and drink.\n\nThere is a Bar available for drink purchases. Patrons attending a show upstairs in the Ballroom are welcome to dine downstairs in the Blue Note club restaurant if there is seating available.\n\nDue to the historic nature of the Ballroom, there are no bathrooms located upstairs. Facilities are located downstairs through the Blue Note Club and are accessible via stairs or the elevator.\n\nEar Plugs are available for free at the Box Office.\n\nIf you have a specific concern or accessibility request for an upcoming event, please contact our Box Office in advance so we may best accommodate your needs.\n\nThank you, and we look forward to seeing you at the JaM Cellars Ballroom!\n\n1030 Main Street, Napa CA 94559\n\nBox Office: 707.880.2300 (Wed-Sat, 2:30-9:00 pm, Sun 1 hr before doors)"}, {"Address": "311 Broadway, Oakland, CA 94607", "Artist": "Brume ", "ArtistImage": "https://photos.bandsintown.com/thumb/9422666.jpeg", "Coordinates": [-122.276005, 37.797178], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Metal, Chillwave, Darkwave", "Time": "4:00 AM UTC", "Venue": "Elbo Room Jack London", "moreBioInfo": "Brume are a San Francisco-based doom metal trio who combine the weight of Black Sabbath’s pioneering distorted riffs with the graceful beauty of singers like Bjork and Portishead’s Beth Gibbons. While they set the tone for greatness with their first pair of crushing releases, the group’s forthcoming Magnetic Eye debut ‘Rabbits’ showcases a band at their tightest, most creative, and ready to take the metal underground by storm. Put on tracks like the expansive “Lament” and settle in to experience the hypnotic sonic catharsis that awaits when the record makes its world debut on November 9th.\n\nBUY OUR DIGITAL ALBUMS HERE:\nhttp://brumesf.bandcamp.com/album/donkey", "otherInfo": "Holy Grove returns to the Bay!"}, {"Address": "243 O’Farrel Street, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Cabaret, Broadway, Cover Songs, Singer Songwriter", "Time": "4:00 AM UTC", "Venue": "Johnny Foley's Dueling Piano Show", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs.\n?\nHis theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City.\n?\nHe is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page.\n?", "otherInfo": "Dueling Piano Show (21+)"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Stanton Moore ", "ArtistImage": "https://photos.bandsintown.com/thumb/7999914.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Jazz, Funk", "Time": "4:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Born and raised in New Orleans, Stanton Moore is a dedicated drummer and performer especially connected to the city, its culture and collaborative spirit. Driven and inspired by the thriving music scene of his hometown which includes such greats as Professor Longhair, Doctor John and The Meters, Moore’s name is now mentioned amongst these Big Easy mainstays.\n\nIn the early ‘90s, Moore helped found the New Orleans-based essential funk band Galactic. Their first album, 1996’s widely acclaimed Coolin’ Off, led to an intense tour schedule of nearly 200 gigs a year for the next ten years. Building on their fan base by adding an esteemed list of all-star collaborations to the six albums that followed, Galactic continues to amass a worldwide audience via recording and touring globally.\n\nMoore launched his solo career in 1998 aided by eight-string guitar virtuoso Charlie Hunter and saxophonist Skerik (Les Claypool, John Scofield, Roger Waters). The group recorded All Kooked Out! featuring a handful of local New Orleans musicians as well.\n\nIn the midst of these recording sessions yet another concept was taking shape. Outtakes turned into the first Garage a Trois release, Mysteryfunk (1999). In 2000 the trio, led by Moore behind the drum kit, was joined by percussionist Mike Dillon (Les Claypool, Ani DiFranco) and has since released three more albums – Emphasizer in 2003, Outre Mer in 2005 and Power Patriot in 2009.\n\nMoore extended his solo discography with the release of Flyin’ the Koop (Verve/Blue Thumb) in 2001, and III (Telarc) in 2006. Following the latter Modern Drummer called Moore’s trademark sound “infectious, jazz-meets-Bonham, nouveau second-line.” Recorded at the legendary Preservation Hall in New Orleans, III featured organist Robert Walter (Greyboy Allstars, The Head Hunters) and guitarist Will Bernard (T.J. Kirk, Doctor Lonnie Smith) as the Stanton Moore Trio, with special guests Skerik and trombonist Mark Mullins (Galactic, Bonerama, Harry Connick, Jr., Better Than Ezra).\n\nIn 2008, Moore looked to continue his scaled back session crew with Walter and Bernard to record Emphasis! (on parenthesis). Says Moore, “When it came time to do another record, I had already known for a while that I wanted to build on the momentum of this band – three musicians who were becoming a unit unto themselves – and I wanted to get a little more adventurous with the music itself.”\n\nIn April 2010, Moore releases Groove Alchemy. The 12-track set is the culmination of Moore’s multimedia project that also includes an instructional book and DVD of the same name. All three facets of the project are designed to explore the roots of funk drumming by examining the work of pioneers like Jabo Starks, Clyde Stubblefield, and Zigaboo Modeliste – each of whom made their mark at different times throughout the 1960s as the engines driving James Brown’s and the Meters’ legendary rhythm sections – and in turn tracing their influences back to the rhythms coming out of New Orleans in the earlier part of the 20th century. Recorded at Levon Helm’s studio in Woodstock, NY, this project is the follow up to the widely acclaimed Take it to the Street DVD and book that focused specifically on New Orleans drumming styles.\n\nShowing his outstanding versatility, Moore has appeared on Heavy Metal Grammy nominees Corrosion of Conformity’s In the Arms of God, Irma Thomas’ After the Rain (winning a grammy in the process), Robert Walter’s Super Heavy Organ, Tom Morello (Rage Against the Machine) and Boots Riley’s (the Coup) Street Sweeper Social Club, Will BernarDiane Birch’s Bible Belt, Alec Ounsworth’s (Clap Your Hands Say Yeah) Mo Beauty. He continues to play dates globally with an ever-evolving cast of musicians including John Scofield; Karl Denson; George Porter, Jr., and Leo Nocentelli (of the Meters); Charlie Hunter; Warren Haynes; John Medeski and Chris Wood (of Medeski, Martin and Wood); Donald Harrison Jr.; Dr. Lonnie Smith, Dr. John, Tab Benoit, Robert Walter; the New Orleans Klezmer All-Stars and the Preservation Hall Jazz Band to name a few.\n\nWith a bachelor’s degree in music and business from Loyola University, Moore stays involved in education by constantly giving clinics and teaching master classes and private lessons all over the world. He has been a contributing writer for Drum!, Modern Drummer, and DownBeat magazines here he was featured on the covers of more than six drum publications. In 2005, he launched a signature line of cymbals with Bosphorus Cymbals and a signature drumstick with the Vic Firth stick company. In 2009, Moore developed his own drum company to introduce his signature titanium snare drum that he designed in conjunction with Ronn Dunnett.\n\nDeeply affected by Katrina and its aftermath, New Orleans’ native son was quick to lend a hand by spearheaded the Tipitina’s Music Workshop, free Sunday seminars that cater to children and a rotating cast of well-known professionals to promote the preservation of New Orleans music. He also set up the Staletta Fund, a scholarship started by he and his wife Aletta to help cover costs for aspiring students to attend jazz camps, auditions and further their education.\n\nMoore stays active as a spokesperson for the Gulf Restoration Network and is a regular proponent of and player with the Voice of the Wetlands All-Stars. Additionally he serves on the board of directors for the Roots of Music, a free music education and academic mentoring program founded by Derrick Tabb, drummer for Rebirth Brass Band and recent nominee for CNN’s Heroes awards.\n\nGalactic’s next record Ya-ka-may was released February 2010, and Moore steps into the role of producer on Anders Osborne’s next record due out in April.", "otherInfo": "General Admission. All ages."}, {"Address": "30 S 1st St, San Jose, CA 95113", "Artist": "Dirtybeats ", "ArtistImage": "https://photos.bandsintown.com/thumb/8199801.jpeg", "Coordinates": [-121.889735, 37.335686], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Bass Music, Drumandbass, Trap, Bass House, Dubstep", "Time": "4:00 AM UTC", "Venue": "Elev8 Night club", "moreBioInfo": "San Jose, Ca based producer & Dj ( DirtyBeats ) is a veteran in the Bay area and the dubstep scene, with a cyberpunk style of hard hitting synths and massive bass.\n\nBelow is DirtyBeats EPK all hotlinks on the images are active.\n\nhttps://drive.google.com/open?id=0B01S911YqOmIRWhiTzRWUmtnS1VsT2k2UVdRNTVDa1FyU1Fv", "otherInfo": "After taking a quite long hiatus, Surface Lights is proud to be back with another huge show in the heart of downtown San Jose. Hosting @ Elev8 Nightclub which is the newest venue for bass parties and a wide spectrum of touring acts in the South Bay. Are you ready to join us?\nCome party at ELEV8 with the SL goons FRIDAY APRIL 17TH\n\n⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺\n\n★ 21+ Event – Doors open at 8:00 pm\n★ $10 tickets online or before 10:00 pm\n★ $15 after 10:00 pm\n\n⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺\n\nLINEUP\n▼▼▼▼\n\n- AB THE THIEF -\nhttps://soundcloud.com/abthethief\n\n- Send Help! -\nhttps://soundcloud.com/sendhelpmusic\n\n- BLAOW! -\nhttps://soundcloud.com/blaow_official\n\n- DirtyBeats -\nhttps://soundcloud.com/dirtybeatsss\n\n- Filthgrinder -\nhttps://soundcloud.com/filthgrinder\n\n- Smelly Shlaps -\nhttps://soundcloud.com/smellygotshlaps\n\n- Zero Excuse -\nhttps://soundcloud.com/zeroexcuse\n\n\nART & VENDORS\n\n☆ SpacePlace Collective ☆\nhttps://www.facebook.com/SpacePlaceCollective\n\n\nDRESS CODE ENFORCED\n- NO Sports Attire\n- NO Baggy Clothing\n- NO Hats\n- NO Tank Tops\n- NO White Tees\n- NO Boots"}, {"Address": "180 Eureka Sq, Pacifica, CA 94044", "Artist": "The Purple Ones - Insatiable Tribute to Prince ", "ArtistImage": "https://photos.bandsintown.com/thumb/9888001.jpeg", "Coordinates": [-122.48864, 37.63265], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Christian Houston - Keyboards, Tony Two Times Providence - Drums, Willie Adams - DJ/ BU Vocals, Levi Seacer Jr. - Musical Director/ Lead Guitar, Shane Cox - Trombone, Jamison Smeltz - Bari/ Tenor Sax, Morty Okin -Trumpet/Bandleader/Manager/Booking, Michael (Tiny) Lindsey - Bass, Derek Clark - Lead Vocals, Pamela Fields - Lead Vocals, Morgan Day - Guitar, Nick Ciardelli - Trumpet", "Time": "4:00 AM UTC", "Venue": "Longboard Margarita Bar", "moreBioInfo": "The Purple Ones is California's premier Prince tribute band and is a labor of love that was born in 2012\n\nOakland California’s The Purple Ones treat the music and patented vibe of Prince’s legacy with the utmost respect. The musical dexterity of The Purple Ones – with 12 pieces on stage including a full horn section - delivers their own spin on Prince’s (and other Prince related artists such as The Revolution, The New Power Generation, Sheila E., Morris Day & The Time and the general Minneapolis Sound) live onstage, as this funk machine, dance party has to be experienced to be believed!\n\nThe Purple Ones is a group of world-class musicians that carries out the Purple Legacy of the MUSIC. TPO is NOT a typical tribute band. There is no impersonator or look- a-like, nor do they dress up in goofy costumes or wigs.\n\nThe Purple Ones bring audiences to their feet, night after night, by speaking Prince’s musical language. energy, rhythm, creativity and of course…a serious dose of unadulterated funk. The Purple Ones tap into that soulful artistry like none other.\n\nThe Purple Ones is a labor of love that was born in 2012 when Bay Area based bandleader and founder, Morty Okin (“The New Morty Show”, co-founder of the Michael Jackson tribute “Foreverland” and Neil Diamond tribute “Super Diamond”,) decided to focus all of his energy on building the greatest Prince homage on the planet.\n\nThe Purple Ones have been packing concert venues since their inception, growing a fan base over the years that includes long time Prince devotees and newbies that are just discovering the icon. Recently, Brown Mark and Matt “Doctor” Fink from The Revolution performed with TPO onstage and is not uncommon for the band to be joined on stage by “Honorary Purple Ones” like celebrity “Super Fan,” comedienne Margaret Cho and members of the artist’s extended musical family, including renowned percussionist (and brother of Sheila E,) Juan Escovedo who toured the world with Prince in the 80’s, as well as Sheila E’s longtime saxophonist Eddie M.\n\nThe Purple Ones’ Musical Director is Prince’s former Musical Director, bassist/guitarist and co-founder (and current member) of Prince’s “New Power Generation,” Levi Seacer Jr. Levi was with Prince for many years and is the only Prince band member to have played multiple instruments. Later, collaborating with Prince as a songwriter and Co-Producer on his projects. Now the lead guitarist and Musical Director of The Purple Ones, Seacer is determined to continue the musical legacy of his late friend and former band mate. He says one of the biggest keys to the authenticity is the ‘controlled chaos” that existed in Prince’s world that allowed for extreme creativity, “With Prince,” Levi says, “you tried everything. That’s the biggest thing I learned from him over all those years. If it doesn’t work you can always take it out, but if it does work…there’s no limit.”", "otherInfo": "No other event info available"}, {"Address": "900 Marin St, San Francisco, CA 94124", "Artist": "Kruder & Dorfmeister ", "ArtistImage": "https://photos.bandsintown.com/thumb/10040461.jpeg", "Coordinates": [-122.386006, 37.749454], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "Ambient, Downbeat, Electronic, Dub, Drum Bass", "Time": "4:00 AM UTC", "Venue": "The Midway", "moreBioInfo": "K&D are two producers/djs/remixers whose distinctive trademark sound is at most times extremely mellow, has a lot of bass, downbeat tracks and a sense of epic soundscapes. There might be the occasional double-time breaks and the heavy and deep typically viennese feeling.\n\nConsider K&D to roam in their own, unique realm of musical beutekunst that owes and gives a lot to rare funk tunes, electric jazz arrangements, the feeling of deep soul, hiphop, dub, reggae, ambient, fusion, brazil, chansons, dope beats and drum+bass and still a lot more influences that happen to find the interest of the two austrians.\n\nAt a time when hip hopbeats started to emancipate themselves from the rapping and everyone started to pay highest attention to the blooming breakbeat scene in the UK, K&D broke through out of nowhere with one 4-track e.p. (G-stoned) that featured a hypnotic track called High Noon and a cover that showed the dj-duo in true Simon & Garfunkel form, straight out of Richard Avedon anno 1969.\n\nThe impact was massive, especially since the first wave of enthusiasm came from the UK where musical imports from the continent are seldom appreciated. Gilles Peterson played the track at first on his famous now called Worldwide-show.\n\nGathering momentum with support from people like Wall of Sounds Mark Jones and tracks for fellow Austrians Count Basic or strange people like William Orbit, the further story of K&D and Richard's Tosca project is well documented on various compilations and twelve inch releases. They met people like the Ninja tune posse, touched base with the leftfield dance, befriended Munich's Compost crew, remixed artists as diverse as Bomb the bass, Bones thugs & harmony, Alex Reece, United Future Organisation, Rockers Hifi (the K&D version was used in the video of \"Going under\"), Lamb, Roni Size, Depeche Mode and dj-ed in more clubs than you would care to count.\n\nBe it their self-produced tracks or the sound of their remixes, the K&D symptomatic feeling of lush european loungcore-dub pervaded all swift changes of the triphop hype and survived as a highly personal expression that found easy access into the world of drum&bass when the breakbeats became soulful.\n\nTheir regular presence in the club circuit, a characteristic side effect of their consistant travelling as djs, made them well-received guest at the various crossing of an international beat-set that took them from Vienna to London, to the American Westcoast, to Germany and back, with a tightly packed dj-bag full of remixes tracing their steps.\n\nA mix-CD compilation, DJ-kicks, for german label studio K7 marked a relevant change in the overall concept of K&D or rather in the way the audience seemed to take them in. From being well-respected underground heroes they had emerged to be full fledged media-celebrities in the music-press whose mix-CD was so excellently mixed and selected, that many new fans were attracted all over the world.\n\nK&D are maybe something like the continental answer to the british breakbeat or the american illbient scene, but then again their musical imprint is outernational anyway. They could achieve the special abstract global reputation that makes them neighbours to RockersHifi, Fila Brazilia, Howie B., DJ Shadow, the wordsound collective, Coldcut or the Thievery corporation in a virtual neighbourhood of twekwando-ing beatmeisters.\n\nBut, with a number of prolific dj-dates of K&D all around the world and the production and releases of Tosca and Peace Orchestra as well as numerous remixes, it seems unavoidable that there will be a lot of talk about Peter Kruder & Richard Dorfmeister.", "otherInfo": "No other event info available"}, {"Address": "144 Taylor St, San Francisco, CA 94102", "Artist": "The Freshmakers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9032581.jpeg", "Coordinates": [-122.41066, 37.783936], "Date": "Fri Apr 17 2020", "EventDate": "2020-04-17", "Genre": "R&b, Rock, Hip Hop, Country, Pop", "Time": "5:00 AM UTC", "Venue": "PianoFight", "moreBioInfo": "The Bay Areas newest top 40 band, rocking a range of hits from hip hop, pop, rock, and country. We keep it nostalgic, while keeping the crowd dancing.", "otherInfo": "No other event info available"}]