var sf_events = [{"Address": "100 Boyes Blvd, Sonoma, CA 95476", "Artist": "Clay Bell Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/11435204.jpeg", "Coordinates": [38.31334055, -122.4825827128851], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "", "Time": "6:30 PM", "Venue": "Sonoma Mission Inn, Clay Bell Solo", "moreBioInfo": "Keeping live music alive", "otherInfo": "Free outdoor show. Locals welcome."}, {"Address": "850 Main St , Napa, CA 94559", "Artist": "Michelle Lambert ", "ArtistImage": "https://photos.bandsintown.com/thumb/11280907.jpeg", "Coordinates": [38.298180157905485, -122.28451559473], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Female Vocals,Acoustic Folk Pop,Pop", "Time": "6:30 PM", "Venue": "Michelle at Napa City Nights", "moreBioInfo": "“Michelle Lambert is the kind of electric performer whose deep talent reveals itself in sly, knowing bursts. Whether it’s goosing the expectation of a breezy pop-country tune with a confident hip-hop-flavored flow, an aching desire slipping out from between the lyrics of a ballad, or the way Michelle dominates every inch of the stage before wielding her violin in classic rock goddess mode. Michelle Lambert is a genre-defying 21st century talent with a lot on her mind!” - Dennis Willis, Soundwaves TV", "otherInfo": "Napa City Nights is Featuring Michelle Lambert in their Lineup on July 16th! Bring a picnic and cheer on this Bay Area artist!\n\nRising star, Michelle Lambert, brings a wo..."}, {"Address": "2074 Second St, Livermore, CA 94550", "Artist": "Kruel Summer ", "ArtistImage": "https://photos.bandsintown.com/thumb/9209363.jpeg", "Coordinates": [37.6806732, -121.77004518948368], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Alternative,Reggae-pop,Indie Rock", "Time": "6:30 PM", "Venue": "KRUEL SUMMER @ Monica's Livermore ", "moreBioInfo": "KRUEL SUMMER is a new project based in San Jose, CA formed by previous members of The Holdup (Clev Stiles & Kyle Christensen). Also in the line up is Ben Dimmit, Sergio Elisondo and Shane Billings who make up the full official Kruel Summer lineup. Kruel Summer's sound follows a unique mix of of sounds which include influences of Reggae, Indie Rock and Hip Hop. The vision is to produce catchy, chill, sing along Summer vibes all year round. Lead singer Clev Stile’s lyrics follow the a “Dayfading Like it’s Summer Every Damn Day” mantra. Kruel Summer is currently in the studio working on their debut LP which is target to drop spring of 2020. The band is scheduled to drop 3 more singles by the end of the year leading up to the full LP album release. You can keep up with any updates by following Kruel Summer on Spotify or @kruelsummermusic on Instagram and Facebook. BACK THEN MUSIC VIDEO: https://youtu.be/mfdOObkV51E", "otherInfo": "KRUEL SUMMER LIVE AT MONICAS IN LIVERMORE\nWITH LOT49"}, {"Address": "201 Franklin St, San Francisco, CA 94102", "Artist": "Villalobos Brothers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8471615.jpeg", "Coordinates": [37.77636975, -122.4215395], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Latin Alternative,Folklore,Vocal Music,Mexican Traditions,New Acoustic,Native American,Folk Jazz,Acoustic,Jazz Fusion,Jazz Instrument,Folk,Latin Band,Latin", "Time": "7:00 PM", "Venue": "Villalobos Brothers at SF JAZS", "moreBioInfo": "VILLALOBOS BROTHERS The Villalobos Brothers have been acclaimed as one of today’s leading Contemporary Mexican ensembles.Their original compositions and arrangements masterfully fuse and celebrate the richness of Mexican folk music with the harmonies of jazz and classical music. The ensemble’s virtuosic performances have delighted audiences throughout Latin America, India, Russia, Canada and in more than 30 states across the US.They have performed in historic venues and events including Carnegie Hall, Lincoln Center, the Latin Grammy Awards, Davies Symphony Hall, Montreal Jazz Festival, the Ford Theatre in Hollywood, the 60th Anniversary of the United Nations, the New Victory, Theatre on Broadway,The San Jose Jazz Fest, Celebrate Brooklyn,the 66th FIFA Congress in Mexico City, the Blue Note Jazz Festival and the Apollo Theatre. In 2018, they joined forces with Arturo O’Farrill and the Afro Latin Jazz Orchestra for the “Fandango at the Wall” project. This ambitious undertaking, produced by Kabir Sehgal, united legendary international musicians for a live concert at the Tijuana - San Diego border wall which resulted in a live album and documentary film to be released in 2019. The Villalobos Brothers recently premiered their Symphonic Project, performing sold-out concerts with both the San Francisco Symphony Orchestra and the Walla Walla Symphony Orchestra. The ensemble has collaborated with legendary musicians including Grammy winners Dan Zanes, Ana Tijoux, Arturo O’Farrill, Antonio Sánchez, Regina Carter and Eduardo Magallanes. The Villalobos brothers are actively touring the United States, delivering a powerful message of love, brotherhood and social justice with brilliance, cadence and virtuosity. Their new album “Somos” will be released in 2019. PRESS: “Aliens of Extraordinary Ability…is the latest CD from these young brothers who grew up in Veracruz, Mexico, and now live in New York…a crazy ball of sound: Mexican coastal traditions meet Sam Cooke in the Bronx!” – Dan Zanes, Grammy Award Winner, USA TODAY. “I am glad I lived long enough to see you! This is amazing! All I can say is, I hope the world gets to experience this. Before starting you said something very important, you said: “we try to embody the miracle of music”…well, you certainly are a carrier of that disease…may we all catch it!…I don’t know what else to say, I am speechless!” – Marion J. Caffey, Producer of “Amateur Night” at the Apollo Theatre “I loved your style of music. The blend was amazing, the band was tight, it kept me going… I felt like I was part of the band, except I was sitting out here. I didn’t understand a word you were saying, but I felt it! where can I buy your CD? For real!” – Steve Pageot, Grammy Award Winner “Oh my God, that was fantastic! Let me tell you something, you guys transformed the environment of the venue…I was exactly where you wanted me to be. Your voices! You’re gonna get this reaction every time you play, and that is an amazing thing. Your music was a tidal wave of fire and it hit you really strong. You have excellent showmanship, but you also have the talent and skill to back it up” – Alicia Olatuja, Mezzo-Soprano “I’m speechless, I’m blown away…I have never seen anything like this before…” -Leital Molad, Senior Producer of WNYC Studio 360 “They played with exuberant intensity for the appreciative audience…with their heads bowed…fingers jumping and feet tapping, they weren’t just playing music, they were living it…” – Devan Sipher, THE FORWARD.", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "the Holding Company ", "ArtistImage": "https://photos.bandsintown.com/thumb/8070177.jpeg", "Coordinates": [37.7604879, -122.42120099500369], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Classic Rock,Rock,Psychedelic Rock", "Time": "7:00 PM", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "Big Brother and the Holding Company on The Chapel's Outdoor Stage"}, {"Address": "20990 Homestead Rd, Cupertino, CA 95014", "Artist": "Phantom Witch ", "ArtistImage": "https://photos.bandsintown.com/thumb/11473980.jpeg", "Coordinates": [37.3362844, -122.04016284434142], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Metal,Death Metal,Heavy Metal,Thrash Metal,Blackened Thrash Metal,Speed Metal", "Time": "7:00 PM", "Venue": "Homestead Bowl & The X Bar", "moreBioInfo": "Intense. Relentless. Thrash Metal. Bay Area, CA est. 2012", "otherInfo": "PinUp Productions Proudly Presents\nDoug Micko’s & Quentin Minor’s Birthday Bash\nFeaturing:\nPhantom Witch\nSection 5150\nHellbender\nFrolic\nHeavyskies\nHomestead Bowl & The X ..."}, {"Address": "2431 Central Ave, Alameda, CA 94501", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/9046383.jpeg", "Coordinates": [37.7638688, -122.24141457360267], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Comedy", "Time": "7:00 PM", "Venue": "Alameda Comedy Club w/ Laurie Kilmartin", "moreBioInfo": "Comedian", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Big Brother ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7604879, -122.42120099500369], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Hard Rock,Blues,Rock", "Time": "7:00 PM", "Venue": "The Chapel", "moreBioInfo": "Big Brother Is The Greatest TV Show EVER!!!! This Is Not An Artist [Please Tag This Right]", "otherInfo": "Big Brother and the Holding Company on The Chapel's Outdoor Stage"}, {"Address": "915 Columbus Ave, San Francisco, CA 94133", "Artist": "Grant Lyon ", "ArtistImage": "https://photos.bandsintown.com/thumb/6188983.jpeg", "Coordinates": [37.8029233, -122.4142026], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "", "Time": "7:30 PM", "Venue": "Cobb's Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "5104 Hopyard Rd, Pleasanton, CA 94588", "Artist": "Jess Hilarious ", "ArtistImage": "https://photos.bandsintown.com/thumb/9689469.jpeg", "Coordinates": [37.696154110691836, -121.90336504234801], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Comedy", "Time": "7:30 PM", "Venue": "Tommy T's Comedy Club", "moreBioInfo": "Jess Hilarious is one of the freshest and most highly sought after faces in comedy. Born and raised in Baltimore, Maryland, Jess is an accomplished stand-up comedian & Actress also known for her appearances on FOX’s REL, MTV's WILD N’ OUT, and has appeared on Russell Simmons’ ALL DEF COMEDY on HBO as well as various shows on VH1, BET, and many others. She has opened for comedy legends such as Martin Lawrence, Rickey Smiley, Mo'Nique and Mike Epps. Jess is extremely popular on Instagram, where her brilliant, cutting edge, and humorous content has earned her more than 4.8 million followers. Her segment, “Jess with the Mess”, has become a social media sensation, regularly garnering over one million views for each video posted. Her comedy is smart and straight to the point. When it comes to the funny, Jess holds NOTHING back.", "otherInfo": "No other event info available"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Mal Hall ", "ArtistImage": "https://photos.bandsintown.com/thumb/9554073.jpeg", "Coordinates": [0.0, 0.0], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Comedy", "Time": "7:30 PM", "Venue": "San Jose Improv w/ Anjelah Johnson", "moreBioInfo": "Mal Hall is your best friend. He’s a comedian, from San Diego, the oldest of four, pizza lover, and he’s a boob man. Mal makes him home in Los Angeles and is currently one of the brightest up and coming comedians in the country. He has quickly evolved into a popular and successful college act, performing at hundreds of campuses across the country. Mal’s conversational style, keen observations and cool delivery have proven to be greatly appreciated and well received by his audiences, both young and old. Mal is a regular feature act for national headliners Alonzo Bodden and Anjelah Johnson, and can be found with them at clubs and theatres all across the country! A finalist of NBC’s Standup For Diversity Showcase in 2009, Mal was a popular member of their nationwide college tour in 2010. This year Mal shot his first television project for FuseTV as a correspondent on the hilarious clip show OffBeat. Stand-up is Mal’s primary passion, but he’s working on a way to get paid to do the other loves of his life, eating pizza and staring at boobies! When not performing comedy, Mal plays basketball, cooks, plays video games (on the easy setting), goes to movies and continues to pursue his interests in acting, hosting and writing. Mal can be seen on a monthly basis at his self produced comedy show in San Diego called Mal Hall present The Gaslamp Comedy Show at The Tipsy Crow. Information about the show can be found at www.MalHall.com", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "The Happys ", "ArtistImage": "https://photos.bandsintown.com/thumb/11393987.jpeg", "Coordinates": [37.7759904, -122.42047537588323], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Ska,Punk,Grunge,Skatepunk,Surf Rock,Pop Punk,Surf", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "The Happys are a bay area band composed of four twenty-something-year olds-playing dysfunctional Surf Pop-Punk/Grunge. Recently got off tour with The Mad Caddies. The Happys new lineup began in January of 2018 when Petty and longtime bassist Brett Brazil returned from a Pacific NW acoustic tour and reconnected with longtime friend and now guitarist, Alex Sanchez. Sanchez had previously played in Hot Start and had just touched down from an extended backpacking trip in Australia. Drummer Ryan Donahue approached the band by weird coincidence at a local bar and joined the band shortly after a few rehearsals. The band began booking shows and accruing a fast number of fans and several thousands of views on their Spotify and Youtube channels. The Happys have shared the stage with The Mad Caddies, Agent Orange, Del the Funky Homosapien among others. They are managed by Rick Bonde of Tahoe Artists Agency who has broken acts such as Blink 182, Sublime, Reel Big Fish, Monophonics and Brothers Comatose.", "otherInfo": "No other event info available"}, {"Address": "201 Washington St, Petaluma, CA 94952", "Artist": "Weathermen ", "ArtistImage": "https://photos.bandsintown.com/thumb/123779.jpeg", "Coordinates": [38.236845, -122.637814], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "", "Time": "8:00 PM", "Venue": "The Phoenix Theater", "moreBioInfo": "Aesop Rock, Breezely Brewin', Cage, Camu Tao, El-P, Tame One and Yak Ballz. Ex: Copywrite, Vast Aire, Jakki tha Mota Mouth.", "otherInfo": "Radium-X, Warning, The Jellyfish Method and Weathermen bring punk back to the Phoenix on Friday 7/16!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "East Bay Soul ", "ArtistImage": "https://photos.bandsintown.com/thumb/8746829.jpeg", "Coordinates": [37.7961867, -122.27843966432516], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Jazz-soul- Funk- R&b", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Greg Adams and East Bay Soul Bio The sound of Grammy and Emmy nominated trumpeter, arranger Greg Adams is one of the world’s best-known musical signatures. As a founding member of Tower of Power, legendary for his arrangements that made the TOP horn section a sought out entity all its own. With countless collaborations in the studio and live on stage, Adams has made his mark on a broad stretch of today’s musical landscape that includes jazz, pop, rock, R&B, soul, and funk. It has been nearly a quarter century since the genre chameleon trumpeter and arranger became a leader in his own right with his ground breaking 1995 debut Hidden Agenda. With Greg Adams’ approach that music is a language... the CONVERSATION continues. You will sense a direct connection with the live feel of the music, the open breath of each note and the collaboration of each player. Adams felt he had something special happening even before the band went into the studio. “I was writing less notes with my writing partner Nick Milo and with the direction that the songs were taking us, we knew we had a different approach for writing for a ten-piece band”. Greg gives a nod to Co-Producer and pianist Nick Milo. The two have been a long time song writing team, spanning 28 years. Milo has penned songs on every Adams solo and East Bay Soul CDs. Before joining East Bay Soul in 2016, Nick was the musical director for Joe Cocker with thirteen years at the helm. Conversation marks the fourth studio album for East Bay Soul and takes a giant leap to cement their own style - a blend of Funk, Jazz, R&B and Soul. Their combined extraordinary talents bring incredible energy to the recording with heart and soul. Greg has lent his sound to Elton John, Rod Stewart, Santana, Phish Celine Dion, Luther Vandross, Madonna, The Rolling Stones Bonnie Raitt, Paul Shaffer, Little Feat, Billy Preston, Peter Frampton, Chicago, The Eurhythmics, Lyle Lovett, Heart, Linda Ronstadt, Aaron Neville, The Brothers Johnson, Wilson Pickett, Huey Lewis and the News, Raphael Saadiq, Al Green, Quincy Jones, B.B. King, Ray Charles, Terrence Trent Darby, Dionne Warrick and Josh Groban to name a very few. Greg has played on over 900 hundred recordings. Beginning early with Elton John’s “The Bitch Is Back” Chaka Kahn’s “Fool’s Paradise” Little Feat’s “High Roller” and Heart’s “Tell It like It Is”. You’ve heard Greg’s collaboration with Paul Shaffer on the opening theme of Late Show With David Letterman and on score arrangements in films as, Duets, Saving Silverman, Top Gun, Austin Powers In Goldmember with Smashmouth and Mask. Teaming up with Stanley Clarke on Little Big League and on Sgt. Peppers Lonely Heart Club Band with the illustrious George Martin. Greg Adams is one of the The opening track “Look Book” transports you to the Runways of New York, Paris, Milan and Tokyo! Look Book in hand. Lights open - from a curtain and the show begins...Greg Adams trumpet portrays the model on the “cat walk”. Dwayne “Smitty” Smith’s bass conjures up the much-needed attitude to really sell it! One of three ballads on the CD is “Our Love Divine” and defines a romance in bloom. Artfully crafted music and lyrics by Rocky Maffit, with a classic Adams’ string arrangement and breathless vocals by Darryl Walker makes the song a certain timeless classic. “Send” is sure to become a showstopper. Opening with the melody is Greg’s flugelhorn and soon Milo takes over on keys with an explosive tour de force on acoustic piano. “Possibilities” loose groove is infectious while the titled cut “Conversation” just melts you away on an easy vibe. Adams reprises his original arrangement on the swampy Lowell George’s Little Feat favorite “Spanish Moon”. Kay-Ta emulates George’s guitar work in his own brand. Look for Bamont’s featured funky Baritone solo. The glue that holds down the rhythm section is Herman Matthews’ stellar drum work. The East Bay Soul Horn section captures Greg’s percussive horn style to a T Lee Thornburg, Lead Trumpet, Johnnie Bamont on Tenor and Bari saxes, Greg Vail on Alto sax, with special guest, Michael Stever offers additional trumpet work. On the Otis Redding’s version of “Try A Little Tenderness” East Bay Soul channels Redding’s Dictionary of Soul. From the recording booth, Greg was trying to get Herman Matthews to look up from his drum kit, to let him know “We Got It”. It is a fitting end to the album “ Adams says, “We really embraced the title of the CD and what we accomplished was a Conversation! Track Listing for Greg Adams and East Bay Soul CONVERSATION 1. Look Book 2. Conversation 3. Quiet Scream 4. Tiger Beat 5. Spanish Moon 6. Our Love Divine 7. Possibilities 8. Send 9. Where Do We Go From Here 10.Try A Little Tenderness Booking For Greg Adams and East Bay Soul • Media and Promotion Contact Andrea Adams • ALM Management andrea@almmanagement.com Cell: 818.621.7736 • Office: 818.697.5728", "otherInfo": "Yoshi's Oakland Presents Greg Adams & East Bay Soul"}, {"Address": "3920 Geary Blvd, San Francisco, CA 94118", "Artist": "Jim McVeigh ", "ArtistImage": "https://photos.bandsintown.com/thumb/11513555.jpeg", "Coordinates": [37.7821711, -122.4502001], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Comedy,Standup Comedy,Clean Comedy", "Time": "8:00 PM", "Venue": "Comedy at Ireland 32's", "moreBioInfo": "Jim McVeigh is a comedian based in Oakland. His comedy stems from feeling like an alien in most parts of life. He’s been described as having both dorky-dad, and cool-mom energy on stage. His act is vulnerable and silly, as he tries to process the world happening at him. Jim is a recent addition to the rosters of Punch Line, Cobb’s, and Rooster T Feathers. He’s opened for Eddie Pepitone, and Pauly Shore, and selected to perform in SF Sketchfest. He co-hosts the popular weekly comedy show, Critical Hit, in Oakland every Saturday.", "otherInfo": "No other event info available"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Natalie Douglas ", "ArtistImage": "https://photos.bandsintown.com/thumb/8570517.jpeg", "Coordinates": [37.7860405, -122.40926628007111], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Vocal Jazz,Cabaret", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "Called “a true force of nature,” and “in a league of her own” by Clive Davis of The Times (UK), in his two five star reviews of her London dates, ten-time MAC Award Winner Natalie Douglas is a Nightlife and two-time Backstage Bistro Award Winner. Natalie has also receved the 2014 Margaret Whiting Award & 2016 Donald F. Smith Award - from the Mabel Mercer Foundation, for which Natalie is also a Master Teacher. Natalie’s portrait hangs on the legendary Birdland Jazz Club Wall of Fame. Her latest series - her SRO 10-month Birdland residency - TRIBUTES has saluted the luminous careers of music legends, including Ella Fitzgerald, Sammy Davis, Jr., Dame Shirley Bassey, Linda Ronstadt, Nina Simone, Elvis Presley & Cher. This series earned her two recent MAC Awards - 2018 Major Artist & 2018 Show of The Year. Recent NYC performances: Carnegie Hall, Birdland Jazz Club, Café Carlyle, The Town Hall, and Jazz at Lincoln Center’s Appel Room and Rose Hall. Internationally: Montenegro, Greece, Italy, Spain, Corsica, Puerto Vallarta, London, Buenos Aires, Cancun, Turkey, Mazatlan, Belize, Grand Cayman & Germany. Natalie’s critically acclaimed third album, Human Heart, won the 2017 Backstage Bistro Award, the 2017 MAC Award for Outstanding Major Recording & is available along with her other CDs, To Nina…Live At Birdland & Not That Different, on iTunes, Amazon.com, Spotify & GooglePlay. Natalie has a Bachelor’s Degree from USC in Theatre and Women’s Studies and holds a Master's Degree from UCLA in Psychology and Theatre. Info: www.nataliedouglas.com", "otherInfo": "We will try to seat all parties of two or more together and appreciate your patience and understanding as we operate to maintain all safety guidelines. Doors open 45-minu..."}, {"Address": "Palo Alto, CA", "Artist": "AJ Lee & Blue Summit ", "ArtistImage": "https://photos.bandsintown.com/thumb/11497941.jpeg", "Coordinates": [37.4443293, -122.1598465], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "", "Time": "8:00 PM", "Venue": "Casa Amaranta (Private Event) - Palo Alto, CA", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "201 Washington St, Petaluma, CA 94952", "Artist": "Warning ", "ArtistImage": "https://photos.bandsintown.com/thumb/6290357.jpeg", "Coordinates": [38.236845, -122.637814], "Date": "2021-07-16", "EventDate": "Jul. 16th, 2021", "Genre": "Metal,Punk,Doom Metal,Punk Rock", "Time": "8:00 PM", "Venue": "The Phoenix Theater", "moreBioInfo": "There are at least five bands with the name Warning. 1. Warning is UK based doom metal band. Warning flagged the rise of post-2000 wave of traditional doom metal. They were formed by Patrick Walker in 1994 in Harlow, Essex. The band is notable for its down-tempo, progressive, melodic and heavy doom-laden sound; the idiosyncratic and poignant vocals of Patrick Walker; and his introspective, darkly-confessional lyrical themes of acute pain, love, and melancholy nostalgia. The band released two demo tapes, \"Revelation Looms\" in Feb 1996 and \"Blessed By Sabbath\" in March 1997. They debuted 1999 with \"The Strength To Dream\". With this album, Warning gained a cult status within doom metal circles, but they soon disbanded after their 2001 European tour with Jack Frost. They regrouped in 2005 to perform at The Doom Shall Rise festival in Germany, and released second album \"Watching From A Distance\" in 2006 to much wide acclaim. Both albums were re-issued on CD in 2008 by the label Cyclone Empire, \"The Strength To Dream\" being re-packaged in new sleeve artwork. At the same time \"Watching From A Distance\" was released by the Metal Supremacy label as a LTD edition gatefold double-vinyl. 2. Power metal band from Poland (active). 3. Heavy metal band from Sweden (split-up). 4. Speed metal band from France (split-up). 5. Electro- synth pop band from Germany. View: http://mutant-sounds.blogspot.com/2008/04/warning-stlp1982germany.html", "otherInfo": "Radium-X, Warning, The Jellyfish Method and Weathermen bring punk back to the Phoenix on Friday 7/16!"}]