var sf_events = [{"Address": "20 Grey St, Petaluma, CA 94952", "Artist": "Derek Irving and His Combo ", "ArtistImage": "https://photos.bandsintown.com/thumb/11020404.jpeg", "Coordinates": [38.2372463, -122.6386736], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "Derek Irving & His Combo", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Tommie Sunshine ", "ArtistImage": "https://photos.bandsintown.com/thumb/7218103.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Electronic, Electro House", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "\"[Tommie Sunshine] just might be the guy who could make dance music fun and important again this year...\" Paper, 2006 Influenced by equal parts of Kraftwerk, AC/DC, and Farley Jackmaster Funk, mid-west rave legend and Brooklyn, NY resident Tommie Sunshine is raising the bar. Covering ground as artist, remixer, producer, vocalist, radio jock, label owner, DJ and songwriter and with his legendary hybrid of live performance and DJ sets now traveling the globe it wont be long before there will be, at least a little, Tommie Sunshine in your life. \"Need big-room house mixes of Sarah Conner or Andy Hunter? Check. How about a rock-house hybrid for The Stills? Got it. Gary Glitter shuffle-beat for Good Charlotte? Not a problem. And lets not get started on the weird quirky techno. All of this is leading Sunshine somewhere. Perhaps as a producer with a platinum record on his wall.\" DJ Times Magazine, 2005 His studio collaborations have included Felix Da Housecat, James Murphy, Arthur Baker, Mylo and DJ Hell; he has played everywhere from Hong Kong to Reykjavik. As an established remixer, Tommie (alongside long time collaborator Mark Verbos) has been requested to retouch work from a diverse list that includes Louis XVI, Yeah Yeah Yeahs, Good Charlotte, Kid Alex, Princess Superstar, Elvis Presley, Fallout Boy, Gang of Four, My Robot Friend, The Killers, Da Brat, P.O.D., Fischerspooner, The Faint, Kill Hannah, Ima Robot, Ladytron and Avril Lavigne. Furthermore, major fashion houses have asked Tommie for his deck time such as Versace, Raf Simons, Chanel, Xavier Delcour and Jeremy Scott Beverly Hills. Tommies original music has also been featured in a film by designer Jeremy Scott; NY hotel Tribeca Grands website, Blockbuster Video radio spots, a cd advertisement for the fashion label Chanel and on the CBS show Without A Trace. His work was also featured in Entertainment Tonights coverage of the Academy Awards, as well as the Hollywood release Kiss Kiss Bang Bang. Not one to wait for innovative outlets for his music, his tunes have been in video games such as NBA 2K6 which features an unreleased track titled And Then as well as Need For Speed: Underground 2. Now with all this under his belt, Tommie is setting the international stage for the release of his debut album to hit next year, prefaced by his first compilation CD coming fall 2005 After six years in Georgia where he ran Satellite Records - Atlanta and held down two residencies at Club Sol and Fusion, he moved back to Chicago for four years establishing club nights ElectroSweat and Degeneration. He also held down the position of promotional director of the Midwest dance mecca Dust Traxx and being named in URB magazines Next 100. As a member of Thee Maddkatt Courtship with longtime collaborator Felix Da Housecat, Tommie co-produced \"Cosmic Pop\" for ffrr/London Records and worked again with Felix & Miss Kittin - co writing Silver Screen, Happy Hour and Glitz Rock - on the award winning 2002 Kittenz & Thee Glitz LP. Thom Yorke of Radiohead is quoted in URB Magazine saying, That should have been fucking number one all over the world. The single \"Silver Screen (Shower Scene)\" continues to be a dancefloor classic around the world years after release. The duo returned to the studio again for the single Rocket Ride which is co-produced and co-written, as well as the track Everyone Is Someone In LA. Tommie also worked with International Deejay Gigolo records supremo DJ Hell and DFAs James Murphy on Hells NY Muscle LP. \"...Sunshines quirky ear, knack for being ahead of the curve and an enthusiasm bordering on the obsession for music cant be understated.\" DJ Times, 2005 His long history in the mid west rave scene made him a major source for those who wanted to learn more about the underground dance culture. He wrote the preface to Mireille Silcotts novel, Rave America and his knowledge on all things centric to this particular music cycle earned him an appearance in Peter Jennings Reporting on ABC, two separate BBC documentaries on House Music as well as the just out on DVD rave documentary Rise and featured DJing in Billy Corgans post smashing-Pumpkins band Zwans video for the song Lyric He has also been establishing his own presence as A&R and label owner with xylophone jones Recordings to include a cast of shocking newcomers alongside well established artists and Tommie himself. His xylophone jones Recordings Showcase at WMC 2004 was named by URB Magazine as the number 2 event of Conference in between Ultra Music Festival and BBC Radio 1 Essential Selection. ). 2004 also brought Tommie to radio, doing a monthly feature on XM Channel 80: The Move - nominated for a DanceStar award in 2004. 2005 proved to be the year of expose for Tommie, as his face graced both DJ Times and URB Magazines covers. He then went on to win Best DJ of Hong Kong 05, which in turn got him his first International Residency at Hong Kongs famous nightclub Volar. \"Having DJd everywhere from the dirtiest rock n roll dive bar to the Guggenheim Museum, Sunshine spins a unique blend of modern rock and future-forward dance music.\" HX, 2006 Stay tuned in 2006 as Tommie preps us all for his two releases. The first will be the Systematic Sessions Vol. 2 - Tommie Sunshine & Marc Romboy is out on German label Systematic Recordings in late June/early July, followed by the Ultra Records release of his double CD chock full of his remix and production work, past and present, with many surprises in store.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Anglerfish ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Blessed Curse ", "ArtistImage": "https://photos.bandsintown.com/thumb/8518804.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Metal, Thrash Metal", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Blessed Curse, based in Sacramento California, have been making a name for themselves through selfless hard work, playing countless shows, and unleashing some of the most punishing true heavy metal. The band began with humble beginnings as childhood friends forging their love of music into their own band, and over the past 16 years they've grown to become a meticulous killing militia primed to join the bigger league and take things to a more international playing field. Forming under the name \"Atrosity\" in 2001, the band recorded their debut 5-song E.P. in early 2005 after many formative years of learning old school metal classic tunes from the likes of Metallica, Iron Maiden, Slayer and Judas Priest. This 5-song EP, appropriately titled \"Fuck Everything\", was the group's first step in their long journey from leaving the confines of Colfax, CA to the world beyond as Atrosity quickly established themselves as the true, young thrash metal band in the Northern California area. 2005 also cemented the young band's reputation further as they opened for thrash metal legends Kreator and Overkill in Sacramento, CA giving them a taste of professional live performances. In 2006, Atrostiy was forced to undergo a name change due to their being an established death metal band from Germany using the proper English spelling of Atrocity. Quickly deciding on the ultra-heavy alternate name of Devastator, the band continued the metal mayhem as the now revamped headbanging force and needed a release with the new name to get the word out to all the ravenous followers as well as potential new fans they would set out to convert. Devastator recorded a 5-song EP, titled \"Crush and Kill\", which was recorded completely live in the studio in two days. Released on Friday, October 13th, \"Crush and Kill\" quickly lived up and passed its predecessor to further spread the band's name and reputation. Devastator spent most of 2007 playing up and down California with fellow up and coming new thrash bands such as Merciless Death, Hatchet, and Warbringer, as well as with national touring acts such as Kreator (twice), Sodom, Three Inches of Blood, Napalm Death, Overkill (twice), Hirax, and Dragonlord. In the fall of 2007, Devastator once again headed off to the studio, this time in Petaluma, CA, to record their follow-up EP, \"Slaughtered Like Pigs\", with the help of the then current drummer of Hatchet and Slave Productions. With their new recording Devastator joined their Bay Area brothers-in-arms Hatchet on a west coast tour blazing a path of destruction. Pushing ever forward, Devastator spent 2008 touring all over the west coast doing random dates alongside notable names like M.O.D., Heathen and Agent Steel, in addition to signing a publishing agreement with Marco Barbieri's Salem Rose Music. In 2009, Devastator geared up to record their next demo recording, the far more professional \"Burn the Beast\" EP sessions at Trident Studios, which was recorded, mixed and mastered in a week by Juan Urteaga (Testament, Machine Head, Sadus). \"Burn the Beast\" received rave press reviews and metal radio airplay across the country and to build upon the momentum the band embarked on a full US tour that summer, dubbed the \"Slaughtering the Masses\" tour, spreading their music and making new fans in over 40 cities. Upon returning home the band realized they had learned a lot from the experience and pulled back making themselves inactive despite a few one-off stints in 2010 from the aggressive live show routine and began making general improvements to their sound, musicianship, vocals and new material. Aiming to join the big leagues Devastator felt the need for another new name that was more unique and original and dubbed themselves Blessed Curse - because being in a band is both a blessing and a curse. In 2011 with an arsenal of new songs the band headed back to Trident Studios with producer Juan Urteaga to record the full-length album of their self-titled Blessed Curse debut. True metal performed with integrity highlighting the band's distinct take on their metal influences and capturing the past, present and future of Blessed Curse. Packaged with a killer original artwork piece from Marc Sasso (Dio, Halford, Cage), Blessed Curse are ready to take it to the next level and have partnered with Cyclone Empire Records to make that next leap possible. Released in the US under Marco Barbieri's record label M-Theory Audio, the Blessed Curse debut album is available world-wide for the metal masses. Since the completion of their debut, the band returned to the live front assaulting audiences with their intense barrage of metal mayhem and sharing stages all over the west coast with bands like Death Angel, Destruction, D.R.I., Evil Dead, Bonded by Blood, Exmortus, Sacrificial Slaughter, and Witchaven. 2016 has brought a new era to the band. Enlisting 6-string shredder Gregg Laubacher on guitar alongside original members Tyler Satterlee on guitar and vocals as well as Derek Bean on drums, B.C. completed the brand new recording titled \"Beware of the Night\" in 2017. Bringing the band back to Trident Studios with the work of Juan Urteaga the recording session marked the third experience of working at Trident and the result was the most punishing, crushing, and pummeling cut of sonic metal music that Blessed Curse has released to date. Bringing five new tracks to life including the first lyric video for the featured song \"Nightbreed\", Beware of the Night was released in the U.S. under the M-Theory Audio label. Pushing forward with new music and an even more fierce determination to bring B.C. to the wider world, countless shows and more headbanging music await the future of Blessed Curse. Bringing a full on metal assault to the USA since 2001.", "otherInfo": "Performing Live:\n EXMORTUS -- https://www.facebook.com/exmortusofficial\n GÜRSCHACH -- https://www.gurschach.com/\n BLESSED CURSE -- https://www.facebook.com/blessedcurseofficial\nWhen you think of Whittier, California, two things come to mind: cruising and Richard Nixon. Now you can add a third thing to that list: metal band Exmortus. The band touches on the many metal sub genres, from death and black metal to technical, with a penchant for thrash. Hard and heavy with non stop aggression, Exmortus has been slinging the thrash for close to two decades. Founded by cousins (guitarist/songwriter) Conan and Mario (drums), the metal band started as a boyhood extracurricular activity. And even as band members came and went, Exmortus grew and changed, eventually releasing four full lengths filled with brutal tunes. These dudes make the kind of music your catholic parents hate, complete with images of flesh-feasting and decay, not to mention pounding drums and song titles like \"Swallow Your Soul\" (you can tell your parents that this metal band covers Beethoven to even things out). Along with the dark imagery and lyrics comes a technical precision and neoclassical flourishes that you don't always hear in thrash - the instrumentals are sharp and on point, and live the band is tight (being together for almost 20 years will do that to a live set). Exmortus is ready to give what every metal head craves: ferocious vocals, shredding guitars, high energy battle anthems, long hair and leather, and all around mayhem.\nmetal.\ndoors @ 7pm;\nshow @ 7:30pm.\nall ages.\n$15 advance;\n$18 day of show.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23d.html\nWatch and listen:\n Exmortus: Metal Is King: http://youtu.be/JT7q4fpxL0U\n Exmortus: Feast of Flesh: http://youtu.be/1XFj6p6PoYo\n Gürschach: St. Anger: http://youtu.be/urRruX2PrY0"}, {"Address": "41 Wharf Rd, Bolinas, CA 94924", "Artist": "Caitlin Jemma ", "ArtistImage": "https://photos.bandsintown.com/thumb/11366664.jpeg", "Coordinates": [37.9101935, -122.6851545], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Caitlin Jemma's Single Release + Birthday Party ", "moreBioInfo": "Caitlin Jemma is a small-town girl with a big country heart. Raised in the high desert of Northern Nevada, her songwriting is influenced by a sense of adventure, reverie, and discovery. With a sound tempered by country and delivered with soul, Caitlin Jemma brings a wholesome and enlivened energy to the deep-rooted traditions of storytelling folk. Jemma's sweet and salty twang has earned comparisons to a young Iris Dement, with echoes of Gillian Welch & Valerie June. Whether performing solo or with her band, The Goodness, Jemma’s dynamic sound, timeless songwriting, & playful stage presence is captivating audiences everywhere from her Pacific Northwest home to Europe. Discography: Old Joy (2016), Lick Them Wounds (2014), Home Means The Hills (2013).", "otherInfo": "w/ Anna Moss + The Nightshades"}, {"Address": "330 Virginia Street, Vallejo, CA 94590", "Artist": "Ronstadt Revival ", "ArtistImage": "https://photos.bandsintown.com/thumb/11357277.jpeg", "Coordinates": [38.1024202, -122.2571691], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Linda Ronstadt", "Time": "7:00 PM", "Venue": "Empress Theatre", "moreBioInfo": "Ronstadt Revival is the premier tribute to Linda Ronstadt, bringing you the songs you love and remember from this legendary artist. From Linda’s 1967 beginnings with The Stone Poneys to her amazing renditions in the 70s of songs by beloved songwriters like Smokey Robinson, Warren Zevon, Lowell George, The Eagles and The Rolling Stones to her 80s smash album Mad Love with it’s New Wave vibe. Ronstadt Revival will take you on timeless journey of all of your favorites including, You're No Good, Blue Bayou, When Will I Be Loved, Tracks of My Tears and so much more! https://www.ronstadtrevival.com - Sign up on our email list! Follow us on Facebook • Instagram • Bandsintown • Reverbnation", "otherInfo": "Come join Ronstadt Revival - A Tribute to Linda Ronstadt for their debut at the beautiful Empress Theatre!"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Selecta ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Exmortus ", "ArtistImage": "https://photos.bandsintown.com/thumb/9420744.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Shred, Metal, Death Metal, Power Metal, Thrash Metal", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "EXMORTUS are an entity amongst themselves and their music, both complex and thoroughly hook-laden, refuses to lend itself to easy categorization. From the technical death-thrash riffage and surgically precise drumming to their neo-classical, twin virtuoso lead guitar attack, fans of death metal, thrash, prog metal, traditional heavy metal and all true metal sub-genres alike enjoy having their craniums crushed by the fury of EXMORTUS.", "otherInfo": "Performing Live:\n EXMORTUS -- https://www.facebook.com/exmortusofficial\n GÜRSCHACH -- https://www.gurschach.com/\n BLESSED CURSE -- https://www.facebook.com/blessedcurseofficial\nWhen you think of Whittier, California, two things come to mind: cruising and Richard Nixon. Now you can add a third thing to that list: metal band Exmortus. The band touches on the many metal sub genres, from death and black metal to technical, with a penchant for thrash. Hard and heavy with non stop aggression, Exmortus has been slinging the thrash for close to two decades. Founded by cousins (guitarist/songwriter) Conan and Mario (drums), the metal band started as a boyhood extracurricular activity. And even as band members came and went, Exmortus grew and changed, eventually releasing four full lengths filled with brutal tunes. These dudes make the kind of music your catholic parents hate, complete with images of flesh-feasting and decay, not to mention pounding drums and song titles like \"Swallow Your Soul\" (you can tell your parents that this metal band covers Beethoven to even things out). Along with the dark imagery and lyrics comes a technical precision and neoclassical flourishes that you don't always hear in thrash - the instrumentals are sharp and on point, and live the band is tight (being together for almost 20 years will do that to a live set). Exmortus is ready to give what every metal head craves: ferocious vocals, shredding guitars, high energy battle anthems, long hair and leather, and all around mayhem.\nmetal.\ndoors @ 7pm;\nshow @ 7:30pm.\nall ages.\n$15 advance;\n$18 day of show.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23d.html\nWatch and listen:\n Exmortus: Metal Is King: http://youtu.be/JT7q4fpxL0U\n Exmortus: Feast of Flesh: http://youtu.be/1XFj6p6PoYo\n Gürschach: St. Anger: http://youtu.be/urRruX2PrY0"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "CurZe ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "R A Y N E ", "ArtistImage": "https://photos.bandsintown.com/thumb/9358144.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Alternative, Pop, Electronic, Dance Pop", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Rayne is a South African singer, songwriter, actor and dancer. Stitched together from various elements and influences in a Warholian fashion, Rayne exhibits a theatrical and avant-garde persona, with a raw centre. He prides himself on his art and seeks to bring change to the world with his music.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Gürschach ", "ArtistImage": "https://photos.bandsintown.com/thumb/11509609.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Heavy Metal, Progressive Metal, Metal, Experimental Metal, Dark Matter, Thrash Metal", "Time": "7:00 PM", "Venue": "Exmortus @ DNA Lounge", "moreBioInfo": "Gürschach (pronounced Ger-shock) is a four-piece Experimental Metal band from the San Francisco Bay Area, whose main vision is to create an unfamiliar, yet captivating listening experience for their audience.", "otherInfo": "DNA Lounge & Olympus Present:\nEXMORTUS\nFriday July 23rd\nAll Ages\nDoors @ 7pm\nShow @ 8pm\nTickets on sale at www.dnalounge.com"}, {"Address": "176 2nd St, San Francisco, CA 94105", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/11546571.jpeg", "Coordinates": [37.7868529, -122.3987619], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Comedy", "Time": "7:00 PM", "Venue": "The Setup", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Christopher Lawrence ", "ArtistImage": "https://photos.bandsintown.com/thumb/8461025.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Underground Trance, Trance, Electronic, Tech Trance, Psy Trance", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Christopher Lawrence is an American disc jockey and producer specializing in progressive trance music. He has released 7 mix CDs since the mid 1990s. Voted the #14 DJ in the world by DJ Magazine’s prestigious ‘Top 100’ poll for 2005 and a recent winner of the \"Best DJ\" award at the Dancestar US Awards, Christopher Lawrence is recognized worldwide as one of the World's top DJs and producers. Dubbed \"A Superstar DJ\" by the US’s URB and “One Of The Most Popular DJs On The Global Circuit” by DJ Magazine, Christopher Lawrence is one of the biggest, most respected and popular names in dance music today. Winner of the “Best American DJ” at the IDMA’s at WMC 2005, Christopher's production skills, coupled with his ability to take international dancefloors by storm with his tough techno trance sets, place him in high demand worldwide. Once an outsider in a world dominated by European and UK DJs, Lawrence has risen to the top of the international dance music heap. He is now considered one of the key global players and one America’s leading dance music exports, playing main stage at the world’s biggest festivals and superclubs. Christopher was the only US DJ invited to headline all three of the inaugural Ministry Of Sound, Cream and Gatecrasher tours of America.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "41 Wharf Rd, Bolinas, CA 94924", "Artist": "Anna Moss & the Nightshades ", "ArtistImage": "https://photos.bandsintown.com/thumb/11433452.jpeg", "Coordinates": [37.9101935, -122.6851545], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Smiley's Schooner Saloon & Hotel", "moreBioInfo": "New Orleans, bedroom pop. The Soul-O project of Anna Moss of Handmade Moments", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Roxas ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "982 Market St, San Francisco, CA 94102", "Artist": "Lucinda Williams ", "ArtistImage": "https://photos.bandsintown.com/thumb/10404379.jpeg", "Coordinates": [37.7827039, -122.4103578], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Folk Rock, Rock, Americana, Alternative Country", "Time": "7:00 PM", "Venue": "The Warfield", "moreBioInfo": "Three time Grammy Winner Lucinda Williams. Currently on tour!", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Switchblade ", "ArtistImage": "https://photos.bandsintown.com/thumb/6180180.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Sludge Metal, Experimental, Metal, Doom, Avant Garde", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "In the cold winter of 1997 turning to 1998, Switchblade slowly took form as a quartet with 2 bassplayers who both screamed their lungs out. A 7\" and a few extra songs for a split 7\" were recorded with Fireside´s mastermind Pelle Gunnerfelt (Fireside, Hives, Breach) in the spring of 1998. In March 1999 Switchblade recorded their groundbreaking and very well received 10\". This time with a newly recruited 2:nd bassplayer/singer. The 10\" was recorded by Breach´s mastermind Anders Ekström. The 10\" turned out very chaotic and fast in tempo. A few months later a few more songs were recorded by Anders Ekström and those songs ended up as the split 7\"´s with Cult of Luna and The Jam Session. Then in late 1999 Switchblade took the decision to go on as a three-piece. During 2000 and 2001, switchblade recorded 2 albums together once again with Breach´s Anders Ekström turning the knobs. Switchblade toured both Sweden (with Cult of Luna) and Europe (twice) in support of the albums. Then in March 2003, Switchblade recorded their third selftitled full length album. The album was a 6 song, 47 minute sonic journey that ranged from subtle ambient soundscapes to monotonous, dark, instrumental passages to full on stoner flirting, yet epic heaviness. All with just sparse use of vocals. Previously having had some problems in truly capturing their sound and dynamics on tape, Switchblade turned to Carl Wikman at EAR Studios who is known for his big and true to nature sounding recordings. The album turned out to be the most powerful and focused material so far, and showcased a huge leap forward in the never ending evolution of Switchbladeï¿½s sound and songwriting. The album received great reveiws both in Europe and in the US, where the album was released by Jake Banon´s (CONVERGE) Deathwish/Icarus imprint. A 4 week European tour in support of the album took place in early 2004 and a shorter tour took place in the summer of 2004 based around an apperance at the legendary Ieper Festival in Belgium. In May 2004 Switchblade wanted to try out some new song ideas and approaches so they packed the gear and headed down to the Mission Hall studio located in the countryside in the south of Sweden. The weekend worth of recording together with Mattias Oldén from LOGH resulted in a 2 track 7\" with guestvocals and guitar, on one of the songs, by Mathias Friberg of LOGH. The 2 songs showed, by far, the most dynamic Switchblade material to that date. Come late summer of 2005, Switchblade packed up their gear and headed down to Mission Hall Studio once again. Having felt so relaxed and enjoyed working with Mathias Oldén, the choice was easy when picking a studio for the recording of the fourth selftitled Switchblade album. The 43+ minutes album consists of 2 long tracks and sees the band more dynamic than ever before. Insted of a constant wall of sound and riffing, every riff and every tone get alot of space and time to \"breathe\". To add further bleakness, beauty and depth to the album there´s guestvocals by \"E\" of swedish blackmetal band WATAIN and once again, guestvocals and guitar by Mattias Friberg of LOGH. The tempo of the songs has slowed down for each release and the vocals has taken a more subtle place in the music and more instrumental passages has been brought forward to create a very dark and almost instrumental soundtrack to the apocalypse. Switchblade are currently working on their 5th seftitled album to be recorded in the autumn of 2008.", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Rob Gee ", "ArtistImage": "https://photos.bandsintown.com/thumb/6280850.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Hardcore & Hardstyle", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Rob GEE is famous all across The Universe as \"the hardest DJ to ever play the Limelight in NYC.\" In the club's early 90's heyday, the versatile GEE kept delirious audiences going through spinning at Limelight's \"Future Shock\" dance/techno nights and performing with his live band as well as spinning at the club's \"Rock And Roll Church\" metal/ rock/ industrial nights. The crowds kept coming back to Limelight, just like they did in Australia, Japan, Italy, Spain, Scotland, Austria, Hungary and Belgium to name a few. GEE is a recurring headliner at Sensation,Thunderdome, Mysteryland, and Love Parade, where GEE played before one million people. His diverse appeal keeps him performing weekly at all types of musical events and concerts. GEE has shared the stage with everyone from Hatebreed and Biohazard to Crystal Method, Busta Rhymes, Kurtis Blow, and Afrika Bambaataa. His GEEness has also has spun at many Slipknot and Korn after parties with his good friend, DJ Starscream a.k.a. #0 of Slipknot. GEE's history of DJing and live performances shows his dedication of bringing the fusion of organic and electronic music to a wide variety of listeners. GEE's love of hip-hop, hardcore, techno, metal and every other genre for that matter set him apart from the rest. While other DJs make tracks and spin records, GEE is an Artist who writes original songs. His indecisiveness as to whether or not he wanted to breakdance and spin hip-hop or jump in the mosh pit and play in a metal band was one of the reasons he began to cultivate his own style of both. Rob GEE is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hip-hop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down (just to name a few) creating a unification of Rock, Electronic, & Metal as well any other style GEE chooses to use. The GEEsult is Rob GEE gabber music. Rob GEE says, \"There are no boundaries in music\" . GEE is writing history launching gabber into the scene of the galaxy...... \"The Gabber Guru,\" as GEE is known for his constant motivation of #PositivianVibes gained worldwide fame after the release of \"Ecstasy You Got What I Need\". The song went Gold and was the #1 video on The Box for 13 straight weeks. At the same time, \"Ecstasy\" rose to #9 on the pop charts and earned him Best Artist, Best Producer and Best Song of the year at The Thunder Awards in Holland. The GEE Man has recently enjoyed more worldwide success along band mates Neophyte and Tieum with their collective efforts \"Coming At You Strong\", \"Anxiety\", & \"Rage With Pride\" under the name \"Riot Squad\". Rob GEE is still pushing solo success globally with his most recent hit \"RIght Now\". GEE always with his open mind has enjoyed recent Hardstyle & Rawstyle bangers teaming up with heavy hitters like The Prophet and Adaro. While in the same breath has been rocking the mainstream airwaves collaborating with hardcore giants Noize Suppressor, Mad Dog, & Furyan. Look out later this year, nu metal will meet hardcore in the studio ring when Rob GEE teams up with no other than Shavo Odadjian of System Of A Down. Rob GEE won't be stopped!!!!!! The sound is 100% Rob GEE, which means eclectic, unexpected and completely unique. Much #GEEspect & #PositivianVibes", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Elevener ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Brizzy ", "ArtistImage": "https://photos.bandsintown.com/thumb/6026344.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kandi Love & PLUR Alliance present\nSO STOKED: SUMMER OF LOVE\nMain Room:\n Christopher Lawrence\n Tommie Sunshine\n Rob Gee\n Switchblade\n Brizzy\n Smol Beanz\n Just Trees\n Psychic Monkey\n Selecta & Rayne\nLounge:\n Anglerfish\n Curze\n Elevener\n Gypsy Kid\n Roxas\n☮️ 🌸 ✌️ 🌸 In the summer of 1967, hippies converged on San Francisco's Haight-Ashbury to celebrate LOVE and PEACE and created a counterculture movement of freedom and self-expression. They rejected the conformist and materialistic values of modern life and placed new emphasis on sharing and community. More than fifty years later the messages and values of that era continue to inspire us. Let's celebrate together the past and the present - peace and love - community and individuality. Let's celebrate at this be-in and be rave hippies. 🌸 ✌️ 🌸 ☮️\n🌸Be sure to wear flowers in your hair!💐\nWinner of \"Best American DJ\" at the IDMA's, Christopher Lawrence is recognized as one of the world's top DJs and producers. A dance music legend, he has been described as \"One of America's most influential DJs\" by DJ Mag and \"A trailblazer\" by SPIN. With twenty years behind the decks, Christopher is one of the most credible names in dance music whose outspoken support of the underground has earned him the respect of industry and fans alike. Always pushing boundaries, Christopher's tough techno trance and psy trance infused sets are a favorite on dance floors at the darkest downtown afterhours to the world's biggest festivals.\nTastemaker to tastemakers, curator, and shapeshifter, Tommie Sunshine is renowned for his reputation of being consistently ahead of the curve bridging the worlds of Rave, Disco, House, and EDM while still standing firmly in the zeitgeist. Establishing his name throughout the American Rave scene during the '90s, he became one of the most recognizable figures of the Electroclash movement during the early 2000s and helped set the stage for the EDM boom of the 2010s. 29 years as a DJ and 35 years as a clubber gives Sunshine his unique perspective on the business & informs his present Rave Revival sound.\nRob Gee is the only artist of his kind to collaborate and create with members of respected rock, metal, hardcore and hiphop acts such as Slipknot, Hatebreed, Biohazard, Wu-Tang Clan, Cypress Hill, and System Of A Down, (just to name a few), creating a unification of Rock, Electronic, & Metal as well any other style for that matter known as gabber music.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-23.html\nWatch and listen:\n So Stoked: Summer of Love: http://youtu.be/FmU6KfN8ABY\nhouse. trance. hardcore. gabber. psytrance. hardstyle. d+b.\n7pm - 2:30am.\nall ages.\n$15, $20 limited advance;\n$25 after;\n$30 < 9pm;\n$35 after."}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Los Sagitarios ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Russell Peters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619761.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "San Jose Improv", "moreBioInfo": "No artist bio available", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Mo Mandel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619297.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "This show is 18 & over with valid, government-issued photo ID. There is a two drink minimum per person. Cameras and video/audio recording devices are not permitted. Ticket sales shut off online before doors open; there may be tickets available at the show. Reserved Premium Seating: $35 General Admission: $25 in advance, $28 day of show"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Tommy Guerrero ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8077498, -122.2726995], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "The New Parish", "moreBioInfo": "Originally known as a member of the old school skateboarding gang \"The Bones Brigade\". He spent several years in the group Jet Black Crayon before releasing his first solo-Single in 1995, entitled \"Backintheday.\" He mixes a variety of jazz, ambient, and hip-hop styles to create a very soulful and chill vibe throughout his followup cds. On his CD \"Soul Food Taqueria\" he collaborated with both Gresham Taylor and the rapper Lyrics Born to add vocal tracks to several of his creations.", "otherInfo": "No event info available"}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Miramar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8244550.jpeg", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Boléros, Love And Anti-love Songs", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "Boleros from Puerto Rico & Beyond. Debut album on Barbés Records. Booking Europe: Derapage Prod @miramarboleros, #miramarboleros", "otherInfo": "No event info available"}, {"Address": "3660 Stony Point Rd, Santa Rosa, CA 95407", "Artist": "Los Kinos ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.3876334, -122.7408679], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Casa Del Mar", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Late for the Train ", "ArtistImage": "https://photos.bandsintown.com/thumb/11196924.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Bluegrass, Traditional Celtic, Folk Revival, Folk, Folk-blues, Traditional Bluegrass, Indie Folk", "Time": "8:00 PM", "Venue": "One Grass Two Grass w/ Late for the Train", "moreBioInfo": "Late for the Train is a modern string band that feels both fresh and familiar. Drawing heavily from American folk & bluegrass, the San Francisco-based group delivers soulful and articulate arrangements of original and traditional music. The core ensemble consists of songwriters and multi-instrumentalists David Pascoe (guitar/mandolin), Laura Benson (fiddle), and Thom Beneduci (stand-up bass).", "otherInfo": "Late for the Train opens the night for One Grass Two Grass, bringing harmonies and original folk stylings to set the mood for a night of good vibes and lots of dancing. \n\nOne Grass Two Grass delivers high energy, hard driving, fun-loving, old-timey, new-timey, good-timey, rockin’ California string band music. One Grass Two Grass forges its own style of folk meets old-time, meets rock, meets bluegrass."}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Juan Wayne ", "ArtistImage": "https://photos.bandsintown.com/thumb/9952762.jpeg", "Coordinates": [37.7760033, -122.4204681], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "Call it the alcoholic lovechild of two roving delinquents. Los Angeles-based Juan Wayne emerged in the middle of 2018 from the dark outer recesses of the minds of songwriters Andrew St. James and César Maria while out on tour in support of the former's 2017 solo album The Big Ole Veronica Apology Record. Once returned home from the road and huddled in seclusion in Maria's Koreatown apartment, the pair recorded two albums on an 8 track tape machine. Part concept, part earnest autobiographical reflection, the collaboration quickly gained traction through their native San Francisco songwriting community, resulting in live performances replete with cowboy hats and boots and a bevy of supporting players culled from acts as diverse as Tino Drima and Deltron 3030. Their upcoming first release, Juan Wayne 1, clocks just over 16 minutes. But there in its brevity is the undeniable kismet. The duo's lifelong friendship yields a profound connection and what results is a sorrowful lofi pop dreamscape melded together by two distinct narrative voices so intertwined - both through personal history and heartache, and shared influence - that it becomes difficult to distinguish where one ends and the other begins. Herein the root of new beginning takes shape. Best seen and heard to be believed, Juan Wayne rides.", "otherInfo": "FAST TIMES presents FRENCH CASSETTES"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "French Cassettes ", "ArtistImage": "https://photos.bandsintown.com/thumb/7443738.jpeg", "Coordinates": [37.7760033, -122.4204681], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Indie Pop Rocks", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "FAST TIMES presents FRENCH CASSETTES"}, {"Address": "1900 Market St, San Francisco, CA 94102", "Artist": "Jim McVeigh ", "ArtistImage": "https://photos.bandsintown.com/thumb/11513578.jpeg", "Coordinates": [37.7706537, -122.4253067], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Standup Comedy, Clean Comedy, Comedy", "Time": "8:00 PM", "Venue": "Orbit Room", "moreBioInfo": "Jim McVeigh is a comedian based in Oakland. His comedy stems from feeling like an alien in most parts of life. He’s been described as having both dorky-dad, and cool-mom energy on stage. His act is vulnerable and silly, as he tries to process the world happening at him. Jim is a recent addition to the rosters of Punch Line, Cobb’s, and Rooster T Feathers. He’s opened for Eddie Pepitone, and Pauly Shore, and selected to perform in SF Sketchfest. He co-hosts the popular weekly comedy show, Critical Hit, in Oakland every Saturday.", "otherInfo": "No event info available"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Lillias White ", "ArtistImage": "https://photos.bandsintown.com/thumb/135098.jpeg", "Coordinates": [37.7860081, -122.4092959], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "No artist bio available", "otherInfo": "We will try to seat all parties of two or more together and appreciate your patience and understanding as we operate to maintain all safety guidelines. Doors open 45-minutes prior to curtain time. Seating will be based on party size, arrival time, and is up to the discretion of the management."}, {"Address": "201 Washington St, Petaluma, CA 94952", "Artist": "DJ Cal ", "ArtistImage": "https://photos.bandsintown.com/thumb/11542649.jpeg", "Coordinates": [38.2348823, -122.6430848], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Hip Hop, Top40, Edm, Open Format, Trap", "Time": "8:00 PM", "Venue": "The Phoenix Theater", "moreBioInfo": "A native of Sonoma County, DJ CAL is from Bay Area / North Bay. His setlists are Multi/Genre designed to move the crowds with a blend of Trap, EDM,Hip-Hop and Reggaeton.He calls the city of Santa Rosa his home, but you might’ve have heard his mixes on-air across the nation (San Francisco, Las Vegas, Orlando, Palms Springs, etc.). He also holds a spot as a mixshow DJ on Fresno California B95, with Teezzy Radio, Last Call and Friday night street party. DJ CAL has several Bay Area and Northern California venues under his belt. Catch him performing and hanging out with the hottest names in music around the Bay. More recently, DJ CAL got awarded for “Best Live DJ” 2018 from “Bohemian” he constantly working on music. Every day he’s working on new edits and remixes. His is work has been supported and featured by various blogs, websites and record pools, DJ City, MyMP3Pool, BpmSupreme and SmashTheClub.com DJ CAL is also working hard to make his own mark in the music industry.", "otherInfo": "Lil Bean and ZayBang hit the Phoenix!"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Clyde Shankle ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "L.O.E. Gino"}, {"Address": "726 1st St, Benicia, CA 94510", "Artist": "Jeffrey James Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/11447658.jpeg", "Coordinates": [38.0501532, -122.1578947], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Blues", "Time": "8:30 PM", "Venue": "Live @ The Rellik", "moreBioInfo": "Jeffrey James Horan is an American guitarist/singer/songwriter, based in the San Francisco Bay Area. Born in Santa Clara, CA. in 1986, Jeffrey has been playing guitar for 28 years, professionally for 19 years. He started playing gospel music in church as a young child and later in his teens Jeffrey started playing traditional blues and soul music with local bay area artists. It was at this time that his talent had progressed to a level that was to be desired and started his professional career. At 16 years old Jeffrey joined force with the son of the legend John Lee Hooker. As guitarist for John Lee Hooker, Jr. he was featured on 2 Grammy Nominated albums in 2004 and 2009. In the last 12 years Jeffrey has been touring with John Lee Nationally and Internationally. Together they have shared the bill and stages with the likes of B.B King, Buddy Guy, Santana, Lenny Kravitz, and with The Rolling Stones in 2017. In the last few years Jeffrey has been working on a solo career making his way into position as the front man. Jeffrey's passion is in blues and rock music but you can hear the influence of country, gospel, and funk seasoned throughout his guitar styling. Jeffrey James describes his sound as modern blues. Live shows are an energetic, powerful, and dynamic with catchy originals and smoking covers. Some of Jeffrey's influences are B.B. King, Albert King, Buddy Guy, Jimi Hendrix, The Vaughan Brothers, Santana, and Eric Clapton.", "otherInfo": "No event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Shante ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "L.O.E. Gino"}, {"Address": "765 Laurel St, San Carlos, CA 94070", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.5045343, -122.2584098], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Singer Songwriter, Cabaret, Broadway, Cover Songs", "Time": "9:00 PM", "Venue": "Faith & Spirits", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No event info available"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Garth ", "ArtistImage": "https://photos.bandsintown.com/thumb/8340394.jpeg", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "Originally raised in the distant D.C. suburbs, Garth. is a singer, producer & multi-instrumentalist now based in New York City. Human Nature, his first musical offering as a solo artist, blends influences ranging from 90s R&B and 80s pop to the more electronic production of today.", "otherInfo": "Legendary House DJ Garth comes to Monarch for one night only."}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "One Grass Two Grass ", "ArtistImage": "https://photos.bandsintown.com/thumb/8230821.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Bluegrass, Country", "Time": "9:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "One Grass Two Grass delivers high energy, hard driving, fun loving, old-timey, new-timey, good-timey, rocking California string band music. Through richly lyrical, naturally inspired originals cushioned by a bed of old mountain tunes and a dash of stomping rock and roll, their unique sound is expressed as a mesh of yesterdays established, deep rooted protocols with the need to bring strings to the times in their own exciting way. Standing on the shoulders of the contemporary string band movement One Grass Two Grass forge their own style of this folk meets old-time meets rock meets bluegrass craze. Getting their start in late 2012 in the San Francisco Bay Area, there have been many highlights in One Grass Two Grass’s upward trajectory through the years. They capped off 2016 with an appearance at The Yonder Mountain String Band’s Northwest String Summit, near Portland, OR , The Telluride Bluegrass Festival’s Band Competition in Telluride, CO, and preforming one of the main stage evening slots for The Hoes Down Harvest Festival at Full Belly Farm in Guinda, CA. 1G2G then could not have been more thrilled to kick off an action packed 2017 summer season with an exciting headlining show at one of San Francisco’s fanciest venues, The Great American Music Hall. The group has been seen accompanying many great artists on stage such as Larry Keel of Keller and the Keels and Natural Bridges, Vince Herman of Leftover Salmon, Poor Man’s Whiskey, James Nash, and John Cragie and have opened for contemporary string bands such as Fruition, Hot Buttered Rum, The Lil Smokies, Danny Barnes, Grant Farm, Front Country, Mipso, Whiskey Shivers, The Last Revel, and Reverend Peyton and the Big Damn Band. With their second album on the way in 2017 and being produced by Hot Buttered Rum’s Nat Keefe, One Grass Two Grass is excited to take the next studio album step. One of the bands defining moments was when Jacob Groopman of Front Country helped the crew produce their debut album in 2014. Released in February 2015 the collaboration proved to produce a rich self titled album which catapulted the group full speed into an exciting and eventful journey that is ever growing and evolving to this day. With 2017 taking the band all across the state of California, Oregon, Nevada, Utah, Montana, Idaho, and Colorado, the excitement is not slowing down. One Grass Two Grass is sure to have you swaying with your lover, stomping with your brother, smiling with your mother, and having just a plain old good time with one another. They deliver hard driving, fun loving, old-timey, new-timey, good-timey, rocking California string band music. Come join em! http://www.onegrasstwograss.com/", "otherInfo": "One Grass Two Grass"}, {"Address": "3553 Mt Diablo Blvd, Lafayette, CA 94549", "Artist": "Audiorage ", "ArtistImage": "https://photos.bandsintown.com/thumb/6159724.jpeg", "Coordinates": [37.8916028, -122.1204661], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Rock, Alternative Rock, Hard Rock", "Time": "9:00 PM", "Venue": "Audiorage at the Roundup Saloon", "moreBioInfo": "Audiorage plays the best alternative rock of the 90's and 00's: Smashing Pumpkins, Red Hot Chili Peppers, White Stripes, Muse, Rage Against The Machine, Weezer and much, much more. Audiorage brings back a musical style that's been missing from local stages for too long: the huge guitar sounds, driving beats and soaring vocals of 90's alternative rock. Our performances are a potent cocktail of favorites, new interpretations and original music. Contact us: info@audiorage.com", "otherInfo": "Audiorage's first post-lockdown gig!\n\nRed Hot Chili Peppers, Smashing Pumpkins, Green Day, Rage Against the Machine, White Stripes and much more. An electrifying night of '90s and '00s alternative rock!"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Mike Bee ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "Legendary house DJ Garth comes to back to the Bay."}, {"Address": "1522 Francisco Blvd, Pacifica, CA 94044", "Artist": "Pete Henry ", "ArtistImage": "https://photos.bandsintown.com/thumb/11496740.jpeg", "Coordinates": [37.6366586, -122.4905276], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Acoustic, One Man Band, Blues", "Time": "9:00 PM", "Venue": "Winters Tavern", "moreBioInfo": "Pete Henry Fisk, b. 1985, is a multi-instrumentalist from California. He began playing guitar at age ten, studying with Craig Sorrenti, and forming his first band with his mother on keys. By age thirteen, Pete had begun playing professionally around the Stockton and Modesto areas in Northern California. At age sixteen, he was being recognized for his skills on the guitar, competing in several different styles of music, winning 1st prize at the Stairway to Stardom concert in 2002 with his group, Concrete Rose, as well as the Louis Armstrong Award and Most Outstanding Jazz Soloist Award as a member of the Escalon High School Jazz Band. Pete went on to study with guitar virtuoso, John Schneiderman, at the University of California, Irvine, where he obtained his MFA. He was involved in a number of highly talented musical ensembles, including the UCI Guitar Ensemble, the IVC Guitar Ensemble, the Cal State Fullerton Orchestra, and the Orange Coast Guitar Society, where he traveled regularly and performed in concert halls across the nation. Meanwhile, Fisk maintained a love and commitment to jazz by attending blues and jazz jams around Orange and Stanislaus Counties of California. Since graduating college, Pete has stayed busy as a professional musician, composing works for screen and film, forming the band HIYA, the 21st Century Woody Guthrie Project, the 21st Century Gershwin Project, all the while teaching guitar and music for the South Orange County Community College District. Most recently, he has focused on guitar and mandolin transcriptions of modern music, from jazz, early Americana, to the latest contemporary songs. Though mostly a soloist now, Pete enjoys collaborating with other musicians as often as possible. He has since spread his musical arrangements and styling around the world, coast to coast of the United States, to the Caribbean Islands, Europe and the Eastern Mediterranean.", "otherInfo": "Peter Henry Fisk, b. 1985, is an American singer and instrumentalist. A performer since age 9, Pete has been recognized for his skills on guitar in several styles, completing a Master of Fine Arts in music from UC Irvine in 2010. Having played in a number of bands and ensembles, he has settled in as a singer soloist, touring internationally with his one-man band arrangements of popular tunes and original music."}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "Bruja ", "ArtistImage": "https://photos.bandsintown.com/thumb/7785741.jpeg", "Coordinates": [37.7781117, -122.4058001], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Sludge Metal, Metal", "Time": "10:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "BANDCAMP: https://bruja14.bandcamp.com/merch SOUNDCLOUD: https://m.soundcloud.com/bruja-band YOUTUBE: http://youtu.be/189Wwg4fC1k", "otherInfo": "Hot Since 82"}, {"Address": "Mission San Jose District, CA", "Artist": "SICK INDIVIDUALS ", "ArtistImage": "https://photos.bandsintown.com/thumb/11478899.jpeg", "Coordinates": [37.5334266, -121.920106], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Pop, Electronic Dance Music, House", "Time": "10:00 PM", "Venue": "Hacienda", "moreBioInfo": "Meeting at the conservatory for music in The Netherlands, Rinze ‘Ray’ Hofstee and Joep ‘Jim’ Smeele formed an instant connection bound by a shared love of music composition and electronic dance music. Drawing influences from Daft Punk, Bingo Players and Swedish House Mafia, their infectious blend of big beats and progressive house melodies quickly garnered them serious attention in all the right places. Coming from the Netherlands, where there genuinely seems to be something in the water when it comes to electronic dance music success, the pair have released on some of the world's most influential imprints - Revealed Recordings, Spinnin' Records, Warner, Interscope, Armada Music, Def Jam and Atlantic Records. Official remixes for Rihanna & David Guetta, Madonna, Moby, Rita Ora, Avicii and Icona Pop have peppered the global radio airwaves, ensuring their sound reaches millions of ears in all four corners of the planet. Recognising the power that the internet gave them to give fans constant access to their music, SICK INDIVIDUALS launched their own radio show; ‘THIS IS SICK’. Reaching tens of thousands of listeners every month and eventually morphing into the major new live 'THIS IS SICK' concept, created exclusively for their stage performances. The pair manipulate visuals and audio in real time direct from the DJ booth, creating a whole new immersive experience for fans who flock to see them play. With more new music to come from the pair this year, and a constantly inundated international tour diary, it’s safe to say it looks set to be another truly ‘SICK’ year from one of the Netherland’s most successful musical exports.", "otherInfo": "No event info available"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "Hot Since 82 ", "ArtistImage": "https://photos.bandsintown.com/thumb/8663744.jpeg", "Coordinates": [37.7781117, -122.4058001], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "Electronic, Deep House", "Time": "10:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "No artist bio available", "otherInfo": "Hot Since 82"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "J. Holiday ", "ArtistImage": "https://photos.bandsintown.com/thumb/8653461.jpeg", "Coordinates": [37.7962494, -122.2785582], "Date": "2021-07-23", "EventDate": "Jul. 23rd, 2021", "Genre": "R&b, Soul, R&b/soul, Rnb-soul", "Time": "10:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "J. Holiday doesn’t pull any punches when he offers his take on the current state of R&B. “Rhythm and Blues is lacking storytellers right now,” insists the candid 22-year-old singer/songwriter. Holiday then pauses, name checks the late legendary singer Otis Redding as if to show his soul credentials and asks, “Where’s our generations’ ‘Sitting on the Dock of the Bay?’ Lately, it seems hip-hop has been birthing all of the great storytellers. It’s time to show that R&B is way more than just dance music. That’s what I’m trying to convey with my music. I won’t settle for less.” While such a statement may seem like a bold proclamation from the fresh-faced newcomer, the Washington D.C. native more than backs it up with his debut album, Back of My Lac. The buzz-heavy Music Line Group/Capitol Records release spotlights a burgeoning talent whose diverse influences range from the heartfelt soul of Marvin Gaye to the provocative street poetry of rap icon Tupac Shakur. “My sound is old school soul with a little mix of hip-hop,” explains Holiday. “If I had to give it a name I would call it ‘street soul.’ Nowadays the ‘hood has little to listen to within R&B. I want my music to be the soundtrack to their lives and beyond.” Indeed, an ambitious J. Holiday is poised to live up to such lofty aspirations. The hypnotic first-single “Be with Me,” produced by Rodney Jerkins, finds Holiday offering the age-old tale of a man wanting to be more than just friends with the object of his affections. “You be giving me the coldest shoulder/‘cause you don’t want your emotions taking over,” he croons. “Instead of talking about you looking for a soldier/are you trying to say you don’t see that in me?” On the title track “Back Of My Lac,” J. Holiday gives listeners a glimpse of his life struggles with heartfelt lines like “I grew up in a house with my mother/I didn’t have my punk ass father/because he felt it was time to move on.” “Without You” builds on a 70’s groove complete with soulful horns and lush strings as Holiday pushes to win back the love of a woman he’s lost. The bass-heavy hardened blues of “City Boy” (featuring dirty south rhyme royalty 8 Ball & MJG) is a two-fisted anthem of ghetto empowerment. And on “Thug Commandments,” Holiday is backed by a swinging, piano-driven break beat as he drops much-needed jewels for the block: “Stop cuffing that young girl, let her breathe/Be a father to your kids…no doo-rags in the Lord’s house/Put trust in the Lord, but keep a glock in the house.” For Holiday, such songwriting comes naturally for a young man who has never forgotten his humble beginnings. “I can say that I’ve lived that street life,” he testifies of his time growing up in Washington D.C. “The streets are not anything to glamorize. I’m trying to let my people back home know that I’m with them. DC has a lot of talent and I’m just trying to show people that we are here.” J. Holiday is a preachers’ son. Raised in the church by a hardworking mother, the pull of secular music was still too much for him to ignore. Fascinated by the early ‘90s R&B vocal groups such as Boyz II Men, H-Town and Jodeci, J. Holiday soon became enamored with hip-hop, marveling in the intricate rhymes of Jay-Z and OutKast. But it was during a high school talent show when a 14-year-old Holiday knew he had a passion for singing. However, local bands were unable to recruit the budding vocalist, whose mother had plans for her son to finish school before seriously pursuing music. Two years later, J. Holiday would discover the music of Marvin Gaye, an experience he calls a “revelation.” “At the time, I didn’t really know that much about him,” he says of the late soul icon. “Marvin became my major influence. He opened me up to folks like Donny Hathaway and Al Green. Those artists had a real honest soul about them. I just wanted to mix that feeling with hip-hop.” The gifted vocalist had found his calling. Holiday skipped college and began recording demos in a local studio. He also found himself increasingly caught up in street activities, but music offered a more positive path. Soon, Holiday met up with current manager Corey Green and formed the group 295, named after the D.C. highway. Buzz for 295 was growing but by 2003 the R&B act disbanded. Fortunately for J. Holiday, his vocal prowess and dynamic stage presence was too much of a commodity to pass up. A&R veteran, Anthony “T.A” Tate, of Music Line Group (Ciara, Teairra Marie) quickly set up a meeting with Capitol Records and a deal was made on the spot. “You just have to stay true to yourself,” Holiday says of his turbulent journey to becoming a recording artist. “A lot of artists nowadays are trying to be something that they are necessarily not. I don’t care how good a song is…if I don’t feel it personally, I’m not going to sing it because it’s not true to me. I feel very personal about my album. There’s nothing fake about it. This is my life. There are a lot of different stories out here and people just need to listen to them.”", "otherInfo": "Yoshi's Oakland Presents J. Holiday"}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Andy McKee ", "ArtistImage": "https://photos.bandsintown.com/thumb/11252044.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Acoustic, Instrumental Acoustic Guitar, Instrumental", "Time": "9:00 AM", "Venue": "Andy McKee's Musicarium 2021 (Guitar Camp)", "moreBioInfo": "Andy McKee is one of the world’s finest acoustic guitarists and it’s evident from the accolades he’s received throughout his career. It’s his youthful energy, attention to song structure and melodic content that elevates him above the rest. After nearly a decade without releasing new studio recordings, McKee returns with his six-track EP, Symbol, out Friday, September 17 on Mythmaker Records in conjunction with Cruzen Street Records. “These are my interpretations of tunes that really inspired me,” says McKee. “I wanted to give listeners a chance to hear what I hear when I listen to this music. I also wanted to branch out a bit and include music that isn’t originally for acoustic guitar.” While Symbol is a collection of inspired renditions, they are important song choices; artists that deeply influence McKee and song’s that connect to his musical past. He pulls from the catalogues of greats like Michael Hedges, Preston Reed, Billy McLaughlin and Prince. There’s “Ragamuffin,” the EP’s lead single, which is a nod to one of McKee’s biggest influences, Michael Hedges. McKee notes that “Michael was not only a revolutionary guitarist on the technical side, his ability to compose for solo guitar was also genius. Most importantly though, he was able to search inside of himself and consistently pull up very human and evocative themes that made him a true artist. I’ll always be grateful for his music.” One track that might catch fans by surprise on Symbol is McKee’s gorgeous rendition of Prince’s “Purple Rain.” In 2012, McKee played alongside Prince in his band on the “Welcome 2 Australia” tour with the song being one of the setlist highlights. “I had originally come up with the ‘Purple Rain’ arrangement to open the shows with while I was on tour with Prince in Australia,” recalls McKee. “I have played it occasionally since then while touring and figured I should finally get a recording of it down. One thing that I learned from Prince while we were on the road is that we both really admire Joni Mitchell. I used that as a reference when trying to describe what I do. Although some of what I do on the guitar is technically demanding, I don’t ever really want that to overshadow the music.” Another standout from Symbol is Mckee’s take on “Chattanooga” by acclaimed guitarist Preston Reed. “In my opinion, ‘Chattanooga’ by Preston Reed is one of the finest fingerstyle guitar pieces ever written,” says McKee. “It’s just loaded with texture, harmony, percussion, and melody. I love the key changes and chromaticism between some of the chords. This tune really inspired me a lot.” McKee, like many, was infatuated with the Rocky IV soundtrack, specifically the Vince DiCola compositions “War” and “Training Montage.” For Symbol, McKee and DiCola joined forces to craft “Rocky IV Medley.” “That was about as surreal as it gets for me,” says McKee. “I became a fan of Vince’s work when I was six years old and I bought the soundtrack to the film on cassette. I used to listen to it all the time on my Sony Walkman and I really found that my favorite tunes were the instrumental tracks which were “War” and “Training Montage” from Vince. Those tunes awakened my mind to the possibility of being moved by music with no words. To be able to recreate those tunes with the electric guitar and play with Vince is really something I could never have dreamed of.” Andy McKee entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique. McKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song “Drifting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the U.S. and Acoustic Magazine in the UK. He also curates his own annual guitar retreat called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts from Dream Theater to Tommy Emmanuel.", "otherInfo": "This is Andy McKee's Guitar Camp featuring Yvette Young, Guitaro 5000, Trevor Gordon Hall, and special guest Michael Manring. its 4 days of workshops, lessons, and intimate performances. For more information, or to register, go to https://andymckeesmusicarium.com/"}, {"Address": "8383 Silverado Trail, Napa, CA 94558", "Artist": "Zak Fennie ", "ArtistImage": "https://photos.bandsintown.com/thumb/11386802.jpeg", "Coordinates": [38.47662450000001, -122.3896475], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Alternative, Rock, Pop, Acoustic, Indie, Folk", "Time": "10:00 AM", "Venue": "ZD Wines (Private Event)", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "384 Hayes St, San Francisco, CA 94102", "Artist": "Dave Ricketts Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8515287.jpeg", "Coordinates": [37.7771105, -122.4226471], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "11:30 AM", "Venue": "Dave Ricketts at Arbor SF", "moreBioInfo": "Dave Ricketts, guitarist, singer, cornetist and bandleader. Aka Rave Dicketts, he started Gaucho Jazz in 2002. Dave's musical path is broad, he grew up playing trumpet in band class and guitar in his own band, his early loves being the Beatles and Louis Armstrong. Drifting to SF on a whim after graduation from classical music school in New Mexico he soon landed a job with the Hot Club of San Francisco. Dave has performed with many great contemporary musicians including Dan Hicks, David Grisman, and Father Guido Sarducci. He has toured places like Iceland, Amsterdam, NYC, Mexico, and Samois–sur–Seine (Django Reinhardt’s final home.) These experiences combined with his classical background have enriched Dave’s approach to music.", "otherInfo": "No event info available"}, {"Address": "6780 Depot St, Sebastopol, CA 95472", "Artist": "Samuel Gray Edmondson ", "ArtistImage": "https://photos.bandsintown.com/thumb/11543240.jpeg", "Coordinates": [38.4031563, -122.8211873], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "12:00 PM", "Venue": "Fern Bar", "moreBioInfo": "Intricate fingerstyle guitar from the musical mind of a punk kid who grew up to love nature, elegant melodies, and the expressive power of the acoustic instrument.", "otherInfo": "I'll be set up outside between Fern Bar, Wood Four, and Pax Wines. Come celebrate summer with me!"}, {"Address": "oakland  ca , Emeryville, CA", "Artist": "DJ Sneak ", "ArtistImage": "https://photos.bandsintown.com/thumb/11501329.jpeg", "Coordinates": [37.8395028, -122.2892278], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "House Music, Disco House, Vinyl, Ibiza, Chicago House, Electronic", "Time": "2:00 PM", "Venue": "BBQ & BEATS ", "moreBioInfo": "DJ Sneak is one of Chicago's second wave of influential Chicago House Music producers and a member of the vanguard of late-'90s American House Music; by 1992 a resurgence in the city's classic sound back to the main clubs & events. Sneak aided in the revolution with a series of single 12\"s that secured his Signature Sound in every DJs Collection. Besides the body of productions for USA and European Record labels, on the flip side \"the boss\" lived up to his name, touring across the globe over three decades, performing from the biggest festivals to local London pubs, the passion for playing House Music has become a beacon of light for many young producers that want to follow a legendary DJ with a stellar career while still maintaining a steady ship towards the future of dancing and entertainment. There are not too many truthful artists that can create on this level. moving forward after years of touring is live streaming and creating exciting experiences through video, the party is still not that clubs or festivals but the music is reaching far many in these years of transition into a new future.", "otherInfo": "DJ SNEAK AND A COUPLE OF GOOD LOCALS FROM THE BAY!"}, {"Address": "464 1st St E, Sonoma, CA 95476", "Artist": "Laura Benitez and the Heartache ", "ArtistImage": "https://photos.bandsintown.com/thumb/6295379.jpeg", "Coordinates": [38.2923719, -122.4556996], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rockabilly, Honky-tonk, Classic Country, Country, Americana, Early Rock And Roll", "Time": "2:00 PM", "Venue": "Laura Benitez Solo Acoustic at Murphy's Pub", "moreBioInfo": "Laura Benitez and the Heartache use the three chord tools of country music to tell the simple, unvarnished truth about love, too much whiskey, and the call of the road. On their new album, \"With All Its Thorns,\" they delve deeper into country music's tradition of storytelling with songs about betrayal (\"Secrets\"), murder (\"In Red\"), and grief (\"Ghostship\"), with a whole lot of heartbreak in between. Their twangy honesty shines through in straightforward arrangements, crystalline harmonies, and spare instrumentation. Beware their catchy hooks and sweet melodies - these stray puppy tunes will follow you home and become your most steadfast companions. Laura Benitez, songwriter, lead singer and founder of Laura Benitez and the Heartache, has been making her mark on stage and screen since 2000. She spent several years appearing in soap operas and commercials in Los Angeles before moving to the San Francisco Bay Area in 2004, diving into the region’s rich Americana and Roots music scenes. Taking her musical cues from the heavily rock influenced Bakersfield sound, and her lyric inspiration from her favorite songwriters Dolly Parton and Loretta Lynn, Laura began writing songs in 2008. She released her first album, \"For Duty or for Love\" on her own Copperhead Records label in 2010. In 2012 she recruited the multi-talented singer, songwriter, and drummer Michele Kappel-Stone (Kirby Grips/Tippy Canoe/Heartache Sisters) into the band, and was lucky enough to secure the talents of Bob Spector (The Spectones) and Ted O'Connell (The GoldDiggers, Moonshine Maybelline) on twang guitar and bass. These four joined together with Ian Taylor Sutton (The Walcotts, Misisipi Mike, Secret Town) on pedal steel to record their critically acclaimed full length album, \"Heartless Woman,\" which was released in 2014. 2015 saw the band touring to festivals in Southern California and Nashville, but also saw some changes in personnel, with Michele Kappel-Stone and Ted O'Connell turning their full-time attention to other projects. New members of The Heartache include Steve Pearson (Secret Town), Mike Anderson (77 El Deora), Jim Goodkind (Whiskey Pass), Patti Maxine (Island Breeze, Henhouse), and Chris Weinress (Mojo Mix). Benitez won an honorable mention for her as yet unpublished song, \"Our Remember Whens\" in American Songwriter Magazine's lyric contest for January of 2016. LB&H's critically acclaimed new album, \"With All Its Thorns\" is now available!", "otherInfo": "Join Laura B for an acoustic set at Murphy's Pub in Sonoma!"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "Jackie Greene ", "ArtistImage": "https://photos.bandsintown.com/thumb/10026284.jpeg", "Coordinates": [37.9682861, -122.5165447], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana & Rock, Americana, Rock, Soul, Folk, Country", "Time": "3:00 PM", "Venue": "Terrapin Crossroads", "moreBioInfo": "Armed with a persuasive voice, a vivid songwriting skill and an instinctive mastery of several instruments, Jackie Greene has carved out a unique musical niche synthesizing his deep affinity for American roots styles into his own timeless, personally-charged music while also engaging in a series of collaborative musical adventures that have teamed him with several notable veterans. In 2013, Greene joined the reunited Black Crowes as lead guitarist on their worldwide tour, and the following year released the self-titled debut album of super-group Trigger Hippy, which Greene is a member of along with Joan Osborne and Crowes drummer Steve Gorman. Greene is also a frequent member of Grateful Dead bassist Phil Lesh’s touring ensemble Phil Lesh & Friends, for which he has contributed lead guitar and vocals since 2007. Greene also toured as part of WRG, an acoustic trio with the Grateful Dead's Bob Weir and Black Crowes frontman Chris Robinson, and he performed with Levon Helm as part of Helm's fabled Midnight Ramble shows. Musical passion and creative integrity have been constants in Jackie Greene's musical life from the start. Growing up in Northern California, he taught himself to play piano and guitar during his childhood. His musical reference points shifted radically when, at the age of 14, he ran across a cache of his parents' vintage rock, country, blues and R&B LPs in the family's basement. Still in his teens and inspired by his discoveries, Greene began writing songs and performing them at a local coffeehouse while recording his compositions in his makeshift garage studio and burning CDRs to sell at his gigs. He saved the money he made selling those discs to fund his debut album, the self-produced, self-released Rusty Nails. Despite being a D.I.Y. release with minimal promotion, the disc received substantial regional attention from fans and press alike. After graduating from high school, Jackie relocated to Sacramento, where he quickly became a local favorite. His popularity led to a deal with a local independent label, which released his second album, Gone Wanderin', in late 2002. The disc won considerable national attention, leading to a series of national tours opening for the likes of B.B. King, Buddy Guy, Susan Tedeschi, Huey Lewis, Mark Knopfler and Taj Mahal. Greene continued to win critical acclaim and expand his fan base with 2004's Sweet Somewhere Bound and 2006's American Myth. In 2007, Greene began moonlighting with Phil Lesh and Friends, while continuing his own musical evolution with his own releases Giving Up the Ghost and Till the Light Comes, released in 2008 and 2010, respectively. After a five year recording hiatus to focus on touring with Phil Lesh, the Black Crowes, Trigger Hippy, and WRG, Greene’s latest album, Back to Birth, will be released in August 2015. \"The musicians that I really admire and try to emulate are the ones who have the whole package: they're great songwriters, great singers and great instrumentalists, and they have a vibe about them that's real,\" he states, adding, \"When I go to make a record, I'm not thinking about where I can fit in a bunch of guitar solos. I'm thinking, 'What does this song feel like? What's it saying?' So my goal, when writing a song or making a record, is to find the core of that emotional experience and convey that.\" Although he's already racked up a multitude of impressive musical achievements, Greene isn't one to look back. Instead, he continues to look to the future - and looks forward to getting back on the road to bring Back to Birth's soulful songcraft to the loyal, wildly diverse fan base that he's built through talent, vision and hard work. \"I still plan on making a lot of different kinds of records in the future, but I can't tell you what they're going to sound like, because I really have no idea,\" he asserts. \"All I can do is write songs and make music as honestly as I can. That's what I believe people appreciate about what I do. They trust me to be honest with them, and I'd never want to abuse that trust.\"", "otherInfo": "No event info available"}, {"Address": "1435 Webster St., Alameda, CA 94501", "Artist": "Lucy & The Long Haul ", "ArtistImage": "https://photos.bandsintown.com/thumb/8953634.jpeg", "Coordinates": [37.77253839999999, -122.2770787], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Ivy Room & Fireside Lounge presents", "moreBioInfo": "Rock and roll from Oakland CA", "otherInfo": "Tiny Towns Outdoor Concert Series"}, {"Address": "1435 Webster St., Alameda, CA 94501", "Artist": "Tarnation ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.77253839999999, -122.2770787], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country, Alternative Country", "Time": "4:00 PM", "Venue": "Ivy Room & Fireside Lounge presents", "moreBioInfo": "No artist bio available", "otherInfo": "Tiny Towns Outdoor Concert Series"}, {"Address": "1435 Webster St., Alameda, CA 94501", "Artist": "Paula Frazer ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.77253839999999, -122.2770787], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Singer, Alternative Country, Songwriter, Country, Folk", "Time": "4:00 PM", "Venue": "Ivy Room & Fireside Lounge presents", "moreBioInfo": "lead vocalist for tarnation and now soloist. she has a brilliant, exact country voice capable of yodelling to great effect. the arrangements of her songs are eerie and lovely, inflected with morricone atmospheres. second to singing, she weaves all manner of beautiful things from materials.", "otherInfo": "Tiny Towns Outdoor Concert Series"}, {"Address": "229 Water St North, Petaluma, CA 94952", "Artist": "The Beer Scouts ", "ArtistImage": "https://photos.bandsintown.com/thumb/11457454.jpeg", "Coordinates": [38.2366122, -122.6408925], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Blues-rock, Blues", "Time": "5:00 PM", "Venue": "Beer Scouts Rock Brewsters!", "moreBioInfo": "The Beer Scouts are Rob Ruiz (12 string bass/vocals), Howard Vatcher (guitar/vocals) and Kenny Susan (drums, vocals). They play straight ahead rock and roll original and cover tunes influenced by artists such as the Beatles, Brownsville Station, Cheap Trick, the Smithereens, Grand Funk Railroad, Chuck Berry and even the Monkees! In their careers the members of the Beer Scouts have shared the stage with the biggest names in rock music, including Van Halen, Jeff Beck, Bob Dylan and many more. They have played a wide range of venues, from the Concord Pavilion to New York’s Bitter End, from hometown bars to London pubs. The Beer Scouts are on a mission to find a few good bars in their quest to bring the fun back to rock ’n’ roll music. Their motto: “Will Rock For Beer”!", "otherInfo": "No event info available"}, {"Address": "3005 Stone Valley Rd, Danville, CA 94526", "Artist": "Britnee Kellogg ", "ArtistImage": "https://photos.bandsintown.com/thumb/11499332.jpeg", "Coordinates": [37.8428913, -121.9845507], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Country", "Time": "6:00 PM", "Venue": "Music in the Park", "moreBioInfo": "Britnee Kellogg was three years old when she started singing, and she’s never stopped. Her impressive career began at local fairs and talent shows – anything that gave her the chance to perform. If it had a stage and a microphone, she was there. Her love of country music started when she was nine years old a Johnny & June concert in Portland, OR. Smitten from the first note, Kellogg knew that she had found her chosen career. Every day since then has brought her one step closer to her dream. Today, you’ll find Kellogg opening for the likes of Blake Shelton, LOCash, Lee Brice, Kip Moore, Jake Owen, and Little Big Town. She also appeared on Season 11 and Season 12 of American Idol. Kellogg’s goal is to create a sound that people can relate to their own personal stories, and encourage them to also go after their dreams, regardless of their circumstances. Her debut EP was released in April of 2019, and is being showcased on CMT as well as Taste of Country. She is a driven, passionate artist with an incredible love for her craft.", "otherInfo": "No event info available"}, {"Address": "25 Main St, Tiburon, CA 94920", "Artist": "The Complements ", "ArtistImage": "https://photos.bandsintown.com/thumb/8140915.jpeg", "Coordinates": [37.8729573, -122.456322], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Positive Rock, Indie, Acoustic", "Time": "6:00 PM", "Venue": "Main Street Music", "moreBioInfo": "Singer-songwriter acoustic duo from California.", "otherInfo": "No event info available"}, {"Address": "6541 Washington St, Yountville, CA 94599", "Artist": "Monica Da Silva ", "ArtistImage": "https://photos.bandsintown.com/thumb/8230127.jpeg", "Coordinates": [38.4030408, -122.3634768], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Worldbeat, Lounge, Indie, Brazilian Music, International, World Fusion, Bossa Nova, International Fusion", "Time": "6:00 PM", "Venue": "Vintage House", "moreBioInfo": "Mônica da Silva grew up living between The United States and Belém, Brazil, a city on the Amazon River. A love of travel and foreign language helped to forge her unique sound. da Silva's music contains an eclectic mix of influences. Her sound can be classified as International Fusion, as it is heavily influenced by Brazilian music, namely Bossa Nova, but also incorporates elements of Lounge, Electronica, Indie Pop, and Worldbeat. da Silva’s songs have been featured in the movie ‘Lady Bird’, in the Paramount Network series ‘American Woman’, in The World Cup, on TED Talks, in The BBC One series \"The Replacement”, and on the Putumayo World Music compilation “Brazilian Beat”. She is currently recording a new, full-length solo album, as well as writing and recording with her project, Complicated Animals.", "otherInfo": "No event info available"}, {"Address": "761 2nd St, Brentwood, CA 94513", "Artist": "Toree McGee ", "ArtistImage": "https://photos.bandsintown.com/thumb/9049618.jpeg", "Coordinates": [37.9340428, -121.6947618], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Alternative Country, Rock, Country", "Time": "6:00 PM", "Venue": "Toree & David @ Harry's Wine Depot", "moreBioInfo": "With a rafter-reaching soprano ranged voice that emanates grit and fire, Toree McGee describes her music as a blend of “Woodstock rock ‘n’ roll, and sparkly country.” This eclectic style is equal parts percussion-driven swagger and playful melodies. Behind the northern California native’s powerful, edgy vocals is a candid, bubbly personality, along with a natural, effervescent stage personality inherited from a family filled with performers. Toree's musical style embodies elements of her influences, ranging from the soulful country sounds of The Judds and Bonnie Raitt, to the rock of Guns N’ Roses and Aerosmith, and especially the engrossing vocals of Janis Joplin. McGee began writing songs and soliciting material for her six-song EP, perfecting her sound into a unique fusion of country, soul and rock that would reflect her edgy roots and support her powerhouse vocals. “Run Right Back To You,” which boasts McGee as the sole writer, is among the standouts on the project. McGee recorded tracks for the EP in 2014 at Ronnie's Place in Nashville, alongside seasoned musicians who have performed with Jason Aldean and Luke Bryan, among others. “I wanted to blend my love of hard rock and country together,” McGee says of the project. “I have this heavy-hitting, gravelly tone in my voice, and I didn’t want to lose that side of me. But country has always been my favorite genre of music. That’s where I want to be, but I want to bring a bit of that old style of rock with me.” Toree's first single, \"Amen\" gained airplay on radio stations in California, the midwest, and Canada, and climbed to the #1 slot on 95.3 KRTY's 'Hot 9 @ 9' segment for several days in a row. It has also gained the attention of Sirius/XM radio, as well as local news stations which have featured her music and story. She most recently co-wrote and recorded brand new songs with hard hitting guitar riffs and tons of girl power attitude, and released her first full-length album on Valentine’s Day 2020 . Her first single from the project, named “Lipstick” is currently in rotation at KRTY as well as on Sirius/XM’s station ‘The Pulse’. McGee opened for country music superstar, Clay Walker in San Jose, followed by opening slots for rising stars, A Thousand Horses, Austin Webb, Brian Davis, Drake White, Cadillac Three, Brett Young, Whiskey Myers, Justin Moore, Randy Houser, Kellie Pickler, The Marshall Tucker Band, and others. Her first full EP was officially released in 2015, and her first full-length album was released in February 2020. Since her first EP release, she has played shows at NASCAR races, the Aria Hotel & Casino in Las Vegas, Grand National Rodeo, for the U.S. Air Force at RAF Mildenhall in the U.K., the Night in the Country music festival in Nevada alongside Justin Moore, Craig Morgan, Drake White, & Thomas Rhett, and most recently at the iconic Fillmore in San Francisco.", "otherInfo": "No event info available"}, {"Address": "644 Main St, Suisun, CA 94585", "Artist": "Tracy Cruz Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/11472926.jpeg", "Coordinates": [38.2388257, -122.0405872], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Soul, R&b/soul, Rnb-soul", "Time": "6:30 PM", "Venue": "Tracy Cruz & Instrumentali-T LIVE at Suisun City Waterfront Music Series ", "moreBioInfo": "Tracy Cruz has a voice that will melt even the toughest of hearts. This vocal powerhouse aims to connect communities with her universal language of love, hope, and happiness. Her unique musical and lyrical blend -- Bay Area urban soul tinged with the influence of her indigenous Filipino roots --has captured the ears of music lovers around the world. Boasting a vocal range that might be bigger than her, Cruz emanates a classic and timeless feel. Two full-length albums (Feel’osophy and Universoul Symphony) and an EP (Illuminate Love) have garnered numerous awards and nominations including two Bay Area Black Music Awards for \"Best CD/Recorded Performance\" and \"Bay Area Rising Star\" as well as Northern California Entertainers Music Award nominations for \"Female Neo Soul Artist of the Year\" and \"Female Entertainer of the Year.” She has supported several established acts including: Kenny Lattimore, Miki Howard, Keke Wyatt, Bilal, and others. The songstress approaches her music unapologetically and freely, staying true to herself, while her stellar band \"Instrumentali-T\" provides a grown and sexy soundtrack for her vocal creations. They completed a 17-venue, 4 month “SOULShine Tour” around California in the summer of 2016. Most recently, she had a SOLD OUT dual CD release concert with R&B/Soul band Feelosophy at Yoshi's in Oakland on 8/22/17. Cruz continues to grow personally and musically, introducing a new chapter into her musical journey. Her newest single, \"Losing in Love” is perhaps her most vulnerable composition to date. It is a prelude to the collection of raw emotions captured on her upcoming EP “H3artifacts.” Paired down to only a piano and vocals, the record conveys the ultimate form of musical vulnerability and fragility. Digging deep into a broken heart, the record explores themes of love, loss, pain, and hope. “I wrote ‘Losing in Love’ during a very painful time in my life. I felt like my heart was breaking into a million pieces and I was losing everything all at once. I couldn't stop crying so I poured out all of my emotions and wrote a song. It was a cathartic release,” shares Cruz. She is fearlessly exposed as she shares her personal journey of reclaiming self-love, perseverance, humility, resilience, and healing. With her continued success and loyal fan base, this new release will not disappoint. She continues to tour and record as well as remaining a strong presence in her community, working with local youth as a vocal coach and mentor. She encourages them to follow their dreams to sing freely and wholeheartedly. -Written by Elle K. Productions 9x award-winning R&B/Soul music artist. New single \"Keep Our Soul Alive \" (produced by Brandon Williams) will be released on 3/14/18 www.tracycruzmusic.com", "otherInfo": "Multi-award winning R&B/Soul music artist Tracy Cruz and her band “Instrumentali-T” will be performing at the Suisun City Waterfront Music Series. Two sets 6:30-7:30 & 8-9 pm. www.tracycruzmusic.com"}, {"Address": "641 Santa Cruz Ave, Menlo Park, CA 94025", "Artist": "Rebecca DuMaine and the Dave Miller Trio ", "ArtistImage": "https://photos.bandsintown.com/thumb/11370725.jpeg", "Coordinates": [37.4524799, -122.1834076], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Jazz", "Time": "6:30 PM", "Venue": "Jazz @ Vida", "moreBioInfo": "Jazz Music", "otherInfo": "two sets of French and American jazz"}, {"Address": "1475 Clubhouse Dr, Discovery Bay, CA 94505", "Artist": "Atlantic Crossing ", "ArtistImage": "https://photos.bandsintown.com/thumb/11150967.jpeg", "Coordinates": [37.894651, -121.5936315], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Tribute Band", "Time": "7:00 PM", "Venue": "Rod Stewart tribute Concert", "moreBioInfo": "No artist bio available", "otherInfo": "Live band presenting the ultimate tribute to Rod Stewart, Ticket sales TBA"}, {"Address": "San Mateo, CA", "Artist": "John Elliott ", "ArtistImage": "https://photos.bandsintown.com/thumb/11502415.jpeg", "Coordinates": [37.5629917, -122.3255254], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "The Back Forty", "moreBioInfo": "http://www.thehereafterishere.com", "otherInfo": "No event info available"}, {"Address": "982 Market St, San Francisco, CA 94102", "Artist": "Lucinda Williams ", "ArtistImage": "https://photos.bandsintown.com/thumb/10404381.jpeg", "Coordinates": [37.7827039, -122.4103578], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk Rock, Rock, Americana, Alternative Country", "Time": "7:00 PM", "Venue": "The Warfield", "moreBioInfo": "Three time Grammy Winner Lucinda Williams. Currently on tour!", "otherInfo": "No event info available"}, {"Address": "Gravenstein Hwy S, Sebastopol, CA 95472", "Artist": "Anna Moss & the Nightshades ", "ArtistImage": "https://photos.bandsintown.com/thumb/11433452.jpeg", "Coordinates": [38.3921302, -122.8175568], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "New Family Farm", "moreBioInfo": "New Orleans, bedroom pop. The Soul-O project of Anna Moss of Handmade Moments", "otherInfo": "No event info available"}, {"Address": "350 Harbor Dr, Sausalito, CA 94965", "Artist": "Chapell ", "ArtistImage": "https://photos.bandsintown.com/thumb/9016443.jpeg", "Coordinates": [37.8680978, -122.4976978], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie Folk, Alt Rock, Rock, Indie Rock", "Time": "7:00 PM", "Venue": "Live Bait", "moreBioInfo": "Alan Chapell is a unique character – even by the standards of the West Village, NYC. Made from years of traveling the world and honing his craft and moving effortlessly through several musical genres without a single tune sounding the same. Seriously good songwriting that’s augmented by what many are calling the best seven piece band in New York. All led by Chapell - Mephistopheles outfitted in a well-tailored white linen suit. Growing up on the “mean streets” of Stamford, Connecticut, Alan Chapell was something of a musical wunderkind - playing piano and trumpet before the age of six. He recorded with the legendary Jimmy Ienner at age 15, and more recently with Talking Head Jerry Harrison. He’s played to jam-packed houses around the world from Mumbai to Managua. It took Chapell a while to get here, but audiences across the U.S. are starting to take notice in a big way. Chapell’s band includes Lorenza Ponce on violin, Ann Klein on guitar, Ali Culotta on piano, Malcom Gold on bass and Rodney Howard on drums. Ponce plays a variety of delicious retro-synth lines which both play off of and play with Klein’s guitar work. There are multiple moving parts that all go together a bit differently depending on the song (and Chapell’s mood.) Chapell’s live show is a cacophony of juxtapositions. His set moves seamless from genre to genre and from topic to topic. From songs about love to songs about more heady topics such as gun violence and human rights. And finally, to a parody of Mark Zuckerberg’s recent Congressional testimony. With all that, Chapell somehow manages to keep things fun – not to mention you are guaranteed to leave the night with at least a few of Chapell’s melodies stuck in your head. On making music in 2019 Chapell now says, “I feel like I’m discovering myself as an artist in a way I never could have earlier in my life. For too long, I bought into the notion that I couldn’t become a successful artist in my 30’s – and it was liberating to recognize how foolish that was. The most invigorating thing is that I don’t feel I’ve written my best song yet. I know who I am now and I am excited that I am nowhere close to my peak.”", "otherInfo": "Alan Chapell plays a special solo concert at Live Bait in Sausalito (next to the world famous Fish Restaurant)"}, {"Address": "2001 Gayley Rd, Berkeley, CA 94720", "Artist": "Bobby Weir ", "ArtistImage": "https://photos.bandsintown.com/thumb/11428814.jpeg", "Coordinates": [37.8735609, -122.2544216], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Blues, Rock, Classic Rock", "Time": "7:00 PM", "Venue": "Bobby Weir & Wolf Bros At Greek Theatre At UC Berkeley", "moreBioInfo": "Founding member of The Grateful Dead, RatDog and Dead & Company. Blue Mountain, my first all original album in 30 years, is out on LP, CD & iTunes.", "otherInfo": "Next stop, the Greek Theatre! Catch Bobby Weir & Wolf Bros LIVE at UC Berkeley on July 24. The show will feature Bobby Weir, Don Was, and Jay Lane featuring Jeff Chimenti and Greg Leisz with special guests The Wolfpack. Presale begins Wednesday, 6/23 from 10am PT-10pm PT with code BWWBCO. Tickets go on sale this Friday (6/25) at 10am PT."}, {"Address": "419 Georgia St, Vallejo, CA 94590", "Artist": "Anika Evans ", "ArtistImage": "https://photos.bandsintown.com/thumb/11529629.jpeg", "Coordinates": [38.100856, -122.2560391], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Gospel", "Time": "7:00 PM", "Venue": "Bay Area Gospel All Star Worship Experience", "moreBioInfo": "Evangelist, Psalmist and C'hellaNique Records Gospel Artist . Debut Album \"It's Necessary\" New Single “God’s Favor”", "otherInfo": "House Of Worship Presents Bay Area Gospel All Star Worship Experience"}, {"Address": "350 Harbor Drive, Sausalito, CA 94965", "Artist": "Alan Chapell ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8680978, -122.4976978], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Bait in Sausalito", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "1356 S Livermore Ave, Livermore, CA 94550", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/9046383.jpeg", "Coordinates": [37.6727857, -121.7537723], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Comedy", "Time": "7:30 PM", "Venue": "Comedy Uncorked", "moreBioInfo": "Comedian", "otherInfo": "No event info available"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Tommy Guerrero ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.8077498, -122.2726995], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "The New Parish", "moreBioInfo": "Originally known as a member of the old school skateboarding gang \"The Bones Brigade\". He spent several years in the group Jet Black Crayon before releasing his first solo-Single in 1995, entitled \"Backintheday.\" He mixes a variety of jazz, ambient, and hip-hop styles to create a very soulful and chill vibe throughout his followup cds. On his CD \"Soul Food Taqueria\" he collaborated with both Gresham Taylor and the rapper Lyrics Born to add vocal tracks to several of his creations.", "otherInfo": "No event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Mo Mandel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619297.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Punch Line Comedy Club", "moreBioInfo": "No artist bio available", "otherInfo": "This show is 18 & over with valid, government-issued photo ID. There is a two drink minimum per person. Cameras and video/audio recording devices are not permitted. Ticket sales shut off online before doors open; there may be tickets available at the show. Reserved Premium Seating: $35 General Admission: $25 in advance, $28 day of show"}, {"Address": "2209 Broadway St, Redwood City, CA 94063-1641", "Artist": "The OaKs ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.4862635, -122.2294701], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie, Alternative", "Time": "8:00 PM", "Venue": "CLUB FOX", "moreBioInfo": "No artist bio available", "otherInfo": "The Live Oaks is a rapidly emerging Americana band that evokes the classic spirit of San Francisco 60's rock and roll."}, {"Address": "1910 Sebastopol Rd, Santa Rosa, CA 95407", "Artist": "JeConte ", "ArtistImage": "https://photos.bandsintown.com/thumb/11543035.jpeg", "Coordinates": [38.4267718, -122.7401717], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Americana, Rock, Blues, Soulful Blues, World Blues, Folk", "Time": "8:00 PM", "Venue": "JeConte & The Salty Dawgs ", "moreBioInfo": "Inspirational Northern California Rock 'n' Roll at its best. JeConte brings an energy level and performance that gets the crowd rocking and keeps it rocking. This energy, combined with a deep soulful New Orleans Blues, Jazz & Funk influence, along with JeConte's non-stop lightening harmonica chops, makes this high energy music experience what live Rock, Blues, and Funk music is all about. JeConte has been singing and playing harmonica all of his adult Life, his style is his own and features his soulful, bluesy vocals and a Texas Blues/Jazz/Funk Harmonica style that is one of a kind. He plays his harmonica's through a vintage 1940's Vega Amp and multiple customized and modified microphones: a custom turner, and a modified JT30 top the list. Over the years JeConte has played with a number of musicians throughout the San Francisco Bay Area, New Orleans, Seattle, New York, Los Angeles, Europe, West Africa, Latin America and South America. He has been a member of many projects including, THIC, The Push, & Citronica Muse. JeConte's self-titled debut album 'Sweet Northern California' has received rave reviews and his Sophomore album 'Down by the Bayou' comes out in 2013. You can purchase his first album 'Sweet Northern California' direct from the iTunes. SNC features Mattey Cohen on Vocals and Guitar, Lex Razon on Drums, Mike Sugar on Bass and JeConte on Vocals, Harmonica and Guitar. All tunes are written by JeConte and Mattey Cohen except for 'Macaroon' (JeConte & Chris Haugen) and 'Run to the Sea'(JeConte & Mike Sugar). Special guests include: Derek Brooker, Robin Coomer, Chris Haugen, Glenn Hartman, Wally Ingram, Sean Leahy & Alan Williams. JeConte has shared the stage with: Players: Khaiara Arby, Tab Benoit, Stevie Black, Jackson Browne, Mangala Camera, Les Claypool, Brett Dennen, Carl Dufrene, Kervyn Cole, Cecil 'P-Nut' Daniels, CR Gruver, Eenor, Dale Fanning, Tom Freund, Fuzz, Glenn Hartman, Chris Haugen, Vince Herman, Basekopu Kouyaté, Wally Ingraham, Kirk Joseph, Michael Lamacchia, The Leroi Brothers, Arne Livingston, Eric Lindell, David Lindley, Jessica Lurie, Papa Mali, Bill McKay, Tommy Miller, Eric McFadden, Mike Myers, Anders Osborne, Mighty Dave Pelliccaro, Radio, Lex razon, Christopher Robin, Oumou Sangaré, Pete Sears, Ron Kat Spearman, John 'Stuball' Syewart, Derek Trucks, Vieux Farka Touré, Rob Wasserman, Bob Weir, Andy Widman, Mitch Woods, and many many more... Bands: ALO, Alphabet Soup, Anders Osborne, The Axis Bothers, Tab Benoit, Black Dog, Christopher Robin Band, Les Claypool, John Cleary, Carl Dufrene, Deep Banana Blackout, Jazz Mafia Trio, Dave Gleason's Wasted Days, Living Daylights, Leftover Salmon, Jerry Hannan, Mother Hips, NewMastersounds, Outformation, Papa Mali, Poor Man's Whiskey, Raw Deluxe, Freddie Roulette, Pete Sears, SOULIT, Ron Kat Spearman, Tea Leaf Green, Derek Trucks Band, Transcendental Hayride, Wild Magnolias, World Anthem Band, Vinyl, and many many more... JeConte's new record Down by the Bayou featuring Anders Osborne was also produced by Anders at Dockside Studios in Maurice LA. The band consists of Matty Cohen, Chris Haugen, Carl Dufrene & Wally Ingram. Oh Yeah!!!", "otherInfo": "JeConte is a blues rock singer and harmonica player based in Sausalito California. He travels the World performing at clubs and festivals with his bands based in: San Francisco Bay Area, New Orleans, Paris - France, and Bamako - Mali. ‘Down by the Bayou,’ produced by, and featuring, Anders Osborne and released on Red Parlor Records is his latest record with 3 Covid releases in the can and coming out soon.\n\n'Down by The Bayou' showcases the bluesy soulful vocals and lightening harmonica chops of renowned live wire JeConte, backed by a ferocious blues rock band featuring New Orleans legend Anders Osborne, veteran LA rocker Wally Ingram, Bayou Bassman Carl Dufrene, San Francisco slide virtuoso Chris Haugen & long time JeConte writing partner and lead guitar maestro Bay Area's Matty Cohen. \n\nDown by the Bayou dips deep into the roots of the Bayou, while simultaneously preserving the NorCal Rock n’ Roll and West African influences of JeConte’s style. Recorded upon his escape from the coup d’etat in Mali at Dockside Studios in Maurice Louisiana, JeConte went directly from the war torn West African country and the The MALI BLUES Sessions, into the heart of the Bayou to carve out a record that inspires deep soulful southern blues, and begs the listener to ask for more."}, {"Address": "2284 San Pablo Ave, Pinole, CA 94564", "Artist": "Chris James and the Showdowns ", "ArtistImage": "https://photos.bandsintown.com/thumb/8652905.jpeg", "Coordinates": [38.00561829999999, -122.2911957], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk Rock, Acoustic", "Time": "8:00 PM", "Venue": "Antlers Tavern", "moreBioInfo": "After hearing Chris James at one of his tireless performances, you’re immediately – and intensely – drawn into his music, taken on a journey with his heartfelt songs. His warm vocals and authentic writing style combined with a bold grit give Chris James and the Showdowns that classic-infused deep-rooted Americana rock sound. Beginning as a local performer in Portland, Maine, James knew that he had to get his name heard in bigger cities. He left for San Francisco with nothing more than a guitar in hand to find work. Eventually, he joined forces with The Showdowns, a Bay Area-based group comprised of Matt Berg (drums), AJ Leighton (bass), John Paterson (keys), and Whitt Vicena (lead guitar). The unity amongst the band can be felt at every show through their synergized performances. Songs from their debut album, Lucky Breaks, and music from James’ solo work have been played generously on SiriusXM Radio, radio stations throughout California, and placed in TV commercial promos. Chris James and the Showdowns’ second album, Somewhere out in California, is authentic, dance-driven, heartfelt, and has been getting loads of attention from various media outlets. They have a packed tour schedule for the rest of the year, including full band and solo performances. Driving down the open road can get us lost in our thoughts when surrounded by the right views and accompanied by the right music. The title track off the album, “Somewhere out in California” begins with an acoustic guitar solo then joined by elegant piano keys. The intimate video is characterized by the natural beauty of California: the views, the ocean, and the forests. “Somewhere out in California” is the narration of a restless heart, reminiscing on all the possible “what ifs” of life. Every day we are forced to make hundreds of choices, big and small. After making a decision we sometimes have afterthoughts, imagining how life would be if different decisions were made and if different things were said. The lyric, “Did you ever feel like we missed the bus” is the metaphorical concern of making the wrong choices in the past and missing prime opportunities or possible new adventures. It is essential to remind ourselves to take risks: if not, we will regret all the possibilities that could’ve been. --\"James' style of writing is hard to deny as it rings of times and life situations we can all relate to. It's nice to see an artist and band like the Showdowns hold true to Americana roots while still giving you a rock and roll kick in the ass!\" -Starita (Producer - Trevor Hall, Tribe Called Quest) --\"Chris is a singer-songwriter with an honest approach and style that really speaks to everyday people...\" - J. Bowman (Lead Guitarist - Michael Franti & Spearhead)", "otherInfo": "FULL BAND returns to ANTLER's TAVERN!"}, {"Address": "2209 Broadway St, Redwood City, CA 94063-1641", "Artist": "The Oaks (band) ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.4862635, -122.2294701], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "CLUB FOX", "moreBioInfo": "No artist bio available", "otherInfo": "The Live Oaks Band is a rapidly emerging Americana band that evokes the classic spirit of San Francisco 60's rock and roll."}, {"Address": "627 2nd Ave, Crockett, CA 94525", "Artist": "Gürschach ", "ArtistImage": "https://photos.bandsintown.com/thumb/11503797.jpeg", "Coordinates": [38.0532881, -122.2235748], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Heavy Metal, Progressive Metal, Metal, Experimental Metal, Dark Matter, Thrash Metal", "Time": "8:00 PM", "Venue": "Gurschach/GreyBush/WurmFlesh/Blessed Curse/Nothing but Losers", "moreBioInfo": "Gürschach (pronounced Ger-shock) is a four-piece Experimental Metal band from the San Francisco Bay Area, whose main vision is to create an unfamiliar, yet captivating listening experience for their audience.", "otherInfo": "LiquidDuaneo Metal productions presents..\nJULY 24TH 2021 @Toots Tavern\nOfficially my 1st show back after covid!!\nBANDS:\nGURSCHACH\nGREYBUSH\nWURMFLESH\nBLESSED CURSE\nNOTHING BUT LOSERS\nDon't miss these killer metal bands!!\nDoors @8\nSHOW @8:30\n21+ / $10 cover\nGREAT SOUND / STAFF / SECURITY / DRINKS / FOOD / LIGHTS / VIBES"}, {"Address": "44 Race St, San Jose, CA 95126", "Artist": "Starover Blue ", "ArtistImage": "https://photos.bandsintown.com/thumb/11421667.jpeg", "Coordinates": [37.3305076, -121.9116715], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Shoegaze, Experimental, Indie, Dream Pop, Experimental Alternative", "Time": "8:00 PM", "Venue": "Starover Blue Live Online Concert from Art Boutiki", "moreBioInfo": "The nostalgic tones of a Juno 106 combine with ambient layers, sparkling guitars, and airy, bittersweet vocals to define Portland experimental dream pop band Starover Blue. Founding members Kendall Sallay and Dirk Milotz began their musical partnership in 2007 in the San Jose State University music department. Live, the four-piece pulls from a multi-faceted discography, appealing to fans of acts such as Wye Oak, Cocteau Twins, A Sunny Day in Glasgow, The Joy Formidable, Low Roar, and The Antlers.", "otherInfo": "Livestream with limited in-person tickets available."}, {"Address": "4100 Monterey Hwy, San Jose, CA 95122", "Artist": "Los Morros del Norte ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.2794835, -121.8341096], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Pop", "Time": "8:00 PM", "Venue": "Event Center La Ceiba", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "4100 Monterey Hwy, San Jose, CA 95122", "Artist": "Montez De Durango ", "ArtistImage": "https://photos.bandsintown.com/thumb/8455004.jpeg", "Coordinates": [37.2794835, -121.8341096], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Duranguense, International", "Time": "8:00 PM", "Venue": "Event Center La Ceiba", "moreBioInfo": "Se forma en la ciudad de Chicago allá por 1996, encabezado por su fundador y director musical, José Luis Terrazas, quien reúne a un grupo de talentosos músicos que al igual que él, tenían un gran deseo de triunfar y dejar huella en la música regional mexicana. Diez años después, las ventas millonarias de discos tales como: “RAMA SECA”, “TU MIRADA”, “DE DURANGO A CHICAGO”, “EN VIVO DESDE CHICAGO”, “Y SIGUE LA MATA DANDO” entre otros, respaldan el impresionante éxito de MONTÉZ DE DURANGO que ha impuesto un estilo en la música, la manera de bailar y vestir. El tema “Rama Seca” es el que les abre las puertas de la disquera BMG, la cual los firma y les produce su primer disco del mismo nombre. “TU MIRADA” es el título de su segunda producción que también es grabada bajo el sello de BMG. Su tercer disco titulado “LA AUSENCIA” fue el primero que grabaron para su propio sello Terrazas Records, marcando con éste, lo que sería el inicio de sus múltiples éxitos. Posteriormente, para cuando grabaron el disco “LOS PRIMOS DE BALTAZAR”; el grupo ya empezaba a figurar como un fenómeno musical, rompiendo récords de taquilla en sus presentaciones. “CON SABOR A TAMBORAZO”, fue su quinta producción con la que inmediatamente acapararon la atención del público, animándose a grabar su sexto disco totalmente en vivo. Después de 6 producciones, José Luis Terrazas acepta la invitación que la disquera transnacional Disa Latin Music le hace para formar parte de su elenco, grabando de inmediato el primer disco para este sello titulado “EL SUBE Y BAJA”. Demostrando que el pasito duranguense no era exclusivo de la ciudad de los vientos, se lanzó en octubre del 2003, el disco “DE DURANGO A CHICAGO”, sólo superado en las listas de Billboard por el álbum “33” de Luis Miguel. Para el año 2004, en agradecimiento a la ciudad que los vio formarse musicalmente, grabaron el disco titulado “EN VIVO DESDE CHICAGO”, el cual debutó en la posición número uno de Billboard. Tanto es el auge de la onda duranguense, que Disa decidió realizar un producto especial con varios artistas del género, sin embargo; la peculiaridad de esta producción titulada “QUE CHIDO! EL PASITO DURANGUENSE” es la magistral participación que tiene MONTÉZ DE DURANGO. Previo a lanzar en el 2005 su producción discográfica, MONTÉZ DE DURANGO participó de manera especial en un disco titulado “LAS MAS BAILABLES DEL PASITO DURANGUENSE. En febrero del 2005, sale al mercado el álbum “Y SIGUE LA MATA DANDO”, una producción muy esperada por el público, que gracias a su apoyo les trajo muchas satisfacciones. Más vivos que nunca y disfrutando de un éxito sin precedente en cada presentación, MONTÉZ DE DURANGO decide lanzar también en el 2005, otras dos producciones discográficas de éxitos, la primera titulada “VIVE” y la segunda que salió para cerrar el año con el nombre de “LOS SÚPER ÉXITOS LAGRIMILLAS TONTAS”, en el que incluyen como bonus track el éxito “Lagrimillas tontas”. En el 2006, la agrupación siguió cosechando triunfos y es así que su casa disquera saca a la venta varias producciones, la primera de ellas denominada “500 NOVILLOS”, un disco que causó furor años atrás, pero lo presentan de una manera totalmente fresca y renovada, aprovechando los nuevos avances tecnológicos de la actualidad. Este álbum le da paso a los “ÉXITOS EN VIVO”, producción que recopila los grandes éxitos que la agrupación ha tenido a lo largo de su carrera, siguiéndole también “GRUPO MONTÉZ E INVITADOS” y “LOS SÚPER ÉXITOS 2 ADIÓS A MI AMANTE”. Para cerrar con broche de oro el 2006, MONTÉZ DE DURANGO presentó su disco “BORRÓN Y CUENTA NUEVA”, producción que mostró una gran evolución en la mezcla de ritmos. Los temas “Adiós a mi amante”, “Que vuelva” y “Me duele escuchar tu nombre”, se lograron posicionar como consentidos del público. La sorpresa musical fue sin lugar a dudas, la incursión de la agrupación al género Pop, ya que aparte de sobresalir con el tema “Me duele escuchar tu nombre” en la versión duranguense, se arriesgaron a grabar la versión Pop de esta melodía consiguiendo de inmediato, resultados inimaginables. La exitosa agrupación MONTÉZ DE DURANGO, después de conseguir el premio Lo Nuestro en la categoría Álbum Regional Mexicano, Dúo u Grupo, un reconocimiento Billboard como Artista Duranguense del Año y satisfacciones por altas ventas con su álbum “BORRÓN Y CUENA NUEVA”, el grupo dirigido por José Luis Terrazas presenta en este 2007, su nueva producción discográfica “!AGÁRRESE!”. El disco viene integrado por doce melodías, entre las que se encuentran: “El hijo del amor”, “Chuy y Mauricio”, “El chivo pelón”, “Bachata rosa”, “¿Dónde está?”, “Etapas de mi vida”, “Lágrimas del corazón”, “Chaparrita”, “Újule”, “La banda dominguera”, y además, para aquellos que se preguntaban por la versión pop de “Me duele escuchar tu nombre”, viene incluida en este álbum como bonus track. El primer sencillo que se desprendió de esta producción llevó por título “Lágrimas del corazón”; una melodía que aborda la melancólica situación que muchos de nuestros paisanos viven en busca del sueño americano. Posteriormente la agrupación promocionó el segundo sencillo de esta agrupación titulado “Como en los buenos tiempos” una ranchera duranguense de la inspiración del propio José Luis Terrazas, además de Edgar Cortázar y Adrián Pieragotino. Paralela a esta promoción MONTEZ DE DURANGO ha lanzado un álbum totalmente el vivo, el segundo en su carrera musical titulado: “EN DIRECTO DE MEXICO A GUATEMALA”, en donde incluyen 11 temas grabados en vivo durante la gira realizada por ambos países a mediados de este año. Grandes éxitos como “Lagrimillas tontas”, “Quiero saber de ti”, “Adiós a mi amante”, “Solo dejé yo a mi padre”, “Que vuelva”, “Lástima es mi mujer”, y “Esperanzas” entre otros, comprenden esta producción, además del bonus track grabado en estudio del tema “La piojosa”. En este 2008, MONTEZ DE DURANGO pone a consideración de su público su nueva producción discográfica titulada: “VIDA MAFIOSA”, un álbum integrado en su totalidad por el género regional por excelencia: el corrido. “La imagen de Malverde” es el tema que se desprende de este álbum cuya dirección musical corrió a cargo de José Luis Terrazas Jr. y Daniel Avila, hijos de José Luis Terrazas, líder de MONTEZ DE DURANGO. “El federal de Zacatecas”, “Dos gallos de oro”, “El General”, “La hummer de Culiacán”, y “De Durango hasta Chicago” son algunos de los temas incluidos en este álbum, algunos de ellos de la autoría de los integrantes de la agrupación. Estas producciones, muestran una sorprendentemente evolución musical de este grupo que viene a reafirmar, el por qué son los más vendedor de este género. MONTEZ DE DURANGO, los máximos exponentes de la música duranguense, presentan su más reciente producción discográfica titulada: “NOSOTROS SOMOS”. Con este material, la agrupación liderada por José Luis Terrazas, honra y agradece a su público, el aplauso, el cariño y el apoyo que les han brindado a lo largo de más de una década de trayectoria, y como detalle, MONTEZ incluyó en su portada las fotografías de cientos de fans que de una manera o de otra han sido partícipes del éxito del grupo. “Espero” un tema del cantautor Espinoza Paz, fue el primer sencillo que lanzado a la radio. Este disco, contiene además varias melodías de la autoría del propio José Luis Terrazas. Posteriormente la agrupación inició la promoción de su segundo sencillo denominado “Lo que un día fue no será” el gran éxito del cantante José José y el cual fue interpretado por MONTEZ en un evento en su honor, además palalelamente lanzaron en territorio americano la melodía “El llanto de un ilegal”, con la que el público hispano se identificó plenamente. MONTEZ DE DURANGO se encuentra preparando lo que será su siguiente producción, y mientras esto sucede, lanzan para deleite del público un disco especial titulado “EL BORRACHO”. Un álbum con varios de sus éxitos, más el bonus track que da título al álbum y que se escuchó en la radio nacional e internacional. “EL BORRACHO” es un tema muy movido y divertido, cuya novedad en él, es el incluir el instrumento de tuba, lo que permite a MONTEZ, darle el toque de la música de banda. Previo a su nueva producción discográfica, MONTEZ DE DURANGO, la agrupación más importante del género duranguense, lanzó un disco con el género que a su estilo, sólo ellos pueden interpretar: “CERRANDO TRATO” es el título del álbum, y los corridos es el género que interpretan en su totalidad en este disco. Las mejores historias contadas bajo los acordes de la tambora, son incluidas en el álbum del grupo que liderea José Luis Terrazas, quien en este momento se encuentra preparando el nuevo material de MONTEZ DE DURANGO y que a mediados del 2010 es lanzado al mercado. “Paseando y tomando” es el primer sencillo que se desprendió de esta producción. MMXII “MMXII” es el título de este álbum que en este 2012, trae para nosotros MONTEZ DE DURANGO. Esta es una de las producciones más esperadas de esta agrupación duranguense, ya que antes que saliera a la venta ya viene con un exito radial \"He Renunciado A Ti\" “Descuide” del compositor del momento \"Horacio Palencia\" es el primer sencillo que se promociona, y se trata de un tema a ritmo de balada duranguense, y esa es precisamente la novedad musical que MONTEZ trae consigo en este álbum, ya que ha renovado el estilo duranguense que lo ha caracterizado, dándo más fuerza a los instrumentos de viento que ya formaban parte de su estilo. Reconocidos internacionalmente, MONTEZ DE DURANGO demuestra con esta producción, el por qué son y seran Los Reyes De La Musica Duranguense, ya que con su talento y experiencia, han servido de ejemplo para el resto de las agrupaciones quienes los consideran toda una institución dentro del género. Premios y reconocimientos: *Disco de Oro por más de 100 mil unidades vendidas de su álbum EL SUBE Y BAJA a tan pocos meses de haber salido a la venta. *Disco de Oro y Platino por el álbum “DE DURANGO A CHICAGO”. *Reconocimiento por más de un millón de discos vendidos de sus discos “EL SUBE Y BAJA”, “DE DURANGO A CHICAGO” y “EN VIVO DESDE CHICAGO”. *Reconocimiento por “Suceso del año” en el 2003, por parte de la estación de radio “Qué Buena”. *Ganadores del Premio Lo Nuestro 2004 en la categoría “Mejor interpretación Banda del año” por el disco “DE DURANGO A CHICAGO” *Ganadores del Premio Billboard 2004 por “Mejor álbum Regional Mexicano (grupo)”, por el disco “DE DURANGO A CHICAGO”. *En el 2004, se proclama el 29 de agosto como el DÍA DE MONTÉZ DE DURANGO en la ciudad de Chicago, Illinois, dentro del evento Viva Chicago Latin Music Festival. *Son nominados al Premio la Gente 2004 en 5 categorías: “Solista o grupo de música popular del año”, “Solista o grupo musical regional mexicana del año”, “Canción de año” por el tema “Lágrimas de cristal”, “Album del año”, por la producción “DE DURANGO A CHICAGO” y “Compositor del año”, por el éxito “Lágrimas de cristal”. *Reciben nominación para los Premios Oye! 2004 en la categoría de “Mejor grupo Banda”; este premio es otorgado por la Academia Nacional de la Música en México. *Reciben en la ciudad de Monterrey Reconocimiento por más de 3 millones de copias vendidas de todas sus producciones discográficas. *Se hacen acreedores al Premio Furia Musical como el “Mejor grupo de Estados Unidos del 2004”. *Reciben en la ciudad de México, Reconocimiento por parte radiodifusora “La Ke buena”, por su participación en el magno evento en la Plaza de Toros México. *Son Nominados al Premio Lo Nuestro 2004 en el género Regional Mexicano en las categorías: “Grupo o dúo del Año”, “Mejor Banda del año” y por partida doble en “Mejor canción del año” por los temas “Lágrimas de Cristal” y “Te quise olvidar”. Triple Diamante por más de 3 millones de discos vendidos de sus últimas producciones, consagrados como el grupo más importante dentro de la música mexicana en Estados Unidos. Triple Disco de Platino por las sorprendentes ventas de su álbum “Y SIGUE LA MATA DANDO” Disco de Oro Americano por registrar más de 500,000 copias vendidas; certificado y confirmado por La Asociación Americana de Grabación (RIAA por sus siglas en ingles Recording Industry Association of América) de su disco “Y SIGUE LA MATA DANDO”. Nominados a los Premios Billboard 2005 en la categoría de “Álbum Regional Mexicano del Año, Dúo o Grupo Masculino” por el disco “EN VIVO DESDE CHICAGO” Placa de Oro Americana por su disco “De Durango a Chicago” certificada por la RIAA. Ganadores al PREMIO VIDEO ROLA por “Mejor Video de Agrupación Duranguense”. Nominados a los Premios Billboard 2006 en la categoría de “Álbum Regional Mexicano del Año, Dúo o Grupo Masculino” por el disco “Y SIGUE LA MATA DANDO”. Nominados al premio Oye! 2006 en la categoría de Mejor Álbum del Año Popular por el disco “BORRÓN Y CUENTA NUEVA”. Nominados al premio Oye! en la categoría Mejor Grupo Banda y Duranguense del Año por su disco “BORRÓN Y CUENTA NUEVA”. Ganadores del Premio Lo Nuestro en la categoría Álbum Regional Mexicano, Dúo u Grupo. Ganadores del Premio Billboard como Artista Duranguense del Año. Nominados al Latin Grammy 2009. Nominados a los Premios Lo Nuestro 2010 Nominados a los Premios Billboard 2010 Ganadores de Premios Billboard A La Musica Mexicana 2011 en la categoria \"Cancion Duranguense del Año\" Nominados a Premios Lo Nuestro 2012 por Artista Duranguense del Año Discografía 1997 \"Rama Seca\" 1998 \" Tu Mirada\" 1999 “LA AUSENCIA” éxitos: “500 novillos”, “La ausencia”, “Tú me has cambiado” “El corrido de Baltasar”, 2000 “LOS PRIMOS DE BALTASAR” éxitos: “Estoy Enamorado” y “Al Despertar”; 2001 “CON SABOR A TAMBORAZO” éxitos: “Caminos a Tepehuanes”, “Catarino y los rurales”, “Las mulas de Garame” y la “La Pava. 2001 “EN VIVO” 2002 “EL SUBE Y BAJA” éxitos: “El sube y baja”, “Las mismas piedras”, “Hoy empieza mi tristeza”, “Mi gusto es” y “El pasito duranguense”. 2003 “DE DURANGO A CHICAGO” éxitos: “Lágrimas de cristal”, “Te quise olvidar”, “Hoy empieza mi tristeza”, “El hijo ausente”. 2004 “EN VIVO DESDE CHICAGO” (Disco de éxitos). 2004* “QUE CHIDO, EL PASITO DURANGUENSE” (participación especial) “Lástima es mi mujer” y “Te quise olvidar”. 2004* “LAS MÁS BAILABLES DEL PASITO DURANGUENSE” (participación especial) “Quiero saber de ti” y “Esperanzas”. 2005 “Y SIGUE LA MATA DANDO” éxitos: Vestida de color de rosa”, “Puro Durango”, “Me llamas”, “La historia”, “Te voy a esperar”, Quiero saber de ti”, “Lástima es mi mujer” y “Esperanzas”. 2005 “VIVE” disco de éxitos donde incluyeron como bonus track la canción “Ven conmigo”. 2005 LOS SÚPER ÉXITOS “LAGRIMILLAS TONTAS” disco de éxitos que incluye como bonus track el tema “Lagrimillas tontas”. 2006 “500 NOVILLOS” (Disco Remasterizado) 2006 “ÉXITOS EN VIVO” 2006 “GRUPO MONTÉZ DE DURANGO E INVITADOS” 2006 “LOS SÚPER ÉXITOS 2 “ADIOS A MI AMANTE” éxito: “Adiós a mi amante” 2006 “BORRÓN Y CUENTA NUEVA” éxitos: “Adiós a mi amante”, “Que vuelva”, “Me duele escuchar tu nombre”. 2007 “¡AGÁRRESE!” éxito: “Lágrimas del corazón”, “Como en los buenos tiempos”. 2008 “VIDA MAFIOSA” éxito: “La imagen de Malverde” 2008 “NOSOSTROS SOMOS” éxito: “Espero”, “Lo que un día fue no será”, “El llanto de un ilegal” 2009 “EL BORRACHO” éxito: “El borracho” 2010 “CERRANDO TRATO” éxito: “Paseando y tomando” 2010 “CON ESTILO… CHICAGO STYLE” éxito: “Mi necesidad” 2012 \"MMXII\" exito \"He Renunciado A Ti\" , \"Descuide\" http://montezdedurango.net Nosotros Somos Montéz De Durango ® Est. 1996", "otherInfo": "No event info available"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Marty O'Reilly ", "ArtistImage": "https://photos.bandsintown.com/thumb/11323959.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Acoustic Folk And Blues", "Time": "8:00 PM", "Venue": "Marty O'Reilly & The Old Soul Orchestra at Hopmonk, Sebastopol ", "moreBioInfo": "Just when you think American roots music should be relegated to the dusty confines of a purist’s museum it will surprise you with a paradigm shift. Take Marty O’Reilly & the Old Soul Orchestra— passing through tradition, the quartet stumbled upon innovation, proving that old souls can be creatively fresh. The Santa Cruz, California-based quartet’s latest, Stereoscope, out February 9, 2018, marks an evolutionary leap in a journey of artistic identity, songwriting maturity, band friendship and fiery group synergy. Here, Marty O’Reilly & the Old Soul Orchestra homed in on their signature cosmic roots aesthetic, brimming with cinematic songcraft, impressionistic lyrics, clever arrangements, telepathic ensemble interplay, and soulfully world-weary vocals. Imagine the delta blues reprised by psychedelic indie rockers. “My whole career has been based on better understanding what’s real and important in artistry, and what is bull#$%,” says Marty. “When you weed out all the excess, the little thing that is left is you.” Marty O’Reilly & the Old Soul Orchestra features Marty on electrified resonator guitar and vocals, Chris Lynch on violin and keys, Ben Berry on upright bass, and Matt Goff on drums and percussion. The group specializes in roots music with evocative lyrics that are conceptually cryptic, relying on imagery and symbols to convey emotion. Artistic touchstones for the group include John Lee Hooker, Howlin’ Wolf, the darkly cathartic oeuvre of Tom Waits, and the experimental arrangements of Radiohead. In its five-year existence, the band has released one previous full length, one EP, and toured nationally and internationally, selling out venues along the West Coast and throughout the United Kingdom. Select career live performance highlights include performing at Outsidelands Festival, Bottlerock, and the Maverick Festival, where despite being at the bottom of the bill, the group managed to sell more CDs than any other artist in the festival's history. They’ve opened for such diverse artists as Shakey Graves, Deer Tick, Martin Sexton, and Kaki King. In addition, they’ve been featured on NPR’s Weekend Edition, and the band’s beloved track, \"Cold Canary Gaslight,\" from its 2014 studio debut album, Pray for Rain, has currently surpassed passed one million Spotify listens. Marty’s blues epiphany came from a somewhat hilarious turn of events when, as a teenager, he tried to download a hip hop track on Napster, but accidently downloaded Blind Willie Johnson’s “Let Your Light Shine On Me.” It was indeed a fateful mistake. Marty saw an avenue of expression for his teen angst in the simple 3-chord structures and earthy melodies of the blues, and dove headfirst into the tradition. “I was dealing with a lot of stuff emotionally at the time, and I would sit in my bedroom, play guitar, and listen to old blues for hours. My parents would leave food for me outside my door,” Marty recalls, laughing. “There was something both angry and calming about that music that resonated with me. That music was my place to get away from all my troubles.” Later, Marty’s father, a voracious music lover, hipped him to John Fahey’s The Yellow Princess (Vanguard Records, 1968), and that record illuminated the possibilities one could explore with roots music. “I felt like that record had one foot in blues and American folk music, and one foot somewhere else,” Marty explains. That John Fahey record’s lesson would play a part in the evolution of the Old Soul Orchestra from reverent traditionalists to Americana adventurers, as evidenced by Stereoscope. The album represents the maturation of artists shedding hero worship and embracing the creativity within. These new frontiers are characterized by a heartfelt purity in Marty’s vocals, the tracks’ unique and richly expressive chord structures and progressions, a shift in narrative perspectives to a more observational bend, and emotionally dynamic arrangements that are beautifully arresting, often beginning with sparse simplicity and then reaching lush and fully orchestrated climaxes with sensitive group interplay. The 11-song album opens with “Firmament,” which eases in with delicately eerie ambience and sparse musical accompaniment, revealing all the soulful nuances and inflections in Marty’s voice. The song soars forward with an impactful arrangement as the full band joins in with rich and varied musicality, including a dazzling drum and percussive break and a violin solo as brilliantly fractured as a cubist painting. The album’s third track, the haunting “Ghost,” is a swampy ambient blues that uses the phenomena of sleep paralysis as an intriguing metaphor for vulnerability. The standout album single “Off and On Again” offers sweet yearning for a détente after a lover’s quarrel. Other album highlights include a rendition of Skip James’ blues classic “Hard Time Killing Floor” with chillingly beautiful new music to accompany the haunting traditional lyrics, and the three stirring, but challenging, instrumentally-driven songs that conclude the album and recall fringe jazz guitarist’s Bill Frisell’s evocations of dustbowl Americana with futuristic ambience. Stereoscope is no doubt a milestone entry for Marty O’Reilly & the Old Soul Orchestra, offering forth the band’s most assured and mature release to date. “We put our heart and soul into this album,” shares Marty. “It’s the album I’ve always wanted to make—one that ten years later I can still be proud of. Making it has made me feel whole, and brought me a lot of joy.”", "otherInfo": "No event info available"}, {"Address": "288 9th Ave, Oakland, CA 94606", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/11546577.jpeg", "Coordinates": [37.7865732, -122.2567924], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Comedy", "Time": "8:00 PM", "Venue": "The Comedy Edge", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No event info available"}, {"Address": "222 Mason St, San Francisco, CA 94102", "Artist": "Lillias White ", "ArtistImage": "https://photos.bandsintown.com/thumb/135098.jpeg", "Coordinates": [37.7860081, -122.4092959], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Feinstein's at The Nikko", "moreBioInfo": "No artist bio available", "otherInfo": "We will try to seat all parties of two or more together and appreciate your patience and understanding as we operate to maintain all safety guidelines. Doors open 45-minutes prior to curtain time. Seating will be based on party size, arrival time, and is up to the discretion of the management."}, {"Address": "1131 Lawrence Expy, Sunnyvale, CA 94089", "Artist": "Grupo Ensamble ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.3971103, -121.9970499], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Evolution Night Club", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "726 1st St, Benicia, CA 94510", "Artist": "Bray ", "ArtistImage": "https://photos.bandsintown.com/thumb/11002146.jpeg", "Coordinates": [38.0501532, -122.1578947], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Indie Pop Rock", "Time": "8:30 PM", "Venue": "(with Neon Velvet) --- Rellik Tavern 12th Anniversary", "moreBioInfo": "Bray is a San Francisco-based singer songwriter with the fire and strut of the quintessential rock front-man, the moves and voice of the classic soul-man and the quick self-effacing humor of a beloved talk show host. Ignited by slinky grooves, ultra-catchy pop rock hooks, and a kinetic live performance style, Bray fuels audiences into a feel-good frenzy with every show. Along with his world class backing band, Bray has performed for crowds as large as 50,000 in ten countries around the world, sharing stages with Train, Slash, Scott Weiland and members of The Doors, the Sex Pistols and Prince's Revolution. Named “Best Live Band” by the San Francisco Herald, He and his band were featured in the NARAS (Grammy) San Francisco New Artist Showcase and have gone on to rank in the final 10 for the national Guitar Center contest to perform on the Jimmy Kimmel Show in 2015. While Bray is enjoying his success, he has been honing his craft for years; tracks from his four studio album releases have enjoyed heavy rotation on over 150 CMJ stations nationwide, charting as high as #3. His tunes have appeared in over half a dozen national television shows, as well as MTV Road Rules, VH1 Old Skool and the syndicated reality series Bad Girls Club. Perhaps even more impressively, his cinematic videos (www.youtube.com/braymusic) have garnered more then 4,000,000 views on YouTube. Bray has rocked arenas, festivals, back-rooms and bars during his whirlwind career which includes four European tours), and loved every minute of it!", "otherInfo": "No event info available"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Cut-Rate Druggist ", "ArtistImage": "https://photos.bandsintown.com/thumb/11554580.jpeg", "Coordinates": [37.890476, -122.299261], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock And Roll", "Time": "9:00 PM", "Venue": "The Avengers + Lolly Gaggers + Cut-Rate Druggist", "moreBioInfo": "Rock n Roll Bass & Drum Duo", "otherInfo": "***JULY 24***\nThe Avengers\n+ Lolly Gaggers\n+ Cut-Rate Druggist\nIvy Room / 21+\n**Masks required while not actively drinking**\n\nAvengers\n“One of the first and finest bands to emerge from San Francisco's punk scene & major inspiration in a scene that flourished long after they broke up. Singer Penelope Houston was one of the pioneering women of American punk.” Mark Deming Allmusic\nLolly Gaggers\nA Bay Area queer band bringing dark Post Punk guitar driven garage rock. Think Flipper swapping spit with 45 Grave.\nCut-Rate Druggist\nRock n Roll Duo / Oakland, CA"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "The Avengers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8051496.jpeg", "Coordinates": [37.890476, -122.299261], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Punk", "Time": "9:00 PM", "Venue": "Ivy Room", "moreBioInfo": "There are several bands called The Avengers. 1. The Avengers were formed in San Francisco, in the first wave of American Punk. Penelope Houston was the lead singer, primary songwriter, and her persona was a large part of the draw for the act. The other band members were James Wilsey (bass), D. Furious (drums), and Greg Ingraham (guitar). Critic Greil Marcus once said The Avengers were, \"...San Francisco's best punk band - in their moments, they were, you knew, better than any other band playing that night anywhere in the world.\" The Avengers gained much publicity when they opened for the Sex Pistols in San Francisco, for their legendary final show at Winterland. The Avengers' 4-song EP was also produced by Steve Jones (of the Sex Pistols) in 1979 on White Noise Records. Their discography also contains an earlier 3-song EP (on Dangerhouse Records) from 1977, a full album called \"The Avengers\" from 1981, a compilation of unreleased tracks and outtakes called \"The Avengers Died for Your Sins\" in 1999 on Lookout! Records, and a second compilation titled \"The American in Me\" on DBK Works (2004). Houston and Ingraham have reunited and currently perform as The Avengers with bassist Joel Reader (MXT, Pansy Division) and drummer Luis Illades (Pansy Division) touring the US and Europe. 2. Perhaps the first band to be called The Avengers was an American group from Bakersfield, California. The first incarnation came together in 1964, as a surf six-piece. Where the name came from is unknown, but the hip British TV series 'The Avengers' had started running on the BBC two years earlier. The group soon latched on to the new sound of the British Invasion and bands like The Beatles, but also American acts like Paul Revere & the Raiders and The Music Machine. Between 1965 and 1967 The Avengers released five 45s and played support slots for the likes of The Beach Boys, The Animals, The Seeds and The Music Machine. They didn't have a hit, but their song \"Be a Caveman\" has become legendary in garage circuits for having the sort of lyric you'd think everyone would write but never really did. Other songs that have turned up on garage compilations are \"It's Hard to Hide\" and its b-side \"Open Your Eyes\". The Avengers had unusually short hair, because they were still in school and were afraid to get suspended. 3. Another early band named The Avengers were based in Wellington, New Zealand and were active from 1966 until 1969. They had a string of top ten hits on the New Zealand charts, with the most successful, \"Love, Hate, Revenge\", reaching #2 in August 1968. Overseas, however, they had considerably less success and they broke up after their second tour of Australia. During their career, they released two albums, Electric Recording in 1968 and Medallion in 1969, as well as a live album in 1968. In 2001, almost all of their studio material was collected on one compilation that also appeared under the name Electric Recording.", "otherInfo": "Ivy Room Presents \n**MASKS REQUIRED**"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Perry Wayne ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Xile Collective presents\nUNDERGROUND SESSIONS\nAbove DNA:\n Autokorekt\n Perry Wayne\n Dmn\n Wy-Fy\n Joogornot\n Gold Uzi\n Ben Danklin\nDazzle Room:\n Micha\n Quinlo\n Unspecified Beats\n Meat Train\n Skooby Dude\nXile Collective are now back bringing you the first installment of the \"Underground Sessions\" featuring bass Gods Autokorekt and Perry Wayne! \"The Arrival\" signified the beginning of the Xile Collective's journey through music paired with their love for the fans. \"Underground Sessions\" will seek to carry on this tradition by offering an inclusive environment for all ravers alike: The ultimate goal is to create a place where people can come to escape the realities of everyday life. Come out to the \"Underground Sessions\" to catch some of your favorite locals as well to see what kind of talent the Bay Area has to offer! This is only the first installment of the \"Underground Sessions\" - Come be apart of Xile family history.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24d.html\nWatch and listen:\n Xile Collective: Underground Sessions: http://youtu.be/QmyT_Gat3dw\ndubstep. riddim. bass. d+b.\n9pm - 2am.\n18+ with ID.\n$10 limited advance;\n$15 after;\n$20 door."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "DJ Tyme ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "BOOTIE MASHUP: BOOTIE-CON\nMain Room:\n Adriana A\n DJ Tyme\nGeek-inspired pole dance show by:\n Flux Vertical Theatre\nLounge:\n Ryan Andrews\nThis week is virtual Comic-Con International, so Adriana A and DJ Tyme are geeking out with mashups from our favorite sci-fi and fantasy films, TV shows, and videogames, including a special geektastic pole dance show at 11:11 from Flux Vertical Theatre. Ryan Andrews holds down the Hip-Hop Lounge.\nShowcasing the best mashups in the world ever, Bootie Mashup has been throwing genre-fluid dance parties in San Francisco since 2003, shamelessly combining pop songs both throwback and current. With our fun, creative themes, our diverse team of pop pirates have won numerous nightlife awards in multiple cities for nearly 18 years.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24.html\nWatch and listen:\n Bootie Mashup: Bootie-Con: http://youtu.be/48nyREDTW9I\nmashups. pop. throwback. hiphop. club bangers. pole dance.\n9pm - 2:30am.\n18+ with ID.\n$15 limited advance;\n$20 < 10pm;\n$25 after.\nhttp://www.bootiemashup.com/"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Gold Uzi ", "ArtistImage": "https://photos.bandsintown.com/thumb/8717896.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Edm, Dubstep, Riddim", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Producer", "otherInfo": "Xile Collective presents\nUNDERGROUND SESSIONS\nAbove DNA:\n Autokorekt\n Perry Wayne\n Dmn\n Wy-Fy\n Joogornot\n Gold Uzi\n Ben Danklin\nDazzle Room:\n Micha\n Quinlo\n Unspecified Beats\n Meat Train\n Skooby Dude\nXile Collective are now back bringing you the first installment of the \"Underground Sessions\" featuring bass Gods Autokorekt and Perry Wayne! \"The Arrival\" signified the beginning of the Xile Collective's journey through music paired with their love for the fans. \"Underground Sessions\" will seek to carry on this tradition by offering an inclusive environment for all ravers alike: The ultimate goal is to create a place where people can come to escape the realities of everyday life. Come out to the \"Underground Sessions\" to catch some of your favorite locals as well to see what kind of talent the Bay Area has to offer! This is only the first installment of the \"Underground Sessions\" - Come be apart of Xile family history.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24d.html\nWatch and listen:\n Xile Collective: Underground Sessions: http://youtu.be/QmyT_Gat3dw\ndubstep. riddim. bass. d+b.\n9pm - 2am.\n18+ with ID.\n$10 limited advance;\n$15 after;\n$20 door."}, {"Address": "90 Old Courthouse Square, Santa Rosa, CA 95404", "Artist": "DJ Cal ", "ArtistImage": "https://photos.bandsintown.com/thumb/11542649.jpeg", "Coordinates": [38.4404749, -122.713083], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Hip Hop, Top40, Edm, Open Format, Trap", "Time": "9:00 PM", "Venue": "DJ CAL at Perch + Plow", "moreBioInfo": "A native of Sonoma County, DJ CAL is from Bay Area / North Bay. His setlists are Multi/Genre designed to move the crowds with a blend of Trap, EDM,Hip-Hop and Reggaeton.He calls the city of Santa Rosa his home, but you might’ve have heard his mixes on-air across the nation (San Francisco, Las Vegas, Orlando, Palms Springs, etc.). He also holds a spot as a mixshow DJ on Fresno California B95, with Teezzy Radio, Last Call and Friday night street party. DJ CAL has several Bay Area and Northern California venues under his belt. Catch him performing and hanging out with the hottest names in music around the Bay. More recently, DJ CAL got awarded for “Best Live DJ” 2018 from “Bohemian” he constantly working on music. Every day he’s working on new edits and remixes. His is work has been supported and featured by various blogs, websites and record pools, DJ City, MyMP3Pool, BpmSupreme and SmashTheClub.com DJ CAL is also working hard to make his own mark in the music industry.", "otherInfo": "No event info available"}, {"Address": "3140 Mission St, San Francisco, CA 94110", "Artist": "El Chevo ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7471447, -122.4192225], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Roccapulco", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Nina Sol ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "Get down with those sweet house sounds."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Ryan Andrews ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "BOOTIE MASHUP: BOOTIE-CON\nMain Room:\n Adriana A\n DJ Tyme\nGeek-inspired pole dance show by:\n Flux Vertical Theatre\nLounge:\n Ryan Andrews\nThis week is virtual Comic-Con International, so Adriana A and DJ Tyme are geeking out with mashups from our favorite sci-fi and fantasy films, TV shows, and videogames, including a special geektastic pole dance show at 11:11 from Flux Vertical Theatre. Ryan Andrews holds down the Hip-Hop Lounge.\nShowcasing the best mashups in the world ever, Bootie Mashup has been throwing genre-fluid dance parties in San Francisco since 2003, shamelessly combining pop songs both throwback and current. With our fun, creative themes, our diverse team of pop pirates have won numerous nightlife awards in multiple cities for nearly 18 years.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24.html\nWatch and listen:\n Bootie Mashup: Bootie-Con: http://youtu.be/48nyREDTW9I\nmashups. pop. throwback. hiphop. club bangers. pole dance.\n9pm - 2:30am.\n18+ with ID.\n$15 limited advance;\n$20 < 10pm;\n$25 after.\nhttp://www.bootiemashup.com/"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Mr. V ", "ArtistImage": "https://photos.bandsintown.com/thumb/11096031.jpeg", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "House Music, Electronic, Edm", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "Experiencing Mr. V’s DJ sets, original productions, or remixes is like taking a trip back in time to dance music’s golden age. Before superstar DJs took over the spotlight, dance music was a cultural phenomenon that did what no other form of music could do – bring people together. It didn’t matter what race or sexual orientation you came from because dance music was all about embracing our differences and creating a homogeneous vibe.", "otherInfo": "Get down with those sweet house sounds."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Meat Train ", "ArtistImage": "https://photos.bandsintown.com/thumb/8091654.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Thrash Death Goregrind", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Meat Train was formed in 2011 as a collaboration to create music with a heavy British sound and a huge appreciation of horror. Originally a recording project between founder Mike “screamer” Pearson and Chas Fenoughty – Meat Train was formed with a vision to create heavy, chugging, riff-based, grinding death with vocals that are a break from the norm. When Mike – previously of Reign and Winter of Torment – decided he wanted to form something new he turned to an old friend and previous bandmate from Liquefied Skeleton, Chas, the one time base player of Thus Defiled. The thing that both guitarists agreed on straight away was that a decent heavy band needs a powerful rhythm section, determined to get it right they turned to old mates to find the right people. Long-time friend and dirty bottom end pounder Iki was an easy and obvious choice, with a dirty sound and a powerful tone that ensures her bass is felt and not ignored! Swapping between a detuned 5-string and a punchy 4-string Iki provides the balls and the groove! After some gentle coaxing the band was able to get Stuart Songhurst previously of Epitome and Thus Defiled to bring his massive sound and outrageous double-kick to the party. Giving Meat Train the power to deliver the blast based shit-storm that is so close to all their hearts. Meat Train Filthy Death Metal from London UK. Bringing huge slabs of guitar served so rare it’s bloody.", "otherInfo": "Xile Collective presents\nUNDERGROUND SESSIONS\nAbove DNA:\n Autokorekt\n Perry Wayne\n Dmn\n Wy-Fy\n Joogornot\n Gold Uzi\n Ben Danklin\nDazzle Room:\n Micha\n Quinlo\n Unspecified Beats\n Meat Train\n Skooby Dude\nXile Collective are now back bringing you the first installment of the \"Underground Sessions\" featuring bass Gods Autokorekt and Perry Wayne! \"The Arrival\" signified the beginning of the Xile Collective's journey through music paired with their love for the fans. \"Underground Sessions\" will seek to carry on this tradition by offering an inclusive environment for all ravers alike: The ultimate goal is to create a place where people can come to escape the realities of everyday life. Come out to the \"Underground Sessions\" to catch some of your favorite locals as well to see what kind of talent the Bay Area has to offer! This is only the first installment of the \"Underground Sessions\" - Come be apart of Xile family history.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24d.html\nWatch and listen:\n Xile Collective: Underground Sessions: http://youtu.be/QmyT_Gat3dw\ndubstep. riddim. bass. d+b.\n9pm - 2am.\n18+ with ID.\n$10 limited advance;\n$15 after;\n$20 door."}, {"Address": "1776 Broadway St, Redwood City, CA 94063", "Artist": "Jesús Chaparro ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.4870495, -122.2229543], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Maya Night Club", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Micha ", "ArtistImage": "https://photos.bandsintown.com/thumb/6387654.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Rock, Neue Deutsche Härte, Matel, German", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Ich bin aus Hamburg und bin Sänger euer Matel und Rockband aus Hamburg. Coversongen im Tonstudio in Hamburg aufnehmen lassen am Do13.2.2014 + Konzerte 2010 Silvesterfreizeit in Wiedenest 2011 in Sardinien Freizeit in Siniscola 2011 Bauwagenfest in Hamburg 2011 in Schweiz in Bad Grund 2012 Schwedenfreizeit in Rättvik Silvesterparty in Wiedenest 2013 Gesangswettbewerbe Hessentag in Kassel Rothenbachhalle Hochzeit Konzert in Falkenberg Silvestergala in Krelingen 2014 Hallo Ich bin Micha aus Hamburg bin Sänger und ab Juli bis Dezember auf Tour. Und Sängen ist meinen Hobby.", "otherInfo": "Xile Collective presents\nUNDERGROUND SESSIONS\nAbove DNA:\n Autokorekt\n Perry Wayne\n Dmn\n Wy-Fy\n Joogornot\n Gold Uzi\n Ben Danklin\nDazzle Room:\n Micha\n Quinlo\n Unspecified Beats\n Meat Train\n Skooby Dude\nXile Collective are now back bringing you the first installment of the \"Underground Sessions\" featuring bass Gods Autokorekt and Perry Wayne! \"The Arrival\" signified the beginning of the Xile Collective's journey through music paired with their love for the fans. \"Underground Sessions\" will seek to carry on this tradition by offering an inclusive environment for all ravers alike: The ultimate goal is to create a place where people can come to escape the realities of everyday life. Come out to the \"Underground Sessions\" to catch some of your favorite locals as well to see what kind of talent the Bay Area has to offer! This is only the first installment of the \"Underground Sessions\" - Come be apart of Xile family history.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24d.html\nWatch and listen:\n Xile Collective: Underground Sessions: http://youtu.be/QmyT_Gat3dw\ndubstep. riddim. bass. d+b.\n9pm - 2am.\n18+ with ID.\n$10 limited advance;\n$15 after;\n$20 door."}, {"Address": "3140 Mission St, San Francisco, CA 94110", "Artist": "Kazzabe ", "ArtistImage": "https://photos.bandsintown.com/thumb/192901.jpeg", "Coordinates": [37.7471447, -122.4192225], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Roccapulco", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "George J J Flores ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "Get down with those sweet house sounds."}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "Paul Goodyear ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7809743, -122.4084128], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "No artist bio available", "otherInfo": "Get down with those sweet house sounds."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "WY-FY ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Xile Collective presents\nUNDERGROUND SESSIONS\nAbove DNA:\n Autokorekt\n Perry Wayne\n Dmn\n Wy-Fy\n Joogornot\n Gold Uzi\n Ben Danklin\nDazzle Room:\n Micha\n Quinlo\n Unspecified Beats\n Meat Train\n Skooby Dude\nXile Collective are now back bringing you the first installment of the \"Underground Sessions\" featuring bass Gods Autokorekt and Perry Wayne! \"The Arrival\" signified the beginning of the Xile Collective's journey through music paired with their love for the fans. \"Underground Sessions\" will seek to carry on this tradition by offering an inclusive environment for all ravers alike: The ultimate goal is to create a place where people can come to escape the realities of everyday life. Come out to the \"Underground Sessions\" to catch some of your favorite locals as well to see what kind of talent the Bay Area has to offer! This is only the first installment of the \"Underground Sessions\" - Come be apart of Xile family history.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24d.html\nWatch and listen:\n Xile Collective: Underground Sessions: http://youtu.be/QmyT_Gat3dw\ndubstep. riddim. bass. d+b.\n9pm - 2am.\n18+ with ID.\n$10 limited advance;\n$15 after;\n$20 door."}, {"Address": "46 Geary St, San Francisco, CA 94108", "Artist": "Sokyo ", "ArtistImage": "https://photos.bandsintown.com/thumb/11523081.jpeg", "Coordinates": [37.7879924, -122.4042943], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Techno, Electro House, Tech House, House", "Time": "9:00 PM", "Venue": "7 Year Anniversary: J.Espinosa, Plural Music, & Gold Bloc!", "moreBioInfo": "Sokyo is an Australian American Tech house DJ residing in San Francisco. You can find Sokyo dancing and singing along while playing. Her infectious smile and friendly demeanor command the crowd and provide a safe place for anyone to be themselves while enjoying the vibes.", "otherInfo": "Elevate your nightlife experience: Two intimate rooms and a state-of-the-art VOID sound-system are just the beginning!\nAbout this event\n7 Year Anniversary: J.Espinosa, Plural Music, & Gold Bloc!\n\nSaturday, July 24th, 2021\n\nMain Room: J.Espinosa, QURE, Jamie Selects (Open Format: Top 40, EDM, Hip Hop, Party Anthems)\n\nBonaparte Room: SOKYO, Prehistoric Reptiles, Klipper, & Lie Detector (EDM, House)\n\nTable Reservations: Call/Text 415-969-0196 or reservations@hawthornsf.com"}, {"Address": "230 Petaluma Ave, Sebastopol, CA 95472", "Artist": "Zoe Winter ", "ArtistImage": "https://photos.bandsintown.com/thumb/9076771.jpeg", "Coordinates": [38.4011362, -122.8226923], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Folk, Americana, Soul", "Time": "9:00 PM", "Venue": "HopMonk Tavern Sebastopol", "moreBioInfo": "Americana singer-songwriter Zoë Winter has been making her way across Bay Area stages since age 8. Inspired by the transcendent music of Karen Dalton, Blaze Foley and Laura Marling, Zoë blends intimate acoustic folk with the powerful melodies of neo-soul.", "otherInfo": "Marty O'Reilly and the Old Soul Orchestra"}, {"Address": "243 O'Farrell St, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.78599310000001, -122.4086873], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Singer Songwriter, Cabaret, Broadway, Cover Songs", "Time": "9:00 PM", "Venue": "Johnny Foley's Irish House", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No event info available"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Russell Peters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619761.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "9:30 PM", "Venue": "San Jose Improv", "moreBioInfo": "No artist bio available", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Hisham Zahran ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7689137, -122.4192514], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Progressive House, Tech House", "Time": "10:00 PM", "Venue": "Public Works", "moreBioInfo": "No artist bio available", "otherInfo": "SET Underground bringing two legends to San Francisco including the founder of Life and Death."}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Dj Tennis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9926125.jpeg", "Coordinates": [37.7689137, -122.4192514], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic", "Time": "10:00 PM", "Venue": "Public Works", "moreBioInfo": "No artist bio available", "otherInfo": "SET Underground bringing two legends to San Francisco including the founder of Life and Death."}, {"Address": "550 Barneveld Ave, San Francisco, CA 94124", "Artist": "GSP ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7398613, -122.4047381], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Dance Fridays - Space 550", "moreBioInfo": "No artist bio available", "otherInfo": "RATED X"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Patrice Baumel ", "ArtistImage": "https://photos.bandsintown.com/thumb/7520074.jpeg", "Coordinates": [37.7689137, -122.4192514], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Techno", "Time": "10:00 PM", "Venue": "Public Works", "moreBioInfo": "Patrice Bäumel is an internationally renowned dj and producer currently living in Amsterdam. He is a long-running resident dj at Trouw Amsterdam, one of Europe’s leading venues for electronic music, running his “Black Magic” and “HiFi” nights at the club. Bäumel infuses his productions and dj sets with lots of energy and a sense of adventure, creating a sound that is satisfies the mind as well as the body. He calls it “techno music for grown-ups”. Trademark productions like “Roar”, “Mike Tyson” or, more recently, “The Woods” are perfect examples of that philosophy. Bäumel has worked with a number of outstanding labels like Get Physical, K7, Systematic, Diynamic, Trouw and Turbo and has big releases coming up in 2014 for Kompakt and My Favorite Robot. Bäumel is also involved in several crossover projects involving classical music, such as his rendition of Steve Reich's “Drumming” at the Concertgebouw during ADE in 2013 or his “Yellow Lounge” residency at Trouw. Management: nathan@grademanagement.com mike@grademanagement.com Bookings Worldwide: bruno@kompakt.fm North/South America: cara@liaisonartists.com Netherlands: kelly@wearee.nl", "otherInfo": "SET Underground bringing two legends to San Francisco including the founder of Life & Death."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Bootie Mashup ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "BOOTIE MASHUP\nDJs TBA!\nShowcasing the best mashups in the world ever, Bootie Mashup has been throwing genre-fluid dance parties in San Francisco since 2003, shamelessly combining pop songs both throwback and current. With our fun, creative themes, our diverse team of pop pirates have won numerous nightlife awards in multiple cities for nearly 18 years.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-24.html\nWatch and listen:\n Bootie Teaser: http://youtu.be/l9CQYZkLZYU\nmashups. pop. throwback. hiphop. club bangers.\n10pm - after hours.\n18+ with ID.\n$15 advance;\n$20 door.\nhttp://www.bootiemashup.com/"}, {"Address": "119 Utah St, San Francisco, CA 94103", "Artist": "Perry Twins ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [37.7675193, -122.4065374], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "Electronic, Pop", "Time": "10:00 PM", "Venue": "The Great Northern", "moreBioInfo": "No artist bio available", "otherInfo": "BRÜT SAN FRANCISCO IS BACK WITH ITS DORE ALLEY EDITION to bring us out of hibernation!!"}, {"Address": "550 Barneveld Ave, San Francisco, CA 94124", "Artist": "Mohammad ", "ArtistImage": "https://photos.bandsintown.com/thumb/6389136.jpeg", "Coordinates": [37.7398613, -122.4047381], "Date": "2021-07-24", "EventDate": "Jul. 24th, 2021", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Dance Fridays - Space 550", "moreBioInfo": "Mohammad Molaei, born September 18, 1988 in Tehran, Iran and grew up surrounded by musicians, singers and was undeniably inspired by his mother’s talent as a gifted and prominent Iranian vocalist. It was her passion and her sensitivity through her vocals that he learned the subtleties and nuance that could be expressed through song. By the age of 7, he displayed great acumen as a musician by mastering the ancient Persian Percussion instrument, the Tombac. However even more fascinating than his prodigious instrumentation, was the way in which he began to sing at such a range of octaves that he had almost absorbed the subtleties and power of the Tombac used for centuries as a storytelling device. Indeed, it was rare to hear a male voice that had such distinct high and low octaves usually reserved for those rare voices. Upon seeing him perform he was invited to learn the ancient musical techniques from a group of dedicated musicians who mentored him for several years. By the age of 12, he added violin to his repertoire and with an unquenchable thirst and natural talent it wasn’t long before he embraced the piano and the guitar. His sense of ownership of the instruments he played and his unusual vocal abilities led to composing music tailored to his own sensibilities as a musician and artist. Performing has taken on new hues recently and he through acting he was recently featured in the lead role in a short film directed by Yancey Arias, appropriately entitled, \"Success Driven”. The film which was written by Scott J. Foster also features actors, Steven Bauer and Serena Scott Thomas. The charming story while fictional is based on a character not unlike Mohammad and explores a young man’s journey from Iran to Hollywood on his quest to find success and fame as a singer in Hollywood. With a Fall 2012 release, the producers are confident to platform the film through Sundance, Cannes and other prestigious competitions and festivals world-wide. To coincide with the film, Mr. Molaei will release his first single produced by Elan Morrisson, in which he wrote the music and provides the vocals with lyrics by Scott J. Foster. The single is feathered through the film as the soundtrack. Couturier Lloyd Klein most recently encouraged Mr. Molaei to model for his new Menswear Campaign also set to launch in Fall of 2012 and has been photographed by the very talented lens man Robert Voltaire for that campaign. Official Facebook profile for international recording artist Mohammad. \"Anyone\" now available on iTunes: Smarturl.it/MohammadAnyone", "otherInfo": "RATED X"}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Andy McKee ", "ArtistImage": "https://photos.bandsintown.com/thumb/11252047.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Acoustic, Instrumental Acoustic Guitar, Instrumental", "Time": "9:00 AM", "Venue": "Andy McKee's Musicarium 2021 (Guitar Camp)", "moreBioInfo": "Andy McKee is one of the world’s finest acoustic guitarists and it’s evident from the accolades he’s received throughout his career. It’s his youthful energy, attention to song structure and melodic content that elevates him above the rest. After nearly a decade without releasing new studio recordings, McKee returns with his six-track EP, Symbol, out Friday, September 17 on Mythmaker Records in conjunction with Cruzen Street Records. “These are my interpretations of tunes that really inspired me,” says McKee. “I wanted to give listeners a chance to hear what I hear when I listen to this music. I also wanted to branch out a bit and include music that isn’t originally for acoustic guitar.” While Symbol is a collection of inspired renditions, they are important song choices; artists that deeply influence McKee and song’s that connect to his musical past. He pulls from the catalogues of greats like Michael Hedges, Preston Reed, Billy McLaughlin and Prince. There’s “Ragamuffin,” the EP’s lead single, which is a nod to one of McKee’s biggest influences, Michael Hedges. McKee notes that “Michael was not only a revolutionary guitarist on the technical side, his ability to compose for solo guitar was also genius. Most importantly though, he was able to search inside of himself and consistently pull up very human and evocative themes that made him a true artist. I’ll always be grateful for his music.” One track that might catch fans by surprise on Symbol is McKee’s gorgeous rendition of Prince’s “Purple Rain.” In 2012, McKee played alongside Prince in his band on the “Welcome 2 Australia” tour with the song being one of the setlist highlights. “I had originally come up with the ‘Purple Rain’ arrangement to open the shows with while I was on tour with Prince in Australia,” recalls McKee. “I have played it occasionally since then while touring and figured I should finally get a recording of it down. One thing that I learned from Prince while we were on the road is that we both really admire Joni Mitchell. I used that as a reference when trying to describe what I do. Although some of what I do on the guitar is technically demanding, I don’t ever really want that to overshadow the music.” Another standout from Symbol is Mckee’s take on “Chattanooga” by acclaimed guitarist Preston Reed. “In my opinion, ‘Chattanooga’ by Preston Reed is one of the finest fingerstyle guitar pieces ever written,” says McKee. “It’s just loaded with texture, harmony, percussion, and melody. I love the key changes and chromaticism between some of the chords. This tune really inspired me a lot.” McKee, like many, was infatuated with the Rocky IV soundtrack, specifically the Vince DiCola compositions “War” and “Training Montage.” For Symbol, McKee and DiCola joined forces to craft “Rocky IV Medley.” “That was about as surreal as it gets for me,” says McKee. “I became a fan of Vince’s work when I was six years old and I bought the soundtrack to the film on cassette. I used to listen to it all the time on my Sony Walkman and I really found that my favorite tunes were the instrumental tracks which were “War” and “Training Montage” from Vince. Those tunes awakened my mind to the possibility of being moved by music with no words. To be able to recreate those tunes with the electric guitar and play with Vince is really something I could never have dreamed of.” Andy McKee entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique. McKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song “Drifting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the U.S. and Acoustic Magazine in the UK. He also curates his own annual guitar retreat called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts from Dream Theater to Tommy Emmanuel.", "otherInfo": "This is Andy McKee's Guitar Camp featuring Yvette Young, Guitaro 5000, Trevor Gordon Hall, and special guest Michael Manring. its 4 days of workshops, lessons, and intimate performances. For more information, or to register, go to https://andymckeesmusicarium.com/"}, {"Address": "3501 Byer Rd, Byron, CA 94514", "Artist": "Nick Tyrrel ", "ArtistImage": "https://photos.bandsintown.com/thumb/11384058.jpeg", "Coordinates": [37.877313, -121.6318306], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "1:00 PM", "Venue": "Campos Family Vineyards", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "6096 Main St, Clayton, CA 94517", "Artist": "LL&PFP ", "ArtistImage": "https://photos.bandsintown.com/thumb/11289612.jpeg", "Coordinates": [37.9410602, -121.9350228], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop-jazz And Redneck-folk", "Time": "1:00 PM", "Venue": "LL&PFP Return to the Saloon", "moreBioInfo": "Just two nice guys trying to express their softer side while chasing down their next beer, wine, or Jameson & coffee. LL tries to blow stuff up in his day job, and PFP stabs chickens...which, if you come to know them, is a pitiful description of what they really do. Musically, LL is a master of his instrument; PFP is the instrument of his master, or something like that. In the end, they just wanna have fun making music for you.", "otherInfo": "No event info available"}, {"Address": "180 Morris St #170, Sebastopol, CA 95472", "Artist": "Anthony Presti Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/7913872.jpeg", "Coordinates": [37.9410602, -121.9350228], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alt-country, Folk Rock", "Time": "1:30 PM", "Venue": "Anthony Presti and Leah Van Dyke- Region Wine Bar's First Anniversary", "moreBioInfo": "Alt-rock singer/songwriter Anthony Presti grew up in Seattle during the 1990’s where an explosive alternative and grunge rock scene was thriving. He moved continuously until his teenage years, where he settled in Sonoma County. Presti played in a hardcore band, releasing several albums and touring extensively until they broke up. His identity shifted as he rediscovered his love for acoustic guitar and eventually moved to San Francisco. He’s gone on several west coast tours, and played shows at the Lagunitas Brewery, Napa City Winery, HopMonk Tavern and Brick and Mortar Music Hall and has shared the stage with national artists like Grammy Nominated Gretchen Peters, Little Tybee, The Deer and Elliott Peck. Presti’s latest record, Existentialism, is his strongest effort to date. The opening track, “Next of Kin,” resembles the stylings of Johnny Cash, while “Dreamland,” Presti’s first music video single, shows a strong influence of Roy Orbison. “One Step Closer” features Presti and Van Dyke trading versus like a new age Fleetwood Mac, “Reach for the Stars” is a catchy contemporary folk laden tune and “Family Tree” is a testament to Presti’s hard rock upbringing. Presti has released several albums, including, Clarity in Hindsight, recorded at Prairie Sun Studios (Tom Waits, Primus) and, Existentialism, at Tiny Telephone Studios with engineer James Riotto (Sean Hayes, The Mountain Goats) accompanied by an impressive cast of musicians including Leah Van Dyke (Brothers of Siren), Shaun David (The Lost), Burt Lewis (Stu Allen) and Jason Slota (Thao and the Getdown Staydown).", "otherInfo": "Anthony Presti and Leah Van Dyke play at the Region Wine Bar in the Barlow in Sebastopol for their one year anniversary."}, {"Address": "175 Fairgrounds Dr, Petaluma, CA 94952", "Artist": "DJ Tazzy Taz ", "ArtistImage": "https://assets.prod.bandsintown.com/images/fallbackImage.png", "Coordinates": [38.242612, -122.6296221], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "2:00 PM", "Venue": "Custom Truck", "moreBioInfo": "No artist bio available", "otherInfo": "No event info available"}, {"Address": "87 N San Pedro St, San Jose, CA 95110", "Artist": "Identity Problem Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/11428379.jpeg", "Coordinates": [37.3365265, -121.8943707], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "2:00 PM", "Venue": "IP BACK AT SAN PEDRO SQUARE!", "moreBioInfo": "Identity Problem is a classic/modern rock cover band from San Jose, California, eager to bring a nostalgic, live atmosphere to any bar scene. http://www.identityproblem.rocks/ Band members are Mike Johnson, Diane Hull, Ron Senior, David Noble and Dan Blake.", "otherInfo": "We are so thankful to be playing music downtown at SPSM once again! Please come out and see us, and support your local San Pedro Market businesses....there's an amazing selection of food and drink...and live music. We promise it will be fun!"}, {"Address": "1 Marina Plaza, Antioch, CA 94509", "Artist": "Toree McGee ", "ArtistImage": "https://photos.bandsintown.com/thumb/9049618.jpeg", "Coordinates": [38.0200104, -121.8202417], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Alternative Country, Rock, Country", "Time": "2:00 PM", "Venue": "Toree & David Unplugged @ Smith's Landing ", "moreBioInfo": "With a rafter-reaching soprano ranged voice that emanates grit and fire, Toree McGee describes her music as a blend of “Woodstock rock ‘n’ roll, and sparkly country.” This eclectic style is equal parts percussion-driven swagger and playful melodies. Behind the northern California native’s powerful, edgy vocals is a candid, bubbly personality, along with a natural, effervescent stage personality inherited from a family filled with performers. Toree's musical style embodies elements of her influences, ranging from the soulful country sounds of The Judds and Bonnie Raitt, to the rock of Guns N’ Roses and Aerosmith, and especially the engrossing vocals of Janis Joplin. McGee began writing songs and soliciting material for her six-song EP, perfecting her sound into a unique fusion of country, soul and rock that would reflect her edgy roots and support her powerhouse vocals. “Run Right Back To You,” which boasts McGee as the sole writer, is among the standouts on the project. McGee recorded tracks for the EP in 2014 at Ronnie's Place in Nashville, alongside seasoned musicians who have performed with Jason Aldean and Luke Bryan, among others. “I wanted to blend my love of hard rock and country together,” McGee says of the project. “I have this heavy-hitting, gravelly tone in my voice, and I didn’t want to lose that side of me. But country has always been my favorite genre of music. That’s where I want to be, but I want to bring a bit of that old style of rock with me.” Toree's first single, \"Amen\" gained airplay on radio stations in California, the midwest, and Canada, and climbed to the #1 slot on 95.3 KRTY's 'Hot 9 @ 9' segment for several days in a row. It has also gained the attention of Sirius/XM radio, as well as local news stations which have featured her music and story. She most recently co-wrote and recorded brand new songs with hard hitting guitar riffs and tons of girl power attitude, and released her first full-length album on Valentine’s Day 2020 . Her first single from the project, named “Lipstick” is currently in rotation at KRTY as well as on Sirius/XM’s station ‘The Pulse’. McGee opened for country music superstar, Clay Walker in San Jose, followed by opening slots for rising stars, A Thousand Horses, Austin Webb, Brian Davis, Drake White, Cadillac Three, Brett Young, Whiskey Myers, Justin Moore, Randy Houser, Kellie Pickler, The Marshall Tucker Band, and others. Her first full EP was officially released in 2015, and her first full-length album was released in February 2020. Since her first EP release, she has played shows at NASCAR races, the Aria Hotel & Casino in Las Vegas, Grand National Rodeo, for the U.S. Air Force at RAF Mildenhall in the U.K., the Night in the Country music festival in Nevada alongside Justin Moore, Craig Morgan, Drake White, & Thomas Rhett, and most recently at the iconic Fillmore in San Francisco.", "otherInfo": "No event info available"}, {"Address": "13160 Central Ave, Boulder Creek, CA 95006", "Artist": "Davey and The Midnights ", "ArtistImage": "https://photos.bandsintown.com/thumb/11471861.jpeg", "Coordinates": [37.1248728, -122.121812], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Blues, Psychedelic Soul, Folk, Country", "Time": "2:00 PM", "Venue": "Davey & The Midnights LIVE at Lille Aeske Arthouse", "moreBioInfo": "Los Angeles westsiders, Davey And The Midnights combine traditional country, blues, and psychedelia to create an eclectic highway sound", "otherInfo": "California+Indiana based Davey & The Midnights bring their energetic storytelling and good vibes to a stage near you. Snap shirts and dancing shoes encouraged! Cosmic American Music"}, {"Address": "87 N San Pedro St, San Jose, CA 95110", "Artist": "Identity Problem ", "ArtistImage": "https://photos.bandsintown.com/thumb/11483518.jpeg", "Coordinates": [37.3365265, -121.8943707], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Classic Rock, Southern Rock, Country, Jam Bands, Americana", "Time": "2:00 PM", "Venue": "San Pedro Square Market Bar", "moreBioInfo": "Identity Problem is a classic rock cover band from San Jose, California, eager to bring a nostalgic, live atmosphere to any bar scene. When Identity Problem formed, Diane (Lead vocals), Mike (acoustic/electric guitar), Robert (lead guitar), Tom (bass), and Christian (drums) had one goal: remind us of our roots, who we once were before we forgot what mattered. Comprised of individuals with a passion for that memory of music and being able to share that same love, it’s hard not hear the brotherhood in their performance, exchanging the spotlight with each other almost as easily as it is to dance to their homegrown sound. Each moment of Identity Problem’s performance honors that rock band tradition we all love. With all bandmembers contributing to the scene with their voices, especially those charismatic vocals from Diane, Identity Problem brings a closeness rarely achieved by cover bands; Identity Problem excels.", "otherInfo": "Join us for some great IP music and dancing!"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Juheun ", "ArtistImage": "https://photos.bandsintown.com/thumb/6032815.jpeg", "Coordinates": [37.7689137, -122.4192514], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Minimal, Techno, Electronic, Tech House", "Time": "4:00 PM", "Venue": "Public Works", "moreBioInfo": "Hailing from the stark and unyielding deserts of the United States, Juheun emerges from the dust with mind warping, forward thinking techno. Constantly searching for a perfect balance between analog gear and the newest technology, he blurs the lines between the past and the future to create a modern and dynamic sound. Octopus Recordings Artist www.Juheun.com www.instagram.com/juheunmusic www.Twitter.com/JuheunMusic", "otherInfo": "Dominic M presents: Juheun (Octopus Recordings) in Public Works Loft"}, {"Address": "100 Hooper St Ste. 4, San Francisco, CA 94107", "Artist": "Gaucho ", "ArtistImage": "https://photos.bandsintown.com/thumb/11554512.jpeg", "Coordinates": [37.76876439999999, -122.3990825], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Gaucho at Seven Stills Brewery & Distillery", "moreBioInfo": "Gaucho is a masterful Bay Area band that combines the influence of gypsy jazz of 1930’s Europe with the rhythmic drive and collective improvisation of New Orleans swing music, gutbucket blues and elements of ragtime. Their sound, a uniquely American concoction, blends instrumental acuity and lighthearted humor that keep their audience coming back for more. As founder, guitarist, and main composer Dave Ricketts says, the band is “in love with the music of Louis Armstrong, Fats Waller and Jimmie Rodgers, as well as the stories, the life styles and the foot steps of hundreds of other great jazz, blues, country and rock musicians that created the sound of American Music from roughly 1900-1950’s” Led by eminent guitarist, Dave Ricketts, the group has been a San Francisco mainstay for over fifteen years, and one of the busiest bands in the bay area playing 5 to 10 gigs a week. Together with virtuosos Rob Reich–accordion and Craig Venetresco–guitar, superlative bassist Ari Munkres and versatile percussionist Steve Apple, these guys keep crowds moving with their beats and complex rhythms. Gaucho has recorded seven albums, tours regularly, and has an increasing repertoire of over forty original tunes. Seven of their tunes are featured in the 2012 film \"Trattoria\"; one was chosen by the Metropolitan Museum of Art for their website; and another is featured in the outtakes section of the Pixar DVD CARS 2.", "otherInfo": "No event info available"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "AMPRS&ND ", "ArtistImage": "https://photos.bandsintown.com/thumb/8580603.jpeg", "Coordinates": [37.7689137, -122.4192514], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Public Works", "moreBioInfo": "bass so thick you can't get a comb through it.", "otherInfo": "Dominic M presents: Juheun (Octopus Recordings) in Public Works Loft"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Dj LowKey ", "ArtistImage": "https://photos.bandsintown.com/thumb/7569105.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Techno, Electronic", "Time": "6:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "LowKey (Goog rec / Driving forces rec / Respekt rec / Phobiq rec / Analytictrail rec / Renesanz rec / AFU rec / Hydraulix rec / Patterns rec / Neverending rec / Selected rec / Inlab rec / Refluxed rec and more......) Essential Artist of the French electronic scene for over 10 years, his productions with his alter ego Kardinal are internationally recognized and playlisted by all superstars dj’s like Umek , Jesper Dahlback , Sasha Carassi , Secret Cinema , Joseph Capriati , Adam Beyer , Dave the drummer and many more…..Their label «GOOG» is certainly the leading label of French techno scene at the moment. After succeeding Tonio and Laurent Garnier at the residence of the legendary Burgundy club l’Anfer in the early 2000s, he regularly took part in all the biggest national events and in clubs around the world (Belgium / Spain / Italy / Czech Republic / China / Thailand / Hong Kong etc., etc.) with his particular style of rave-influenced grooves mixing minimal, breakbeat and techno. He has notably collaborated with various artists such as Scan X, Dafresh, or even Popof, with several maxis signed on the famous label of Thomas Hekcmann AFU LAB and completed the anthem of Heretiks DVD with the title «Mamoth». He produced his first album, «Puzzled», in collaboration with Kardinal, released on the label Tracker at the end of 2010. Artiste incontournable de la scène électronique française depuis une dizaine d’années grâce à ses productions,réalisées avec son alter ego Kardinal.Ses Tracks sont supportées et playlistées aux quatre coins de la planète par les plus grands dj’s tels que Adam Beyer , Sasha Carassi , Luigi Madonna , Joseph Capriati ou bien encore Umek . Après avoir succédé à Laurent Garnier et Tonio à la résidence du mythique club dijonnais l’An-fer au début des années 2000 , on le retrouve sur tous les plus gros événements nationaux ainsi que dans les clubs à travers le monde (Belgique/Espagne/Italie/République Tchèque/Autriche/Chine/Thaïland/ Hong Kong etc…….) Leur label « GOOG » avec Kardinal est certainement le label phare de la scène dark techno française à l’heure actuelle. Une cinquantaine de maxis à son actifs dont le tube « Mamoth » (l’hymne du DVD des Hérétiks), ainsi que des signatures remarquées sur des labels phares de la scène électronique internationale tel que le label allemand « AFU » de Thomas Heckmann , le label Italien « Phobiq » de Sasha Carassi le label anglais « Hydraulix » de D.A.V.E the Drummer ou bien encore le label hollandais Patterns…… On peut noter des collaborations diverses avec des artistes tels que Scan x, Da fresh, Electric Rescue , Angy Kore , Pleasurktaft , Mikael Jonasson ou bien encore Popof . http://www.facebook.com/pages/Dj-LowKey/38562665993?ref=ts http://soundcloud.com/djlowkey http://soundcloud.com/goog-records http://www.beatport.com/artist/lowkey/33074 Booking LowKey or LowKey & Kardinal on 4 Decks : General booking : contact@electrobooking.com Germany / Austria / switzerland : michael@stilevent.de", "otherInfo": "Performing Live:\n Xanubis\n Vtizzel\n Canal Knight\n Liam Berry\n Seb707\n DJ Lowkey\nXanubis is an alternative Hip Hop artist from San Francisco. His music explores the contrast of his hedonistic and nihilistic exterior; and his passionate, romantic interior, as he reluctantly accepts his fading youth.\nVtizzel is an artist who doesn't appreciate censorship for the sole reason of his beliefs of free speech. The lyrical acrobatics and serious topics of Vtizzel are sometimes intimidating to the average listener. While understanding many people have emotional triggers, Vtizzel aims to talk about some of the most uncomfortable topics; in hopes to bring awareness to messed up situations and ultimately create a community of good mental health. Vtizzel wants the best for the world, even if the world may not know the best for themselves.\nCanal Knight is an Electronic and Hip Hop Artist based in the San Jose bay area. Inspired by the art and community that raised them, Knight hopes their music makes people move while pushing the genre of hiphop/rap in both a progressive and unique directions.\nLiam Berry is a San Francisco native multi-media artist who works mainly with Music and Visual Arts. Musically, he takes lots of inspiration from many different sub-genres of Jazz, Brazilian, Hip-Hop, and Indie music and blends all these unique sounds in his written music and general playing style. Liam's visual art revolves around abstract colors, shapes and designs, while he does play with different techniques, he is known for his Graffiti/Keith Herring inspired style of linework which can be found in most of his work.\nSeb707 is an artist out of the bay area who is fresh and new to the game. Influenced by G funk, trap and Anime, the beats are a mix and blend of the sounds that he made himself. Seb707 has worked with small local artists for several years and is self taught from making beats to mixing and engineering. Dropping a few beat tapes and collabs this is He's first rap tape to ever release.\nDJ Lowkey is a Bay Area artist specializing in local underground Hip Hop. They were born and raised in San Francisco, in the heart of the Bayview district, and have a strong love for unique sounds. They hope to open people's field of view with music as a means and a method.\nhiphop. rap.\n6pm - 11pm.\nall ages.\nFree with RSVP.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-25d.html\nWatch and listen:\n Xanubis: Ultra Instinct: http://youtu.be/9lvlFHxIgxA"}, {"Address": "199 Valencia St, San Francisco, CA 94103", "Artist": "King Dream ", "ArtistImage": "https://photos.bandsintown.com/thumb/8586718.jpeg", "Coordinates": [37.77002780000001, -122.4221052], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "King Dream at Zeitgeist", "moreBioInfo": "King Dream is the new project from Bay Area songwriter and musician Jeremy Lyon. Inspired by Jim James, Blake Mills, and Jonathon Wilson, Lyon spent 5 years touring the country with Tumbleweed Wanderers, a band he co-founded in 2011, releasing a couple albums and a few EPs along the way. Since disbanding in 2016, he's worked as a sideman in a slew of regional indie rock, psych/folk, and alt/pop acts including Whiskerman, M Lockwood Porter, and Lapel, while working on his debut self-titled album, due out summer of 2018.", "otherInfo": "3 sets of King Dream - FREE!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Jana Herzen ", "ArtistImage": "https://photos.bandsintown.com/thumb/11493415.jpeg", "Coordinates": [37.7962494, -122.2785582], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "Charnett Moffett Trio NEW LOVE Release Concert feat. Jana Herzen ", "moreBioInfo": "Jana Herzen, Nothing But Love, Press Release / September 23, 2019 PR Contact: sethcohenpr@earthlink.net “She is a composer, guitarist and lyricist whose performances are imaginative and soulful.” – Jazz Times A SOPHISTICATED JUXTAPOSITION OF JOY, MELANCHOLY, AND MYSTERY INFUSE SINGER/SONGWRITER/GUITARIST JANA HERZEN’S THIRD ALBUM, ‘NOTHING BUT LOVE’ Album Releases 1.17.20 on Motéma Music Preview Concert – at Joe’s Pub in New York City on October 29th, @ 7pm. On ‘Nothing But Love’, Jana Herzen’s diverse, soulful and sophisticated collection of folk/pop/world/jazz originals, the singer-songwriter, and guitarist reaches new heights as a storyteller and composer. The wonderfully rich, mature, and complex song tapestry will be released on January 17, by the multi-GRAMMY® winning Motéma label. Learn more at http://janaherzen.net “Herzen presents warmly wrought jazz-pop.” – Time Out, NY “Absolute Intimacy.” – Gary Walker, WBGO For Press Inquiries about Jana Herzen’s Nothing But Love, please contact Seth Cohen PR: sethcohenpr@earthlink.net www.sethcohenpr.com Booking Inquiries contact: Maria Matias Agency: maria@mariamatiasmusic.com", "otherInfo": "Show At Yoshis starts at 7 pm/ Doors at 6:30\n\n\nFretless electric jazz bass master, composer and vocalist Charnett Moffett celebrates the release of his trio/quartet NEW LOVE on the Motema label. Joining him will be the core trio from the album: featured guitarist and vocalist Jana Herzen and drummer Corey Garcia. \n\nPress comment on Charnett Moffett and NEW LOVE: \n\n“One of the best bassists on the American scene.\" \n– JazzASeizHeur\n\n– \"There’s something special anytime that Jana Herzen and Charnett Moffett make music together. Together they're magic.\" – American Songwriter\n\n“Charnett Moffett’s latest reminds us once again, that his quicksilver imagination matches the speed of his fingers.. there’s a tight synchronicity at play.. A dynamic, ever-shifting dialogue issues from their collaboration; it’s a conference of multifaceted tonalities and intuition.” \n– Downbeat, July 2021\n\n\"It's music at the intersection of swing, spiritual and free jazz …”\n– AFROPOP.ORG\n\n“Charnett Moffett delivers a love letter to humanity with NEW LOVE” – BASS MAGAZINE\n\n“Charnett Moffett’s astonishing bass command is evident throughout New Love… the music also brims with positivity. …The playing’s fresh and effervescent in the extreme… ”\n– TEXTURA July 2021\n\n\"A master of both double bass and electric bass from an illustrious musical family, Moffett is known as much for the daunting breadth of his musicality as his technical prowess, catalyzing essential recordings such as Wynton Marsalis’ “Black Codes (From the Underground),” Ornette Coleman’s “Sound Museum” and Kenny Garrett’s “Triology.” – THE SAN FRANCISCO CHRONICLE"}, {"Address": "3159 16th St, San Francisco, CA 94103", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/11403932.jpeg", "Coordinates": [37.7646135, -122.4233002], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Soul Jazz, West Coast Blues, R&b, Blues", "Time": "7:00 PM", "Venue": "Gestalt", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is. For the past 35 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience. In addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff. GG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style. She is currently working on her own all-original album \"Content Under Pressure\". GG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award. She's performed at the San Jose Jazz Summer Fest, Mill Valley Fall Arts Festival, Sacramento Arts Festival, Monterey Bay Blues Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011. GG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor. GG Amos Website - www.twogees.com Bookings: Michael Vogel wingtip228@gmail.com Quotable quotes> “Must say, nothing is as good as sex but this is close!\" - Kjell Andreassen of Radio Holstebro in Denmark. “Girl, you can boogie!” - John Lee Hooker “You’re a hell of a guitar player and singer too!” - Guitar Shorty “You… You!” - Chris Cain", "otherInfo": "The GG Amos Trio a.k.a. The GG3 perform hot blues, simmering jazz and soulful r&b.. Etc.. Live at Gestalt in the heart of the Mission District, San Francisco CA. \n\nFeaturing GG Amos on guitar/vocals, Parris Bertolucci on keyboards/organ/bass and Randy Lee Odell on drums"}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Russell Peters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9619761.jpeg", "Coordinates": [37.3356413, -121.8883224], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "San Jose Improv", "moreBioInfo": "No artist bio available", "otherInfo": "EVENT INFO:There is a two-item minimum purchase requirement in the showroom for all guests. Seating is general admission, first-come, first-served, with the exception of groups and premium booths.All sales are final.MISCELLANOUS:For group sales info, e-mail our Events Manager to learn about special menu options and reserved seating.Additional questions may be addressed in our Frequently Asked Questions.For further assistance contact San Jose Improv at 408.280.7475 or by e-mail."}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Charnett Moffett ", "ArtistImage": "https://photos.bandsintown.com/thumb/11363589.jpeg", "Coordinates": [37.7962494, -122.2785582], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "Yoshi's: Charnett Moffett Trio NEW LOVE Release Concert feat. Jana Herzen with Corey Garcia", "moreBioInfo": "Bassist, Composer, Bandleader, Vocalist, Producer, Recording Artist for Motema Music. An artist with an unusual abundance of spirit, chops, and charisma, Charnett Moffett has released sixteen acclaimed albums and has toured the world as one of the most innovative and versatile acoustic and electric bassists in jazz. He debuted on the Blue Note label in 1987, and after signing with several other labels through the years, in 2008 he found his 'home' at the Motema label where he has released his seven most recent projects. Moffett's career began as a child prodigy, appearing first on record in his father Charles Moffett's band at age 8. In addition to his leadership career, he has collaborated as a 'bassist to the stars' on over 200 albums, many of them considered to be classics in jazz.", "otherInfo": "Show At Yoshis starts at 7 pm/ Doors at 6:30\n\n\nFretless electric jazz bass master, composer and vocalist Charnett Moffett celebrates the release of his trio/quartet NEW LOVE on the Motema label. Joining him will be the core trio from the album, guitarist and vocalist Jana Herzen and drummer Corey Garcia. \n\nPress comment on Charnett Moffett and NEW LOVE: \n\n“One of the best bassists on the American scene.\" \n– JazzASeizHeur\n\n“Charnett Moffett’s latest reminds us once again, that his quicksilver imagination matches the speed of his fingers.. there’s a tight synchronicity at play.. A dynamic, ever-shifting dialogue issues from their collaboration; it’s a conference of multifaceted tonalities and intuition.” \n– Downbeat, July 2021\n\n\"It's music at the intersection of swing, spiritual and free jazz …”\n– AFROPOP.ORG\n\n“Charnett Moffett delivers a love letter to humanity with NEW LOVE” – BASS MAGAZINE\n\n“Charnett Moffett’s astonishing bass command is evident throughout New Love… the music also brims with positivity. …The playing’s fresh and effervescent in the extreme… ”\n– TEXTURA July 2021\n\n\"A master of both double bass and electric bass from an illustrious musical family, Moffett is known as much for the daunting breadth of his musicality as his technical prowess, catalyzing essential recordings such as Wynton Marsalis’ “Black Codes (From the Underground),” Ornette Coleman’s “Sound Museum” and Kenny Garrett’s “Triology.” – THE SAN FRANCISCO CHRONICLE"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "The Strike ", "ArtistImage": "https://photos.bandsintown.com/thumb/11377275.jpeg", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Indie Pop, Pop & Rock, Alternative", "Time": "7:30 PM", "Venue": "The Strike with Sub-Radio", "moreBioInfo": "The Strike is a 5 member independent band based in Los Angeles, CA. Formed in 2013, the band is headed by front man Chris Crabb and supported by Alex Palazzo, David Maemone - Keys, Frank Ojeda-bass, and Jay Tibbitts-drums. The Strike released their debut album \"Faint of Heart\" in June of 2017, which was met with great enthusiasm nationally. The success of the record allowed them to expand their presence into Los Angeles and the greater Mountain West region and has put them on the radar as one of the up and coming bands to watch for. On August 17th 2018, their song “Human Right” from the album was featured in Netflix’s original movie “To All the Boys I’ve Loved Before.” In less than one month, the song was streamed over 1 million times on Spotify alone, and well over a million times across all platforms. It was “Shazamed” over 20k times in the month following the release of the movie. Among those who saved Human Right to their library, it is listened to at an average of 10+ times. It was featured on Spotify’s New Alt Playlist (700k+ subscribers), as well as the US Viral Top 50 Chart. In the summer of 2017, they were selected to play at the 27th annual Qingdao Beer Festival in China where they performed to thousands of festival goers for a month and a half. Their music is now being circulated across Asia. In early 2018 The Strike was hand selected by Quincy Jones to play a three month residency at Q's Bar and Lounge in Dubai. There they were able to win over fans from all over the globe. They played 60 shows in 82 days while in the UAE. The Strike is known for their captivating live performances. In an age of musical minimalism, The Strike is reminiscent of rock bands from the 70's and 80's. They feature true showmanship in an age where the art of performance has been forgotten. Chris Crabb's vocal style is akin to rock vocalists such as Lou Gramm, or Steve Perry. The band members are all students at their craft. Those attend Strike shows become instant fans.", "otherInfo": "No event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Good People ", "ArtistImage": "https://photos.bandsintown.com/thumb/221729.jpeg", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Hip Hop, Jazz", "Time": "8:00 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "The Strike & Sub-Radio"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "Sub-Radio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9056029.jpeg", "Coordinates": [37.8663468, -122.2671168], "Date": "2021-07-25", "EventDate": "Jul. 25th, 2021", "Genre": "Pop, Pop Rock, Rock & Roll, Indie Pop, Alternative, Alt Rock", "Time": "8:30 PM", "Venue": "Cornerstone Craft Beer & Live Music", "moreBioInfo": "Sub-Radio makes indie pop that grooves, stabs, winks, punches, inspires. Founded by six childhood friends, they built a following in their hometown of Washington, D.C. on the strength of ecstatic live shows and a stream of releases. Sub-Radio is Adam Bradley (vocals), Matt Prodanovich (guitar, vocals), Michael Pereira (drums), John Fengya (keys, guitar, vocals), Barry Siford (bass), and Kyle Cochran (guitar, keys).", "otherInfo": "No event info available"}, {"Address": "170 Railroad St, Santa Rosa, CA 95401", "Artist": "Andy McKee ", "ArtistImage": "https://photos.bandsintown.com/thumb/8203795.jpeg", "Coordinates": [38.4355805, -122.7190196], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Acoustic, Instrumental Acoustic Guitar, Instrumental", "Time": "9:00 AM", "Venue": "Andy McKee's Musicarium 2021 (Guitar Camp)", "moreBioInfo": "Andy McKee is one of the world’s finest acoustic guitarists and it’s evident from the accolades he’s received throughout his career. It’s his youthful energy, attention to song structure and melodic content that elevates him above the rest. After nearly a decade without releasing new studio recordings, McKee returns with his six-track EP, Symbol, out Friday, September 17 on Mythmaker Records in conjunction with Cruzen Street Records. “These are my interpretations of tunes that really inspired me,” says McKee. “I wanted to give listeners a chance to hear what I hear when I listen to this music. I also wanted to branch out a bit and include music that isn’t originally for acoustic guitar.” While Symbol is a collection of inspired renditions, they are important song choices; artists that deeply influence McKee and song’s that connect to his musical past. He pulls from the catalogues of greats like Michael Hedges, Preston Reed, Billy McLaughlin and Prince. There’s “Ragamuffin,” the EP’s lead single, which is a nod to one of McKee’s biggest influences, Michael Hedges. McKee notes that “Michael was not only a revolutionary guitarist on the technical side, his ability to compose for solo guitar was also genius. Most importantly though, he was able to search inside of himself and consistently pull up very human and evocative themes that made him a true artist. I’ll always be grateful for his music.” One track that might catch fans by surprise on Symbol is McKee’s gorgeous rendition of Prince’s “Purple Rain.” In 2012, McKee played alongside Prince in his band on the “Welcome 2 Australia” tour with the song being one of the setlist highlights. “I had originally come up with the ‘Purple Rain’ arrangement to open the shows with while I was on tour with Prince in Australia,” recalls McKee. “I have played it occasionally since then while touring and figured I should finally get a recording of it down. One thing that I learned from Prince while we were on the road is that we both really admire Joni Mitchell. I used that as a reference when trying to describe what I do. Although some of what I do on the guitar is technically demanding, I don’t ever really want that to overshadow the music.” Another standout from Symbol is Mckee’s take on “Chattanooga” by acclaimed guitarist Preston Reed. “In my opinion, ‘Chattanooga’ by Preston Reed is one of the finest fingerstyle guitar pieces ever written,” says McKee. “It’s just loaded with texture, harmony, percussion, and melody. I love the key changes and chromaticism between some of the chords. This tune really inspired me a lot.” McKee, like many, was infatuated with the Rocky IV soundtrack, specifically the Vince DiCola compositions “War” and “Training Montage.” For Symbol, McKee and DiCola joined forces to craft “Rocky IV Medley.” “That was about as surreal as it gets for me,” says McKee. “I became a fan of Vince’s work when I was six years old and I bought the soundtrack to the film on cassette. I used to listen to it all the time on my Sony Walkman and I really found that my favorite tunes were the instrumental tracks which were “War” and “Training Montage” from Vince. Those tunes awakened my mind to the possibility of being moved by music with no words. To be able to recreate those tunes with the electric guitar and play with Vince is really something I could never have dreamed of.” Andy McKee entertains both the eye and the ear as he magically transforms the steel string guitar into a full orchestra via his use of altered tunings, tapping, partial capos, percussive hits and a signature two-handed technique. McKee’s crossover success has helped him to achieve millions upon millions of YouTube viewers, underscoring his emergence as one of today’s most unique and influential artists. His song “Drifting” became one of the first YouTube viral videos with almost 60 million views. He has been featured as a cover story in both Acoustic Guitar Magazine in the U.S. and Acoustic Magazine in the UK. He also curates his own annual guitar retreat called Musicarium. McKee’s tour dates have taken him through Europe, Asia, Australia and North America, including tours with legendary acts from Dream Theater to Tommy Emmanuel.", "otherInfo": "This is Andy McKee's Guitar Camp featuring Andy along with Mike Dawes, Antoine Dufour, Calum Graham, Trevor Gordon Hall, Muriel Anderson, and Michael Manring."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "BIT ", "ArtistImage": "https://photos.bandsintown.com/thumb/6373397.jpeg", "Coordinates": [37.7711031, -122.4126145], "Date": "2021-07-26", "EventDate": "Jul. 26th, 2021", "Genre": "Electronic, Psy Trance, Goa Trance", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "DEATH GUILD\nMain Room:\n Decay\n Joe Radio\n Melting Girl\nLounge:\n Sage\n Bit\nDeath Guild is the oldest weekly goth/industrial dance night in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nBuy tickets: https://www.dnalounge.com/calendar/2021/07-26.html\nWatch and listen:\n Death Guild: 2009 Trailer: http://youtu.be/c9L2pOVeLHo\ngothic. industrial. synthpop.\n9:30pm - 2:30am.\n18+ with ID.\n$5 advance;\n$5 < 10:30pm;\n$8 after.\nhttp://www.deathguild.com/"}, {"Address": "Claremont, CA", "Artist": "Nathalia ", "ArtistImage": "https://photos.bandsintown.com/thumb/9051121.jpeg", "Coordinates": [34.0966764, -117.7197785], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Latin American Family Music, Kindie, Bilingual Music, Family Music", "Time": "3:30 PM", "Venue": "Claremont Library", "moreBioInfo": "Originally from Barranquilla, Colombia, Nathalia moved to the United States to study Music Therapy at the Berklee College of Music. Upon completion, she began her career in Los Angeles and later received a Master’s degree in Clinical Psychology from Antioch University. Nathalia’s experience as a music therapist and early childhood music educator ultimately inspired her to use music as a tool for teaching her own children Spanish. In doing so, she had inadvertently written songs that would later become her debut children’s album, From Here To There. Since then, Nathalia’s unique bilingual approach to songwriting has made her a prominent voice in the world of children’s music. She has released two additional albums, Dream a Little and Cuando era pequeña, both of which were co-produced and performed by notable Grammy Award winners. In addition, she has been a featured guest on Univision's 'Despierta America', CBS's 'The Talk' and her music has been played on a number of parenting blogs and online radio stations. Nathalia’s South American heritage and passion for bilingual education has served as a major influence in the music she creates. From rock to cumbia, jazz to reggaeton, her songs are produced in a number of different musical styles and written with the whole family in mind.", "otherInfo": "No event info available"}, {"Address": "200 Hartz Ave, Danville, CA 94526", "Artist": "The Complements ", "ArtistImage": "https://photos.bandsintown.com/thumb/8140915.jpeg", "Coordinates": [37.8230482, -122.0008185], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Positive Rock, Indie, Acoustic", "Time": "5:30 PM", "Venue": "Hazy Barbecue", "moreBioInfo": "Singer-songwriter acoustic duo from California.", "otherInfo": "No event info available"}, {"Address": "444 Battery St, San Francisco, CA 94111", "Artist": "Karinda Dobbins ", "ArtistImage": "https://photos.bandsintown.com/thumb/9903737.jpeg", "Coordinates": [37.795486, -122.4001359], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Comedy", "Time": "8:00 PM", "Venue": "Comedy Allstars", "moreBioInfo": "Comedian, writer, and actor.", "otherInfo": "No event info available"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/11404195.jpeg", "Coordinates": [37.76976860000001, -122.4471395], "Date": "2021-07-27", "EventDate": "Jul. 27th, 2021", "Genre": "Soul Jazz, West Coast Blues, R&b, Blues", "Time": "8:00 PM", "Venue": "Club Deluxe", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is. For the past 35 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience. In addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff. GG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style. She is currently working on her own all-original album \"Content Under Pressure\". GG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award. She's performed at the San Jose Jazz Summer Fest, Mill Valley Fall Arts Festival, Sacramento Arts Festival, Monterey Bay Blues Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011. GG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor. GG Amos Website - www.twogees.com Bookings: Michael Vogel wingtip228@gmail.com Quotable quotes> “Must say, nothing is as good as sex but this is close!\" - Kjell Andreassen of Radio Holstebro in Denmark. “Girl, you can boogie!” - John Lee Hooker “You’re a hell of a guitar player and singer too!” - Guitar Shorty “You… You!” - Chris Cain", "otherInfo": "The GG Amos Trio a.k.a. The GG3 perform hot blues, simmering jazz and soulful r&b.. Etc.. Live at Club Deluxe in the Haight/Ashbury District, San Francisco CA. \n\nFeaturing GG Amos on guitar/vocals, Parris Bertolucci on Hammond organ/bass and Randy Lee Odell on drums"}]