var sf_events_3 = [{"Address": "100 W Monte Vista Ave, Vacaville, CA 95688", "Artist": "Quattrosound", "ArtistImage": "https://photos.bandsintown.com/thumb/7210415.jpeg", "Coordinates": [-121.99208, 38.35915], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Classical, Jazz, Fusion, Rock, Pop, Classical Crossover, Classical Pop, Guitarist, Violinist, Cellist, Percussion, Original music", "Time": "10:30 AM", "Venue": "Vacaville High School", "moreBioInfo": "QUATTROSOUND is an innovative acoustic ensemble that skillfully blends their classical and jazz training with a wide-range of personal music influences to create a uniquely engaging sound. The four musicians are equally astute at playing a Bach Suite, rocking out to Led Zeppelin or interpreting a piece by Chick Corea. Their playful passion captures enthusiasm from audiences of all ages.\n\n\n\nWith violin, cello, guitar, an eclectic selection of percussion instruments, and creative vocal arrangements Quattrosound produces a vibrant live show. Hailing from Japan, Mexico, Guatemala, and the United States, their music selections are as diverse as their nationalities. In an effort to inspire their broad range of listeners, Quattrosound, is focused on creating engaging programming for the classroom, stage and media.\n\n\n\n“bursting with intellect, passion, and virtuosity, but sounding like nothing you’ve heard before”\n\n(Nick DeRiso, somethingelsereview.com).\n\n\n\nIndividually these four accomplished musicians based in Los Angeles have played with the likes of Bocelli, Barbara Streisand, Yo-Yo Ma, Annie Lennox, Michael Jackson, Layla Hathaway, Ricky Martin and Gloria Estefan.\n\n\n\nTogether, Quattrosound raises the bar of originality with clever compositions and arrangements that \"pay homage to the classics\" and forge a new contemporary sound.\n\n\n\n\n\n\n\nGroup members:\n\nLeah Zeger (violin and vocals)\n\nGiovanna Moraga Clayton (cello and vocals)\n\nKay-Ta Matsuno (guitar and vocals)\n\nJorge Villanueva (percussion and vocals)", "otherInfo": "No other event info available"}, {"Address": "1280 N McDowell Blvd, Petaluma, CA 94954", "Artist": "Caroline Rose", "ArtistImage": "https://photos.bandsintown.com/thumb/8360245.jpeg", "Coordinates": [-122.661783, 38.272428], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Schizodrift, Folk", "Time": "4:20 PM", "Venue": "Lagunitas Brewing Company", "moreBioInfo": "hello, CR 2.0 here! Twitter: CarolineRoseFM Insta: CarolineRoseMusic", "otherInfo": "No other event info available"}, {"Address": "200 Independence Dr, Menlo Park, CA 94025", "Artist": "Ellie James Music", "ArtistImage": "https://photos.bandsintown.com/thumb/9109700.jpeg", "Coordinates": [-122.18, 37.45], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Dream Pop, Indie Rock, Indie Folk, Indie Pop", "Time": "5:00 PM", "Venue": "Hotel Nia, Autograph Collection", "moreBioInfo": "Stylistically unique and captivating, Ellie James mixes the darker, dreamier side of her California roots with the edge and dynamics of her Boston background. Ellie's music is gritty, emotional, and raw, playing with vintage instruments and modern recording techniques. Ellie grew up in the heart of Sonoma Country wine country, infused with everything from roots and bluegrass to rock and roll. Currently based out of the Bay Area, she has recorded in studios in Boston and Los Angeles, and has performed at various venues across the country. The Afterparty EP coming August 2019.", "otherInfo": "No other event info available"}, {"Address": "4048 Sonoma Hwy, Napa, CA 94559", "Artist": "Frankie Bourne", "ArtistImage": "https://photos.bandsintown.com/thumb/9145101.jpeg", "Coordinates": [-122.335006, 38.255277], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Americana, Roots-rock, Indie", "Time": "6:00 PM", "Venue": "Carneros Resort and Spa", "moreBioInfo": "Frankie Bourne is a singer-songwriter, recording artist and performance artist based out of Northern California. Originally from West Marin County, he made his way down the California coast through Santa Cruz, writing songs, jamming in garages and performing at every open mic he could find while simultaneously earning a BA in Film & Digital Media and Literature from the University of California Santa Cruz.\n\nHe then immediately moved to Los Angeles where he wrote and arranged his acoustic-laced debut studio album, Californicana. The album was produced by LA producer Marc Danzeisen (Riverdogs, Powerslide, Gilby Clarke), and features saxophonist Jeremy Trezona (Saint Motel), as well as guitarists Johnny Hawthorn (Toad The Wet Sprocket, Everclear) and Manny Alvarez (Jackson Browne, Lucinda Williams), among others. It released independently under Bourne’s own Robotic Records with a successful sold out record release show at the historic (and now permanently closed) House of Blues on the Sunset Strip Foundation Room, followed by a 15-date California Tour.\n\nOn his 2015 debut, Frankie took a stance as a solo artist and emerged on the scene equipped with infectious roots-rock songs, and an authentic indie sound that, \"combines the style of new Americana with all the things you loved about 90s adult alternative bands\" (TourWorthy.com), and \"a smoky, quick-tongued lyrical quality that can change speeds like a Zack Greinke change-up\" (San Jose Rock Music Examiner). His first solo effort has been incredibly well-received by Indie, Rock and Americana radio stations nationwide, and won an award for best love song on the Jango Radio 2015 Valentine's Day Playlist, who call it, \"a refreshing roots rock record for the 21st Century\".\n\nAfter a hard-fought six years in the Los Angeles music scene, Frankie returned to his native San Francisco Bay Area in 2016, where his new band has quickly begun to make a name for themselves in the North Bay for their explosive, jam-oriented live shows, and their melodic roots-rock music that bridges eras of influence. Featuring drummer Jeff Nassi (Meredith Brooks, Fillmore Slim, Unauthorized Rolling Stones), guitarist Sunil Sharma (Alison Harris, Reality Check, Blusion), and bassist Matt Pasquale (Gravity Hill), Bourne’s new band is his primary focus of late. They enter Prairie Sun Studios in Spring 2018 to cut an album under Robotic Records.\n\nOn February 17th 2017 Frankie released Valley of Vindication, a 5-track EP of songs that showcase a softer, more acoustic direction to his sound. On Record Store Day 2017 (April 22nd 2017) Frankie released another 3-track EP, titled Homemade Remedies.\n\nYou can find his music on iTunes, Spotify, Amazon and CD Baby, and hear it on the following terrestrial and internet radio stations: KSVY (Sonoma), KWMR (Marin), KRSH (Santa Rosa), KALW (San Francisco), KPIG & KZSC (Santa Cruz), KCBX (Central Coast), HFM LA (Los Angeles), KHLV (Las Vegas), KHTP (Phoenix), Jango Radio, Indie Radio Music, Relax Free Radio, The Mad Music Asylum, War Stories Radio, and UK based XRP Radio, among others.\n\nwww.frankiebourne.com\n\n“Troubadour Frankie Bourne is one to watch as a burgeoning solo act. So tune in and behold...He’s part Johnny Cash, part Eagles, part Steve Earle, part...Frankie Bourne”\n– Christopher Millard, San Jose Rock Music Examiner\n\n“Frankie is California through and through. But then there’s so much more...It’s real music, plated by a real singer/songwriter with real instruments for real people”\n– Michael Rauch, View From The Cheap Seats\n\n“Bourne definitely has a way with a hook, and his infectious songs are both easy to absorb and easy to like...He’s going for earthiness rather than slickness to display that organic type of sound”\n– Alex Henderson, Music Journalist SPIN, Billboard, LA Weekly", "otherInfo": "No other event info available"}, {"Address": "100 El Camino Real, Menlo Park, CA 94025", "Artist": "Chenot", "ArtistImage": "https://photos.bandsintown.com/thumb/8140997.jpeg", "Coordinates": [-122.172094, 37.447768], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Classic Rock, Motown, Pop", "Time": "6:00 PM", "Venue": "Menlo Tavern @ Stanford Park Hotel", "moreBioInfo": "I play and sing whatever eclectic covers strike my fancy, from classic rock to Motown to that 90s jam you forgot you loved. I’m based in The San Francisco Bay Area, but I also play in the world-spanning band Sister Willow.", "otherInfo": "No other event info available"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Punch Brothers", "ArtistImage": "https://photos.bandsintown.com/thumb/8576443.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Country, Bluegrass", "Time": "7:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "Punch Brothers’ fourth Nonesuch album, the T Bone Burnett–produced The Phosphorescent Blues, addresses with straight-up poignancy and subversive humor the power and the pitfalls of our super-connected era. Digitally fueled isolation may be a theme, but this virtuosic acoustic quintet offers its warmest, most emotive and elegantly melodic work to date—so invitingly human in its approach that it practically ushers the listener into the room as these guys assemble in front of a mic.\n\nIndeed, a longing for community and connection was both impetus and inspiration for this disc. Never a group that could be accused of taking it easy, Punch Brothers had been touring almost non-stop since the majority of them first got together to support mandolin player Chris Thile’s 2006 solo album, How to Grow a Woman From the Ground. (And whenever they did take a break from their official Punch Brothers duties, the individual members engaged in a staggering array of solo and collaborative projects with fellow travelers in the worlds of bluegrass, jazz, and classical music.) But in February 2013, after supporting the 2012 disc Who’s Feeling Young Now?—an album in which, a New York Times reviewer opined, the band “shifted the emphasis from instrumental wizardry to playful storytelling” —Punch Bothers decided to scale back the concert schedule allowing themselves the chance to interact musically and personally, away from tour buses and dressing rooms.\n\nAs guitarist Chris Eldridge explains, “There was a sense among all of us that we needed to dial it back a little bit and really give ourselves time to write a record where we didn’t have deadlines and weren’t under pressure to get something out. So we scheduled these writing retreats. The first was in May 2013. We got together for a week in Charleston, South Carolina. We rented a house, and we played a gig—and the gig paid for us to rent the place. We worked on music all day at a steady pace, but it didn’t feel as pressured as it had in the past. We had another one in Telluride, another one in New York. We had about five of them. It was really good for us to have the space to work on something. We could let a song sit for a day or two and then come back to it and ask, does it still feel great—or not? We never had that luxury before.”\n\nOne such retreat took place at Oberlin College, where the band had been invited to participate as artists in residence at its famed conservatory. They conducted master classes, talked and jammed with students, and played in the auditorium. Banjo player Noam Pikelny recalls, “We had our own room in the conservatory building, surrounded by all these students who are there working their asses off on their instruments and their compositions. To have the opportunity to work on our own stuff while being surrounded by all of that was very inspiring. We were in an environment where we felt a responsibility to make something very special because part of our audience was right outside our door.”\n\nOver the course of the writing sessions, Thile relates, they had animated debates with each other and with the students, about how they relate to music, and to each other, through a digital filter. A narrative began to emerge that informs compositions like the rueful “I Blew It Off” and the ambitious, three-part opener, “Familiarity” which goes from spare and staccato to lilting and pastoral. No diatribes here: the words are often haunting and impressionistic, while the music boasts its own powerful eloquence.\n\n“We started writing these songs,” notes violinist Gabe Witcher, “and had enough time to discover what they really are. And as we saw this story emerge, this narrative, we wanted to see if we could also tell the story sonically. ‘Familiarity,’ the trilogy, is probably the best example of that. It begins very dry, presented very plainly, no effects, as if these are thoughts coming from inside someone’s head. But, as this thing progresses, the craziness of the outside world envelopes the narrator, tries to get into his consciousness. It builds to a climax and then releases into this dream world. He’s not sure where he is—at a club, a church—or what he is hearing. The presentation of that is very dreamlike, otherworldly. The third piece is the morning after, if you will, presented very organically, as if we are just sitting around in a room playing a song. It’s like Sunday morning waking up—what happened last night? Reckoning with the reality of it all. Trying to enhance those themes sonically—that was another step forward for us in the story telling on the record. We touched on that in Who’s Feeling Young Now? as far as using the studio to enhance the music. Now we are really using the studio to help the narrative along.”\n\nThe Phosphorescent Blues is, in many ways, a slice of modern life, says Thile: “Going out after shows, we’d go to bars that were loud, where the music may not be ideal, to be around other people, to get a sense of the world for a second. And I’d see people just like me on their phones, telling people they wish they were there, texting people who really are there. Then some song would come on in real time and some person knows that song and then they see that someone else does too and maybe they both sing it together and that moment is spiritual, some shared experience, and they are interacting in three dimensions, in the flesh, with their fellow man. And that’s communion. ‘Familiarity’ and other songs on this record dive into that: how do we cultivate beautiful, three-dimensional experiences with our fellow man in this day and age?”\n\nShortly before the sessions began, Thile and Witcher met with Burnett and discovered the producer had the very same things on his mind. In fact, he’d just given a commencement address at the University of Southern California on the subject of technology and human interaction. Witcher remembers, “Thile and I looked at each and said, ‘This is unbelievable. It’s exactly what we are writing about.’ So this was a perfect, serendipitous union.”\n\nThat union was also a long time coming. Burnett had previously enlisted Punch Brothers to contribute music to the Hunger Games soundtrack he produced. They performed an even greater role on the soundtrack to the Coen Brothers’ Inside Llewyn Davis, and served as the “house band” for the star-studded Another Day, Another Time concert Burnett organized at NYC’s Town Hall in September 2013. Having Burnett at the helm of these Punch Brothers sessions was a revelatory experience, even for musicians already so finely attuned to each other.\n\n“T Bone understood what we were trying to do and helped us get it even further,” says bassist Paul Kowert. “He was like a coach and a teammate at once.”\n\n“Even as much as we had worked with him before, I had no idea what to expect,” Thile admits. “T Bone works in mysterious ways. His genius is he manages to maintain perspective while being fully and utterly engaged and swept up in the excitement and frustration and hope and despair that goes along with trying to coax life out of these assemblages of notes.” In this setting, Thile delivered what are arguably the most expressive vocals of his career, on songs like “Julep” and “Forgotten,” bolstered by harmonies that the Beach Boys’ Brian Wilson would approve of. “Singing while T Bone was in the control room, I felt what it was like for an actor to work with a great director. He would find ways to get me into my own lyrics. He might come at things with some observation about the lyric that would allow me to sing it not just as me but as a whole lot of people.”\n\nBurnett himself added a discreet amount of electric guitar, most noticeably on “I Blew It Off,” and even convinced the band to add percussion on some tracks, a first for a Punch Brothers disc—integrated so artfully into the mix by drummer Jay Bellerose that one has to listen twice to even know it’s there. On “Forgotten” and “My Oh My,” Witcher could overdub himself into an entire string section.\n\nThile brought in the Passepied from Claude Debussy's Suite Bergamasque and they built it into an evocative full-band arrangement. Conversely, “Magnet” jettisons the cerebral for joyful reveling in the carnal; its spirited, syncopated groove mirrors the urgency and anticipatory excitement of a looming, late-night assignation.\n\nFinal track “Little Lights” sums up The Phosphorescent Blues, a single-take recording that imagines countless smart phones held in the air as a symbol of hope and possibility, a 21st century twist on “This Little Light Of Mine.” At its climax, the band is actually joined by a digital choir of its fans. The band had tried overdubbing their own voices, but that sounded contrived. Then one night, while driving home in L.A., Witcher had a brainstorm: If they didn’t have the resources to assemble a choir in the studio, why not reach out directly to fans, via Twitter and their website, to add their voices? Eldridge reveals, “We received over a thousand submissions. It wasn’t about people singing well or badly; we just wanted everyone in there.”\n\n\"Little Lights\" becomes a fitting, and genuinely uplifting, conclusion to The Phosphorescent Blues, as Punch Brothers address the questions they've posed about technology by conjuring up, in the course of the song, a very real virtual community. They used all the digital tools they had on hand, but it ultimately came together in a more familiar way, via words and music and voices.\n\n—Michael Hill", "otherInfo": "No other event info available"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Rick Estrin & The Nightcats", "ArtistImage": "https://photos.bandsintown.com/thumb/9248229.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Spanning the gamut", "Time": "7:30 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Larger-than-life blues star Rick Estrin has piloted the wildly fun and musically fearless Rick Estrin & The Nightcats for the last decade, touring the world and proving night after night why they won 2018’s Blues Music Award for Band Of The Year. The limitless combined talents of blues harmonica virtuoso and sly, soulful singer Estrin, guitar mastermind Kid Andersen, keyboard wizard Lorenzo Farrell and endlessly creative drummer Derrick “D’Mar” Martin take Estrin’s inventive, original songs to new and unexpected places. On stage, the band’s ability to deliver an unpredictable, no-holds-barred show is unmatched.\n\nNow, Rick Estrin & The Nightcats return with their fourth studio album, Contemporary. With the band kicking everything up a notch, Estrin and the Nightcats explore some different sounds, instrumentation and grooves, while maintaining the trademark Nightcats style. Produced by Andersen and Estrin and recorded at Andersen’s now-famous Greaseland Studio in San Jose, California, Contemporary delivers twelve surprising, wise-cracking, foot-stomping songs, including nine by Estrin (one co-written with Andersen), one each by Andersen and Farrell, and one obscure Bobo Jenkins cover. From the noir-ish romp I’m Running to the hilarious title track to the sardonic Resentment File (co-written with Estrin’s friend of over 50 years, Joe Louis Walker), Contemporary packs a modern blues punch. According to Estrin, “Recording at Greaseland, we all had so much fun and were so relaxed, the genius ideas just started pouring in from all sides. I really expect this record to blow some minds.”\n\nIn addition to Estrin’s celebrated songwriting and spectacular harmonica playing, he and the band are among the most entertaining and colorful showmen around. Estrin’s flashing harmonica solos, quick wit and signature hipster-cool look, Andersen’s off-the-cuff guitar pyrotechnics, Farrell’s mighty organ and piano work and D’Mar’s dynamic drumming bring instant fun to their live performances. “People don’t go out to see people who look like themselves,” says Estrin. “They want to see something special. I was schooled in this business to be a showman, and that’s what you get when you come to see us perform. We know how to put on a show. I feel sorry for anyone who has to follow us.”\n\nEstrin was schooled by some of the very best blues musicians. While still a teen, he was tutored by San Francisco’s famous musician (and pimp) Fillmore Slim. He was mentored by Oakland’s legendary Rodger Collins, and gigged with blues stars Lowell Fulson and Z.Z. Hill. Estrin moved to Chicago when he was 19 to work with Windy City bluesmen Johnny Young, Eddie Taylor, Sam Lay and John Littlejohn, and even jammed with Muddy Waters. He returned to California and continued to hone his craft. By the time he joined forces with guitarist Little Charlie Baty and formed Little Charlie & The Nightcats in 1976—a band he would front for the next 30 years—Estrin was a seasoned performer with plenty of talent and a newfound knack for writing killer original songs.\n\nUpon Baty’s retirement from touring in 2008, Estrin recruited high-flying guitar wunderkind Christoffer “Kid” Andersen and formed Rick Estrin & The Nightcats. The band quickly became a worldwide favorite with blues fans as well as critics and radio programmers. “Kid’s a fearless nut on the guitar,” says Estrin. “He’s really the only guy who could fit in with us.” With an uninhibited style that perfectly meshed with Estrin’s wildly imaginative songs, the new band charged out of the gate. Billboard called them “fabulous, remarkable and original.”\n\nSince the 2009 release of Rick Estrin & The Nightcats’ celebrated Alligator Records debut, Twisted, the 2012 follow-up One Wrong Turn, 2014’s crowd-pleasing You Asked For It...Live!, and 2017’s Groovin’ In Greaseland, the band has toured the world, earning high praise and standing ovations everywhere they go. The Chicago Sun-Times said, “These are serious musicians having a hotter than hot good time. It’s tough to stay in your seat when Estrin and his musical cohorts get cooking.” They’ve performed at festivals and concert stages from San Francisco to Chicago to New York, and everywhere in between, plus tours of the United Kingdom, Norway, Belgium, France, Switzerland, Poland, Australia, Israel and recently Estonia and Russia. The band’s worldwide popularity helped Estrin win five Blues Music Awards, including two nods for Song Of The Year (1994 and 2018), Best Instrumentalist—Harmonica (2013) and Traditional Blues Male Artist Of The Year (2018). The full band, Rick Estrin & The Nightcats, won the highly coveted 2018 Blues Music Award for Band Of The Year.\n\nAccording to Estrin, “Contemporary is the most fully realized expression of who Rick Estrin & The Nightcats really are and what we’re capable of as a band. With the group’s help, everything I envisioned for the songs got turned up a notch, with everyone getting more and more inspired.” This is modern blues at its most potent and powerful, with phenomenal musicianship and lyrics that cut with a wink and nod. According to the UK’s Blues & Rhythm, “Rick Estrin & The Nightcats have crafted an instantly identifiable sound. They serve up insightful, original blues combined with tough rock’n’ roll. This band is superb.”\n\nRick Estrin (harmonica, vocals)\nRick Estrin was born in San Francisco, California in 1949, and grew up fiercely independent. As a 10-year-old boy, he made his way to the tough Market Street area and befriended many of the neighborhood characters. When he was 12, his older sister gave him a copy of Ray Charles’ The Genius Sings The Blues, and he became infatuated with the music. Albums from Jimmy Reed, Champion Jack Dupree, Mose Allison, Nina Simone and others soon followed. By the time he was a teenager, Estrin had immersed himself in the urban, African-American culture surrounding him. He got his first harmonica at age 15, and by age 18 was proficient enough to begin sitting in at black clubs around the city. He first jammed with blues master Lowell Fulson and immediately was hired to open five shows for R&B giant Z.Z. Hill. He worked five nights a week for almost a year with guitar legend Travis Phillips in a band fronted by famed pimp/bluesman Fillmore Slim (who was the centerpiece of the acclaimed Hughes Brothers documentary American Pimp). Slim introduced Estrin to singer Rodger Collins, the man who would become Rick’s first real musical mentor. Collins schooled Rick on the finer points of songwriting and show business. At 19, Estrin relocated to Chicago and worked with some of the city’s best bluesmen. He met and jammed with the legendary Muddy Waters, who told Rick, “You outta sight, boy! You got that sound! You play like a man!” Muddy wanted Estrin to go on the road with him, but Estrin missed Muddy’s phone call and it never happened. Estrin eventually moved back to the Bay Area, met guitarist Charlie Baty and formed Little Charlie & The Nightcats. With Charlie’s retirement from touring in 2008, Rick brought in guitar virtuoso Kid Andersen and formed Rick Estrin & The Nightcats.\n\nEstrin cites Sonny Boy Williamson II, Percy Mayfield and Detroit bluesman Baby Boy Warren as his major songwriting influences. His work on the reeds is deep in the tradition of harmonica masters Sonny Boy Williamson II and Little Walter Jacobs, while at the same time pushing that tradition forward with his innovative songs. And his sly and soulful vocals are the perfect vehicle for driving those songs home.\n\nKid Andersen (guitar)\nChristoffer “Kid” Andersen was born in Telemark, Norway. A blues fan since childhood, Andersen fell in love with the music of Otis Rush, Buddy Guy, Junior Watson, and the Kings (B.B., Albert and Freddie). By the time he was 18, he was backing all the American blues stars who came through Norway, including Homesick James, Nappy Brown and Willie “Big Eyes” Smith. He moved to California when he was 21. Once in the U.S.A., Andersen earned a green card as an “Alien of Extraordinary Ability.” Andersen released four solo albums before joining blues harmonica legend Charlie Musselwhite’s band in 2004, a gig that lasted until he joined Rick Estrin & The Nightcats in 2008. In addition to being an expert multi-instrumentalist (guitar, bass, keyboards, percussion), Kid’s talents as engineer and producer keep his now-famous Greaseland Studio fully booked. Winner of the 2017 Keeping The Blues Alive Award, Greaseland has been featured in The San Jose Mercury News as well as on NPR. At Greaseland, Kid has produced, engineered (and many times played on) albums by artists including Tommy Castro, Nick Moss, John Nemeth, Wee Willie Walker and Finis Tasby, as well as all five Rick Estrin & The Nightcats CDs.\n\nLorenzo Farrell (piano, organ)\nLorenzo Farrell was born in Lexington, Kentucky, and grew up in Bloomington, Indiana, where he started playing piano at age five. During his high school years in California, he discovered jazz and made the switch to upright acoustic bass. After high school, Farrell took several years off from his music career to earn a degree in Philosophy from the University of California at Berkeley, and study religion in Delhi, India. Since returning to the San Francisco Bay Area, he has been a highly sought-after multi-instrumentalist, having returned to piano and mastered the organ in recent years. A Nightcat since 2003, Lorenzo has also had the opportunity to perform and/or record with many other artists, including Wee Willie Walker, Elvin Bishop, Finis Tasby, Jackie Payne, Andy Santana, Terry Hanck and Little Charlie Baty’s Organ Grinder Swing.\n\nDerrick “D’Mar” Martin (drums)\nDerrick “D’Mar” Martin is simply a force of nature. D’Mar is a musician, producer, songwriter, singer, educator, entertainer and motivational speaker. He traveled the world for 17 years as the drummer for the legendary Little Richard. D’Mar has also worked with a number of other artists including Dorothy Moore, Bobby Rush, Vasti Jackson, Ali Ollie Woodson (The Temptations), Big Jack Johnson, Carla Thomas, Billy Preston, Roy Gaines, Mitch Woods, Jackie Payne, Syl Johnson, Bob Margolin and Tutu Jones. He shares his passion for music education in his own music lecture series entitled Drums & More. Now, D’Mar brings all of these talents to his new family, The Nightcats.", "otherInfo": "No other event info available"}, {"Address": "Sebastopol, CA", "Artist": "Woodlander", "ArtistImage": "https://photos.bandsintown.com/thumb/9091284.jpeg", "Coordinates": [-122.8239, 38.4021], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Psychedelic Folk, Indie, Singer, Songwriter, Folk Rock", "Time": "7:30 PM", "Venue": "Fern Bar", "moreBioInfo": "Based out of Northern California, folk/pop singer and songwriter, Josh Woodlander combines acoustic guitar, vocals, and ambient electronica into a uniquely soulful blend of American heartland music with influences of ambient, folk, soul, reggae and African music. Coined the “Denim Shaman”, Woodlander is a unique musical artist who improvises multi-instrumental tracks (via looper pedal) chords, melodies and lyrics in real time in the sonic form of a buddhist sand painting never to be repeated. All live music on this site was inspired in the moment — no chords, instrumentation or lyrics were rehearsed and all tracks are the raw recording with no post-production or effects added.\n\n“Every show is unique and akin to jumping off a musical cliff and gliding in the wind — I take the leap and see where the spirit takes me”,\n- Woodlander.", "otherInfo": "No other event info available"}, {"Address": "275 Hayes St, San Francisco, CA 94102", "Artist": "Patti Smith", "ArtistImage": "https://photos.bandsintown.com/thumb/8656541.jpeg", "Coordinates": [-122.420776, 37.777043], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Rock, Punk", "Time": "7:30 PM", "Venue": "Sydney Goldstein Theater", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "155 Columbus Ave, San Francisco, CA 94133", "Artist": "Gaucho", "ArtistImage": "https://photos.bandsintown.com/thumb/7519822.jpeg", "Coordinates": [-122.405592, 37.796778], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Jazz, Acoustic, Swing", "Time": "8:00 PM", "Venue": "Comstock Saloon", "moreBioInfo": "Gaucho is a masterful Bay Area band that combines the influence of gypsy jazz of 1930’s Europe with the rhythmic drive and collective improvisation of New Orleans swing music, gutbucket blues and elements of ragtime. Their sound, a uniquely American concoction, blends instrumental acuity and lighthearted humor that keep their audience coming back for more. As founder, guitarist, and main composer Dave Ricketts says, the band is “in love with the music of Louis Armstrong, Fats Waller and Jimmie Rodgers, as well as the stories, the life styles and the foot steps of hundreds of other great jazz, blues, country and rock musicians that created the sound of American Music from roughly 1900-1950’s”\n\nLed by eminent guitarist, Dave Ricketts, the group has been a San Francisco mainstay for over fifteen years, and one of the busiest bands in the bay area playing 5 to 10 gigs a week. Together with virtuosos Rob Reich–accordion and Craig Venetresco–guitar, superlative bassist Ari Munkres and versatile percussionist Steve Apple, these guys keep crowds moving with their beats and complex rhythms.\n\nGaucho has recorded seven albums, tours regularly, and has an increasing repertoire of over forty original tunes. Seven of their tunes are featured in the 2012 film \"Trattoria\"; one was chosen by the Metropolitan Museum of Art for their website; and another is featured in the outtakes section of the Pixar DVD CARS 2.", "otherInfo": "Gaucho at Comstock Saloon: The Barbary Coast re-created by the Comstock Saloon would have appeared to the denizens of the 19th-century vice district as a utopian fantasy. The saloon's booths are occupied by mixed groups, the bartenders have all their teeth, and the booze won't make you go blind. That doesn't make the romance it stages any less potent, because everything about the place is so beautifully realized. Jonny Raglin and Jeff Hollinger's take on classic cocktails such as Pisco Punches and South Sides is deft, and even defter is the way chef Carlo Espinas lightens and modernizes Victorian dishes - beans and salt pork, Hamburg steak, beef-shank and bone marrow pie - so they feel as contemporary as a well-made Manhattan."}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "M.O.M.", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.437364, 37.774222], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Madrone Art Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"M.O.M. (Motown on Mondays)\" w/ DJ Gordo Cabeza & Timoteo Gigante"}, {"Address": "3225 22nd St, San Francisco, CA 94110", "Artist": "The Monday Makeout", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419521, 37.755192], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Make-Out Room", "moreBioInfo": "No artist bio available", "otherInfo": "\"The Monday Make-Out\" Local ensembles push the boundaries of jazz — and sometimes even sound itself — in a free whirlwind of improvisational whimsy."}, {"Address": "500 4th St, San Francisco, CA 94107", "Artist": "Brendan Getzell", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.398131, 37.779293], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Hotel Utah Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "Open Mic with Brendan Getzell at Hotel Utah: The Old West and indie music come together at the Hotel Utah Saloon, where a small stage, an antique bar, and a diversely stocked jukebox set the scene. A gigantic taxidermied elk head stares down upon drinkers in the main section, which is dominated by a beautiful old wooden bar on one side and a long row of picture windows on the other. The adjacent music area is split between a small balcony (shaped to look like the stern of a sailing ship) and an intimate downstairs section with a scattering of tables and corner booths. Meaty grub fills the menu during the day, while eclectic local bands and acoustic songwriters fill the calendar at night."}, {"Address": "17 Broadway Blvd, Fairfax, CA 94930", "Artist": "Derek Smith", "ArtistImage": "https://photos.bandsintown.com/thumb/7168664.jpeg", "Coordinates": [-122.587997, 37.986787], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Pop, Metal, Jazz, Hop-hop, Rock, Electronic", "Time": "8:00 PM", "Venue": "19 Broadway", "moreBioInfo": "Drummer / Producer / Songwriter", "otherInfo": "8pm - Open Mic W/Derek Smith"}, {"Address": "2367 Shattuck Ave, Berkeley, USA", "Artist": "Ari Chi", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Olivia Gatwood*"}, {"Address": "150 Frank H. Ogawa Plaza, Oakland, CA 94612", "Artist": "Phillip Greenlief", "ArtistImage": "https://photos.bandsintown.com/thumb/8914956.jpeg", "Coordinates": [-122.27165, 37.80565], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Pro Arts Gallery & COMMONS", "moreBioInfo": "Since his emergence on the west coast in the late 1970s, Evander Music founder and saxophonist Phillip Greenlief has achieved international critical acclaim for his recordings and performances with musicians and composers in the post-jazz continuum as well as new music innovators and virtuosic improvisers. He has performed and recorded with Wadada Leo Smith, Meredith Monk, Nels Cline, Rashaun Mitchell and They Might Be Giants; albums include THAT OVERT DESIRE OF OBJECT with Joelle Leandre, and ALL AT ONCE with FPR (Frank Gratkowski, Jon Raskin, Phillip Greenlief). Upcoming releases include a trio date with Fred Frith and Evelyn Davis (Clean Feed). Recent residencies have included Headlands Center for the Arts and from 2012 to 2014 he was the curator at Berkeley Arts, a home for progressive music. He is the recipient of a San Francisco Bay Guardian Goldie Award. His critical writing has been published in Artforum and Signal to Noise.", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave, Berkeley, USA", "Artist": "Olivia Gatwood", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Olivia Gatwood*"}, {"Address": "853 Valencia St, Sf, CA 94110", "Artist": "Fog Holler", "ArtistImage": "https://photos.bandsintown.com/thumb/8667096.jpeg", "Coordinates": [-122.42126, 37.75933], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Amnesia Beer & Music Hall", "moreBioInfo": "Mysteriously lonesome, hard driving bluegrass from the San Francisco Bay Area.", "otherInfo": "Fog Holler returns for their first-Mondays residency to bring new tunes and new takes on bluegrass classics at Amnesia in SF. With a large rotating list of songs and a constant stream of new music being written, there's always something exciting and different to look forward to! Not to be missed!"}, {"Address": "853 Valencia St, San Francisco, CA 94110", "Artist": "The Alabama Bow Ties", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421068, 37.759319], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Amnesia", "moreBioInfo": "No artist bio available", "otherInfo": "The Alabama Bowties at Amnesia: Dark red, hypnotic light helps this tiny bar live up to its name, and its tall stage features everything from '20s-themed nights and garage rock to bebop jazz and experimental electronica. There's no liquor, but intriguing soju cocktails and a well-chosen selection of microbrews are available if your inhibitions need loosening. Whether you're attending a comedy showcase, a literary reading, or a Gypsy dance party, however, make sure to arrive early - Amnesia fills up fast."}, {"Address": "424 Haight St, San Francisco, CA 94117", "Artist": "Sissy Bar", "ArtistImage": "https://photos.bandsintown.com/thumb/120498.jpeg", "Coordinates": [-122.429362, 37.772531], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Underground SF", "moreBioInfo": "No artist bio available", "otherInfo": "\"Sissy Bar\" w/ resident DJs Bubbles & Christina"}, {"Address": "2344 Market St, San Francisco, CA 94114", "Artist": "Opulence", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.434294, 37.763629], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Beaux", "moreBioInfo": "No artist bio available", "otherInfo": "\"Opulence\" at Beaux:"}, {"Address": "3223 Mission St, San Francisco, CA 94110", "Artist": "Krazy For Karaoke", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419787, 37.745082], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "The Knockout", "moreBioInfo": "No artist bio available", "otherInfo": "Krazy for Karaoke With Omar Rockriguez."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Frankie Fictitious", "ArtistImage": "https://photos.bandsintown.com/thumb/9164562.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "Frankie Fictitious is a World Famous Award-Winning Burlesque Sensation based in San Francisco, California\n\n\"Miss Exotic World 2019\" - Burlesque Hall Of Fame\n\"Most Dazzling 2019\" - Burlesque Hall of Fame\nTop 50 Burlesque Industry Figures - 21st Century Burlesque\n\"Miss Viva Las Vegas 2017\" - Viva Las Vegas Rockabilly Weekend\n\"Best Burlesque 2017\" - Arizona Burlesque Festival\n“Best Small Group 2017”- Burlesque Hall of Fame", "otherInfo": "No other event info available"}, {"Address": "1232 Grant Ave, San Francisco, CA 94133", "Artist": "The Bachelors", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.406986, 37.798566], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "Genres: Decades, 60s", "Time": "9:30 PM", "Venue": "The Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "The Bachelors at The Saloon: Revered for its daily live blues performances, the Saloon also has the rugged distinction of having survived the 1906 earthquake and standing as the oldest bar in San Francisco (opened in 1861). With its rough aged-wood interior and hardy clientele, the Saloon definitely stands apart from the shiny new neighbors along this nightlife-rich stretch of North Beach."}, {"Address": "3089 16th St., San Francisco, CA 94103", "Artist": "Skylarking", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421602, 37.764714], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Skylark Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Skylarking\" w/ I&I Vibration"}, {"Address": "243 O'Farrell St, San Francisco, CA 94102", "Artist": "Damir", "ArtistImage": "https://photos.bandsintown.com/thumb/167640.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Mon Oct 7 2019", "EventDate": "2019-10-07", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Johnny Foley's Irish House", "moreBioInfo": "No artist bio available", "otherInfo": "Damir at Johnny Foley's Irish House: Music lovers cherish the intimate cellar underneath Johnny Foley's Irish Pub, where songsmiths like Ron Sexsmith, Josh Rouse, and Lisa Loeb have all performed. A venue so intimate that musicians must use the audience bathroom."}, {"Address": "1 Jones St, San Francisco, CA 94102", "Artist": "Diana Gameros", "ArtistImage": "https://photos.bandsintown.com/thumb/8206349.jpeg", "Coordinates": [-122.412435, 37.781374], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Latin Alternative, Pop Acoustic, World Music and Fusion, Bossa Nova, Latin Folk, Latin Pop, French Chanson, Jazz, Folk, Pop, Indie, Alternative, Rumba, Bolero, World Fusion, Dream Pop", "Time": "10:00 AM", "Venue": "The Hibernia Bank Building", "moreBioInfo": "Singer, songwriter, guitarist, and composer Diana Gameros was born into a musical family surrounded by traditional Mexican songs of love and revolution.\n\nThe first of her family to receive formal music lessons, Ms. Gameros left Mexico as a teenager to study piano and recording technology in Michigan. During those formative years, she soaked up the sounds of classical music, underground rock, the avant-garde, world music, and jazz. Ms.Gameros has since shared the stage with the Oakland Symphony, the San Francisco Symphony, Taylor Mac, Bebel Gilberto, and Natalia Lafourcade, among others.\n\nIn 2013 she released her first album \"Eterno Retorno\", a soulful retrospective of her journey as an immigrant. Ms. Gameros received the Emerging Leader Award from the Chicana/Latina Foundation in 2014 for her work in music and social justice activism. In 2017 she release her sophomore album \"Arrullo\".\n\nGameros' songs and story have been featured on Billboard, Mother Jones, NPR's Weekend Edition, All Songs Considered, NPR's Alt.Latino podcast and the Public Radio International's The World and PBS's NewsHour.", "otherInfo": "Diana shares songs at the LTX Fest 2019."}, {"Address": "Trilogy Pkwy, Brentwood, CA 94513", "Artist": "Toree McGee", "ArtistImage": "https://photos.bandsintown.com/thumb/9170656.jpeg", "Coordinates": [-121.730065, 37.9020862], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "No genre available", "Time": "4:00 PM", "Venue": "Trilogy at The Vineyards", "moreBioInfo": "Blessed with a rafter-reaching soprano range and a voice that emanates grit and fire, Toree McGee describes her music as a blend of “Woodstock rock ‘n’ roll, and sparkly country.” This eclectic style is equal parts percussion-driven swagger and playful melodies. Behind the northern California native’s powerful, edgy vocals is a candid, bubbly personality, along with a natural, effervescent stage personality inherited from a family lineage filled with performers. McGee’s grandparents were part of a traveling gospel quartet, and her father had been a singer in a garage rock band. Her father instilled in McGee a love of classic rock and her passion for music, while her mother gravitated toward classic country. The vivacious entertainer’s own performing career began early, as a karaoke singer at The Red Caboose, a biker bar and grill owned by McGee’s aunt and grandmother. “Before I could speak in sentences, I was singing in front of people,” McGee recalls. Often, McGee and her sister, along with their parents, would spend weekends helping out at the establishment. “It made us really well-rounded, because we got to know and observe people from all walks of life. “ McGee grew up in a close-knit community, her days a flurry of school, church, family time, and plenty of music. She was enrolled in vocal lessons by age seven, and participated in choirs and singing competitions throughout high school. Her musical style embodies elements of her influences, ranging from the soulful country sounds of The Judds and LeAnn Rimes, to the rock of Guns N’ Roses and Aerosmith, and especially the engrossing vocals of Janis Joplin. “I was a really big fan of Janis Joplin for a long time,” McGee says. “I loved her uniqueness and how you could feel her emotion when she sang. But the whole rock ‘n’ roll kind of jagged edge thing wasn’t really me all the way. I always had a sunshiny personality, and I wasn’t as hardened as the rock scene was. Country music always made me happy, and everything always brought me back to that.” “My goal was always to sing and to sustain myself as a singer,” McGee says. Armed with faith and pluck, McGee placed her bet and traded four years of college for the real-world education of full-time performing. By her late teens, she was performing in several cover bands, in addition to her own live shows. “If I had taken four years to go to school, I wouldn’t have the experience of playing with a live band, or have had so much time to develop my voice and the direction I wanted to go.” The time spent sharpening her skills paid off when McGee met musician and producer Gary Tackett, a guitarist and tour manager for Billy Currington. Tackett recognized her vocal talent and offered to produce a project. McGee began writing songs and soliciting material for her upcoming six-song EP, perfecting her sound into a unique fusion of country, soul and rock that would reflect her edgy roots and support her powerhouse vocals. “Run Right Back To You,” which boasts McGee as the sole writer, is among the standouts on the project. “I was inspired by the concept of returning to a person, even though they are not right for you,” McGee says. “I felt so drawn to that concept that I knocked out this song in about 45 minutes. It just poured out, and is one of my favorites on the project.” McGee laid down tracks in Nashville for the EP at famed studio Ronnie’s Place, alongside musicians who have performed with Jason Aldean and Luke Bryan, among others. Her current single, \"Amen\" has been gaining airplay on Northern California radio stations and has recently climbed to the #5 slot on 95.3 KRTY's 'Hot 9 @ 9' segment. It has also gained the attention of Sirius/XM radio, as well as local news stations which will soon be featuring her music and story. McGee also had her first big act accompanying performance, opening with a 30 minute set for country music superstar, Clay Walker in San Jose. Her self-titled EP will officially be released in April 2015. “I wanted to blend my love of hard rock and country together,” McGee says of the project. “I have this heavy-hitting, gravelly tone I can get in my voice, and I didn’t want to lose that side of me that played in bars and grew up in bars. But country has always been my favorite genre of music. That’s where I want to be, but I want to bring a bit of that old style of rock with me.” A country singer with some rock hippie flare from Northern California.", "otherInfo": "No other event info available"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "GG Amos", "ArtistImage": "https://photos.bandsintown.com/thumb/9361417.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Blues, West Coast Blues, Soul Jazz, R&B", "Time": "4:30 PM", "Venue": "The Saloon", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her organ trio The GG3 play their weekly After-Work Blues Party. Featuring Parris Bertolucci on keyboards/bass & Randy Lee Odell on drums. 4:30-8:30pm - 1232 Grant Ave. SF, CA 94133"}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "B3B4", "ArtistImage": "https://photos.bandsintown.com/thumb/9255051.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Jazz, Soul Jazz, Jazz-Funk", "Time": "6:00 PM", "Venue": "Club Deluxe", "moreBioInfo": "TOM GRIESSER was first exposed to jazz at age five, when he stumbled upon his father's Benny Goodman and Duke Ellington records. He has been performing professionally in the San Francisco Bay Area since 1992. Tom performed regularly in the swing revival scene with St. Vitus Dance, toured nationally with The New Morty Show, and was also the leader of The Section 8 Project, his ensemble which featured the tunes of bassist Charles Mingus. Since 1999, he has played frequently with the Marcus Shelby Jazz Orchestra and Brass Monkey Brass Band, as well as leading his own trio, the Tom Griesser 3. Outside of the jazz world, Tom has performed with the singer/songwriter Rodriguez, the subject of the 2012 documentary Searching for Sugar Man, and recorded with Third Eye Blind on their 2009 release Ursa Major.\n\nSCOTT FOSTER is the chair of the performing arts department at the Urban School of San Francisco, teaching Jazz Band, Music Theory and MP&E. He provides private guitar lessons for performers of all levels. When asked who he was studying with, Guitarist Kirk Hammett told Guitar World Magazine: “This local player Scott Foster… He’s a jazz guy but also a shredder”. Scott’s CD Night Blooming Jazz Men can be found on cdbaby.com. He's been a major contributor to the music community in the Bay Area for over 25 years, currently playing with the Americano Social Club, the Fil Lorenz Orchestra, Dave Scott Quartet, and The Scott Foster Ensemble.\n\nKEVIN GERZEVITZ works as a performer, composer and teacher in the San Francisco Bay Area. He has performed and/or recorded with James Newton, Jose Feliciano, Matt Eakle, Jimbo Trout, Jason Bowman, Jude Gold, Michael Manring, Kathryn Keats, and Andrew Hagar. He studied piano, improvisation, and composition at the University of Michigan School of Music. His musical genre range is diverse and stretches beyond organist, performing rebetika violin with The Disciples of Markos, jazz manouche accordion with Gaucho, and ‘80s pop synth with Tainted Love. He enjoys teaching as the Music & Movement specialist at Pacific Primary School in San Francisco. His composition endeavors have led to scoring several independent films, and producing several recordings which are showcased on his website: kevingerzevitz.com\n\nDANIEL FOLTZ, a very active freelancer, has played the drums professionally since 1996, touring internationally and sharing the stage with Lavay Smith, Linda Perry, Jon Evans, and Shelby Lynne. He has been the drummer with Storm and Her Dirty Mouth, Black Lab, and The Giant Trio. He has been featured on several CDs, including One Hour Mama by Lavay Smith & The Red Hot Skillet Lickers, Headlights and Other Constellations by Sonya Hunter, Under These Skies by Noelle Hampton, and Tatamonk by Alex Degrassi and Quique Cruz. Daniel is on the roster of artists for Vic Firth drumsticks.", "otherInfo": "No other event info available"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "Steel Pulse", "ArtistImage": "https://photos.bandsintown.com/thumb/8653205.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Reggae, Roots, Dub", "Time": "6:00 PM", "Venue": "Mystic Theatre", "moreBioInfo": "Steel Pulse was formed in 1975 in Birmingham, England, specifically the inner city area of Handsworth. The founding members were schoolmates David Hinds (the primary songwriter as well as the lead singer and guitarist), Basil Gabbidon (guitar), and Ronnie \"Stepper\" McQueen (bass). All of them came from working class West Indian immigrant families, and none had much musical experience. They took some time to improve their technical proficiency, often on Roots inspired material by the Wailers, Burning Spear and several other prominent Jamaican artists. McQueen suggested the group name, after a racehorse, and they soon fleshed out the lineup with drummer Steve \"Grizzly\" Nisbett, keyboardist/vocalist Selwyn \"Bumbo\" Brown, percussionist/vocalist Alphonso \"Fonso\" Martin, and vocalist Michael Riley.\n\nSteel Pulse initially had difficulty finding live gigs, as club owners were reluctant to give them a platform for their \"subversive\" Rastafarian politics. Luckily, the punk movement was opening up new avenues for music all over Britain, and also finding a spiritual kinship with protest reggae. Thus, the group wound up as an opening act for punk and new wave bands like the Clash, the Stranglers, Generation X, the Police, and XTC, and built a broad-based audience in the process. In keeping with the spirit of the times, Steel Pulse developed a theatrical stage show that leavened their social commentary with satirical humor; many of the members dressed in costumes that mocked traditional British archetypes (Riley was a vicar, McQueen a bowler-wearing aristocrat, Martin a coach footman, etc.). The band issued two singles -- \"Kibudu, Mansetta and Abuku\" and \"Nyah Love\" -- on small independent labels, when they then came to the attention of Island Records after opening for Burning Spear.\n\nSteel Pulse's first single for Island was the classic \"Ku Klux Klan,\" which happened to lend itself well to the band's highly visual, costume-heavy concerts. It appeared on their 1978 debut album, Handsworth Revolution, which was soon hailed as a classic of British reggae by many fans and critics, thanks to songs like the title track, \"Macka Splaff,\" \"Prodigal Son,\" and \"Soldiers.\" Riley departed before the follow-up, 1979's Tribute to the Martyrs, which featured other key early singles in \"Sound System\" and \"Babylon Makes the Rules,\" and solidified the band's reputation for uncompromising political ferocity. That reputation went out the window on 1980's Caught You, a more pop-oriented set devoted to dance tracks and lovers rock. By that point, Steel Pulse was keen on trying to crack the American market, and went on tour over Island's objections. Caught You was issued in the States as Reggae Fever, but failed to break the group, and they soon parted ways with Island.\n\nSteel Pulse moved on to Elektra/Asylum, which released an LP version of their headlining set at the 1981 Reggae Sunsplash Festival. Their studio debut was 1982's True Democracy, a generally acclaimed set that balanced bright, accessible production with a return to social consciousness. It became their first charting LP in America, making both the pop and R&B listings. The slicker follow-up, Earth Crisis, was released in 1984 and featured producer Jimmy \"Senyah\" Haynes subbing on guitar and bass for founding members Gabbidon and McQueen, both of whom left the group by the end of the recording sessions. They were replaced by guitarist Carlton Bryan and bassist Alvin Ewen for 1986's Babylon the Bandit, another Haynes-produced effort that ranked as the group's most polished, synth-centered record to date. It featured the powerful \"Not King James Version\" and won a Grammy for Best Reggae Album.\n\nIn 1988, Steel Pulse released State of Emergency, their most explicitly crossover-oriented album yet. They also contributed the track \"Can't Stand It\" to the soundtrack of Spike Lee's classic Do the Right Thing. In 1991, they released another heavily commercial album, the Grammy-nominated Victims, which featured the single \"Taxi Driver.\" Backing up the song's views, Steel Pulse filed a class-action lawsuit against the New York City Taxi and Limousine Commission, charging that drivers discriminated against blacks and particularly Rastafarians. Founding member Fonso Martin left that year, reducing Steel Pulse to a core trio of Hinds, Nisbett, and Brown. Their backing band still featured Ewen and was elsewhere anchored by guitarist Clifford \"Moonie\" Pusey, keyboardist Sidney Mills, trumpeter Kevin Batchelor, Saxophonist Jerry Johnson and Trombonist Clark Gayton.\n\nThe 1992 live album Rastafari Centennial marked the beginning of a return to the group's musical roots, and earned another Grammy nomination. The following year, they performed at Bill Clinton's inaugural celebration, the first reggae band to appear at such an event. 1994's studio album Vex completed Steel Pulse's re-embrace of classic roots reggae, though it also nodded to contemporary dancehall with several guest toasters and a digital-flavored production. 1997's Rage and Fury continued in a similar vein, and was nominated for a Grammy. In 1999, the group released another collection of live performances, Living Legacy.\n\nFast forward a long seven years since their previous album, Rage and Fury, Steel Pulse would return yet again, this time with African Holocaust, and yet again have their ranks dwindled. Core members David Hinds (vocals, rhythm guitar) and Selwyn Brown (keyboards, backing vocals) are the only ones to remain from the band's original line-up, but they more than hold their own and they're joined by a deep roster of supporting musicians, a list too long to list. As always, the music is what's most important, and on that count, this Steel Pulse lineup indeed makes the mark. Granted, it did take them seven years to get the album out, but still it won a Grammy Awards Nomination for Best Reggae Album of the year. There's really not too much else to say about African Holocaust. Longtime fans will know what to expect. Newcomers should know a few things: above all, Steel Pulse are known for performing well-written, Afrocentric songs that are rebellious without being negative or inflammatory, and though the band membership has changed over the years, the type of songs hasn't, nor has the steady move away from dancehall that was apparent on the band's previous album. the message and music remain true to the band's principles and vision.\n\nSteel Pulse is one of Britain's greatest reggae bands, in terms of creative and commercial success. Steel Pulse started out playing authentic roots reggae with touches of jazz and Latin music, and earned a substantial audience worldwide. Their 1978 debut, Handsworth Revolution, is still regarded by many critics as a landmark and a high point of British reggae. By the late '80s, Steel Pulse had won a Grammy and were working full-fledged crossover territory. They subsequently returned to a tough-minded, rootsy sound and have added touches of dancehall and hip-hop along the way.", "otherInfo": "No other event info available"}, {"Address": "100 El Camino Real, Menlo Park, CA 94025", "Artist": "Chenot", "ArtistImage": "https://photos.bandsintown.com/thumb/8140997.jpeg", "Coordinates": [-122.172094, 37.447768], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Classic Rock, Motown, Pop", "Time": "6:00 PM", "Venue": "Menlo Tavern @ Stanford Park Hotel", "moreBioInfo": "I play and sing whatever eclectic covers strike my fancy, from classic rock to Motown to that 90s jam you forgot you loved. I’m based in The San Francisco Bay Area, but I also play in the world-spanning band Sister Willow.", "otherInfo": "No other event info available"}, {"Address": "39 Fell St, San Francisco, CA 94102", "Artist": "Adam Shulman", "ArtistImage": "https://photos.bandsintown.com/thumb/8574810.jpeg", "Coordinates": [-122.418576, 37.776173], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Mr. Tipple's Recording Studio", "moreBioInfo": "Calendar and news for jazz pianist Adam Shulman", "otherInfo": "No other event info available"}, {"Address": "3158 Mission St, San Francisco, CA 94110", "Artist": "In Spades", "ArtistImage": "https://photos.bandsintown.com/thumb/9455333.jpeg", "Coordinates": [-122.419467, 37.746817], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Metal, Heavy Metal", "Time": "7:00 PM", "Venue": "El Rio", "moreBioInfo": "San Francisco based Metal Quartet. Booking: contact@inspadesband.com", "otherInfo": "3158 Mission Street. Doors at 7:00pm. $10. Ages 21+."}, {"Address": "476 Castro St, San Francisco, CA 94114", "Artist": "Rob Reich", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.435403, 37.761304], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Blush! Wine Bar", "moreBioInfo": "No artist bio available", "otherInfo": "Kally Price & Rob Reich at Blush! Wine Bar: Across from the Castro Theatre, Blush! is a cozy pre-movie place to grab a drink. With jazz nights on Thursdays and subtle background music other nights, this bar is a low-key Castro option. A plush couch propped against the burgundy, art-adorned wall offers a cozy seat for intimate groups, while a long, wooden table towards the back accommodates a larger group of ten. Featuring a comprehensive list of nearly 100 wines stored in proper wooden racks, Blush! serves the amateur and oenophile alike, where $70-$80 can fetch you a bottle of a crisp and fruity white or an earthy six-year-old Bordeaux, or $6 can get a more temperate-flavored but generous pour. The food portion of the menu boasts rich and rustic European small plates, cheese and savory charcuterie platters, and nibbles such as Kalamata olives and tapenade."}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Boy & Bear", "ArtistImage": "https://photos.bandsintown.com/thumb/9146512.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Tue Oct 8 2019", "EventDate": "2019-10-08", "Genre": "Genres: Indie, Folk, Australian, International, Alternative", "Time": "7:00 PM", "Venue": "The Independent", "moreBioInfo": "Boy & Bear is happy. Boy & Bear is Tambourine. Boy & Bear is good for you. http://smarturl.it/harlequindream www.boyandbear.com www.youtube.com/boyandbearmusic www.twitter.com/boyandbear http://instagram.com/boyandbear", "otherInfo": "No other event info available"}]