var sf_events = [{"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Forest Sun ", "ArtistImage": "https://photos.bandsintown.com/thumb/9161674.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Americana, Folk", "Time": "1:30 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Born in upstate New York to folksinging back-to-the-land hippie parents (Forest’s dad literally built the floor that Bob Dylan stood on at manager Albert Grossman’s Bearsville studios in Woodstock, NY. His mom heard Pete Seeger and Joan Baez play in her uncles living room in Boston and dated one of the Chambers Brothers before she met his dad), weaned on a diet of Jackson Browne and Toots and the Maytals, some of Forest’s earliest memories are of his dad playing “Poncho and Lefty” by Townes Van Zandt and his mom singing Elizabeth Cotton’s “Freight Train”. Forest wrote songs with Rory Block when he was six years old, learned to juggle from WavyGravy when he was 9, and studied drumming with the late African master percussionist Babatunde Olatunji as a teenager. In college he played in a band with SNL star Maya Rudolph. They opened for No Doubt at the Catalyst in Santa Cruz before Forest left to study art in Spain.\n\nA pioneer of the DIY movement in 1999 he recorded his first record in his bedroom in San Francisco with bassist Seth Ford Young (Tom Waits, Edward Sharpe) and toured Europe for the first time, including playing at the Rally on Dam Square in Amsterdam for the Tibetan Freedom Concert.\n\nHe’s played festivals from California (Strawberry Music Festival, American River Music Festival) to Europe (Belladrum in Scottland, Fiesta City in Belgium) and opened for such luminaries as Lyle Lovett, Bonnie Rait, Steve Earle, Keb Mo, Brett Dennen and the Beach Boys (Forest met famed Beach Boys producer Van Dyke Parks at festival porch jam and later swapped songs at his house in LA). Collaborations include the jam band scene (ALO -Animal Liberation Orchestra on Jack Johnson’s label) the bluegrass scene (Hot Buttered Rum), and indie folk artists like Jolie Holland and JT Nero from Birds Of Chicago. Forest’s songs mine his deep folk roots and embrace his love of gospel, reggae, Americana, country, soul, jazz and funk.\n\nSun’s music has appeared on Showtime and MTV and in several film scores and soundtracks. He has also had several cameo roles in independent cinema including playing a fireman in “Who's there?” directed by Cassie Jaye and premiering at Tallgrass Film Festival.\n\nHaving done two successful kickstarters Forest is putting out his music on Vinyl and releasing a new song each month this year.\n\nForest is also a visual artist and his original paintings and prints have been shown at the Sala Lola Anglada in Barcelona and the Marin Museum of Contemporary Art.\n\nForest resides in the Redwoods of Mill Valley, Ca when he is at home.\n\n“…a quiet joy in a raucous world.\" John Davy - No Depression\n\n\" ... stripped-back, slightly twangy evocative Americana set that is a delight from start to end.\" Maverick Magazine (UK)\n\n“... alt country, folk-rock jams, creating a hodgepodge of comparisons that ranged from Jack Johnson to Ryan Adams to David Gray. ...even into Bob Dylan territory ... a daunting place to tread, but pulled off with the grace of a musical veteran.” Jessica Small - Santa Barbara Independent", "otherInfo": "Songwriters Spotlight\nFeaturing Sami Freeman, Pat Hull, Caitlin Jemma, Forest Sun\n\nALL AGES\n\n$12-15\n\nDoors 6pm\nShow 7pm"}, {"Address": "Berkeley, CA", "Artist": "AJ Lee & Blue Summit ", "ArtistImage": "https://photos.bandsintown.com/thumb/9173669.jpeg", "Coordinates": [-122.2729, 37.8708], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Santa Cruz, California", "Time": "2:00 AM UTC", "Venue": "Berkeley Bluegrass Festival", "moreBioInfo": "No artist bio available", "otherInfo": "Come out to the annual Berkeley Bluegrass Festival, located at Berkeley's own Freight & Salvage Coffee House. Like every year, this year will have a wide variety of top notch bluegrass musicians:\nPeter Rowan Bluegrass Band, Alice Gerrard, Hasee Ciaccio, Tatiana Hargreaves, Laurie Lewis, Tom Sauber, Tom Bekeny, AJ Lee & Blue Summit, The Town Howlers."}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Forest Sun ", "ArtistImage": "https://photos.bandsintown.com/thumb/9161674.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Americana, Folk", "Time": "2:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Born in upstate New York to folksinging back-to-the-land hippie parents (Forest’s dad literally built the floor that Bob Dylan stood on at manager Albert Grossman’s Bearsville studios in Woodstock, NY. His mom heard Pete Seeger and Joan Baez play in her uncles living room in Boston and dated one of the Chambers Brothers before she met his dad), weaned on a diet of Jackson Browne and Toots and the Maytals, some of Forest’s earliest memories are of his dad playing “Poncho and Lefty” by Townes Van Zandt and his mom singing Elizabeth Cotton’s “Freight Train”. Forest wrote songs with Rory Block when he was six years old, learned to juggle from WavyGravy when he was 9, and studied drumming with the late African master percussionist Babatunde Olatunji as a teenager. In college he played in a band with SNL star Maya Rudolph. They opened for No Doubt at the Catalyst in Santa Cruz before Forest left to study art in Spain.\n\nA pioneer of the DIY movement in 1999 he recorded his first record in his bedroom in San Francisco with bassist Seth Ford Young (Tom Waits, Edward Sharpe) and toured Europe for the first time, including playing at the Rally on Dam Square in Amsterdam for the Tibetan Freedom Concert.\n\nHe’s played festivals from California (Strawberry Music Festival, American River Music Festival) to Europe (Belladrum in Scottland, Fiesta City in Belgium) and opened for such luminaries as Lyle Lovett, Bonnie Rait, Steve Earle, Keb Mo, Brett Dennen and the Beach Boys (Forest met famed Beach Boys producer Van Dyke Parks at festival porch jam and later swapped songs at his house in LA). Collaborations include the jam band scene (ALO -Animal Liberation Orchestra on Jack Johnson’s label) the bluegrass scene (Hot Buttered Rum), and indie folk artists like Jolie Holland and JT Nero from Birds Of Chicago. Forest’s songs mine his deep folk roots and embrace his love of gospel, reggae, Americana, country, soul, jazz and funk.\n\nSun’s music has appeared on Showtime and MTV and in several film scores and soundtracks. He has also had several cameo roles in independent cinema including playing a fireman in “Who's there?” directed by Cassie Jaye and premiering at Tallgrass Film Festival.\n\nHaving done two successful kickstarters Forest is putting out his music on Vinyl and releasing a new song each month this year.\n\nForest is also a visual artist and his original paintings and prints have been shown at the Sala Lola Anglada in Barcelona and the Marin Museum of Contemporary Art.\n\nForest resides in the Redwoods of Mill Valley, Ca when he is at home.\n\n“…a quiet joy in a raucous world.\" John Davy - No Depression\n\n\" ... stripped-back, slightly twangy evocative Americana set that is a delight from start to end.\" Maverick Magazine (UK)\n\n“... alt country, folk-rock jams, creating a hodgepodge of comparisons that ranged from Jack Johnson to Ryan Adams to David Gray. ...even into Bob Dylan territory ... a daunting place to tread, but pulled off with the grace of a musical veteran.” Jessica Small - Santa Barbara Independent", "otherInfo": "Songwriters showcase at Sweetwater Music Hall"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "Yonder Mountain String Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/9925714.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Sun Apr 5 2020", "EventDate": "2020-04-05", "Genre": "Bluegrass, Folk", "Time": "2:00 AM UTC", "Venue": "Terrapin Crossroads", "moreBioInfo": "For the past 20 years, Yonder Mountain String Band has redefined bluegrass music, expanding the traditional acoustic genre beyond its previously established boundaries by steadily pushing the envelope into the realms of rock n’ roll and improvisation. YMSB—guitarist Adam Aijala, bassist Dave Johnston, banjo player Ben Kaufmann, Nick Piccininni on mandolin and violinist Allie Kral--has always played music of their own design, in the process attracting a devout following of fans that often resembles a tight-knit family on an epic musical journey as Yonder traverses the country with an ambitious tour schedule. Yonder is a quintessential ensemble honing its craft night after night on the road, and the fans are there to experience it in real time. The result is music that doesn’t stand still, it’s always progressing and breaking unprecedented ground.\n\nYonder Mountain String Band’s last new album, LOVE. AIN’T LOVE (2017) is undeniably the Colorado-based progressive bluegrass outfit’s most surprising, creative and energetic studio excursion (of their 12 studio offerings) to date. Songs like “Chasing My Tail” and “Alison” are rooted in tradition but as current as tomorrow, animated by electrifying performance, vivid production, and the modernist power that has made Yonder one of the most popular live bands of their generation. Melding sophisticated songcraft, an irrepressible spirit, and remarkable instrumental ability, LOVE. AIN’T LOVE is a testament to Yonder Mountain String Band’s organic, dynamic, and intensely personal brand of contemporary bluegrass-fueled Americana. Of the album, Rolling Stone said it’s “modern bluegrass and punctuated by genre-jumping excursions into world music, reggae and all points in between.” And having logged well over 2100 shows together, the band has amassed devoted fans and critical acclaim along the road, with Glide Magazine hailing them as “a cast of likeable characters that let their joyous spirits and ace instrumental capabilities do the talking.”\n\nThe band has hit the road in 2019 armed with new material that will first get road-tested, and get the studio treatment later this year. This material will undoubtedly be in line with the what you’d expect from Yonder Mountain String Band: edgy and genre-defying music without boundaries.", "otherInfo": "No other event info available"}, {"Address": "San Francisco, CA", "Artist": "John Elliott ", "ArtistImage": "https://photos.bandsintown.com/thumb/8687595.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "No genre available", "Time": "6:00 PM UTC", "Venue": "The Sea Fort", "moreBioInfo": "http://www.thehereafterishere.com", "otherInfo": "No other event info available"}, {"Address": "55 Almaden Blvd #600, San Jose, CA 95113", "Artist": "Patrick Garr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10281217.jpeg", "Coordinates": [-121.894904, 37.332842], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Musical Theater", "Time": "8:00 PM UTC", "Venue": "Zoom Video Communications", "moreBioInfo": "Patrick is a New York based dancer, singer, actor, choreographer and dance teacher currently performing as Samuel Seabury and Man 2 on the Angelica tour of HAMILTON. He graduated from the University of Kentucky with a BA in Theatre, Musical Theatre Certificate, and a minor in Dance. Patrick is a proud Contemporary Dance alum of the School for the Creative and Performing Arts and the Kentucky Governor's School for the Arts.\nRecently, Patrick has worked with choreographers such as Josh Prince, Brooke Wendle, Abdul Latif, and Katie Rose McLaughlin.\nHe began dancing when he was three years old and danced competitively for four years. Patrick has trained extensively with Giordano Dance Chicago on scholarship, iTheatrics (NYC), Broadway Dance Center, Alvin Ailey, and more. After graduation Patrick moved to New York City to pursue a career in performance.\nPatrick’s professional credits include: Fiddler on the Roof (The MUNY), Mary Poppins (The Lexington Theatre Company), Hello, Dolly!, Aida, Billy Elliot, Big Fish (Music Theatre Wichita).\nPatrick teaches with Man In Motion NYC, Varsity All Star Dance Convention and several other studios around the US. As a choreographer, Patrick's credits include: Addams Family, Thoroughly Modern Millie, and selections from Matilda, Chicago, and Pippin.\nHe is a proud member of Actor's Equity Association.", "otherInfo": "No other event info available"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/9361550.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Blues, R&b, Soul Jazz, West Coast Blues", "Time": "11:30 PM UTC", "Venue": "The Saloon", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her organ trio The GG3 play their weekly After-Work Blues Party.\n\nFeaturing Parris Bertolucci on keyboards/bass & Randy Lee Odell on drums.\n\n4:30-8:30pm - 1232 Grant Ave. SF, CA 94133"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Monster Magnet ", "ArtistImage": "https://photos.bandsintown.com/thumb/8374981.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "Monster Magnet is an American stoner metal/stoner rock band, often cited as one of the most successful and influential in the genre. Hailing from Red Bank, New Jersey, the group was founded by Dave Wyndorf (vocals and guitar), John McBain (guitar), Tom Diello (drums), and Tim Cronin (vocals and bass). The band first went under the name \"Dog of Mystery\" and later \"Airport 75\", before finally settling on \"Monster Magnet\".\n\nIn 1989, Monster Magnet released two demo cassettes; \"Forget About Life, I'm High on Dope\" and \"I'm Stoned, What Ya Gonna Do About It?\". The band's first 'official' release was a self-titled EP from Glitterhouse Records of Germany. In 1991 the band signed with Caroline Records and released their first full length album, the cult classic Spine of God, in 1991. The next release was a bizarre 4 song EP titled Tab which included, among two other marathon length songs, a 32 minute track called \"Tab...\". McBain was fired soon after, due to personality conflicts between himself and Dave Wyndorf. He was replaced by Atomic Bitchwax guitarist Ed Mundell; who holds the position to this day.\n\nThe year 1993 saw the release of the album Superjudge. While the album was released on major record label (A&M Records) and is considered a cult favorite among fans of the band's earlier work, the album did not sell very well. The follow-up, a more pop-influenced album, was Dopes to Infinity had a hit single in \"Negasonic Teenage Warhead\" but still did only slightly better than Superjudge. Wyndorf moved to Las Vegas, Nevada in order to begin working on Powertrip (1998), a breakthrough hit that earned a gold certification. Powertrip saw the band departing from its usual lo-fi, stoner rock fare, and enter into an era with more guitar and heavier drum beats. Guitarist Phil Cavaino joined the band in 1998. \"Space Lord\", the first single, was a major radio hit and the band went on tour with bands like Aerosmith, Metallica and Marilyn Manson. Their last album on A&M Records was God Says No (2000). After this release, Joe Calandra and Jon Kleiman departed the band due to internal conflicts with Wyndorf, and were replaced by Jim Baglino and Bob Pantella respectively. In 2003, Monster Magnet signed to the European label SPV, and in early 2004 released Monolithic Baby! throughout Europe. The U.S. release followed in May on SPV America. In March 2005 Phil Cavaino departed after 7 years service in a split described as amicable by Wyndorf. A followup to Monolithic Baby! was expected in March 2006 to coincide with their European Tour, along with rereleases of Spine of God and Tab, both featuring new artwork and liner notes, however the tour and album release did not go ahead. A DVD is also planned for late 2006.\n\nOn February 27, 2006 Dave Wyndorf overdosed on prescription drugs. His management released the following statement\n\n\"The battle with one’s inner demons is the most personal fight any of us can undertake. The fight is at times a lonely, confusing journey. On the evening of February 27, Dave Wyndorf suffered a set back in his own fight and was hospitalized due to a drug overdose. His full recovery is expected. We ask that all those he has encountered over the years or simply affected by his music to take a moment to think good thoughts of and for him. With the grace of God and those who love him we are all confident that Dave will rebound from this set back and continue to play and make great rock and roll.\"\n\nMonster Magnet's style and material are heavily influenced by 1970s-era space rock bands such as Hawkwind and Captain Beyond. In addition to arranging covers such as Hawkwind's \"Brainstorm\" (Doremi Fasol Latido, 1972), Wyndorf sometimes incorporates elements of space rock staples into his own songs. For instance, the Dopes to Infinity title track borrows some of its lyrics from \"Lord of Light\" (ibid.), and Superjudge's \"Twin Earth\" is a reinterpretation of Captain Beyond's \"Mesmerization Eclipse\" (Captain Beyond, 1972). Monster Magnet's live shows occasionally feature Stacia-esque nude dancers, a fact which has landed them in trouble with the law in some American cities.", "otherInfo": "Monster Magnet - Powertrip: A Celebration"}, {"Address": "3359 26th St, San Francisco, CA 94110", "Artist": "Mark Masters Comedy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9519836.jpeg", "Coordinates": [-122.417254, 37.748837], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Comedy", "Time": "3:00 AM UTC", "Venue": "The Laundry", "moreBioInfo": "Mark Masters is a clean comedian from Denver, Colorado. He runs a monthly show in Vail, Colorado called the Vail Comedy Show and wrote a book in 2019 called Not Good Yet.", "otherInfo": "Every joke starts with a premise and every Wednesday Comedians Jeff Dean, James Mwaura and Andrew Orolfo bring together the best local and nationally touring stand-up comedians to turn these premises into hilarious bits.\n\nJoin them in The Laundry’s hidden and intimate comedy basement. Surprise drop in each week, you’ll never know who pops in. Past surprise guests have been seen on HBO, Comedy Central, MTV, and TBS."}, {"Address": "San Jose, CA", "Artist": "Lilan Kane ", "ArtistImage": "https://photos.bandsintown.com/thumb/7335896.jpeg", "Coordinates": [-121.8261, 37.2751], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Pop, Soul, Rnb-soul, R&b/soul, Jazz", "Time": "2:00 AM UTC", "Venue": "San Jose Jazz - livestream", "moreBioInfo": "Lilan Kane (pronounced LEE - lawn) is an award winning singer-songwriter based in Oakland, CA. She released her album Love, Myself to a sold out crowd at Yoshi's Jazz Club. Her vintage-tinged soul sound flows through the heartfelt compositions, telling stories of love, loss, and self-discovery while they seamlessly blend R&B, funk, pop, and jazz. The Berklee College of Music alum recently performed in New Orleans at the French Quarter Festival and graced the Yoshi's stage again, this time with the dynamic Cosa Nostra Strings. They also performed at Undercover Presents: A Tribute to the Miseducation of Lauryn Hill at the Yerba Buena Center for the Arts in San Francisco. Other notable performances include the Fillmore Jazz Festival, San Jose Winter Jazz Fest, Great American Music Hall, Sweetwater Music Hall, The Mint LA, the Whisky A Go-Go, among others. She has opened for Hall & Oates, Sharon Jones, Trombone Shorty, and Morgan James. Lilan Kane (pronounced LEE - lawn) is an award winning singer-songwriter based in Oakland, CA who performs original music and covers in the pop, soul, and jazz genres.", "otherInfo": "Live Stream: https://www.facebook.com/sanjosejazz/?__tn__=kC-R&eid=ARAM2DnQHNwth4oClAocakM6DP8qdzf6aKGMHehpGgAOwxi1mqAz0O3mzPcMnARrrz5eaqBFncFmuQ82&hc_ref=ART0gVECetLavNlCWPA6OIqdK70KuLkhWJdtmHJKaVyI-oVlG2HNTdfKiBPJJLTgFqY&fref=nf&__xts__[0]=68.ARAHc1fAGWCbvj1owHuGShGXDUud4xMwi9O5grbCoOQOAPzSaQiRIW8QuxjwwucnIH3GnbfW6ZeSpQSbQs1RjetU68fB8nh1GUDSS-NK2rR7lWIgxUephJdg2FPiToUs9tUeXA3xmwRgONkil_7VAsOORUPlWo00hhmKYyk0tPCLsXxjn38whHhQ44pWfKbdIBHYPGMXoAtH9OqnFg1GI6PI2tGRE-UMaLV2g0znNxr4RRt1pbrss-r8pmx3X23WXUE318vXN_Ggl89iTXBoUyv9K9byqtPCV5Ck966ACAjey6-p0-8ViePJv6BGIoHysOpXtYNiBy5yRjV9uw"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Scott Amendola ", "ArtistImage": "https://photos.bandsintown.com/thumb/7596193.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Free Jazz, Jazz", "Time": "3:00 AM UTC", "Venue": "Ivy Room", "moreBioInfo": "Scott Amendola:\nDrummer/Composer/Bandleader/Educator\n“Amendola’s music is consistently engaging, both emotionally and intellectually, the product of a fertile and inventive musical imagination.” Los Angeles Times\n\n“If Scott Amendola didn't exist, the San Francisco music scene would have to invent him.” Derk Richardson, San Francisco Bay Guardian\n\n“Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.”Steven Raphael, Modern Drummer\n\n“...drummer/signal-treater Scott Amendola is both a tyrant of heavy rhythm and an electric-haired antenna for outworldly messages (not a standard combination).” Greg Burk, LA Weekly\n\nFor Scott Amendola, the drum kit isn’t so much an instrument as a musical portal. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. His closest musical associates include guitarists Nels Cline, Jeff Parker, Charlie Hunter, Hammond B-3 organist Wil Blades, violinists Jenny Scheinman and Regina Carter, saxophonists Larry Ochs and Phillip Greenlief, and clarinetist Ben Goldberg, players who have each forged a singular path within and beyond the realm of jazz.\n\nWhile rooted in the San Francisco Bay Area scene, Amendola has woven a dense and far-reaching web of bandstand relationships that tie him to influential artists in jazz, blues, rock and new music. A potent creative catalyst, the Berkeley-based drummer is the nexus for a disparate community of musicians stretching from Los Angeles and Seattle to Chicago and New York. Whatever the context, Amendola possesses a gift for twisting musical genres in unexpected directions.\n\nNels Cline maintains his long-running role in the alt-rock juggernaut Wilco, but the band’s long stretches of inactivity mean that he can also perform as a member of the Scott Amendola Band and a recently launched duo project (a tête-à-tête setting in which Scott thrives). Amendola continues to tour and record with the volatile instrumental band, The Nels Cline Singers, which is due for a follow up to 2014’s critically hailed, genre-obliterating Macroscope (Mack Avenue).\n\nIt’s not surprising that the Singers provided an early and essential forum for Amendola’s artful use of electronics, a small menagerie of devices that has found its way “into everything I do,” he says. “After years of experimenting I’m using them in a more expressive and confident way than ever before.”\n\nCline was still an underground LA legend in the mid-1990s when he first encountered Amendola and was “blown away,” he says. “There aren’t too many drummers on the West Coast who had his wide-ranging ability. Scott’s got some funk in him, a looser, sexy thing going on, and the flexibility to play free and different styles. He plays behind singer/songwriters and he rocks too.”\n\nScott also performs widely with his longtime sparring partner Wil Blades in the orchestral duo Amendola Vs. Blades. While they’ve honed a wide array of material, the project initially centered on their thrilling investigation of Duke Ellington and Billy Strayhorn’s “Far East Suite.” Their 2016 debut album Greatest Hits (Sazi Records) earned lavish critical praise, with the San Jose Mercury News hailing the duo for honing a “repertoire of groovelicious jazz for more than a decade, and they throw down the funk with fervor on a project that clocks in at the old-school LP length of 39 minutes, distilling some of their leanest, meanest, punchiest pieces.”\n\nNo project better displays Amendola’s big ears and musical ambitions than Fade To Orange a piece commissioned as part of the Oakland East Bay Symphony’s Irvine Foundation-funded New Visions/New Vistas Initiative. The roiling work premiered to critical acclaim at Oakland’s Paramount Theater on April 15, 2011. Determined to refine and document the piece, Amendola conducted a successful PledgeMusic crowd-funding campaign and recorded Fade To Orange at Berkeley’s storied Fantasy Studios with his original collaborators—his Nels Cline Singers bandmates (Cline and powerhouse bassist Trevor Dunn)—and the great Magik*Magik Orchestra.\n\n“The idea was really the Singers meet the Symphony,” Amendola says. “I wanted Trevor’s electric bass for that big contrast with the orchestra, and I conceived of the piece as a concerto for guitar. It was an amazing experience to premiere ‘Fade to Orange’ at the Paramount, but it was bittersweet after all that work. Like, that’s it? I wanted to see what else we could do with it.”\nHe released Fade to Orange on CD and vinyl on his label Sazi Records in 2015. The album includes four distilled, wildly imaginative remixes of “Fade to Orange” by Cibo Matto’s Yuka Honda, Mocean Worker, Beautiful Bells, and Deerhoof’s John Dieterich and Teetotum’s Drake Hardin.\n\nAmendola established his reputation as a bandleader in 1999 with the release of the acclaimed album Scott Amendola Band featuring the unusual instrumentation of Eric Crystal on saxophones, Todd Sickafoose on acoustic bass, Jenny Scheinman on violin, and Dave Mac Nab on electric guitar. By the time the quintet returned to the studio in 2003, Cline had replaced Mac Nab, contributing to the quintet’s combustible chemistry on the Cryptogramophone album Cry.\n\nCline was a crucial contributor on Amendola’s 2005 Cryptogramophone album Believe, which also features guitarist Jeff Parker (from the band Tortoise), Jenny Scheinman, and late bassist John Shifflett. Scott created his own label, SAZi Records, for his next release, 2010’s exquisite Lift, a trio session with Parker and Shifflett dedicated to his gossamer, bluesy ballads and ethereal soundscapes, with an occasional foray into surf rock deconstruction.\n\nIn some circles, Amendola is best known for his intermittent two-decade collaboration with seven-string guitar wizard Charlie Hunter, with whom he connected shortly after moving to the Bay Area in 1992. They went on to play together with John Schott and Will Bernard in the three-guitar-and-drums combo T.J. Kirk, which earned a Grammy nomination for its eponymous 1996 debut album. After years of occasional gigs, they teamed up again in 2011 in a tough and sinewy duo. They spent five years touring incessantly and released two acclaimed albums: 2012’s recession-inspired Not Getting Behind is the New Getting Ahead and 2013’s Pucker, the latter showcases Amendola’s melodically inspired tunes.\n\nIn 2014, looking for new avenues to distribute their music, Hunter and Amendola released four 5-track EPs, each focusing on the music of a particular artist or act. From the standards of Ellington and Cole Porter to the country hits of Hank Williams and seminal new wave tunes of The Cars, the duo transformed everything they encountered with their groove-centric sensibility.\n\nAs a sideman, Amendola has performed and recorded with a vast, stylistically varied roster of artists, including Bill Frisell, John Zorn, Mike Patton, Mondo Cane, John Scofield, Cibo Matto, John Dieterich from Deerhoof, Wadada Leo Smith, Bruce Cockburn, Madeleine Peyroux, Cris Williamson, Joan Osborne, Jacky Terrasson, Shweta Jhaveri, Phil Lesh, Sex Mob, Kelly Joe Phelps, Larry Klein, Carla Bozulich, Wayne Horvitz, Johnny Griffin, Julian Priester, Sonny Simmons, Pat Martino, Jim Campilongo, Bobby Black, Larry Goldings, Paul McCandless, Rebecca Pidgeon, and the Joe Goode Dance Group.\n\nBorn and raised in the New Jersey suburb of Tenafly, just a stone’s throw from New York City, Amendola displayed an aptitude for rhythm almost from the moment he could walk. His grandfather, Tony Gottuso, was a highly respected guitarist who performed with jazz luminaries such as Ella Fitzgerald, Louis Armstrong, Frank Sinatra, and Nat “King” Cole. A member of the original Tonight Show Band under Steve Allen, he offered plenty of support when Amendola began to get interested in jazz.\n“We used to play together a lot when I was a teenager,” Amendola says. “It had a huge impact on me to play with someone who was around when a lot of the standards that musicians like Miles Davis, John Coltrane, and Keith Jarrett play were written.”\n\nHis passion for music only deepened during his four years at Boston’s venerable Berklee College of Music, where it wasn’t unusual for him to practice for 12 hours a day. Drawing inspiration from fellow students such as Jorge Rossi, Jim Black, Danilo Perez, Chris Cheek, and Mark Turner, and studying with the likes of Joe Hunt, and Tommy Campbell, Amendola found his own voice rather than modeling himself after established drummers. Since 2014, Scott has served as Associate Professor at the University of California - Berkeley’s Jazz Program. His teaching in Jazz Percussion focuses on private instruction.\n\n\nOver a career spanning more than three decades, Amendola has forged deep ties across the country, and throughout the world. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist, and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. He’s never more than one degree away from a powerful musical hook-up.", "otherInfo": "Amendola vs. Blades! The duo is back @ The Ivy Room!\nYes indeed! Wil Blades and Scott Amendola return with the duo! Continuing to celebrate the release of our new record \"Everybody Wins\"! We'll see you there!"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Amendola vs. Blades ", "ArtistImage": "https://photos.bandsintown.com/thumb/6262426.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Polka, Rock, Jazz, Funk, Avant-garde Jazz", "Time": "3:00 AM UTC", "Venue": "Ivy Room", "moreBioInfo": "Amendola Vs. Blades\n\n“The breadth of what we do is so wide we don't have to think about it,” says longtime Bay Area drummer Scott Amendola, when talking about fellow local organist Wil Blades--the other half of the dynamic music duo known as Amendola vs. Blades. “The cool thing is we can play swingin’ old school jazz, funk and rock, African music, to playing free.” Such dynamic range would prove challenging for any band, let alone one consisting merely of eight limbs, two analog keyboards and a drum kit. But it’s a challenge the two friends have eagerly met gig after gig since their auspicious first show together, a performance of Duke Ellington’s “Far East Suite” as an organ and drums arrangement, ten years ago. “It’s all about keeping it fresh,”adds Amendola. “And keeping the audience engaged.” And keeping audiences sonically freshened and engaged throughout their ever-evolving decade-long stint hasn’t been a problem for this uncanny duo, who’ve imprinted plenty of nondescript juke joints: the High Sierra Music Festival, SF Jazz, and the iconic Fillmore, alike with their slithery sound, enough to make stalwart critics like the SF Chronicle’s Joel Selvin squawk: \"As for Wil Blades and Scott Amendola, these two Young Turks of the San Francisco jazz scene are bringing the organ-drum duo into the 21st century.\" And during this century, if you wanted to experience Amendola vs. Blades, you’d have to be one of the many thousands who’ve steadily showed up at one of their live duo adventures. Sure, you may have seen and/or heard these two in-demand session players as bandleaders in their own right, or as distinguished sidemen with the likes of Nels Cline, Charlie Hunter, John Zorn, Mike Patton, John Scofield, Idris Muhammad, Bernard Purdie, or Dr. Lonnie Smith. But if you wanted an album of just the two of them facing off as they do, literally on stage--you’d have to wait. Until now. Finally, Scott Amendola and Wil Blades bring us their long-anticipated debut album—Greatest Hits—on Sazi Records. Recorded over two nights in front of an intimate audience in a downtown Oakland club in June of last year, Greatest Hits is comprised of seven originals, tunes that had initially been composed and recorded by Scott and Wil for other projects. Depending who you ask, the album title could perhaps be construed as a mini-sampler of what’s to come, or perhaps a facetious statement of what was. The germ for the album took shape nearly two years ago. Adds Scott, “We always talked about it, but our schedules never lined up due to both of us being heavily on the road. As other projects ended, we actually had time to take it seriously.”Blades adds, “The thing about live recording was double-fold. For us playing as a duo is very loose and fun, so the best way to capture that was live--the vibe of a studio can make you feel restrained under pressure. A loose gig is a better representation of how we play our stuff, which is improvising.”On Greatest Hits, such improvisation creatively steers the duo through a scenic tour of music genres, as each artist pushes and pull the other toward unanticipated discovery, all the while powered by the heavy grooves laid down by Blades’ mastery of the Hammond organ, and Hohner Clavinet, and anchored by Amendola’s rhythmic drum array. “Most organ players are piano players first,\n\norgan players second. But Wil’s the opposite. His relationship to the organ is deeper than anyone I’ve ever heard”, say Amendola. In addition to Hammond organ, (and requisite Leslie speaker), Blades doubles his keyboard arsenal with the distinct sound of a Clavinet, one he spent a summer tediously restoring. “It literally has my blood, sweat and tears in it,” laughs Wil. “It opens up more sonic possibilities, and just adds another color texture to the mix.”The seven tunes on Greatest Hits impresses with its own set of colors and textures. From the fast boogaloo of “Lima Bean,” to the New Orleans 2nd line vibe of “32nd St.”, and “Slow Zig,” (a tribute to Meters legend Zigaboo Modeliste); the complex 6/8 rhythms of the Ethiopian-inspired “Addis”, to the afrobeat-centric homage via “Oladipo”, to Fela’s right (and left) hand man, wunderkind drummer Tony Allen; or from the soulful songs dedicated to their respective daughters in “Deep Eyes”, and “Mae Mae.”It’s a range Amendola vs. Blades is uniquely suited to express. “I like playing tunes,” the drummer says. “I like the idea of there being a structure to launch from, and being a duo means there are a lot of possibilities harmonically and rhythmically. Neither one of us knows what we are gonna do, and that is exciting both for us, and the audience.”\n\nPress\n\n\"The Amendola vs Blades duo has firmly established itself as one of the liveliest acts in the Bay Area.\"\n- Jazz Observer\n\n“Sometimes it just ridiculous how much sonic space Scott Amendola and Wil Blades alone can fill up in a room. Freakishly funky and soul satisfying, this dynamic duo push the limits on their Greatest Hits, while having too much fun doing it.”\n- Something Else Reviews\n\n“The music itself is joyfully fun as well: yes, it’s jazz, but in true organ-combo fashion it’s jazz that is deeply infused with funk.”\n– CD HotList\n\n“Drummer Scott Amendola and organist Wil Blades create a rich sound that can turn on a dime, exploring everything from Duke Ellington suites to funk, bebop and rock.”\n- Jazzschool\n\n\"Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.\"\n- Modern Drummer Magazine\n\n“Yeah, he does it...he’s on it. He is the future to carry on the legend, the legacy of the organ, [of] the B-3.”\n- Dr. Lonnie Smith Pioneer and Legend of the Hammond B-3 Organ", "otherInfo": "Please join us for a night of music with Scott Amendola and Wil Blades!"}]