var sf_events = [{"Address": "1 South St, , San Francisco, CA 94158", "Artist": "RobloxSabrina ", "ArtistImage": "https://photos.bandsintown.com/thumb/9920118.jpeg", "Coordinates": [-122.389267, 37.768831], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Pop, Latina, Dance-pop, Latin Pop, Pop Rock, Teen Pop", "Time": "2:00 AM UTC", "Venue": "Chase Center", "moreBioInfo": "Sabrina Cabello (born October 10, 1996) is a American singer, songwriter, and model born in Miami, Florida.", "otherInfo": "No other event info available"}, {"Address": "3700 Middlefield Rd, Palo Alto, CA 94303", "Artist": "Laura Veirs ", "ArtistImage": "https://photos.bandsintown.com/thumb/8525255.jpeg", "Coordinates": [-122.113309, 37.423261], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Indie, Alternative, Folk, Pop", "Time": "2:00 AM UTC", "Venue": "Mitchell Park Community Center", "moreBioInfo": "A prolific songwriter for nearly twenty years, Laura Veirs proves the depth of her musical skill on her tenth solo album, The Lookout. Here is a batch of inimitable, churning, exquisite folk-pop songs; a concept album about the fragility of precious things. Produced by Grammy-nominated Tucker Martine, Veirs’ longtime collaborator, The Lookout is a soundtrack for turbulent times, full of allusions to protectors: the camper stoking a watch fire, a mother tending her children, a sailor in a crows nest and a lightning rod channeling energy.", "otherInfo": "No other event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Bessie Snow ", "ArtistImage": "https://photos.bandsintown.com/thumb/10061726.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Apr 6 2020", "EventDate": "2020-04-06", "Genre": "Play, Classic Blues, Entertainment, Fine Art, Tease, Pop, Jazz, Classic, Funk, Rock, Burlesque, Live, Glamour, Dance, Old Hollywood, Performance Art, Classic Rock", "Time": "5:00 AM UTC", "Venue": "DNA Lounge", "moreBioInfo": "Bessie Snow is a Neo-classic burlesque performer. She enjoys incorporating classic models of striptease along with modern innovation. She has performed internationally and all over the U.S by way of some of the most reputable burlesque festivals. She is known for igniting audiences with her magical and sensual ways of moving and shifting. She is your year around snow storm that’s here to remind you that being cold can be hot too.", "otherInfo": "No other event info available"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/9361550.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "West Coast Blues, Blues, R&b, Soul Jazz", "Time": "11:30 PM UTC", "Venue": "The Saloon", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her organ trio The GG3 play their weekly After-Work Blues Party.\n\nFeaturing Parris Bertolucci on keyboards/bass & Randy Lee Odell on drums.\n\n4:30-8:30pm - 1232 Grant Ave. SF, CA 94133"}, {"Address": "1075 Sutter St, San Francisco, CA 94109", "Artist": "Koala & the Golden Boy ", "ArtistImage": "https://photos.bandsintown.com/thumb/8955212.jpeg", "Coordinates": [-122.417932, 37.787751], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Indie Rock, Pop Rock, Acoustic, Folk", "Time": "12:00 AM UTC", "Venue": "Hotel Carlton", "moreBioInfo": "Koala and the Golden Boy is singer-writer couple Jen and Jordan.", "otherInfo": "No other event info available"}, {"Address": "South San Francisco, CA", "Artist": "Tearful Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8619874.jpeg", "Coordinates": [-122.4081, 37.6549], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Dark Ambient, Dark Wave, Electronic, Synth Wave, Alternative", "Time": "1:00 AM UTC", "Venue": "The Hanging Garden", "moreBioInfo": "All Lyrics and vocals- Sky Lesco\nAll music and some vocals -Manuel Lozano\nWave Records, In the Dark Morning, LP, 2016\nInclub Records, Evocation,LP,2017", "otherInfo": "No other event info available"}, {"Address": "1111 Solano Ave, Albany, CA 94706", "Artist": "George Cole ", "ArtistImage": "https://photos.bandsintown.com/thumb/8682442.jpeg", "Coordinates": [-122.298349, 37.890478], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Acoustic, Gypsy Jazz, American Song, Composer Songbook, Guitar Virtuoso, Consumate Entertainer, Performer, Acoustic Guitar", "Time": "1:30 AM UTC", "Venue": "Rendez-Vous Café Bistro", "moreBioInfo": "GEORGE COLE: Singer and breakneck acoustic guitarist George Cole inhabits a musical world all his own.... a world in which Django Reinhardt, The Ramones, Nat King Cole and Doc Watson get equal billing with Irving Berlin, George Gershwin, Willie Nelson and the Great American Songbook. Cole currently occupies the guitar chair for the David Grisman Quintet and has 2 releases on Grisman’s highly regarded Acoustic Disc Label. George was guitar teacher and mentor to Rock and Roll Hall of Fame Inductees Billie Joe Armstrong and Mike Dirnt of Green Day for 10 years in the East Bay. Cole, a San Francisco native and BAMMIE award winner brings an expertise to his guitar playing and singing that is filtered through Rock and Roll, Gypsy Jazz and All things American. The music he makes brings to mind the old adage “Everything Old Is New Again”. David Grisman tapped Cole to play on his most recent Sextet record and Cole in turn featured Grisman on his release “George Cole Live”. Jazz legend Keely Smith handpicked Cole to play guitar and sing duets with her on her last tour. Chris Isaak also had Cole lay down guitar tracks on his platinum selling Forever Blue release. Cole is currently performing at festivals, performing arts centers, top nightclubs, and vintage theaters. www.GEORGECOLE.net\nwww.georgecole.net", "otherInfo": "Do yourself a favor and join the throng to enjoy George Cole’s amazing, world class music, and superb french cuisine at Rendez-Vous Café Bistro Tuesday 6:30-8:30"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Monster Magnet ", "ArtistImage": "https://photos.bandsintown.com/thumb/8374981.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "Monster Magnet is an American stoner metal/stoner rock band, often cited as one of the most successful and influential in the genre. Hailing from Red Bank, New Jersey, the group was founded by Dave Wyndorf (vocals and guitar), John McBain (guitar), Tom Diello (drums), and Tim Cronin (vocals and bass). The band first went under the name \"Dog of Mystery\" and later \"Airport 75\", before finally settling on \"Monster Magnet\".\n\nIn 1989, Monster Magnet released two demo cassettes; \"Forget About Life, I'm High on Dope\" and \"I'm Stoned, What Ya Gonna Do About It?\". The band's first 'official' release was a self-titled EP from Glitterhouse Records of Germany. In 1991 the band signed with Caroline Records and released their first full length album, the cult classic Spine of God, in 1991. The next release was a bizarre 4 song EP titled Tab which included, among two other marathon length songs, a 32 minute track called \"Tab...\". McBain was fired soon after, due to personality conflicts between himself and Dave Wyndorf. He was replaced by Atomic Bitchwax guitarist Ed Mundell; who holds the position to this day.\n\nThe year 1993 saw the release of the album Superjudge. While the album was released on major record label (A&M Records) and is considered a cult favorite among fans of the band's earlier work, the album did not sell very well. The follow-up, a more pop-influenced album, was Dopes to Infinity had a hit single in \"Negasonic Teenage Warhead\" but still did only slightly better than Superjudge. Wyndorf moved to Las Vegas, Nevada in order to begin working on Powertrip (1998), a breakthrough hit that earned a gold certification. Powertrip saw the band departing from its usual lo-fi, stoner rock fare, and enter into an era with more guitar and heavier drum beats. Guitarist Phil Cavaino joined the band in 1998. \"Space Lord\", the first single, was a major radio hit and the band went on tour with bands like Aerosmith, Metallica and Marilyn Manson. Their last album on A&M Records was God Says No (2000). After this release, Joe Calandra and Jon Kleiman departed the band due to internal conflicts with Wyndorf, and were replaced by Jim Baglino and Bob Pantella respectively. In 2003, Monster Magnet signed to the European label SPV, and in early 2004 released Monolithic Baby! throughout Europe. The U.S. release followed in May on SPV America. In March 2005 Phil Cavaino departed after 7 years service in a split described as amicable by Wyndorf. A followup to Monolithic Baby! was expected in March 2006 to coincide with their European Tour, along with rereleases of Spine of God and Tab, both featuring new artwork and liner notes, however the tour and album release did not go ahead. A DVD is also planned for late 2006.\n\nOn February 27, 2006 Dave Wyndorf overdosed on prescription drugs. His management released the following statement\n\n\"The battle with one’s inner demons is the most personal fight any of us can undertake. The fight is at times a lonely, confusing journey. On the evening of February 27, Dave Wyndorf suffered a set back in his own fight and was hospitalized due to a drug overdose. His full recovery is expected. We ask that all those he has encountered over the years or simply affected by his music to take a moment to think good thoughts of and for him. With the grace of God and those who love him we are all confident that Dave will rebound from this set back and continue to play and make great rock and roll.\"\n\nMonster Magnet's style and material are heavily influenced by 1970s-era space rock bands such as Hawkwind and Captain Beyond. In addition to arranging covers such as Hawkwind's \"Brainstorm\" (Doremi Fasol Latido, 1972), Wyndorf sometimes incorporates elements of space rock staples into his own songs. For instance, the Dopes to Infinity title track borrows some of its lyrics from \"Lord of Light\" (ibid.), and Superjudge's \"Twin Earth\" is a reinterpretation of Captain Beyond's \"Mesmerization Eclipse\" (Captain Beyond, 1972). Monster Magnet's live shows occasionally feature Stacia-esque nude dancers, a fact which has landed them in trouble with the law in some American cities.", "otherInfo": "Monster Magnet - Powertrip: A Celebration"}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "Clark Beckham ", "ArtistImage": "https://photos.bandsintown.com/thumb/8649256.jpeg", "Coordinates": [-122.463777, 37.783225], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Blues, Soul, R&b, Pop, R&b/soul, Rnb-soul", "Time": "3:00 AM UTC", "Venue": "Neck Of the Woods", "moreBioInfo": "My parents are both incredibly musically talented. My mother (Terri Beckham) is a music teacher, who surrounded me with the best music in the world (from the 60s and 70s) and provided with great musical opportunities my whole life. My father (Virgil Beckham) played and sang blues with straight up soul and has influenced me tremendously in my passion and style of expression.", "otherInfo": "w/local support from Sam McCarthy"}, {"Address": "West Oakland, CA", "Artist": "Mentes Diferentes ", "ArtistImage": "https://photos.bandsintown.com/thumb/10111113.jpeg", "Coordinates": [-79.95381499999999, 40.4440775], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Live on the Air ", "moreBioInfo": "No artist bio available", "otherInfo": "Listen from everywhere @ http://poormagazine.org/radio"}, {"Address": "2272 Telegraph Ave, Oakland, CA 94612", "Artist": "Gus Clark ", "ArtistImage": "https://photos.bandsintown.com/thumb/9941711.jpeg", "Coordinates": [-122.268578, 37.812367], "Date": "Tue Apr 7 2020", "EventDate": "2020-04-07", "Genre": "Countypolitan, Ragtime, Country, Crooner, Country Blues, Honky Tonk, Classic Country", "Time": "4:00 AM UTC", "Venue": "The Legionnaire Saloon", "moreBioInfo": "Crooning classic country and soulful serenades, with a hot honky tonk combo", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "The High Water Line ", "ArtistImage": "https://photos.bandsintown.com/thumb/8826196.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Acoustic, Bluegrass, Americana, Alternative Folk", "Time": "2:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "The High Water Line is a 5 piece group of Bay Area musicians who blend their diverse musical tastes and experiences to create a modern bluegrass sound all their own.\n\nWe can be found playing around the Bay Area a few times a month, and the members of HWL have performed all over the world, from New York to Shanghai and even in our own backyard at the CBA’s Father’s Day Festival.\n\nWhile all the members of HWL come from outside CA, we call it home now and feel lucky that the amazing bluegrass community here has allowed us to come together and share our musical passions. We met in 2017 thanks to the amazing local jam and performance scene. Our shared values around working together to elevate our music to levels we couldn’t reach on our own resulted in our name, The High Water Line.\n\nHailing from upstate New York, holding down the Banjo spot, and singing with his powerful baritone voice, is Tyler Stegall. Tyler's driving banjo style propels the band along no matter the tempo. Clare Armenante comes from The Garden State. A classical violin player, she is both at home playing for symphonies and taking amazing breaks over traditional bluegrass music. Not only is Clare amazing on the fiddle, but she can sing all the parts better than the rest of the band put together. Also from New Jersey, the man responsible for keeping the band in time and bringing the funk, is bass player and singer Jim Toggweiler. Helping to keep the band moving is mandolin player Tj Carskadon, from WI. Tj’s harmony singing and driving backbeat help to define The High Water Line’s unique rhythmic feel. Last, but certainly not least, is our amazing guitar player all the way from Monroe, Georgia, Joel Cofield. The way Joel seamlessly blends blues with both traditional and modern bluegrass guitar styles, combined with his fantastic harmony and lead singing, round out HWL’s sound and help bring it a flavor all its own.\n\nYou can find our demo recording included in this packet and on soundcloud at https://soundcloud.com/the-high-water-line. We are planning to make a longer record in 2018 and are working on some new original material for that project now.", "otherInfo": "No other event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Adelitas Way ", "ArtistImage": "https://photos.bandsintown.com/thumb/8491954.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Rick DeJesus Tre Stafford, Andrew Cushing", "Time": "2:00 AM UTC", "Venue": "DNA Lounge", "moreBioInfo": "Las Vegas's Adelitas way\nwww.adelitaswaymusic.com\nThe Vegas Syn Records/ The Fuel Music", "otherInfo": "An electric night of live music"}, {"Address": "Redwood City, CA", "Artist": "Small Hat ", "ArtistImage": "https://photos.bandsintown.com/thumb/9523631.jpeg", "Coordinates": [-122.2364, 37.4852], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Blues-rock, Alternative, Rock, Soul", "Time": "2:00 AM UTC", "Venue": "Street life ", "moreBioInfo": "Delivering their unique sound of soulful alternative southern rock, Small Hat features Mandy Brooks, Cosmos Harrison, and ZOZ, along with various special guests, with the intention to inspire and connect with their audience. Based out of Northern California, Small Hat has been awarded for songwriting, with their first single released spring of 2018. smallhatband.com", "otherInfo": "No other event info available"}, {"Address": "765 Center Blvd, Fairfax, CA 94930", "Artist": "Kate Gaffney ", "ArtistImage": "https://photos.bandsintown.com/thumb/8682343.jpeg", "Coordinates": [-122.584093, 37.985925], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Kate Gaffney - singer/songwriter/guitar", "Time": "3:00 AM UTC", "Venue": "Iron Springs Pub & Brewery", "moreBioInfo": "Singer-songwriter Kate Gaffney honed her skills in her native Philadelphia, jumped from coast to coast, and laid musical roots in Northern California.\n\nThe exploration of coastal living, in all of its glory, splendor, isolation, and mystery, has inspired Kate to make a new concept album - coming soon!", "otherInfo": "Kate Gaffney acoustic ensemble at Iron Springs Pub & Brewery\n\nWednesday April 8th\n8-10pm\n\nNo cover, tips welcome :)\n\nAll ages"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "Adam Melchor ", "ArtistImage": "https://photos.bandsintown.com/thumb/9008802.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Jersey City, New Jersey", "Time": "3:00 AM UTC", "Venue": "The Fillmore", "moreBioInfo": "Adam Melchor is a 24 year old recording artist from New Jersey. In his debut EP The Archer, Adam weaves intensely personal lyrics with colloquial melody to create a vivid yet vulnerable narrative. Carried by his folk guitar playing and impressive vocals, the songs showcase a musical empathy rare for an artist of Adam‘s age and comparable to contemporaries like M. Ward or Conor Oberst.\nThe 5 song EP includes the singles \"Brook Revisited\" and \"The Archer. It is emotive, stark, and often apologetic. But out of a confession booth turned vocal booth, Adam has created a cathartic and auspicious debut album.", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Chasms ", "ArtistImage": "https://photos.bandsintown.com/thumb/8445542.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Experimental, Industrial, Shoegaze, Dub, Ambient, Electronic", "Time": "3:00 AM UTC", "Venue": "The Chapel", "moreBioInfo": "Chasms crafts ethereal, percussive dirges that are sparse in arrangement and potent with emotion. Comprised of producer, vocalist, and guitarist Jess Labrador and bassist Shannon Madden, the duo layers meditative guitars and electronic drum samples with Labrador’s entrancing soprano to create an otherworldly sound.\n\nThe duo released the \"Divine Illusion\" single in October 2018, two years after the release of their debut LP 'On the Legs of Love Purified.' As the band shifts their sound toward the murky depths of dub with an upcoming LP to be released on the Felte label in early 2019, “Divine Illusion” is the final chapter of the duo’s industrial-shoegaze sound.\n\nWhile '…Love Purified' is Chasms’ debut, the band has been active since 2012. They’ve released the 'When It Comes' (Dream, 2012), 'Riser' (Dream, 2014) EPs and the 'Bad Evolution' single (Sleep Genius, 2012). They then collected a majority of the two EPs on the 'Subtle Bodies' compilation album (Sleep Genius, 2014).", "otherInfo": "The KVB at The Chapel"}, {"Address": "1933 Broadway, Oakland, CA 94612", "Artist": "Ryan Herr Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8243946.jpeg", "Coordinates": [-122.269131, 37.808347], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Live, Dub, World, Chill, Reggae, International", "Time": "3:00 AM UTC", "Venue": "Oakland School For The Arts At Sweets Ballroom", "moreBioInfo": "Ryan Herr has been weaving his mix of live and electronic music for festivals, events, ecstatic dances, and retreats throughout the world for nearly 20 years. His sets are loved for his synthesis of original and live elements and his uniquely designed blend of genres and cultures, both contemporary and classic, mixed with on-the-spot compositions and original remixes. Many have come to know his music through his collaborations and performances with The Polish Ambassador, Wildlight and Ayla Nereo. Ryan has become a featured artist/producer on many of their album releases and has produced several successful remixes for TPA's label, Jumpsuit Records. He also recently produced the Wildlight - The Tide (Acoustic) album as well as co-produced Ayla Nereo's \"The Code of the Flowers\". He has a diverse and dynamic background of musical genres and styles and has been creating music for yoga, dance, film and meditation throughout his career. He has performed at many major festivals around the country, including Lightning in a Bottle, Symbiosis, Beloved, Lucidity, Arise, Imagine, and Phases of the Moon. He focuses much of his attention on the medicinal aspects of music and dance, and always incorporates a healthy dose of improvisation into his live sets.", "otherInfo": "No other event info available"}, {"Address": "2272 Telegraph Ave, Oakland, CA 94612", "Artist": "Stumble Day ", "ArtistImage": "https://photos.bandsintown.com/thumb/9560675.jpeg", "Coordinates": [-122.268578, 37.812367], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Alternative, Rock", "Time": "3:00 AM UTC", "Venue": "The Legionnaire Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "3359 26th St, San Francisco, CA 94110", "Artist": "Mark Masters Comedy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9519836.jpeg", "Coordinates": [-122.417254, 37.748837], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Comedy", "Time": "3:00 AM UTC", "Venue": "The Laundry", "moreBioInfo": "Mark Masters is a clean comedian from Denver, Colorado. He runs a monthly show in Vail, Colorado called the Vail Comedy Show and wrote a book in 2019 called Not Good Yet.", "otherInfo": "Every joke starts with a premise and every Wednesday Comedians Jeff Dean, James Mwaura and Andrew Orolfo bring together the best local and nationally touring stand-up comedians to turn these premises into hilarious bits.\n\nJoin them in The Laundry’s hidden and intimate comedy basement. Surprise drop in each week, you’ll never know who pops in. Past surprise guests have been seen on HBO, Comedy Central, MTV, and TBS."}, {"Address": "5475 Old Redwood Hwy, Penngrove, CA 94951", "Artist": "Gus Clark ", "ArtistImage": "https://photos.bandsintown.com/thumb/9941711.jpeg", "Coordinates": [-122.666871, 38.294274], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "Countypolitan, Ragtime, Country, Crooner, Country Blues, Honky Tonk, Classic Country", "Time": "3:30 AM UTC", "Venue": "Twin Oaks Roadhouse", "moreBioInfo": "Crooning classic country and soulful serenades, with a hot honky tonk combo", "otherInfo": "No other event info available"}, {"Address": "San Jose, CA", "Artist": "Justin Rock ", "ArtistImage": "https://photos.bandsintown.com/thumb/7248992.jpeg", "Coordinates": [-121.8261, 37.2751], "Date": "Wed Apr 8 2020", "EventDate": "2020-04-08", "Genre": "No genre available", "Time": "4:00 AM UTC", "Venue": "The Legionarre w/ Stumble Day", "moreBioInfo": "No artist bio available", "otherInfo": "Stumble Day"}, {"Address": "229 Water St North, Petaluma, CA 94952", "Artist": "Red's Blues ", "ArtistImage": "https://photos.bandsintown.com/thumb/9034428.jpeg", "Coordinates": [-122.64148, 38.23832], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Americana, Blues Some Original, Blues", "Time": "12:00 AM UTC", "Venue": "Brewsters Beer Garden + Restaurant", "moreBioInfo": "Red’s Blues~~You Knock Me Out\nWith this second release, You Knock Me Out, Red’s Blues has stepped up another notch into blues big league with the exemplary songwriting team of singer Beth Reid-Grigsby and her Blues Music Award-winning stand up (bass-playing and singing) husband RW Grigsby. Couple that with all their music friends joining in on the fun, and this new CD makes a very strong case for Northern California being the new torch-bearing center of the classic Chicago and Texas blues sound.\nSix stellar originals tell the couple’s individual and combined personal histories in an honest and cosmic way. Beth & RW’s love of the classic blues vibe pays off and yet, these songs could easily be covered by well-known singers in many roots music idioms.\nNestled alongside are songs by their mid-20th century heroes Jimmy Reed (lead track, “There’ll Be a Day”, “Ain’t That Loving You Baby”), Memphis Minnie (“Lookin’ the World Over”), Big Bill Broonzy (“Lonesome Road Blues”), jump blues brother-sister act, Buddy & Ella Johnson (“Why Don’t You Stop It”) and Memphis Slim (“Mother Earth.”)\nRed’s Blues has a finger-poppin’ attitude—straight outta the afore-mentioned golden years when blues, R&B and swing all meshed together and dance floors every night were filled with snake hips and slow drags. Beth, with her sensual, southern voice and classy behind-the-beat phrasing is more a Julie London or Bobbie Gentry-styled singer: smoky with languid, sexy sophistication. She can swing too, just check out the big fun on “Why Don’t Ya Stop It.” This rich nightclub feel is missed on too many modern singers. The yearning confidentiality, the wise heart that Beth brings to her true-life stories reveal tales of youth seen through grown up reflection.\nRW, who has not lost his hometown Rome, Georgia accent has this quality also. Upright bass never had a better companion—it’s no wonder that RW has anchored the doghouse rhythm for Mark Hummel’s legendary Harmonica Blowouts for ten years. Together, Beth & RW have a rare and beautiful combination of poetry, humor and groove in their music. What other couple in more recent music memory had this? Could they be the blues Sonny & Cher? Johnny & June? Whether up-tempo or ballad, this makes for a great live show —part juke joint, part nightclub. They are uptown and lowdown.\nTheir friends on this release are California harp masters Rick Estrin and Mark Hummel, Texas guitar masters Anson Funderburgh and Mike Keller, Texas drummer and RW Grigsby’s childhood music sidekick, Wes Starr (the dazzling team from Hummel’s Golden State-Lone Star Revue) guitarist and harmonica player Dave Earl and two Sacramento Hall of Famers, guitarists Robert Sidwell and Steve Randall.\nVeteran Bay Area Musician Dave Earl, now living in the Sierra foothills, played guitar and rack harmonica in Red’s Blues for two years. “Doug Crumpacker of Hucklebucks reknown, is currently Red’s Blues’ guitar player. When we have another guitar player on stage with us, he knows when to drop back and support the other artist. He’s a fine addition to our band and is up there with the best. Also a great part of our rhythm section is Tim Wilbur, Sacramento’s own shuffle king.” Doug, Tim and RW are all members of the Sacramento Blues Hall of Fame.\nDrummer/studio owner/engineer Larry Carr understands the great 1950s Chicago drummers like Jimmy Reed’s great shuffle drummer Earl Phillips. He also has a terrific beatnik bongo/shakers turn on one of the album highlights, “I’m Trouble (Hillbilly Bongo Blues)” penned by RW. If Robert Mitchum were still around, THIS 2-minute warning would absolutely be his theme song.\nYoung Hammond B-3 lions are here too. James Pace (Tommy Castro) and Kid Andersen (award-winning blues producer; and formerly with Terry Hanck, Charlie Musselwhite, now Rick Estrin & The Nightcats), and John Cocuzzi all take turns and elegant swingman Cocuzzi adds his deep blues piano touch on three songs.\nIt is always good to know what the artists themselves want to say about each song choice they carefully made and the originals they wrote:\n1. There’ll Be A Day- the flip side of Jimmy Reed’s 1963 hit “Shame, Shame, Shame.” Original 3rd verse written by Beth contains the album title You Knock Me Out.\n2. Poor Girl- inspired by RW and Beth’s time managing a ghetto bingo hall in Montgomery, Alabama and a girl with a gambling problem.\n3. Lookin’ The World Over- Memphis Minnie’s tale of travels with her righteous man. Killer Estrin harp solo.\n4. That’s All- written after Beth found a picture of her mother’s. A family tale of living, loving and dying.\n5. Ain’t That Loving You Baby- Jimmy Reed cover features Mark Hummel on harp and the Golden State Lone Star Revue.\n6. Baby Walk On- RW original inspired by Mose Allison. Solos by Hummel, Mike Keller and Anson Funderburgh.\n7. Stonebroke- originally recorded in 1992 with RW on Gary Primich’s My Pleasure on Austin’s Amazing Records. Rick Estrin plays some fine solos. A Primich original.\n8. Why Don’t You Stop It- Buddy and Ella Johnson tune, Lou Ann Barton used to sing this with Roomful of Blues.\n9. Pat’s Blues-Original tune about our friend who went on a binge and woke up with a stranger who’s name she didn’t know....yep it’s true. Only we changed it to a tune about our friend, a guy, because it didn’t sound right, Beth singing about a girl.....)\n10. Lonesome Road Blues- Big Bill Broonzy road tune.\n11. I’m Trouble (Hillbilly Bongo Blues)- RW original, Larry Carr on bongos, hillbilly beatnik.\n12. Somewhere Down The Line- Another RW&B original, trying to channel the feel of south Louisiana in this song of reconciliation. Nice soloing from John Cocuzzi and Steve Randall. Another family tale.\n13. Mother Earth- Memphis Slim cover brings it all home. Solos by John Cocuzzi and Robert Sidwell. On a Blues Cruise in 2012, Barrelhouse Chuck asked Beth if she knew “Mother Earth.” She said “no, but I know Blues is Everywhere.” He said, “I love your voice. Learn that song.” So she did—\"never got to sing it with him, though. I was glad RW thought of putting it on the CD.”\n\nA little more Beth & RW back story:\nBeth, thanks to her older brother, grew up listening to Huddie Ledbetter, Muddy Waters and Mississippi John Hurt records and as a kid, learned from and sang songs at home with her Mom-- “ Summertime,” “God Bless the Child,” and St. Louis Blues.” Across the street in her hometown of south Santa Barbara though, the shy 7 year old redhead was bold enough to go perch on the neighbor’s porch listening to a Cuban salsa band rehearse, and from that learned to love the rhythms, the bass and percussion in particular. She and RW met through the local Santa Barbara blues scene years later in 1977, and have lived in his home state of Georgia and then Texas before heading back to sunny Sacramento, California in 2006.\n2014 Grammy-nominated and Blues Music Award (BMA) winner bassist RW Grigsby has been playing since he was 14 years old, and began his professional career when still a teenager. He's toured the U.S., Canada and Europe since the '80s, and currently juggles playing with Red's Blues, Mark Hummel and the Blues Survivors and The Golden State/Lone Star Blues Revue. He played and recorded with Texas blues stars Gary Primich and Black Top Records’ Mike Morgan and the Crawl in the 1990s. RW is the bassist on the 2014 Grammy-nominated and BMA-winning CD, Remembering Little Walter. He was nominated for a BMA “Best Bassist” Award in 2017, and was inducted into the Sacramento Blues Hall of Fame in 2018.\nRed’s Blues draw their audiences into a grown-up music world—southern music with downhome simmer, dance floor fun and stellar, sophisticated players who know they have no need to blast at earsplitting volumes to make the biggest impact.\n– Bio by Mindy Giles, © 2018\n\nhttps://www.facebook.com/redsbluessac\n(916) 342-4281 bethgrigsby@comcast.net", "otherInfo": "Red’s Blues is bringing our unique blues and original Americana music to the Brewster’s patio. Please join us for dinner from their fine menu, and drinks of your choosing. Red’s Blues has been working hard on their third CD, and will be playing some new originals and old favorites. Doug Crumpacker, guitar, RW Grigsby, bass, Tim Wilbur, drums and Beth Reid-Grigsby, lead vocals. CDs on sale and tips appreciated. We also accept credit cards. See you there!"}, {"Address": "1300 Van Ness Ave, San Francisco, CA 94109-5519", "Artist": "Hannah Dasher ", "ArtistImage": "https://photos.bandsintown.com/thumb/9498376.jpeg", "Coordinates": [-122.421386, 37.787858], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Country", "Time": "2:00 AM UTC", "Venue": "The Regency Ballroom", "moreBioInfo": "The first time you hear HANNAH DASHER perform, you'll discover something you never knew you wanted.\nThough a modern stylist, her personality-packed lyrics and vocal delivery are steeped in traditional country, soul, rock, and blues. She is signed to Sony/ATV Nashville and is working on her debut album, Heavy.", "otherInfo": "Dierks Bentley’s Hot Country Knights One Knight Stand Tour"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "CocoRosie ", "ArtistImage": "https://photos.bandsintown.com/thumb/9595752.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Indie, Folk, Alternative, Electronic", "Time": "2:00 AM UTC", "Venue": "The Fillmore", "moreBioInfo": "CocoRosie are an American duo that was formed by sisters Sierra (Rosie) and Bianca (Coco) Casady in 2003. Sierra and Bianca Casady are American half-Cherokee sisters. Sierra, the older of the two, was born in Iowa, and Bianca was born in Hawaii. Their mother nicknamed them Rosie and Coco, respectively, from which their musical act takes its name. Stylistically they may be assigned to the indie rock, psych folk, folk-tronic genres, and are sometimes associated with the new weird america movement. Sierra who studied Operatic vocal techniques lends the lead vocals and also plays the guitar, harp and flute. Bianca is a percussionist and also beatboxes. The group also uses various objects such as toys to construct their unique sound. They were active for most of 2004, playing dates across the U.S. and making several trips to Europe for tours playing with TV on the Radio, Bright Eyes, Battles, Devendra Banhart and others.\nOn the 29th of April 2008 Cocorosie will be the first band to perform together with the famous Royal Concertgebouw Orchestra in the Concertgebouw in Amsterdam.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Magic In the Other ", "ArtistImage": "https://photos.bandsintown.com/thumb/8687451.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Ezra Lipp, Roger Riedlbauer, Steve Adams", "Time": "2:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "“An intelligent music listener’s dream. The music is danceable but also worthy of focus to see their communication in real time. It is something special to bear witness to the birth of a band that could potentially take a scene by storm, you feel like you’re in on something, witness to something great.” - Glide Magazine\n\nMagic In The Other was born out of the idea that it is in the unknown where the most potent ground lays for magic and discovery. It is from this notion that this fresh-on-the-scene trio from Oakland, CA sets out to connect with their listeners, creating a mentally-stimulating, emotionally-resonate, highly-danceable, and distinctly-transformative experience where everyone feels just a little more magical.\n\nMITO assembled in early 2017, consisting of three in-demand Bay Area veterans - drummer and bandleader Ezra Lipp (Phil Lesh & Friends, Sean Hayes), bass player Steve Adams (ALO, Nicki Bluhm & The Gramblers) and guitar wizard Roger Riedlbauer (Jolie Holland, Mercury Falls). Over the course of just a year, the trio has honed in on a contagious chemistry that beams with personality and is incredibly engaging to watch. It may be difficult to pin the band down to a specific genre, however, traces can be detected. Be it the rhythmic sophistication of jazz and West African music, the unrestrained spirit of rock n’ roll, the compositional approach of western classical music, or the improvisatory intensity of North Indian ragas, the magic of the band ultimately lies in the skilled fusing of all of the above (and beyond) to create a sound fresh and unique all its own.\n\nIn the fall of their break-out year, while building a buzz on stages around the Bay Area and garnering their first set of loyal fans, Ezra, Steve and Roger crowd-funded nearly $20k to put toward the making of their first full-length album. Recorded at the legendary Tiny Telephone Studios, the debut captures the band’s first batch of live-tested material, and is augmented by a few of their close musical friends as well as other fun studio surprises. Magic In The Other is aiming for a late summer/early fall release this year with subsequent touring to celebrate the completion of one chapter and the unknown of the next.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Ezra Lipp ", "ArtistImage": "https://photos.bandsintown.com/thumb/7665151.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Ezra Lipp is an innovative, Bay Area based drummer, composer and educator, who regularly performs with a slew of all star musicians, works as an in demand session musician, has his own teaching practice, leads his own band Magic In The Other, and is the proud creator and host of a music podcast called The Ezra Lipp Hour (More or Less) . He has extensively toured the US and Europe and has worked with many amazing bands and artists representing diverse musical genres including Phil Lesh of the Grateful Dead, Melvin Seals and JGB, counter-cultural Iranian superstar Mohsen Namjoo, national folk-soul treasure Sean Hayes and many, many more [see below for a more complete list].\n\nEzra is a lifelong student of music and earned a bachelor’s degree in Music Performance and Jazz studies from the University of Vermont in 2005. He has also studied music and percussion from around the globe both in the US and abroad (including West African, North Indian, Afro-Cuban, and more). As a teacher he brings his depth and breadth of rhythmic knowledge and years of professional experience to help others along on a path to find their own creative musical voice and expression.\n\nEzra’s imaginative approach, accomplished musicianship and refined sensibilities distinguish him as a truly creative contemporary musician and drum artist.\n\n\"Ezra Lipp appears and sounds utterly natural, as if each of these varied environments is his organic state as a drummer. He exhibits a steely-eyed, no-holding-back intensity that speaks of an artist that truly gives himself to the moment, open ears craning to catch what the music needs as his body blurs beautifully to tease out the right moves and deliver them right on time. Our gut says Lipp is going to be one of the greats one day, and it’s not going to suck to witness his evolution along the way.\" - Dennis Cook, Jambase/Dirty Impound", "otherInfo": "No other event info available"}, {"Address": "42011 Boscell Rd, Fremont, CA 94538", "Artist": "Charlie Farley ", "ArtistImage": "https://photos.bandsintown.com/thumb/8536721.jpeg", "Coordinates": [-121.981821, 37.508125], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Alternative, Hip Hop, Country, Country Rap, Rap, Rock", "Time": "2:00 AM UTC", "Venue": "The Saddle Rack", "moreBioInfo": "Hometown- DeQueen Arkansas\n\nI take everything I grew up listening to and make it my own. I combine country, rap, rock and any other style you can imagine, throw it in the pot and eat whatever comes out. Some people don't like it, a lot of folks love it, regardless I'm me and that's all I know how to be. I guarantee you my show is better than the last one you attended, so come on out ? Preciate yall ?", "otherInfo": "No other event info available"}, {"Address": "San Jose, CA", "Artist": "Lilan Kane ", "ArtistImage": "https://photos.bandsintown.com/thumb/7335896.jpeg", "Coordinates": [-121.8261, 37.2751], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Pop, Jazz, Soul, R&b/soul, Rnb-soul", "Time": "2:00 AM UTC", "Venue": "San Jose Jazz - livestream", "moreBioInfo": "Lilan Kane (pronounced LEE - lawn) is an award winning singer-songwriter based in Oakland, CA. She released her album Love, Myself to a sold out crowd at Yoshi's Jazz Club. Her vintage-tinged soul sound flows through the heartfelt compositions, telling stories of love, loss, and self-discovery while they seamlessly blend R&B, funk, pop, and jazz. The Berklee College of Music alum recently performed in New Orleans at the French Quarter Festival and graced the Yoshi's stage again, this time with the dynamic Cosa Nostra Strings. They also performed at Undercover Presents: A Tribute to the Miseducation of Lauryn Hill at the Yerba Buena Center for the Arts in San Francisco. Other notable performances include the Fillmore Jazz Festival, San Jose Winter Jazz Fest, Great American Music Hall, Sweetwater Music Hall, The Mint LA, the Whisky A Go-Go, among others. She has opened for Hall & Oates, Sharon Jones, Trombone Shorty, and Morgan James. Lilan Kane (pronounced LEE - lawn) is an award winning singer-songwriter based in Oakland, CA who performs original music and covers in the pop, soul, and jazz genres.", "otherInfo": "Live Stream: https://www.facebook.com/sanjosejazz/?__tn__=kC-R&eid=ARAM2DnQHNwth4oClAocakM6DP8qdzf6aKGMHehpGgAOwxi1mqAz0O3mzPcMnARrrz5eaqBFncFmuQ82&hc_ref=ART0gVECetLavNlCWPA6OIqdK70KuLkhWJdtmHJKaVyI-oVlG2HNTdfKiBPJJLTgFqY&fref=nf&__xts__[0]=68.ARAHc1fAGWCbvj1owHuGShGXDUud4xMwi9O5grbCoOQOAPzSaQiRIW8QuxjwwucnIH3GnbfW6ZeSpQSbQs1RjetU68fB8nh1GUDSS-NK2rR7lWIgxUephJdg2FPiToUs9tUeXA3xmwRgONkil_7VAsOORUPlWo00hhmKYyk0tPCLsXxjn38whHhQ44pWfKbdIBHYPGMXoAtH9OqnFg1GI6PI2tGRE-UMaLV2g0znNxr4RRt1pbrss-r8pmx3X23WXUE318vXN_Ggl89iTXBoUyv9K9byqtPCV5Ck966ACAjey6-p0-8ViePJv6BGIoHysOpXtYNiBy5yRjV9uw"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "Shannon Hayden ", "ArtistImage": "https://photos.bandsintown.com/thumb/7942286.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Progressive Alternative, Indie & More, Electronic, Classical", "Time": "2:30 AM UTC", "Venue": "Mystic Theatre", "moreBioInfo": "\"Doing what is expected isn't something everyone does well. Following years of classical training at the highest level, Shannon Hayden's very non traditional interpretation of cello performance is an example of why that is a good thing. Running her instrument through more electronic gear and amplification than some metal band with a stolen credit card probably wasn't something anyone back at the conservatory had in mind, though it really shouldn't come as much of a surprise these days. Art has always found ways to embrace technology without becoming a slave to it and Shannon's compositions owe as much to her brilliant mastery of the cello itself as they do to the latest technical innovations which greatly expand the range and complexity of the instrument. Occasional heavy outbursts of distortion with elements bordering noise punk are matched with layers of lush ambiance combining both current and traditional styles with all the virtuosity of a player redefining our expectations of maturing young prodigies. Some musicians make you feel good about where music is headed and Shannon Hayden is one of them.\"", "otherInfo": "No other event info available"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "Ayla Nereo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8203379.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Acappella, Folktronica, Cinematic Folk, World Folk & Fusion, Cinematic Alt-folk, Female Vocals, Folk", "Time": "2:30 AM UTC", "Venue": "Mystic Theatre", "moreBioInfo": "Ayla Nereo is a voice for the planet, a beacon of light, a modern bard of beauty singing directly from her soul. With lyrical poetry splashing like dazzling paint across a canvas of sound, she builds layer upon layer of vocal melodies into majestic loop-pedal harmonies, weaving syncopated threads of guitar, kalimba, piano, and percussion into her live performances.\n\nAyla’s music is a genre unto its own, as she allows sounds to dance between vocal looping, produced beats, live drumming, orchestral string arrangements, Celtic melodies, and even dashes of hip-hop wordplay. With an uncanny ability to disarm and crack open the heart, Ayla’s lucid storytelling and magical presence rings with love, as she sings for the depth of our humanness, a truth beyond time and place, and the pure wonder of life itself.\n\nCalling us to listen deeper, her songs are elegant masterpieces of lucid storytelling, with lyrics ringing as anthems and mantras for hope, healing, and love.\n\nThough you’d never know it by witnessing her perform, Ayla grew up with a deep fear of singing. In her final year of college, songs began pouring through her, and it was only through the constant urging of those around her that she began to slowly share her music. Propelled by the songs themselves, Ayla’s journey of meeting those fears and singing through them has propelled her into the powerful performer she is today, touching an ever-widening global audience with the inspiring magic of her songs.\n\nA child schooled at home in the hills of Sonoma County, Ayla was raised on Cat Stevens, Bob Dylan, opera, classical music, traditional celtic songs, and ABBA -- influences which have deeply shaped her music. Touching on both the timeless and modern, she always rides the line between genres, so that her songwriting and sound ultimately cannot be compared to anyone else.\n\nDancing her own songs on stage as she sings them, her movement and presence gives the audience a permission to be wild, real, vulnerable, and alive. Every performance Ayla gives is its own inspired journey; an enchanting and poignant experience that holds you by the heart and doesn’t let go.\n\nAyla is releasing her 6th album in the spring of 2019 via Jumpsuit Records. Honing her artistry and craft over the years, Ayla has developed a loyal fanbase, one that has recently seen exponential growth into widening circles across the planet. The upcoming release of her phenomenal new album, \"By The Light of the Dark Moon\", marks a stepping-out into the world arena. With a nationwide tour supporting the album release, a full summer of notable festival appearances, and her second European tour on the horizon, Ayla's music is reverberating from a west-coast transformational niche into larger global audiences, to inspire and uplift the hearts of humanity. Her music has also recently seen rapid and increasing growth throughout Europe, as well as Canada, Australia, and dozens of other countries.\n\nTo date, Ayla has released 5 solo albums, 2 Wildlight albums (the collaboration project of Ayla and David Sugalski, aka The Polish Ambassador), and 3 collaboration albums.\n\n“A poet, musician, visionary and mystic, Ayla Nereo is an otherworldly artist who shares the fruits of her soul.” ~ The Huffington Post\n\n“[Ayla’s] relationship with the earth is imprinted in her music … thickly layered tracks where expansive and intriguing instrumentals serve as an intricate backdrop for her delicate and soft-spoken vocals.” ~ Billboard\n\n“I am here to receive songs that help us remember our origins, our incredible human potential, and our right relationship with all Life.”\n\n“We are born of dust and silence. We are made of ancient song.”", "otherInfo": "w/ Peia, Mikey Pauker"}, {"Address": "400 Eddy St, San Francisco, CA 94109", "Artist": "Theo Croker ", "ArtistImage": "https://photos.bandsintown.com/thumb/9178786.jpeg", "Coordinates": [-122.414392, 37.78382], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Jazz Fusion, Jazz, Funk, Hip Hop", "Time": "2:30 AM UTC", "Venue": "Black Cat", "moreBioInfo": "Producer, composer, & trumpeter Theo Croker is an adventurous musician whose adept skills find him at home playing standards, swinging post-bop, or more groove-oriented electric jazz. A native of Leesburg, Florida, Croker is the grandson of the late great jazz trumpeter Doc Cheatham. He began playing trumpet around age 11 after hearing Cheatham play in New York City, and by his teens was studying music at the Douglas Anderson School of the Arts in Jacksonville, Florida. From 2003 to 2007, Croker attended the music conservatory at Oberlin College. While at Oberlin, he was mentored by legendary trumpeter and educator Donald Byrd. Also during this time, he earned the Presser Music Foundation Award, which funded his debut album, 2006's Fundamentals. After graduating Oberlin, Croker relocated to China, where he took up residency at Shanghai's House of Blues. His 2009 album, In the Tradition, paid tribute to Cheatham.\n\nIn 2013, Croker returned to the States and began work on his third solo album, the Dee Dee Bridgewater-produced Afro Physicist. Released in 2014 on OKeh/Sony Masterworks Records, the Echo Award nominated album found him branching out stylistically, weaving elements of funk, Latin jazz, and hip-hop into his sound. In 2016, he delivered Escape Velocity, which found him delving deeper into a genre-bending, spiritually enlightened, funk-influenced jazz sound.\n\nUpon the album’s release, The Wall Street Journal heralded the album as “ timeless and of-the-moment”. His live performances, the Huffington Post lauded Croker’s band DVRKFUNK, saying they were “a tight front line that weave in serpentine precision and are backed by a powerful rhythm section that pushes the groove.” Outside of his solo career, Croker has lent his inimitable talents as composer, arranger and musician to J. Cole’s 2016 release on title track “4 Your Eyez Only”, as well as “For Whom the Bell Tolls” and “Ville Mentality”. He is also featured on Common’s newest album, “Black America Again.”\n\n\"Star People Nation\" Croker's new album is due to be released in October 2018 on Sony Masterworks.", "otherInfo": "No other event info available"}, {"Address": "270 Capistrano Rd #22,, Half Moon Bay, CA 94019", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/9046383.jpeg", "Coordinates": [-122.482887, 37.503929], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Comedy", "Time": "2:30 AM UTC", "Venue": "Hop Dogma Brewing Co.", "moreBioInfo": "Comedian", "otherInfo": "No other event info available"}, {"Address": "2424 Mariposa St, San Francisco, CA 94110", "Artist": "The Live Bawdy Storytelling Show ", "ArtistImage": "https://photos.bandsintown.com/thumb/9379356.jpeg", "Coordinates": [-122.407929, 37.763394], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Verdi Club", "moreBioInfo": "No artist bio available", "otherInfo": "Thursday, April 9th, 2020\n\nat the Verdi Club\n\n2424 Mariposa, San Francisco, CA\n\nRemember: Bang-O at 7:00 PM, Stories at 8:00 PM\n\nWant a sample of Bawdy?\n\nListen to the Bawdy Storytelling podcast at\n\nhttp://bit.ly/bawdypodcast\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nThis Evening of Stories, Songs & Sex Toys features:\n\n❤ Hosted by Sexual Folklorist Dixie De La Tour\n\n❤ Legendary Author/Speaker/Kinkster Race Bannon\n\n❤ Songs by Bawdy's brilliant cohort, Jefferson Bergey\n\n❤ Pitch your story to Dixie@BawdyStorytelling.com\n\n❤ Play Bang-O & WIN Prizes, just for making new friends\n\n❤ Bang-O Grand Prizes from Good Vibrations\n\n❤ Bawdy's new merchandise, FINALLY #BawdyGotMeLaid\n\n❤ Reserved Seating puts you right up front\n\n❤ Custom Bawdy Cocktails to help you get your flirt on #CBT #UnicornsButthole #EthicalSlut\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nFor Millions of Years, Sexual Folklorist & Podcast host Dixie De La Tour has brought the Nation’s Perverrati together & onto the Bawdy Storytelling stage to tell their own infamously true tales of lust, love, kinky collisions, gender redefinition, sexual identity, life-changing hook-ups, educational one-night stands & everything in between.\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nThe Original Sex + Storytelling series, featuring Real People & Rockstars sharing their Bona Fide Sexual Exploits, Live Onstage\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nAnd we know you're on FetLife, ya pervert. Join the Bawdy Storytelling group there!\n\nhttps://fetlife.com/groups/46341\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nPerformer Bios:\n\n❤ Dixie De La Tour is a sexual folklorist, professional storyteller, podcaster, teacher, coach, community builder and most of all, a facilitator. She is also the Founder, Curator & Host of the Award-winning and NSFW storytelling series, Bawdy Storytelling (“The Moth for Pervs” - LA Weekly, “The Original Sex and Storytelling series” - Playgirl) that’s been lauded for its transformational, relatable, empowering performances. This live stage series is currently headed into its 13th year, the groundbreaking Bawdy Storytelling podcast has had over 1.5 million downloads, plus it’s been acknowledged as a ‘Best Of’ Sex podcast from Forbes, GQ Magazine, Marie Claire, Uproxx, Daily Mail UK, Bustle and (twice!) by Esquire Magazine.\n\nDixie has been Sainted by the Sisters of Perpetual Indulgence (“Saint Kiss & Make You Tell”) for her work to reduce stigma and eliminate shame, and she recently became a Muppet. Discover more about Dixie De La Tour and Bawdy Storytelling at Facebook.com/BawdyStorytelling, on Instagram at https://www.instagram.com/bawdystorytelling on Twitter at @Bawdy and always at www.BawdyStorytelling.com\n\nIn addition to story and public speaking coaching for her own series, Dixie coaches for TEDx, Women in Technology, offers custom Brand Storytelling coaching, has led storytelling events in Libraries, teaches Storytelling for the Classroom and has been a featured teller for the National Storytelling Conference. Ultimately, this story-loving southerner is passionate about storytelling’s ability to keep people safe, reduce social anxiety and connect us with strangers. Stories help you find your people!\n\n❤ Kinky sex has been one of Race Bannon’s passions as a practitioner, organizer, writer, educator, commentator, activist and leader since his first explorations of the leather world starting in 1973. Race’s accomplishments include co-founder of the Kink Aware Professionals referral service; leader of The DSM Project that began to change how psychotherapy professionals view kink; author of the bestselling Learning The Ropes: A Basic Guide to Safe and Fun BDSM Lovemaking; founder of Daedalus Publishing Company, the first company dedicated to publishing nonfiction leather/SM/fetish books; prolific writer; former sex advice columnist; former producer and host of the first kink internet talk show Bound To Talk; past Board member of the National Coalition for Sexual Freedom, Community-Academic Consortium for Research on Alternative Sexualities, NLA International and Avatar Club Los Angeles; co-founder of NLA Los Angeles; and member of Chicago Hellfire Club, The 15 Association, and Society of Janus. Race is currently on the Board of the Leather Hall of Fame. Recently Race was inducted into the Society of Janus Hall of Fame. He is featured in the documentaries Vice and Consent, Out of the Darkness: The Reality of S&M and Folsom Forever, was a BDSM consultant for the movie Exit to Eden, and is currently an Executive Producer for Divine Deviance, an upcoming documentary about the global kink/BDSM/fetish scene. Race is also a popular speaker who has delivered the keynote address for a number of events. He has been awarded the 2006 National Leather Association International's Lifetime Achievement Award, 2010 Mister Marcus Hernandez Lifetime Achievement Award (Man) Pantheon of Leather Community Service Award, the 2011 Philip M. Turner Lifetime Achievement Award, the 2013 National Gay and Lesbian Task Force Creating Change Leather Leadership Award, 2014 San Francisco Bay Area Leather Alliance Co-Man of the Year (tie), and the 2016 NorCal/Northwest Regional Pantheon of Leather Award. You can read some of Race's writings at www.bannon.com or www.racebannon.com or in the Bay Area Reporter (ebar.com) where he is the leather/kink columnist.\n\n❤ Straddling the line between sentimental and sleazy, Jefferson Bergey blends gritty, soulful pop with elements of folk, blues, and country with a penchant for the ridiculous in his original compositions.\n\nThe Oakland based singer-songwriter performs his family-unfriendly music all over the Bay Area. He’s a frequent contributor, writing custom songs for the award-winning, San Francisco based, Bawdy Storytelling. As a solo acoustic act, Bergey's sound is akin to folky musical theater in a coffee shop...if the coffee shop also sold sex toys and sativa gummy bears. His polite vulgarity may not be for the very young and impressionable or the very old and conservative but he won’t tell you how to raise your kids or upset your grandparents.\n\nHe can be seen and heckled every Monday night at his Risqué residency at Scopo Divino in San Francisco. For well over two years straight, he’s put on a unique and interactive show where he plays original music and cover songs suggested by those in attendance who haven’t already left in disgust.\n\nBergey's music can be heard on the RISK! and Bawdy Storytelling podcasts. He has performed at The Independent, Sweetwater, Great American Music Hall, Jewish Community Center in SF, John Steinbeck Association, Special Olympics in Long Beach, Punchline SF, and SF Sketchfest.\n\nHis newest EP titled ‘Always Up (To Go Down)’ was originally written for Bawdy Storytelling and is flanked by a few of his ‘inter-lewds’, now fleshed out with piano, bass, and pedal steel. It also features the talents of Natalie Smith (Cape Weather) on vocals.\n\nwww.jeffersonbergey.com\n\nhttps://www.patreon.com/jeffersonbergey\n\nhttps://www.facebook.com/jefferson.bergey\n\nhttps://www.instagram.com/jeffersonbergey\n\n\n\n• No Refunds or Exchanges\n\n• Lineup Subject to Change\n\n• ASL Interpretation available with prior written notice. Contact BawdyStorytelling@gmail.com for more information\n\n• General Admission seating is first come, first served. We recommend you arrive when doors open for best seating (Reserved Seating guarantees you a seat right up front)\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nWinner of SFist's Best Storytelling Show, the SF Weekly’s Best of San Francisco & the LA Weekly’s Best Of Los Angeles (for Best Storytelling) & 2 Time Winner of the SF Bay Guardian’s Best of the Bay Award (Best Literary Event)\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\n“The Moth for Pervs” – LA Weekly\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\n“Dixie De La Tour’s scandalous, over-the-top Bawdy Storytelling series” – SF Weekly\n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nWant more Bawdy?\n\nwww.BawdyStorytelling.com\n\nTwitter: @Bawdy\n\n& at Facebook.com/BawdyStorytelling"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Kadavar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8848191.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Doom, Stoner, Rock, Doom Metal, 70s, Classic Rock", "Time": "3:00 AM UTC", "Venue": "The Chapel", "moreBioInfo": "For the few lucky bands who live to see a career blossom out of their passion, even fewer manage to avoid the hopeless creative stagnation that happens when hobby turns into ”work”. We all know that as soon as rock n roll starts to resemble going to the office, there\nare no winners – everybody's screwed. As the German trio KADAVAR – arguably the hardest working band in European rock – stand on the brink of releasing their fourth full length album, they look back at a seven year long career of doing things the other way around.\nRather than this being the time to start talking about how music is just another way of paying the bills, they could not be more in tune with the main reason anybody starts a band in the first place – liberation.\n“We used to put ourselves under a lot of pressure,” says guitarist and vocalist Christoph ‘Lupus’ Lindemann. “We didn't want to be just another rock band, we wanted to be the best.\nNow we are free from the idea that we need to hit the charts or fill big halls to become happy. To get to that point everyone involved needs mental maturity, and this satisfies me more than any full arena.”\nNot that they are strangers to neither chart positions nor sold out venues. After being formed in the German capital city back in 2010, the word of KADAVAR playing in a different league from their retro rock-labelled peers quickly spread worldwide, resulting not only in\naudiences growing past the 1000 mark on their many tours, but also in chart positions for their third and latest album »Berlin« – entering on position 18 in Germany and 21 in the US Heatseekers charts. Highly regarded as one of the most explosive live experiences on\ncontemporary rock scene, their secret seems to be boiled down and brewed from three ingredients: an accessible yet personalized brand of classic rock; a no-frills approach to everything they do (”minimal arrangement, maximum effect”); and that undeniable German\ntenacity, yet again.\n“Even in the early years there was somehow an implication that unless we gave it 120 per cent, nobody would ever recognise any of it,” says drummer Christoph ‘Tiger’ Bartelt. “That was one half. The other half was juveline over-confidence!” Him and Lupus both grew up working class, the latter in an over-achieving family of athletes,\nwhich fueled his competitive side (”in our family, the second best was the first loser”). Both studied sound engineering after high school, and met in the beer-drenched Berlin underground at night time, as you do. Inspiration struck when the new wave of retro rock flooded the scene in the mid-00s, and together they built KADAVAR on the foundation of a\nvintage sound with classic song structure – a conscious step away from the increasingly heavier stoner bands of the time (the name itself was inspired by the American underground heroes DANAVA). “If someone does a seven minute jam on one riff and sells it as something\ncool I think he is just too stupid to write a good song!” Lupus says. “We wanted to sound more like a heavy garage band. We still do, maybe now more than ever.”\nPersonality-wise, they couldn't be more different. Lupus is social and opinionated. An emotional straight-shooter, or ”East German” - as he himself sums it up. Where he wears his heart on his sleeve, Tiger on the other hand keeps his neatly tucked inside, only to be\nexposed to the outside world on stage. Where Lupus speaks, Tiger thinks.\n“It's not by chance that he calls himself Lupus - ”wolf”,” the drummer says. “He has killer instinct and he is a loyal warrior. He is impulsive and it somehow feels like he enjoys being uncomfortable. Getting on the same page with him requires a lot of friction and a strong\nstance. It sounds rough, but I really like it.“\n“Tiger takes the time it needs to really understand a situation and make a decision based on\nit. I trust him and rely on him and without him the band would be dead,” Lupus says. In between them two balances Simon ‘Dragon’ Bouteloup, the bassist who replaced the original member Phillip ‘Mammut’ Lippitz. There is nothing German about this Parisian bohemian. Simon spent his late teenage years drifting around Europe intuitively – just like\nhis style of playing – later ending up with the infamous French psychonauts in AQUA NEBULA OSCILLATOR. He moved to Berlin in 2012 to play with THE OATH, and joined KADAVAR two years later.\n“Simon is a really great, beloved person who changed the band so much. He has a totally different background music-wise, and also is attitude to life. If you don't give it time and learn\nhow to slow down and listen to him, you will never find out who he is. But if you do a whole new world opens up,” Lupus says. “His dedication to music is remarkable,” Tiger adds. “That's something I've always adored about him.”\nTogether the trio form a uniqe symbiose, challenging each other to fill the sonic space between them when the curtain goes up – and to grow even closer after it's gone down.\n“Being only three on stage does not give you much margin of error, so each and every one of us need to kick ass every night. But at least it gives everyone enough space to express himself, sonically and physically on stage,” Simon says.\nIn the beginning of 2017 the band prepared to start a new album cycle by literally rolling up their sleeves and building a brand new recording studio from scratch. Over 100 square\nmetres inside an industrial complex in the area of Neukölln in Berlin is now their creative haven and workplace alike, and this is where the follow-up to »Berlin« has started to take form.\n“We have been giving it quite a lot of thought, how we want to continue after the last album,” says Tiger. “Maybe I try not to only be a musician, but to think, write and play like an artist. It sounds corny, but I mean it in the way a brick layer differs from an architecht. Not to\nonly lay brick by brick, but create a nice vision of a house with different rooms.” Intentionally or not, the act of manual labor – like building a house in arrival of a new baby – gives a poetic layer to the album process. “It is a big challenge,” Simon says. “But also a positive\nperiod where we are able to question everything we've already established in order to move forward as a band. We would not respect ourselves and our followers by putting out just\nanother KADAVAR album. It needs to be different and hopefully better!“\nThey might have eased up on the competitive attitude, but don't believe for a second the\nhunger is gone. Take it from the wolf himself: “When you realize you have taken it to the next level, where you can live from music and see the world – you work your ass off to keep\nthat. What else should we do? We are useless in the normal world. And maybe it looks harder\nthan it is...“", "otherInfo": "KADAVAR at The Chapel"}, {"Address": "412 14th St, Oakland, CA 94612", "Artist": "Stay Out ", "ArtistImage": "https://photos.bandsintown.com/thumb/9136059.jpeg", "Coordinates": [-122.270302, 37.804256], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Punk", "Time": "3:00 AM UTC", "Venue": "The Golden Bull Bar", "moreBioInfo": "Stay Out is an American punk rock band from Oakland, CA consisting of Grant Pack (Vocals/Bass), Mason McGeorge (Vocals/Guitar), Nate Reynoso (Drums/Vocals), we live in a van down by the river.", "otherInfo": "Stay Out\nKill Your Ego\nLeftover Bowlskies\nSome Kind Of Nightmare\nDoors 8pm | $8 | 21+ Only"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Mantar ", "ArtistImage": "https://photos.bandsintown.com/thumb/6389332.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Black Metal Doom Punk", "Time": "3:00 AM UTC", "Venue": "The Chapel", "moreBioInfo": "two piece monster from northern germany. debut: \"death by burning\" recorded in early 2013. no fancy art production -> just raw display of power. the half german / half turkish band exists for not even a year.\ntrue battle hymns and sinister sounds of darkness. no gimmicks, no image, pure rage. bone crushin' like the berzerker's path. in spite of the fact no bassguitar has been used on the record, MANTAR manages to sound even meaner and heavier than a five piece band due to superior skills in general.\nflogging beats and blackened melodies meet feedback orgies and doom mayhem. get in touch for more information.", "otherInfo": "KADAVAR at The Chapel"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Ladama ", "ArtistImage": "https://photos.bandsintown.com/thumb/8044917.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "An international collective of women building community through sound.", "otherInfo": "LADAMA - DANCE FLOOR OPEN!"}, {"Address": "311 Broadway, Oakland, CA 94607", "Artist": "Tearful Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8619874.jpeg", "Coordinates": [-122.276005, 37.797178], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Dark Ambient, Dark Wave, Electronic, Synth Wave, Alternative", "Time": "3:00 AM UTC", "Venue": "Elbo Room Jack London", "moreBioInfo": "All Lyrics and vocals- Sky Lesco\nAll music and some vocals -Manuel Lozano\nWave Records, In the Dark Morning, LP, 2016\nInclub Records, Evocation,LP,2017", "otherInfo": "No other event info available"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Scott Amendola ", "ArtistImage": "https://photos.bandsintown.com/thumb/7596193.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Free Jazz, Jazz", "Time": "3:00 AM UTC", "Venue": "Ivy Room", "moreBioInfo": "Scott Amendola:\nDrummer/Composer/Bandleader/Educator\n“Amendola’s music is consistently engaging, both emotionally and intellectually, the product of a fertile and inventive musical imagination.” Los Angeles Times\n\n“If Scott Amendola didn't exist, the San Francisco music scene would have to invent him.” Derk Richardson, San Francisco Bay Guardian\n\n“Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.”Steven Raphael, Modern Drummer\n\n“...drummer/signal-treater Scott Amendola is both a tyrant of heavy rhythm and an electric-haired antenna for outworldly messages (not a standard combination).” Greg Burk, LA Weekly\n\nFor Scott Amendola, the drum kit isn’t so much an instrument as a musical portal. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. His closest musical associates include guitarists Nels Cline, Jeff Parker, Charlie Hunter, Hammond B-3 organist Wil Blades, violinists Jenny Scheinman and Regina Carter, saxophonists Larry Ochs and Phillip Greenlief, and clarinetist Ben Goldberg, players who have each forged a singular path within and beyond the realm of jazz.\n\nWhile rooted in the San Francisco Bay Area scene, Amendola has woven a dense and far-reaching web of bandstand relationships that tie him to influential artists in jazz, blues, rock and new music. A potent creative catalyst, the Berkeley-based drummer is the nexus for a disparate community of musicians stretching from Los Angeles and Seattle to Chicago and New York. Whatever the context, Amendola possesses a gift for twisting musical genres in unexpected directions.\n\nNels Cline maintains his long-running role in the alt-rock juggernaut Wilco, but the band’s long stretches of inactivity mean that he can also perform as a member of the Scott Amendola Band and a recently launched duo project (a tête-à-tête setting in which Scott thrives). Amendola continues to tour and record with the volatile instrumental band, The Nels Cline Singers, which is due for a follow up to 2014’s critically hailed, genre-obliterating Macroscope (Mack Avenue).\n\nIt’s not surprising that the Singers provided an early and essential forum for Amendola’s artful use of electronics, a small menagerie of devices that has found its way “into everything I do,” he says. “After years of experimenting I’m using them in a more expressive and confident way than ever before.”\n\nCline was still an underground LA legend in the mid-1990s when he first encountered Amendola and was “blown away,” he says. “There aren’t too many drummers on the West Coast who had his wide-ranging ability. Scott’s got some funk in him, a looser, sexy thing going on, and the flexibility to play free and different styles. He plays behind singer/songwriters and he rocks too.”\n\nScott also performs widely with his longtime sparring partner Wil Blades in the orchestral duo Amendola Vs. Blades. While they’ve honed a wide array of material, the project initially centered on their thrilling investigation of Duke Ellington and Billy Strayhorn’s “Far East Suite.” Their 2016 debut album Greatest Hits (Sazi Records) earned lavish critical praise, with the San Jose Mercury News hailing the duo for honing a “repertoire of groovelicious jazz for more than a decade, and they throw down the funk with fervor on a project that clocks in at the old-school LP length of 39 minutes, distilling some of their leanest, meanest, punchiest pieces.”\n\nNo project better displays Amendola’s big ears and musical ambitions than Fade To Orange a piece commissioned as part of the Oakland East Bay Symphony’s Irvine Foundation-funded New Visions/New Vistas Initiative. The roiling work premiered to critical acclaim at Oakland’s Paramount Theater on April 15, 2011. Determined to refine and document the piece, Amendola conducted a successful PledgeMusic crowd-funding campaign and recorded Fade To Orange at Berkeley’s storied Fantasy Studios with his original collaborators—his Nels Cline Singers bandmates (Cline and powerhouse bassist Trevor Dunn)—and the great Magik*Magik Orchestra.\n\n“The idea was really the Singers meet the Symphony,” Amendola says. “I wanted Trevor’s electric bass for that big contrast with the orchestra, and I conceived of the piece as a concerto for guitar. It was an amazing experience to premiere ‘Fade to Orange’ at the Paramount, but it was bittersweet after all that work. Like, that’s it? I wanted to see what else we could do with it.”\nHe released Fade to Orange on CD and vinyl on his label Sazi Records in 2015. The album includes four distilled, wildly imaginative remixes of “Fade to Orange” by Cibo Matto’s Yuka Honda, Mocean Worker, Beautiful Bells, and Deerhoof’s John Dieterich and Teetotum’s Drake Hardin.\n\nAmendola established his reputation as a bandleader in 1999 with the release of the acclaimed album Scott Amendola Band featuring the unusual instrumentation of Eric Crystal on saxophones, Todd Sickafoose on acoustic bass, Jenny Scheinman on violin, and Dave Mac Nab on electric guitar. By the time the quintet returned to the studio in 2003, Cline had replaced Mac Nab, contributing to the quintet’s combustible chemistry on the Cryptogramophone album Cry.\n\nCline was a crucial contributor on Amendola’s 2005 Cryptogramophone album Believe, which also features guitarist Jeff Parker (from the band Tortoise), Jenny Scheinman, and late bassist John Shifflett. Scott created his own label, SAZi Records, for his next release, 2010’s exquisite Lift, a trio session with Parker and Shifflett dedicated to his gossamer, bluesy ballads and ethereal soundscapes, with an occasional foray into surf rock deconstruction.\n\nIn some circles, Amendola is best known for his intermittent two-decade collaboration with seven-string guitar wizard Charlie Hunter, with whom he connected shortly after moving to the Bay Area in 1992. They went on to play together with John Schott and Will Bernard in the three-guitar-and-drums combo T.J. Kirk, which earned a Grammy nomination for its eponymous 1996 debut album. After years of occasional gigs, they teamed up again in 2011 in a tough and sinewy duo. They spent five years touring incessantly and released two acclaimed albums: 2012’s recession-inspired Not Getting Behind is the New Getting Ahead and 2013’s Pucker, the latter showcases Amendola’s melodically inspired tunes.\n\nIn 2014, looking for new avenues to distribute their music, Hunter and Amendola released four 5-track EPs, each focusing on the music of a particular artist or act. From the standards of Ellington and Cole Porter to the country hits of Hank Williams and seminal new wave tunes of The Cars, the duo transformed everything they encountered with their groove-centric sensibility.\n\nAs a sideman, Amendola has performed and recorded with a vast, stylistically varied roster of artists, including Bill Frisell, John Zorn, Mike Patton, Mondo Cane, John Scofield, Cibo Matto, John Dieterich from Deerhoof, Wadada Leo Smith, Bruce Cockburn, Madeleine Peyroux, Cris Williamson, Joan Osborne, Jacky Terrasson, Shweta Jhaveri, Phil Lesh, Sex Mob, Kelly Joe Phelps, Larry Klein, Carla Bozulich, Wayne Horvitz, Johnny Griffin, Julian Priester, Sonny Simmons, Pat Martino, Jim Campilongo, Bobby Black, Larry Goldings, Paul McCandless, Rebecca Pidgeon, and the Joe Goode Dance Group.\n\nBorn and raised in the New Jersey suburb of Tenafly, just a stone’s throw from New York City, Amendola displayed an aptitude for rhythm almost from the moment he could walk. His grandfather, Tony Gottuso, was a highly respected guitarist who performed with jazz luminaries such as Ella Fitzgerald, Louis Armstrong, Frank Sinatra, and Nat “King” Cole. A member of the original Tonight Show Band under Steve Allen, he offered plenty of support when Amendola began to get interested in jazz.\n“We used to play together a lot when I was a teenager,” Amendola says. “It had a huge impact on me to play with someone who was around when a lot of the standards that musicians like Miles Davis, John Coltrane, and Keith Jarrett play were written.”\n\nHis passion for music only deepened during his four years at Boston’s venerable Berklee College of Music, where it wasn’t unusual for him to practice for 12 hours a day. Drawing inspiration from fellow students such as Jorge Rossi, Jim Black, Danilo Perez, Chris Cheek, and Mark Turner, and studying with the likes of Joe Hunt, and Tommy Campbell, Amendola found his own voice rather than modeling himself after established drummers. Since 2014, Scott has served as Associate Professor at the University of California - Berkeley’s Jazz Program. His teaching in Jazz Percussion focuses on private instruction.\n\n\nOver a career spanning more than three decades, Amendola has forged deep ties across the country, and throughout the world. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist, and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. He’s never more than one degree away from a powerful musical hook-up.", "otherInfo": "Amendola vs. Blades! The duo is back @ The Ivy Room!\nYes indeed! Wil Blades and Scott Amendola return with the duo! Continuing to celebrate the release of our new record \"Everybody Wins\"! We'll see you there!"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Amendola vs. Blades ", "ArtistImage": "https://photos.bandsintown.com/thumb/6262426.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Funk, Polka, Rock, Avant-garde Jazz, Jazz", "Time": "3:00 AM UTC", "Venue": "Ivy Room", "moreBioInfo": "Amendola Vs. Blades\n\n“The breadth of what we do is so wide we don't have to think about it,” says longtime Bay Area drummer Scott Amendola, when talking about fellow local organist Wil Blades--the other half of the dynamic music duo known as Amendola vs. Blades. “The cool thing is we can play swingin’ old school jazz, funk and rock, African music, to playing free.” Such dynamic range would prove challenging for any band, let alone one consisting merely of eight limbs, two analog keyboards and a drum kit. But it’s a challenge the two friends have eagerly met gig after gig since their auspicious first show together, a performance of Duke Ellington’s “Far East Suite” as an organ and drums arrangement, ten years ago. “It’s all about keeping it fresh,”adds Amendola. “And keeping the audience engaged.” And keeping audiences sonically freshened and engaged throughout their ever-evolving decade-long stint hasn’t been a problem for this uncanny duo, who’ve imprinted plenty of nondescript juke joints: the High Sierra Music Festival, SF Jazz, and the iconic Fillmore, alike with their slithery sound, enough to make stalwart critics like the SF Chronicle’s Joel Selvin squawk: \"As for Wil Blades and Scott Amendola, these two Young Turks of the San Francisco jazz scene are bringing the organ-drum duo into the 21st century.\" And during this century, if you wanted to experience Amendola vs. Blades, you’d have to be one of the many thousands who’ve steadily showed up at one of their live duo adventures. Sure, you may have seen and/or heard these two in-demand session players as bandleaders in their own right, or as distinguished sidemen with the likes of Nels Cline, Charlie Hunter, John Zorn, Mike Patton, John Scofield, Idris Muhammad, Bernard Purdie, or Dr. Lonnie Smith. But if you wanted an album of just the two of them facing off as they do, literally on stage--you’d have to wait. Until now. Finally, Scott Amendola and Wil Blades bring us their long-anticipated debut album—Greatest Hits—on Sazi Records. Recorded over two nights in front of an intimate audience in a downtown Oakland club in June of last year, Greatest Hits is comprised of seven originals, tunes that had initially been composed and recorded by Scott and Wil for other projects. Depending who you ask, the album title could perhaps be construed as a mini-sampler of what’s to come, or perhaps a facetious statement of what was. The germ for the album took shape nearly two years ago. Adds Scott, “We always talked about it, but our schedules never lined up due to both of us being heavily on the road. As other projects ended, we actually had time to take it seriously.”Blades adds, “The thing about live recording was double-fold. For us playing as a duo is very loose and fun, so the best way to capture that was live--the vibe of a studio can make you feel restrained under pressure. A loose gig is a better representation of how we play our stuff, which is improvising.”On Greatest Hits, such improvisation creatively steers the duo through a scenic tour of music genres, as each artist pushes and pull the other toward unanticipated discovery, all the while powered by the heavy grooves laid down by Blades’ mastery of the Hammond organ, and Hohner Clavinet, and anchored by Amendola’s rhythmic drum array. “Most organ players are piano players first,\n\norgan players second. But Wil’s the opposite. His relationship to the organ is deeper than anyone I’ve ever heard”, say Amendola. In addition to Hammond organ, (and requisite Leslie speaker), Blades doubles his keyboard arsenal with the distinct sound of a Clavinet, one he spent a summer tediously restoring. “It literally has my blood, sweat and tears in it,” laughs Wil. “It opens up more sonic possibilities, and just adds another color texture to the mix.”The seven tunes on Greatest Hits impresses with its own set of colors and textures. From the fast boogaloo of “Lima Bean,” to the New Orleans 2nd line vibe of “32nd St.”, and “Slow Zig,” (a tribute to Meters legend Zigaboo Modeliste); the complex 6/8 rhythms of the Ethiopian-inspired “Addis”, to the afrobeat-centric homage via “Oladipo”, to Fela’s right (and left) hand man, wunderkind drummer Tony Allen; or from the soulful songs dedicated to their respective daughters in “Deep Eyes”, and “Mae Mae.”It’s a range Amendola vs. Blades is uniquely suited to express. “I like playing tunes,” the drummer says. “I like the idea of there being a structure to launch from, and being a duo means there are a lot of possibilities harmonically and rhythmically. Neither one of us knows what we are gonna do, and that is exciting both for us, and the audience.”\n\nPress\n\n\"The Amendola vs Blades duo has firmly established itself as one of the liveliest acts in the Bay Area.\"\n- Jazz Observer\n\n“Sometimes it just ridiculous how much sonic space Scott Amendola and Wil Blades alone can fill up in a room. Freakishly funky and soul satisfying, this dynamic duo push the limits on their Greatest Hits, while having too much fun doing it.”\n- Something Else Reviews\n\n“The music itself is joyfully fun as well: yes, it’s jazz, but in true organ-combo fashion it’s jazz that is deeply infused with funk.”\n– CD HotList\n\n“Drummer Scott Amendola and organist Wil Blades create a rich sound that can turn on a dime, exploring everything from Duke Ellington suites to funk, bebop and rock.”\n- Jazzschool\n\n\"Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.\"\n- Modern Drummer Magazine\n\n“Yeah, he does it...he’s on it. He is the future to carry on the legend, the legacy of the organ, [of] the B-3.”\n- Dr. Lonnie Smith Pioneer and Legend of the Hammond B-3 Organ", "otherInfo": "Please join us for a night of music with Scott Amendola and Wil Blades!"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Damian Lazarus ", "ArtistImage": "https://photos.bandsintown.com/thumb/8072672.jpeg", "Coordinates": [-122.419248, 37.768875], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "House & Deep House, House", "Time": "4:00 AM UTC", "Venue": "Public Works", "moreBioInfo": "Since the moment he spun his first record, Damian Lazarus’s mission has been a clear and urgent one: to blow away the mediocre, the over-inflated, the obsolete; to seek out and celebrate the energetic, the important, the new. Always rebelling, always going places.\n\n\"…and to have fun in the process. Playing around with different styles and ideas is what I do best,\" Lazarus explains.\n\nDriven by an almost childlike curiosity, a vivid imagination and wicked sense of humor, he’s used his role as a DJ, label owner and now musician to nurture and share the most exciting and experimental music on the planet. Drawn to the darkness, but buoyed by the light, ever ready to embrace new ideas and different perspectives on music and the dancefloor, Lazarus is always ahead of the curve, with a wry smile on his face and a neat trick up his sleeve, How many DJs do you know who’ve played ‘Reviewing The Situation (from the Oliver! soundtrack, no less) half-speed to a jubilant crowd at DC10 in Ibiza. How many DJs do you know who’ve received a sitting ovation on the dancefloor?", "otherInfo": "Damian Lazarus (extended set)"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "The Crooked Stuff ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440872.jpeg", "Coordinates": [-122.437364, 37.774222], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Electronic Rock, Electro, Funk", "Time": "4:00 AM UTC", "Venue": "Madrone Art Bar", "moreBioInfo": "The Crooked Stuff is a heavy electro funk sound system from San Francisco. Their Moog, drum & bass driven sound creates a thick and beat heavy vibe for vocalist Tom G’s sultry and off-kilter mic work. A new band on the scene, The Crooked Stuff has rapidly gained a fan base by sharing stages with Dumpstaphunk, The Nth Power, Tank & The Bangas, Lyrics Born, Monophonics, Fishbone, Leo Nocentelli and D.J. Williams’ Shots Fired. Their live shows are a captivating sonic and visual experience that should be on your list to catch!", "otherInfo": "9pm DJ\n10pm The Crooked Stuff\nFree!"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "The Lucky Losers ", "ArtistImage": "https://photos.bandsintown.com/thumb/9941009.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Thu Apr 9 2020", "EventDate": "2020-04-09", "Genre": "Blues, Soul-blues, Blues Gospel, Blues-rock, Jazz Blues", "Time": "4:30 AM UTC", "Venue": "The Saloon", "moreBioInfo": "Winner of independent Blues Award for “Best Blues-Soul Artist of 2019,” The Lucky Losers’ music is a throwback to the hybrid of soul, blues, rock, gospel, and country that emerged in the late 1960’s with impassioned vocals, electrifying vocal interplay, and some powerful harmonica. Described as “the finest light-skinned female blues vocalist in the U.S” (Real Blues/2010), fiery Dallas-born entertainer Cathy Lemons has a velvet voice with a gritty edge and the rebel conviction of a woman risen from the ashes. New Jersey native Phil Berkowitz \"has earned renown as one of the West Coast’s most distinctive harp players, as well as for his sharp, resonant tenor\" (Living Blues/ 2018). Based In San Francisco and accompanied by a dynamic four-piece ensemble, The Lucky Losers have been nominated for a total of 15 awards since 2015. They have travelled to 33 states in the U.S. and have completed 8 national tours.", "otherInfo": "No other event info available"}, {"Address": "1 Broadway, Oakland, CA 94607", "Artist": "Afroholix ", "ArtistImage": "https://photos.bandsintown.com/thumb/6938097.jpeg", "Coordinates": [-122.27704, 37.79515], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Hip Hop, Jazz, Funk, Soul", "Time": "1:00 AM UTC", "Venue": "Lungomare", "moreBioInfo": "Afroholix blends Funk, Soul and Jazz improv from deep outer space to make the mix just right. Featuring some of the Bay's top talent, Afroholix combines many different genres of Black music to make something beautiful, funky and fresh. Every show is a unique event. We drop Soul, Funk, Hip Hop and Jazz with love and soulful improvisation to make each night a special one. Born and raised from Oakland's rich musical legacy, Afroholix began it's journey in early 2015 and we've been steady mobbing since then. Can't stop won't stop! Influenced by Miles, Jimi, Sade, classic Hip Hop and golden era Jazz, we do our thing and make it funky!", "otherInfo": "No other event info available"}, {"Address": "1828 Wetmore Rd, Livermore, CA 94550", "Artist": "Tammy Byerly ", "ArtistImage": "https://photos.bandsintown.com/thumb/8580176.jpeg", "Coordinates": [-121.770589, 37.645417], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Acoustic, Pop Rock, Pop", "Time": "1:00 AM UTC", "Venue": "Las Positas Vineyards", "moreBioInfo": "Tammy is a performing solo artist from the San Francisco Bay Area.", "otherInfo": "Las Positas Vineyards 2020 8th Annual Evening in the Vineyards Concert Series\n\nMusic from 6-9PM\n\nTickets available now!"}, {"Address": "2074 Second St, Livermore, CA 94550", "Artist": "Nick Tyrrel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9116756.jpeg", "Coordinates": [-121.769989, 37.680587], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "1:30 AM UTC", "Venue": "Monica's Livermore", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Alanna Royale ", "ArtistImage": "https://photos.bandsintown.com/thumb/9946122.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Funk, Soul, R&b", "Time": "2:00 AM UTC", "Venue": "The Independent", "moreBioInfo": "Alanna Royale makes classic-minded R&B and soul music for the modern age. It's a sound rooted in big melodies, blasts of brass, percussive punch, and old-school grooves, with songs that shine a light not only on frontwoman Alanna Quinn-Broadus' larger-than-life voice, but her songwriting chops, too.\n\nThe band formed in Nashville, where Alanna and guitarist Jared Colby relocated after cutting their teeth as working-class musicians in Boston. Once in Tennessee, they teamed up with drummer Matt Snow, and bassist Gabriel Golden, forming a core lineup that often swells to as many as ten members -- including backup vocalists and a two-piece horn section -- in concert. Together, the band looked beyond Nashville's country-filled past and, instead, took inspiration from Motown's soul, Stax's funky strut, and rock & roll's rebellion. Tattooed, brash, and unapologetically unique, they stood out in a town dominated by Americana music, charting a unique course whose highlights have since included an appearance at Bonnaroo, a string of cross-country shows supporting acts like Lee Fields and St. Paul and the Broken Bones, and an audience that celebrates the band's diversity.\n\nOn their fourth release, 2018's So Bad You Can Taste It, Alanna matches the brassy spirit of the band's previous records — including their full-length debut, Achilles — with rare vulnerability. There's still plenty of soulful stomp here, from the upbeat sweep of the record's lead single, \"I Know,\" to the funky fire of \"Giving It All Away.\" There's also a more mature, sober look at the demands thrust upon independent artists — or anyone's who's willing to chase down an uncertain horizon, no matter how rough the journey may be. With songs that examine the midpoint between desperation and drive, So Bad You Can Taste It is the band's most genuine work to date.\n\n\"There are mountains and valleys to any journey, and this record is about being in the valley,\" explains Alanna Quinn-Broadus. \"It's about the low moments. It's basically the opposite of someone's Instagram feed, because it's not a highlights reel. It's just real.\"\n\nLow moments notwithstanding, So Bad You Can Taste It marks a creative high for Alanna Royale, whose members recorded the record's six songs with producer Kelly Finnigan and engineer Mindy Watts across multiple studios. Joining them were guests like trombonist Nadav Nirenberg -- known for his work alongside artists like Wyclef Jean, Breakdown Brass, and Wu Tang -- as well as Kirk Donovan, Meggan Utech, and Alexis Saski. Working with this expanded crew, Alanna Royale carved out a song-based sound that targeted not only their audience's dancing shoes, but their heads and hearts, too. Songs like the powerful, poignant ballad \"I Used to Dream\" were reworked multiple times, resulting in a record that's nuanced, heartfelt, and unafraid to show off its own scars.\n\n\"The title, So Bad You Can Taste It, says it all,\" Alanna explains. \"This record is all about the idea of something that's in front of you, and you can see it and feel it, but it's just out of reach. That thing can be your sanity or your sobriety or your success. I sometimes think it's harder to see the light at the end of the tunnel, rather than not seeing any light at all. Once you know the possibility of light is there, you have no option but to go after it. That can be really hard and really dangerous…which makes it really worthwhile to sing about.\"", "otherInfo": "We're SO excited to announce that we'll be hittin' the west coast for the first time to support our brothers in Monophonics and the release of their new record \"It's Only Us\"! More information can be found at www.alannaroyale.com."}, {"Address": "17533 Santa Cruz Hwy, Los Gatos, CA 95033", "Artist": "The Summit Sisters ", "ArtistImage": "https://photos.bandsintown.com/thumb/9081833.jpeg", "Coordinates": [-121.988667, 37.214182], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "The Cats", "moreBioInfo": "The Summit Sisters is an all-female rock/pop/folk cover band. Their repertoire is a well-balanced mix of sing-alongs and upbeat dance music which span the decades from the 60s to the popular songs of today. The fun rhythms and perfectly blended harmonies of this band will surely get you up on your feet!", "otherInfo": "No other event info available"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Napalm Death ", "ArtistImage": "https://photos.bandsintown.com/thumb/10006429.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Danny Herrera - Drums, Mitch Harris - Guitar / Vocals, Shane Embury - Bass, Mark Barney Greenway - Vocals", "Time": "2:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "What makes NAPALM DEATH so special? Well, let’s think back 30 years: Would you have thought that a grindcore band from Birmingham would ever make it into the official album charts with some of the most infernal noise ever put on tape, enter the Guinness book for the shortest song ever recorded or appear in a prominent UK TV series named “Skins”? That it would be part of an Alice Cooper hosted episode of BBC’s Never Mind the Buzzcocks to guess from a couple of look-alikes who is the singer in NAPALM DEATH? Could you have ever imagined a down-to-earth lad named Mark “Barney” Greenway, a soccer fan (Aston Villa F.C.), vegetarian, prog metal freak and one of music history’s most renowned representatives of “cookie monster” style vocals would become a personality within the extreme music realm that is not about beer-drinking and hell-raising but synonymous with sounding hard while being smart? Well, that is where we are at now. From filthy, sweaty rehearsal rooms and tiny clubs and pubs NAPALM DEATH has conquered every music festival you can think of and toured through corners of the world a lot of bands would not even dare to tour while becoming famous for combining brutal music with political engagement and ethical values beyond the usual cliché of sex, drugs & rock n roll. And, as most fans will be delighted to hear, this remarkable story is far from being over…\n\nFourteen albums in (not counting the cover-platter “Leaders…Part 2”) three decades and NAPALM DEATH remain the leaders of the grindcore / death metal world, once again showing the upstarts how it's done. Not content to simply wear the term “legendary,” the band has once again raised the bar on what it takes to remain at the top of the heap with its highly anticipated new album “Utilitarian”. While their past roster reads like a who's who of extreme metal royalty, including Lee Dorrian (Cathedral), Bill Steer (Carcass), Justin Broadrick (Godflesh) and the late Jesse Pintado (Terrorizer) to name a few, it's the current line-up of Mark \"Barney\" Greenway (vocals), Mitch Harris (guitars), Shane Embury (bass), and Danny Herrera (drums) that has kept the legend alive and seething. “Utilitarian” is the follow-up to the band’s much lauded 2009 album, “Time Waits For No Slave”, and sees the quartet return in expected raw and uncompromising fashion.\n\nIn the wake of a gruelling international tour schedule for “Time Waits For No Slave”, NAPALM DEATH finally got down to writing for “Utilitarian” in early 2011. It was recorded over the course of the year at Parlour Studios in Northamptonshire, UK with producer Russ Russell monitoring the mayhem, finally mixed and mastered in November. The end result is vicious and chaotic, but Greenway notes that “the ever-present darker, more ambient side of Napalm (references: Swans, My Bloody Valentine, Birthday Party et al) has now gotten faster, too – or at least the tempo of it varies so it’s not just exclusively slow and mournful. This gives it an extra, obtuse dimension. And hopefully people get lost in the frantic thickness of it.”\n“Utilitarian” runs the gamut from straight-ahead violence and force to pure, undiluted NAPALM DEATH-induced chaos that overall provides a well-rounded bloodletting that's not for the weak and also confronts the listener with such surprising moments as the sax passages by none other than John Zorn on ‘Everyday Pox’ or choral-like clean sections in ‘Fall On Their Swords’ or ‘Blank Look About Face’. The latter is a perfect bridge to the album’s outspoken lyrical content as it viciously attacks politicians’ opportunistic talk that according to Greenway only knows one goal: “Say anything to tame a crowd - whether it is sycophantic praise, bullshit morality or rabble-rousing power-speak - as long as they can cling on to their place in the hierarchy.”\nTrue to the band’s tradition of spitting gallons of verbal venom, “Utilitarian” is an in-your-face razor-edged platter of social, cultural and political commentary. Far from being a placard-waving “cause” band, the quartet offer up personal views on the degeneration of society ('Everyday Pox'), the arms trade ('Fall On Their Swords'), sexual and gender expression (‘Gag Reflex’), the environment ('Order Of Magnitude') and aspects of everyday life for the common man ('Collision Course', 'Think Tank Trials') revealing Barney’s understanding of what to do with your life: “We have a finite period of existence that is all too easy to waste, and ultimately we all deserve happiness and contentment.” The bottom line is: Think for yourself, liberate yourself and don’t end up feeding the machine that all too willingly eats you up.\n\nUltimately, NAPALM DEATH are special because they never sacrificed their ideals for anything mundane, will continue pleasing their fans with a stunning record named “Utilitarian” and ceaseless touring activities in support of its release while provoking world leaders with all the rage and criticism you can squeeze into a song. Extreme music’s raised fist is back!", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Beabadoobee ", "ArtistImage": "https://photos.bandsintown.com/thumb/9247760.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "London,United Kingdom", "Time": "2:00 AM UTC", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "95 Linden St, Oakland, CA 94607", "Artist": "Phil Johnson and Roadside Attraction Comedy and Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/6401870.jpeg", "Coordinates": [-122.287857, 37.79966], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Humor, Comedy, Comedy Rock, Standup Comedy, Funny", "Time": "2:00 AM UTC", "Venue": "Campovida Taste of Place", "moreBioInfo": "Phil Johnson is a man who gets mistaken for a woman, but only by those not paying attention. That revelation kicks off a battle for self-awareness where comedy and music are the weapons of choice. It’s a battle that has taken Phil to such esteemed festivals as the Edinburgh Fringe and Sundance Film Festivals and the Top 8 Finals of the World Series of Comedy.\n\n“I’ve always been the guy who isn’t quite what people expect,” says Phil. Using that experience, Phil pokes holes in the medical marijuana argument, discusses being a white guy at a hip hop show (and the innocent gestures that can get him in trouble), and reveals why Hawaii isn’t the paradise we think it is.\n\nFrom Shakespearean bees to redneck vampires to anthropomorphic cell phones with weight issues, Phil Johnson fills the stage with quirky characters that combine social satire with absurdist flights of fancy. Then the guitar comes out and kicks the show into an even higher gear with songs about the bright future (and dark past) of babies and what he would do if he woke up one morning as an actual woman.\n\nOn stage, Phil’s playful humor and likeable, endearing manner allow him to shake things up without antagonizing the audience. In the end we can only be who we are, try to understand others, and hope they understand us.", "otherInfo": "Ticket Price $20 | Age Restriction 21+"}, {"Address": "2001 Gayley Rd, Berkeley, CA 94720", "Artist": "Slenderbodies ", "ArtistImage": "https://photos.bandsintown.com/thumb/8107243.jpeg", "Coordinates": [-122.25063, 37.86976], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Alternative, Indie Pop", "Time": "2:00 AM UTC", "Venue": "The Greek Theatre Berkeley", "moreBioInfo": "The California-based duo met while attending university, and came together as a creative force 3 years later. The two wrote, recorded and produced their debut album “Sotto Voce” over the span of a month and 380 miles. The result was an emotionally impactful, sonically soft collection of songs, with intricate airy guitar work complemented by gentle vocals and present drums. With vivid imagery at the forefront of vocal waves, the Slenderbodies paints portraits of siren songs, sultry nights with foreign lovers, lost romance, and home.\n\nAfter almost a year, Slenderbodies present their second release, Fabulist. Embark on a journey away from home, whisked out to sea, floating across the ocean of the mind. Out now on Majestic Casual Records.", "otherInfo": "No other event info available"}, {"Address": "1710 Mission St, San Francisco, CA 94103", "Artist": "Mod Sun ", "ArtistImage": "https://photos.bandsintown.com/thumb/9690084.jpeg", "Coordinates": [-122.420383, 37.769717], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Hip Hop", "Time": "2:00 AM UTC", "Venue": "Brick & Mortar Music Hall", "moreBioInfo": "My entire biography is my story, my story is my music, listen to my story > http://modsun.com", "otherInfo": "No other event info available"}, {"Address": "390 Capistrano Rd, Half Moon Bay, CA 94019", "Artist": "Sunny And The Black Pack ", "ArtistImage": "https://photos.bandsintown.com/thumb/8910643.jpeg", "Coordinates": [-122.485383, 37.50414], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Rock, Soul, R&b, Blues, Jazz Blues", "Time": "2:00 AM UTC", "Venue": "Half Moon Bay Brewing Company", "moreBioInfo": "Since 2015, Sunny And The Black Pack have been building a reputation as true visionaries in the music scene. Starting out creating music and playing gigs in the San Francisco area, Sunny And The Black Pack quickly built a devoted fanbase. Rocking dance floors and opening minds ever since, the band draws crowds from far and wide, and continues to spread musical light in every new destination. Get in touch to learn more about the band and upcoming gigs.", "otherInfo": "7-10pm"}, {"Address": "924 Gilman St, Berkeley, CA 94706", "Artist": "Ultra Q ", "ArtistImage": "https://photos.bandsintown.com/thumb/9248857.jpeg", "Coordinates": [-122.299296, 37.879505], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Guitar Music, Rock, Alt-rock, Pop", "Time": "2:00 AM UTC", "Venue": "924 Gilman", "moreBioInfo": "Ultra Q is an American rock band formed in Oakland, California in 2019. Led by singer/songwriter Jakob Armstrong (guitar, vocals), the group originally began as a trio with brothers Chris Malaspina (drums) and Enzo Malaspina (guitar). Kevin Judd (bass guitar) was added shortly after. Ultra Q draws on a mix of influences to create their own brand of Rock and guitar music.", "otherInfo": "back in the bay :)"}, {"Address": "859 O'farrell St, San Francisco, CA 94109", "Artist": "Napalm Death ", "ArtistImage": "https://photos.bandsintown.com/thumb/10006429.jpeg", "Coordinates": [-122.418818, 37.784796], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Danny Herrera - Drums, Mitch Harris - Guitar / Vocals, Shane Embury - Bass, Mark Barney Greenway - Vocals", "Time": "2:00 AM UTC", "Venue": "Great American Music Hall", "moreBioInfo": "What makes NAPALM DEATH so special? Well, let’s think back 30 years: Would you have thought that a grindcore band from Birmingham would ever make it into the official album charts with some of the most infernal noise ever put on tape, enter the Guinness book for the shortest song ever recorded or appear in a prominent UK TV series named “Skins”? That it would be part of an Alice Cooper hosted episode of BBC’s Never Mind the Buzzcocks to guess from a couple of look-alikes who is the singer in NAPALM DEATH? Could you have ever imagined a down-to-earth lad named Mark “Barney” Greenway, a soccer fan (Aston Villa F.C.), vegetarian, prog metal freak and one of music history’s most renowned representatives of “cookie monster” style vocals would become a personality within the extreme music realm that is not about beer-drinking and hell-raising but synonymous with sounding hard while being smart? Well, that is where we are at now. From filthy, sweaty rehearsal rooms and tiny clubs and pubs NAPALM DEATH has conquered every music festival you can think of and toured through corners of the world a lot of bands would not even dare to tour while becoming famous for combining brutal music with political engagement and ethical values beyond the usual cliché of sex, drugs & rock n roll. And, as most fans will be delighted to hear, this remarkable story is far from being over…\n\nFourteen albums in (not counting the cover-platter “Leaders…Part 2”) three decades and NAPALM DEATH remain the leaders of the grindcore / death metal world, once again showing the upstarts how it's done. Not content to simply wear the term “legendary,” the band has once again raised the bar on what it takes to remain at the top of the heap with its highly anticipated new album “Utilitarian”. While their past roster reads like a who's who of extreme metal royalty, including Lee Dorrian (Cathedral), Bill Steer (Carcass), Justin Broadrick (Godflesh) and the late Jesse Pintado (Terrorizer) to name a few, it's the current line-up of Mark \"Barney\" Greenway (vocals), Mitch Harris (guitars), Shane Embury (bass), and Danny Herrera (drums) that has kept the legend alive and seething. “Utilitarian” is the follow-up to the band’s much lauded 2009 album, “Time Waits For No Slave”, and sees the quartet return in expected raw and uncompromising fashion.\n\nIn the wake of a gruelling international tour schedule for “Time Waits For No Slave”, NAPALM DEATH finally got down to writing for “Utilitarian” in early 2011. It was recorded over the course of the year at Parlour Studios in Northamptonshire, UK with producer Russ Russell monitoring the mayhem, finally mixed and mastered in November. The end result is vicious and chaotic, but Greenway notes that “the ever-present darker, more ambient side of Napalm (references: Swans, My Bloody Valentine, Birthday Party et al) has now gotten faster, too – or at least the tempo of it varies so it’s not just exclusively slow and mournful. This gives it an extra, obtuse dimension. And hopefully people get lost in the frantic thickness of it.”\n“Utilitarian” runs the gamut from straight-ahead violence and force to pure, undiluted NAPALM DEATH-induced chaos that overall provides a well-rounded bloodletting that's not for the weak and also confronts the listener with such surprising moments as the sax passages by none other than John Zorn on ‘Everyday Pox’ or choral-like clean sections in ‘Fall On Their Swords’ or ‘Blank Look About Face’. The latter is a perfect bridge to the album’s outspoken lyrical content as it viciously attacks politicians’ opportunistic talk that according to Greenway only knows one goal: “Say anything to tame a crowd - whether it is sycophantic praise, bullshit morality or rabble-rousing power-speak - as long as they can cling on to their place in the hierarchy.”\nTrue to the band’s tradition of spitting gallons of verbal venom, “Utilitarian” is an in-your-face razor-edged platter of social, cultural and political commentary. Far from being a placard-waving “cause” band, the quartet offer up personal views on the degeneration of society ('Everyday Pox'), the arms trade ('Fall On Their Swords'), sexual and gender expression (‘Gag Reflex’), the environment ('Order Of Magnitude') and aspects of everyday life for the common man ('Collision Course', 'Think Tank Trials') revealing Barney’s understanding of what to do with your life: “We have a finite period of existence that is all too easy to waste, and ultimately we all deserve happiness and contentment.” The bottom line is: Think for yourself, liberate yourself and don’t end up feeding the machine that all too willingly eats you up.\n\nUltimately, NAPALM DEATH are special because they never sacrificed their ideals for anything mundane, will continue pleasing their fans with a stunning record named “Utilitarian” and ceaseless touring activities in support of its release while provoking world leaders with all the rage and criticism you can squeeze into a song. Extreme music’s raised fist is back!", "otherInfo": "No other event info available"}, {"Address": "2147 Broadway, Oakland, CA 94612", "Artist": "Tiffany Austin Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8698793.jpeg", "Coordinates": [-122.267555, 37.810801], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "2:30 AM UTC", "Venue": "The Sound Room", "moreBioInfo": "♥, swing & soul\nwww.tiffanyaustinmusic.com", "otherInfo": "No other event info available"}, {"Address": "400 Eddy St, San Francisco, CA 94109", "Artist": "Theo Croker ", "ArtistImage": "https://photos.bandsintown.com/thumb/9178786.jpeg", "Coordinates": [-122.414392, 37.78382], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Jazz Fusion, Jazz, Funk, Hip Hop", "Time": "2:30 AM UTC", "Venue": "Black Cat", "moreBioInfo": "Producer, composer, & trumpeter Theo Croker is an adventurous musician whose adept skills find him at home playing standards, swinging post-bop, or more groove-oriented electric jazz. A native of Leesburg, Florida, Croker is the grandson of the late great jazz trumpeter Doc Cheatham. He began playing trumpet around age 11 after hearing Cheatham play in New York City, and by his teens was studying music at the Douglas Anderson School of the Arts in Jacksonville, Florida. From 2003 to 2007, Croker attended the music conservatory at Oberlin College. While at Oberlin, he was mentored by legendary trumpeter and educator Donald Byrd. Also during this time, he earned the Presser Music Foundation Award, which funded his debut album, 2006's Fundamentals. After graduating Oberlin, Croker relocated to China, where he took up residency at Shanghai's House of Blues. His 2009 album, In the Tradition, paid tribute to Cheatham.\n\nIn 2013, Croker returned to the States and began work on his third solo album, the Dee Dee Bridgewater-produced Afro Physicist. Released in 2014 on OKeh/Sony Masterworks Records, the Echo Award nominated album found him branching out stylistically, weaving elements of funk, Latin jazz, and hip-hop into his sound. In 2016, he delivered Escape Velocity, which found him delving deeper into a genre-bending, spiritually enlightened, funk-influenced jazz sound.\n\nUpon the album’s release, The Wall Street Journal heralded the album as “ timeless and of-the-moment”. His live performances, the Huffington Post lauded Croker’s band DVRKFUNK, saying they were “a tight front line that weave in serpentine precision and are backed by a powerful rhythm section that pushes the groove.” Outside of his solo career, Croker has lent his inimitable talents as composer, arranger and musician to J. Cole’s 2016 release on title track “4 Your Eyez Only”, as well as “For Whom the Bell Tolls” and “Ville Mentality”. He is also featured on Common’s newest album, “Black America Again.”\n\n\"Star People Nation\" Croker's new album is due to be released in October 2018 on Sony Masterworks.", "otherInfo": "No other event info available"}, {"Address": "1 Old Rancheria Rd, Nicasio, CA 94946", "Artist": "Junk Parlor ", "ArtistImage": "https://photos.bandsintown.com/thumb/8142032.jpeg", "Coordinates": [-122.69817, 38.06214], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Rock, Junk", "Time": "2:30 AM UTC", "Venue": "Rancho Nicasio", "moreBioInfo": "JUNK PARLOR Biography A galvanizing force on the Bay Area indie rock scene since launching serendipitously in 2013, Junk Parlor is that crazy-rare band whose vibe is so driven by joyful schizophrenia that it transcends easy genre trappings. Born from the wild musical wanderings of Jason Vanderford, renowned for his five years recording and touring with gypsy jazz sensation The Hot Club of San Francisco, their energizing musical collage includes 50’s rock and roll rumbling atop gypsy rhythms, a bit of Gipsy Rhumba, tango, Eastern Euro/Hungarian music, bellydance, punk…Vanderford was raised on “rock and roll and punk and everything under the sun,” so other sounds are certain to appear as the hybrid junk rockers continue their jam. The songs on their mostly vocal 2013 debut Wild Tones and predominantly instrumental follow-up Melusina (2015) have earned them comparisons to Nick Cave, Leonard Cohen, Gogol Bordello, Dead Kennedys and Tom Waits. One fan called it “Crooner Punk” because of Vanderford’s beckoning, low range vocals – but those are just the centerpiece of a vibe that includes the singer’s acoustic banjo and rhythm guitar, the polyrhythmic grooves of drummer, cajon player and group cofounder Rt Goodrich, Laela Peterson-Stolen’s soaring violin and viola and the growling electric fretless bass of Tim Bush. At the heart of Junk Parlor’s desire to get their audiences dancing and singing along is Vanderford’s passion for storytelling. He taps into an offbeat influence for their latest single, the haunting rockabilly heartbreak tune “Mick Jagger’s Heart.” Drawing thematic inspiration from The Rolling Stones’ countrified ballad “Dear Doctor” (which appeared on Beggar’s Banquet), the band creates a fresh twist on the pain of lost love via the juxtaposition of dark lyrics and bouncy rhythms. Vanderford artfully describes the piece as what happens “when the heartache of Leonard Cohen decides to lament under the sun amidst the California surf…The moment of goodbye…the lingering sigh that begs to turn back time…Doctor won’t you please…tear it out.” The compelling, gut punchingly beautiful video for the track by Jeannie Jo uses scenes of San Francisco cityscapes as a metaphor for heartbreak. Building a solid, ever expanding West Coast fan base, Junk Parlor has played several hundred gigs these past few years. Beyond a batch of hotspots in San Francisco and throughout the Bay Area, the band has headlined numerous times in Seattle, Portland, Eugene, Los Angeles and Reno. Aiming each time out to capture a room for a few hours, and aware of today’s short musical attention spans, Vanderford always creates fresh set lists using previous tunes to frame or set the mood for the next, building waves of energy in an arc like fashion. Not surprisingly, Junk Parlor’s fan base is as demographically eclectic as their music. Remembering a certain trip to Seattle, the singer says, “One night we played a punk club in Bremerton, with people wearing Mohawks and going crazy in a mosh pit, and the next we were at the Triple Door jazz club, with an older audience in suits and ties, drinking fancy martinis. The sonic shift reminds us a lot of the MTV Unplugged era, when heavy rockers gained new popularity by playing softer acoustic music.” As Vanderford tells it, Junk Parlor began almost by accident. In the years since his stint with The Hot Club of San Francisco, he had emerged as one of the region’s “go-to” musicians for his rhythm guitar and gypsy jazz expertise. In early 2013, his uncle, Tim Bush, asked him to come play his acoustic at a wine bar in Petaluma that he tended bar at. Vanderford agreed, but only if Bush played bass. “He’s been a professional bassist for 30 years and took me to buy my first guitar when I was 14,” says the singer. As he got into his once a month residency, Robin Goodrich showed up, telling Vanderford he wanted to put a group together. “I had never met him before, but he said he knew who I was,” Vanderford says. “I was hesitant but asked him to sit in with me for a few months. Then he shows up one day saying he booked the band. I told him we didn’t have a name and he said we better get one. So then I took it seriously.” As the idea of a larger ensemble took shape, Vanderford decided he wanted an original, more experimental band rather than another traditional gypsy jazz outfit. He began pulling out songs he had never shown anyone. The clever band name came from his younger days, when his bedroom stored his collection of vintage furniture and pictures he’d bought at antique stores. He vowed then that if he ever had a band of his own, he would call it what he called that space: Junk Parlor. Adding Bush on bass, the band played their first gig that May and five months later they made their debut album Wild Tones and started touring. While the singer writes all the original songs, the band works together on the arrangements and each member writes their own parts. Vanderford and Goodrich are financial partners in the band who do everything DIY, including booking, social media, poster making and promotion. Junk Parlor's members have played the gamut of festivals and prestigious venues including Outside Lands, Kate Wolfe Fest, Djangofest, Gaia Fest and SXSW. Vanderford has played, recorded and toured with the Americano Social Club, The Hot Club of San Francisco, Clint Bakers New Orleans Jazz Band, Little Charlie's Caravan, Avatar Ensemble and Seth Ford Young Quartet. Rt Goodrich has laid down rhythms and toured with Staggerwing, Beso Negro and Standing Room Only. Bush has played extensively with Danny Montana, Sweetie Pie and the Doughboys, Chuck Day, Sam Andrew, Jim Martin, and Freddie Roulette. Wild Tones included two instrumentals that resonated with the local bellydance community. The band started getting videos of dance troupes from all over, dancing to these tracks. Kami Liddle from the Gold Star Dane Company asked Vanderford if he wanted to collaborate, and he dove into a fresh project, aiming to create an album for dancers to choreograph to. They put together a Kickstarter campaign and raised enough money to make Junk Parlor’s instrumental dominated Melusina and go on tour with the Gold Star girls. He had been collecting vintage bellydance records for years, so he started picking out the ones he loved to learn. He recorded two covers among the originals, “Gold Star Dance Academy” and “Procession.” Looking ahead, Vanderford says that the new album, which will include “Mick Jagger’s Heart,” will build upon what Junk Parlor has been doing since day one. “Our first two records are simply two sides of the same coin,” he says. “I am looking forward to our next project as we already have all the songs and have been playing them out and getting a wonderful response. This one will include a few instrumentals, but have more of an emphasis on vocals. “What I’m learning through all of these recording and performing experiences is that it doesn’t matter if you’re a jazz musician, singer or dancer, the goal is always telling a great story. I love getting out there and hearing people’s stories and then transforming those into songs that can be interpreted in unique ways by the band, dancers and everyone in the audience that it touches.” \"A dream falling off the edge of a cliff.\"", "otherInfo": "No other event info available"}, {"Address": "327 Lasuen St, Stanford, CA 94305", "Artist": "Bruce Cockburn ", "ArtistImage": "https://photos.bandsintown.com/thumb/6288087.jpeg", "Coordinates": [-122.1722, 37.4215], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Folk Rock, Rock, Folk, Classic Rock, Rock And Roll", "Time": "2:30 AM UTC", "Venue": "Bing Concert Hall", "moreBioInfo": "Bruce Cockburn Bone on Bone\nBone On Bone\n\nFew recording artists are as creative and prolific as Bruce Cockburn. Since his self-titled debut in 1970, the Canadian singer-songwriter has issued a steady stream of acclaimed albums every couple of years. But that output suddenly ran dry in 2011 following the release of Small Source of Comfort. There were good reasons for the drought. For one thing, Cockburn became a father again with the birth of his daughter Iona. Then there was the publication of his 2014 memoir Rumours of Glory.\n\n“I didn’t write any songs until after the book was published because all my creative energy had gone into three years of writing it,” Cockburn explains, from his home in San Francisco. “There was simply nothing left to write songs with. As soon as the book was put to bed, I started asking myself whether I was ever going to be a songwriter again.”\n\nSuch doubt was new to the man who’s rarely been at a loss for words as he’s distilled political views, spiritual revelations and personal experiences into some of popular music’s most compelling songs. What spurred Cockburn back into songwriting was an invitation to contribute a song to a documentary film about the late, seminal Canadian poet Al Purdy and he was off to the races.\n\nBone On Bone, Cockburn’s 33rd album, arrives with 11 new songs, including “3 Al Purdys,” a brilliant, six-minute epic that pays tribute to Purdy’s poetry. Cockburn explains its genesis: “I went out and got Purdy’s collected works, which is an incredible book. Then I had this vision of a homeless guy who is obsessed with Purdy’s poetry, and he’s ranting it on the street. The song is written in the voice of that character. The chorus goes, ‘I'll give you three Al Purdys for a twenty dollar bill.’ Here’s this grey-haired dude, coat tails flapping in the wind, being mistaken for the sort of addled ranters you run into on the street—except he’s not really ranting, he’s reciting Al Purdy. The spoken word parts of the track are excerpts from Purdy’s poems. After that, once the ice was broken, the songs just started coming.”\n\nCockburn’s rugged fingerpicking style on the Dobro perfectly matches Purdy’s plainspoken words and the grizzled voice of his street character. A similar guitar style can be heard on two of the next songs Cockburn wrote, the gospel-like “Jesus Train,” and “Café Society,” a bluesy number about people who gather at his local coffee shop to sip their java and talk about the state of the world.\n\nThere’s a prevalent urgency and anxious tone to much of the album, which Cockburn attributes to living in America during the Trump era. But, more than anything, Bone on Bone amounts to the deepest expression of Cockburn’s spiritual concerns to date. The 12-time Juno winner and Canadian Music Hall of Fame inductee turned away from traditional Christianity in the mid-1970s toward a quest for the more all-inclusive mysticism he documents in his memoir. And it’s that kind of spirituality that figures prominently in “Jesus Train” and “Twelve Gates to the City.” In “Looking and Waiting,” Cockburn sings of “scanning the skies for a beacon” from the divine.\n\n“It’s a song of faith and frustration,” says Cockburn of the latter. \"...Tired of looking in from the outside. My MO has always been to be aware of the divine...that dimension...always dealing with being stuck in a kind of observer’s position with respect to all that. I know it’s there. I don't really see as faith so much as knowledge. Others may have different ideas about those things, but for me, I don’t have to struggle to believe in God, or the notion that God cares what happens to me. But I do have to struggle with being in a conscious, intentional relationship. That underlies a lot of these songs.”\n\n“Forty Years in the Wilderness” ranks alongside “Pacing the Cage” or “All the Diamonds” as one of Cockburn’s most starkly beautiful folk songs. “There have been so many times in my life when an invitation has come from somewhere...the cosmos...the divine...to step out of the familiar into something new. I’ve found it’s best to listen for, and follow these promptings. The song is really about that. You can stay with what you know or you can pack your bag and go where you’re called, even if it seems weird...even if you can’t see why or where you’ll end up.”\n\n“Forty Years in the Wilderness” is one of several songs that feature a number of singers from the church Cockburn frequents, for the sake of convenience referred to in the album credits as the San Francisco Lighthouse “Chorus.” “The music was one of the enticements that drew me to SF Lighthouse. As I found myself becoming one of the regulars there, and got to know the people, I felt that I really wanted all these great singers, who were now becoming friends, to be on the album. They were kind enough to say yes!” Among other songs, they contribute call-and-response vocals to the stirring “Stab at Matter.” Other guests on the album include singer-songwriters Ruby Amanfu, Mary Gauthier, and Brandon Robert Young, along with bassist Roberto Occhipinti, and Julie Wolf, who plays accordion on “3 Al Purdys” and sings with the folks from Lighthouse, together with LA songwriter Tamara Silvera.\n\nProduced by Colin Linden, Cockburn’s longtime collaborator, the album is built around the musicianship of Cockburn on guitar and the core accompaniment of bassist John Dymond and drummer Gary Craig. Also very much part of the sound is the accordion playing of Cockburn’s nephew John Aaron Cockburn and the solos of noted fluegelhorn player Ron Miles (check out his stunning work on the cascading “Mon Chemin,” for example).\n\nTwo other songs should be noted. The environmental warning “False River” came about at the invitation of Yvonne Bloomer, the poet laureate of Victoria, British Columbia. Bloomer was seeking a poem about the controversial Kinder Morgan Trans Mountain Pipeline. “Pipelines have their own perils that we’re all aware of,” says Cockburn, “so I started writing what was meant to be a spoken-word piece with a rhythm to it. But it evolved very quickly into a song.”\n\n“States I’m In,” which opens the album, conjures up feelings of mystery and dread. “It’s literally a ‘dark night of the soul’ kind of song,” Cockburn explains, “as it starts with sunset and ends with dawn. It passes through the night. The song is about illusion and self-delusion, looking at the tricks you play on yourself.” He adds: “Maybe it’s also a play on words about me living in the States.”\n\nCockburn, who won the inaugural People’s Voice Award at the Folk Alliance International conference in February and will be inducted into the Canadian Songwriters Hall of Fame in September, continues to find inspiration in the world around him and channel those ideas into songs. “My job is to try and trap the spirits of things in the scratches of pen on paper and the pulling of notes out of metal,” he once noted. More than forty years after embarking on his singer-songwriting career, Cockburn keeps kicking at the darkness so that it might bleed daylight.", "otherInfo": "No other event info available"}, {"Address": "627 2nd Ave, Crockett, CA 94525", "Artist": "Knocked Down ", "ArtistImage": "https://photos.bandsintown.com/thumb/10141309.jpeg", "Coordinates": [-122.223563, 38.053227], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Punk, Pop Punk, Skate Punk", "Time": "3:00 AM UTC", "Venue": "Toot's Tavern", "moreBioInfo": "A Melodic Punk band from Stockton, CA", "otherInfo": "Prizefighter, Knocked Down, Dead River Rebels"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Kofy Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/10215961.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Rock", "Time": "3:00 AM UTC", "Venue": "Ivy Room", "moreBioInfo": "Kofy Brown, an Oakland, CA musician, singer and songwriter has been a pioneering force in the Bay Area’s hip-hop soul scene since the 90’s. Leading her band on tour paving the way for other indie artist to trek forth, the KBB have spread the gospel of Brown’s unique style of soul, rock, funk and more all over North America, Canada and Europe. Kofy Brown has thrived by following her own creative path. She and her band the KBB have developed a reputation for putting on an outstanding live show. Her music is a soulful combination of funk, rock, blues and hip-hop topped off with a singing and rap style she calls word song.\n\nKofy Brown is co-creator /bass player and one of the lead songwriters and vocalist in the legendary all black girl rock trio Sistas in the Pit.\n\nKofy Brown is also currently playing drums and vocalizing with her latest project, Skip the Needle. Skip the Needle is comprised of veteran vocalists and musicians, Vicki Randle, Shelley Doty and Katie Colepits. The four women deliver a hard edge blend of soul, funk, rock and more.\n\nOther projects include drumming for the refreshingly smart and witty Americana artist, Dillbilly, and occasionally holding down bass duties for the gospel soul infused Marcelle Davies-Lashley and folk soul artist, Gina Breedlove.\n\nKofy Brown is a fiercely independent recording artist. The Washington DC native has released eight full length recordings on her own indie label Simba Music and is currently working on album number nine. She’s played the prestigious North Sea Jazz Festival, toured with Iggy Pop and has placed music on MTV and other indie films. Kofy Brown doesn’t plan on stopping anytime soon. Kofy Brown – Love Warrior", "otherInfo": "A celebration of Kofy Brown's new record, Child of Providence!\n\nKofy Brown's 10th release is a mix of funky, bluesy soul music. Ticket price includes a copy of the new CD.\n\nOpening the night is the wonderfully talented Be Steadwell. Be Steadwell is a singer songwriter from Washington DC. The music is a blend of soul, acapella and folk. Be calls her music QUEER POP."}, {"Address": "400 S 1st St, San Jose, CA 95113", "Artist": "The Emo Night Tour ", "ArtistImage": "https://photos.bandsintown.com/thumb/8936443.jpeg", "Coordinates": [-121.885544, 37.330047], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "3:00 AM UTC", "Venue": "The Ritz", "moreBioInfo": "No artist bio available", "otherInfo": "Imagine going to a show and hearing Taking Back Sunday, Fall Out Boy, Panic! At The Disco, My Chemical Romance and many more, all only playing their best songs...all night long.\n\nWelcome to The Emo Night Tour.\n\nThe Emo Night DJ’s will be spinning all the angst your teenage dirtbag heart desires all night long and a special guest band will bring you emo covers that will make you feel like you’re at Warped Tour ‘08 minus all the dust and melting in the sun!\n\nThe last event in San Jose SOLD OUT, so you do not want to sleep on this...make sure to Tell All Your Friends and Sugar, Come Down!\n\nFriday • April 10th • The Ritz • 21+\nDoors 8:00pm • $15 advance • $18 day of"}, {"Address": "1517 Franklin, Oakland, CA 94612", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/9046383.jpeg", "Coordinates": [-122.269511, 37.805131], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Comedy", "Time": "3:00 AM UTC", "Venue": "The Layover", "moreBioInfo": "Comedian", "otherInfo": "No other event info available"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Shannon Hayden ", "ArtistImage": "https://photos.bandsintown.com/thumb/7942286.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Progressive Alternative, Indie & More, Electronic, Classical", "Time": "3:00 AM UTC", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "\"Doing what is expected isn't something everyone does well. Following years of classical training at the highest level, Shannon Hayden's very non traditional interpretation of cello performance is an example of why that is a good thing. Running her instrument through more electronic gear and amplification than some metal band with a stolen credit card probably wasn't something anyone back at the conservatory had in mind, though it really shouldn't come as much of a surprise these days. Art has always found ways to embrace technology without becoming a slave to it and Shannon's compositions owe as much to her brilliant mastery of the cello itself as they do to the latest technical innovations which greatly expand the range and complexity of the instrument. Occasional heavy outbursts of distortion with elements bordering noise punk are matched with layers of lush ambiance combining both current and traditional styles with all the virtuosity of a player redefining our expectations of maturing young prodigies. Some musicians make you feel good about where music is headed and Shannon Hayden is one of them.\"", "otherInfo": "No other event info available"}, {"Address": "1610 Bridgeway,, Sausalito, CA 94965", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/9361550.jpeg", "Coordinates": [-122.488111, 37.861872], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "West Coast Blues, Blues, R&b, Soul Jazz", "Time": "3:00 AM UTC", "Venue": "Sausalito Cruising Club", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her band return to the floating nightclub. The Sausalito Cruising Club is a private boat club featuring a full bar/lounge, dining room, stage and dance floor and food galley.\n\nGG Amos- guitar/vocals; Parris Bertolucci- organ/keyboards; Vicky Grossi- bass; Randy Lee Odell- drums\n\nShowtime: 8-11pm\nEmail to get on guest list if Non-Member:\nernest@sausalitocruisingclub.org"}, {"Address": "3700 Middlefield Rd, Palo Alto, CA 94303", "Artist": "Scott Amendola ", "ArtistImage": "https://photos.bandsintown.com/thumb/7596193.jpeg", "Coordinates": [-122.113309, 37.423261], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Free Jazz, Jazz", "Time": "3:00 AM UTC", "Venue": "Mitchell Park Community Center", "moreBioInfo": "Scott Amendola:\nDrummer/Composer/Bandleader/Educator\n“Amendola’s music is consistently engaging, both emotionally and intellectually, the product of a fertile and inventive musical imagination.” Los Angeles Times\n\n“If Scott Amendola didn't exist, the San Francisco music scene would have to invent him.” Derk Richardson, San Francisco Bay Guardian\n\n“Amendola has complete mastery of every piece of his drumset and the ability to create a plethora of sounds using sticks, brushes, mallets, and even his hands.”Steven Raphael, Modern Drummer\n\n“...drummer/signal-treater Scott Amendola is both a tyrant of heavy rhythm and an electric-haired antenna for outworldly messages (not a standard combination).” Greg Burk, LA Weekly\n\nFor Scott Amendola, the drum kit isn’t so much an instrument as a musical portal. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. His closest musical associates include guitarists Nels Cline, Jeff Parker, Charlie Hunter, Hammond B-3 organist Wil Blades, violinists Jenny Scheinman and Regina Carter, saxophonists Larry Ochs and Phillip Greenlief, and clarinetist Ben Goldberg, players who have each forged a singular path within and beyond the realm of jazz.\n\nWhile rooted in the San Francisco Bay Area scene, Amendola has woven a dense and far-reaching web of bandstand relationships that tie him to influential artists in jazz, blues, rock and new music. A potent creative catalyst, the Berkeley-based drummer is the nexus for a disparate community of musicians stretching from Los Angeles and Seattle to Chicago and New York. Whatever the context, Amendola possesses a gift for twisting musical genres in unexpected directions.\n\nNels Cline maintains his long-running role in the alt-rock juggernaut Wilco, but the band’s long stretches of inactivity mean that he can also perform as a member of the Scott Amendola Band and a recently launched duo project (a tête-à-tête setting in which Scott thrives). Amendola continues to tour and record with the volatile instrumental band, The Nels Cline Singers, which is due for a follow up to 2014’s critically hailed, genre-obliterating Macroscope (Mack Avenue).\n\nIt’s not surprising that the Singers provided an early and essential forum for Amendola’s artful use of electronics, a small menagerie of devices that has found its way “into everything I do,” he says. “After years of experimenting I’m using them in a more expressive and confident way than ever before.”\n\nCline was still an underground LA legend in the mid-1990s when he first encountered Amendola and was “blown away,” he says. “There aren’t too many drummers on the West Coast who had his wide-ranging ability. Scott’s got some funk in him, a looser, sexy thing going on, and the flexibility to play free and different styles. He plays behind singer/songwriters and he rocks too.”\n\nScott also performs widely with his longtime sparring partner Wil Blades in the orchestral duo Amendola Vs. Blades. While they’ve honed a wide array of material, the project initially centered on their thrilling investigation of Duke Ellington and Billy Strayhorn’s “Far East Suite.” Their 2016 debut album Greatest Hits (Sazi Records) earned lavish critical praise, with the San Jose Mercury News hailing the duo for honing a “repertoire of groovelicious jazz for more than a decade, and they throw down the funk with fervor on a project that clocks in at the old-school LP length of 39 minutes, distilling some of their leanest, meanest, punchiest pieces.”\n\nNo project better displays Amendola’s big ears and musical ambitions than Fade To Orange a piece commissioned as part of the Oakland East Bay Symphony’s Irvine Foundation-funded New Visions/New Vistas Initiative. The roiling work premiered to critical acclaim at Oakland’s Paramount Theater on April 15, 2011. Determined to refine and document the piece, Amendola conducted a successful PledgeMusic crowd-funding campaign and recorded Fade To Orange at Berkeley’s storied Fantasy Studios with his original collaborators—his Nels Cline Singers bandmates (Cline and powerhouse bassist Trevor Dunn)—and the great Magik*Magik Orchestra.\n\n“The idea was really the Singers meet the Symphony,” Amendola says. “I wanted Trevor’s electric bass for that big contrast with the orchestra, and I conceived of the piece as a concerto for guitar. It was an amazing experience to premiere ‘Fade to Orange’ at the Paramount, but it was bittersweet after all that work. Like, that’s it? I wanted to see what else we could do with it.”\nHe released Fade to Orange on CD and vinyl on his label Sazi Records in 2015. The album includes four distilled, wildly imaginative remixes of “Fade to Orange” by Cibo Matto’s Yuka Honda, Mocean Worker, Beautiful Bells, and Deerhoof’s John Dieterich and Teetotum’s Drake Hardin.\n\nAmendola established his reputation as a bandleader in 1999 with the release of the acclaimed album Scott Amendola Band featuring the unusual instrumentation of Eric Crystal on saxophones, Todd Sickafoose on acoustic bass, Jenny Scheinman on violin, and Dave Mac Nab on electric guitar. By the time the quintet returned to the studio in 2003, Cline had replaced Mac Nab, contributing to the quintet’s combustible chemistry on the Cryptogramophone album Cry.\n\nCline was a crucial contributor on Amendola’s 2005 Cryptogramophone album Believe, which also features guitarist Jeff Parker (from the band Tortoise), Jenny Scheinman, and late bassist John Shifflett. Scott created his own label, SAZi Records, for his next release, 2010’s exquisite Lift, a trio session with Parker and Shifflett dedicated to his gossamer, bluesy ballads and ethereal soundscapes, with an occasional foray into surf rock deconstruction.\n\nIn some circles, Amendola is best known for his intermittent two-decade collaboration with seven-string guitar wizard Charlie Hunter, with whom he connected shortly after moving to the Bay Area in 1992. They went on to play together with John Schott and Will Bernard in the three-guitar-and-drums combo T.J. Kirk, which earned a Grammy nomination for its eponymous 1996 debut album. After years of occasional gigs, they teamed up again in 2011 in a tough and sinewy duo. They spent five years touring incessantly and released two acclaimed albums: 2012’s recession-inspired Not Getting Behind is the New Getting Ahead and 2013’s Pucker, the latter showcases Amendola’s melodically inspired tunes.\n\nIn 2014, looking for new avenues to distribute their music, Hunter and Amendola released four 5-track EPs, each focusing on the music of a particular artist or act. From the standards of Ellington and Cole Porter to the country hits of Hank Williams and seminal new wave tunes of The Cars, the duo transformed everything they encountered with their groove-centric sensibility.\n\nAs a sideman, Amendola has performed and recorded with a vast, stylistically varied roster of artists, including Bill Frisell, John Zorn, Mike Patton, Mondo Cane, John Scofield, Cibo Matto, John Dieterich from Deerhoof, Wadada Leo Smith, Bruce Cockburn, Madeleine Peyroux, Cris Williamson, Joan Osborne, Jacky Terrasson, Shweta Jhaveri, Phil Lesh, Sex Mob, Kelly Joe Phelps, Larry Klein, Carla Bozulich, Wayne Horvitz, Johnny Griffin, Julian Priester, Sonny Simmons, Pat Martino, Jim Campilongo, Bobby Black, Larry Goldings, Paul McCandless, Rebecca Pidgeon, and the Joe Goode Dance Group.\n\nBorn and raised in the New Jersey suburb of Tenafly, just a stone’s throw from New York City, Amendola displayed an aptitude for rhythm almost from the moment he could walk. His grandfather, Tony Gottuso, was a highly respected guitarist who performed with jazz luminaries such as Ella Fitzgerald, Louis Armstrong, Frank Sinatra, and Nat “King” Cole. A member of the original Tonight Show Band under Steve Allen, he offered plenty of support when Amendola began to get interested in jazz.\n“We used to play together a lot when I was a teenager,” Amendola says. “It had a huge impact on me to play with someone who was around when a lot of the standards that musicians like Miles Davis, John Coltrane, and Keith Jarrett play were written.”\n\nHis passion for music only deepened during his four years at Boston’s venerable Berklee College of Music, where it wasn’t unusual for him to practice for 12 hours a day. Drawing inspiration from fellow students such as Jorge Rossi, Jim Black, Danilo Perez, Chris Cheek, and Mark Turner, and studying with the likes of Joe Hunt, and Tommy Campbell, Amendola found his own voice rather than modeling himself after established drummers. Since 2014, Scott has served as Associate Professor at the University of California - Berkeley’s Jazz Program. His teaching in Jazz Percussion focuses on private instruction.\n\n\nOver a career spanning more than three decades, Amendola has forged deep ties across the country, and throughout the world. As an ambitious composer, savvy bandleader, electronics explorer, first-call accompanist, and capaciously creative foil for some of the world’s most inventive musicians, Amendola applies his wide-ranging rhythmic virtuosity to a vast array of settings. He’s never more than one degree away from a powerful musical hook-up.", "otherInfo": "Amendola vs. Blades@ Mitchell Park in Palo Alto. The duo returns to the south bay to celebrate the release of our new record \"Everybody Wins\"!\nWil Blades: Hammon B3/Clavinet\nScott Amendola: drums/percussion/electronics\n\nw/ Trance Mission"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Ayla Nereo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8203379.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Acappella, Folktronica, Cinematic Folk, World Folk & Fusion, Cinematic Alt-folk, Female Vocals, Folk", "Time": "3:00 AM UTC", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "Ayla Nereo is a voice for the planet, a beacon of light, a modern bard of beauty singing directly from her soul. With lyrical poetry splashing like dazzling paint across a canvas of sound, she builds layer upon layer of vocal melodies into majestic loop-pedal harmonies, weaving syncopated threads of guitar, kalimba, piano, and percussion into her live performances.\n\nAyla’s music is a genre unto its own, as she allows sounds to dance between vocal looping, produced beats, live drumming, orchestral string arrangements, Celtic melodies, and even dashes of hip-hop wordplay. With an uncanny ability to disarm and crack open the heart, Ayla’s lucid storytelling and magical presence rings with love, as she sings for the depth of our humanness, a truth beyond time and place, and the pure wonder of life itself.\n\nCalling us to listen deeper, her songs are elegant masterpieces of lucid storytelling, with lyrics ringing as anthems and mantras for hope, healing, and love.\n\nThough you’d never know it by witnessing her perform, Ayla grew up with a deep fear of singing. In her final year of college, songs began pouring through her, and it was only through the constant urging of those around her that she began to slowly share her music. Propelled by the songs themselves, Ayla’s journey of meeting those fears and singing through them has propelled her into the powerful performer she is today, touching an ever-widening global audience with the inspiring magic of her songs.\n\nA child schooled at home in the hills of Sonoma County, Ayla was raised on Cat Stevens, Bob Dylan, opera, classical music, traditional celtic songs, and ABBA -- influences which have deeply shaped her music. Touching on both the timeless and modern, she always rides the line between genres, so that her songwriting and sound ultimately cannot be compared to anyone else.\n\nDancing her own songs on stage as she sings them, her movement and presence gives the audience a permission to be wild, real, vulnerable, and alive. Every performance Ayla gives is its own inspired journey; an enchanting and poignant experience that holds you by the heart and doesn’t let go.\n\nAyla is releasing her 6th album in the spring of 2019 via Jumpsuit Records. Honing her artistry and craft over the years, Ayla has developed a loyal fanbase, one that has recently seen exponential growth into widening circles across the planet. The upcoming release of her phenomenal new album, \"By The Light of the Dark Moon\", marks a stepping-out into the world arena. With a nationwide tour supporting the album release, a full summer of notable festival appearances, and her second European tour on the horizon, Ayla's music is reverberating from a west-coast transformational niche into larger global audiences, to inspire and uplift the hearts of humanity. Her music has also recently seen rapid and increasing growth throughout Europe, as well as Canada, Australia, and dozens of other countries.\n\nTo date, Ayla has released 5 solo albums, 2 Wildlight albums (the collaboration project of Ayla and David Sugalski, aka The Polish Ambassador), and 3 collaboration albums.\n\n“A poet, musician, visionary and mystic, Ayla Nereo is an otherworldly artist who shares the fruits of her soul.” ~ The Huffington Post\n\n“[Ayla’s] relationship with the earth is imprinted in her music … thickly layered tracks where expansive and intriguing instrumentals serve as an intricate backdrop for her delicate and soft-spoken vocals.” ~ Billboard\n\n“I am here to receive songs that help us remember our origins, our incredible human potential, and our right relationship with all Life.”\n\n“We are born of dust and silence. We are made of ancient song.”", "otherInfo": "w/ Peia, Handmade Moments"}, {"Address": "23 Petaluma Blvd N, Petaluma, CA 94952", "Artist": "Dirtwire ", "ArtistImage": "https://photos.bandsintown.com/thumb/10066863.jpeg", "Coordinates": [-122.640098, 38.233411], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "World Fusion, Blues-rock, Electronica", "Time": "3:30 AM UTC", "Venue": "Mystic Theatre", "moreBioInfo": "Dirtwire sits on the front porch of Americana’s future, conjuring up a whirlwind of sound using traditional instrumentation, world percussion, soundscapes, and electronic beats. Comprised of David Satori (Beats Antique), Evan Fraser (Hamsa Lila; Bolo), and Mark Reveley (Jed and Lucia), each performance brings both band and audience to a mysterious crossroads of beats, blues, African, Asian, and South American sounds. The result is a rebirth of Americana and a post-millennial psychedelic journey to downhome goodness.\n\nVisit http://dirtwire.net for more info, Email dirtwire@gmail.com to have us out to your neck of the woods.", "otherInfo": "No other event info available"}, {"Address": "1710 Mission St, San Francisco, CA 94103", "Artist": "Pablo Dylan ", "ArtistImage": "https://photos.bandsintown.com/thumb/9154329.jpeg", "Coordinates": [-122.420383, 37.769717], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "No genre available", "Time": "3:30 AM UTC", "Venue": "Brick & Mortar Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "726 1st St, Benicia, CA 94510", "Artist": "5 O'clock Somewhere ", "ArtistImage": "https://photos.bandsintown.com/thumb/10099572.jpeg", "Coordinates": [-122.157812, 38.050196], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Fairfield, California", "Time": "3:30 AM UTC", "Venue": "The Rellik Tavern", "moreBioInfo": "A fun dynamic band playing hits from the 50s to today.", "otherInfo": "No other event info available"}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "The Fixins ", "ArtistImage": "https://photos.bandsintown.com/thumb/9030977.jpeg", "Coordinates": [-122.463777, 37.783225], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Folk Groove, Bluegrass, Jam, Blues, Folk-rock", "Time": "3:30 AM UTC", "Venue": "Neck Of the Woods", "moreBioInfo": "A grooving folk-rock jam band with funk and blues influences....spreading good vibes and having good times.", "otherInfo": "The Fixins and Moontrain live at Neck of the Woods in San Francisco, CA."}, {"Address": "1001 B St, Hayward, CA 94541", "Artist": "The Well Known Strangers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8749231.jpeg", "Coordinates": [-122.082413, 37.672754], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Soul, Country, Americana", "Time": "4:00 AM UTC", "Venue": "The Bistro", "moreBioInfo": "The Well Known Strangers is a collective of seasoned Bay Area session musicians and dear friends playing a musical blend that they refer to as \"California country soul,\" featuring Amber Morris (Tim Hockenberry, Narada Michael Walden, The Eric Martin Band, The Soul Jah Family band) on vocals; David Noble (Poor Man's Whiskey, Pardon The Interruption) on lead guitar, vocals; Joshua Zucker (The Jones Gang, Rowan Brothers) on bass; Austin de Lone (Nick Lowe, Elvis Costello, The Fabulous Thunderbirds) on keys; Mick Hellman (The Go To Hell Man Band) on drums and vocals; and Rob Anderson (emerging talent and repeat world champion cyclist) on guitar.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Neon Velvet ", "ArtistImage": "https://photos.bandsintown.com/thumb/6128653.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Your Red Carpet Dance Party", "Time": "4:00 AM UTC", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Smoochy The very best new and classic dance hits. Alt Dance & New Wave from the 80s, 90s, and 2000s... sprinkled with a fresh mix of funk and glam.", "otherInfo": "No other event info available"}, {"Address": "146 S Murphy Ave, Sunnyvale, CA 94086", "Artist": "Crystal Skies ", "ArtistImage": "https://photos.bandsintown.com/thumb/9928074.jpeg", "Coordinates": [-122.029756, 37.376782], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Electronic Dance Music, Electronic", "Time": "4:00 AM UTC", "Venue": "Pure Lounge & Nightclub", "moreBioInfo": "Melodic Bass Music.", "otherInfo": "No other event info available"}, {"Address": "370 Grove St, San Francisco, CA 94102", "Artist": "Space Cowboys ", "ArtistImage": "https://photos.bandsintown.com/thumb/10267582.jpeg", "Coordinates": [-122.422523, 37.77818], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Electronic, House", "Time": "4:00 AM UTC", "Venue": "Phonobar", "moreBioInfo": "Space Cowboys are a San Francisco based collective that began its exploration of the cosmos over a decade ago, as a diverse group of talented individuals who came together in the pursuit of the creation of unique entertainment events, mechanical contraptions, and unique art projects.\n\nSpace Cowboy DJs: 8Ball, Bassben, Ben Anderson, Brad Robinson, Deckard, J9, Kapt'n Kirk, kev/null, Leyl Master Black, Mancub, rrrus, Rumblemunk, Shissla, shOOey, Sol, Tamo, WorkR.", "otherInfo": "Celebrate the resurrection on Good Friday with ALL 6 Angels on the decks!! We'll be at San Francisco's Phonobar in Hayes Valley again. Cover is only $10.\n\nCome out for a night of killer music, j9's Birthday, and sassy spring magic. We'll be bringing the heat with some booty shakin' tunes so grab your dancing shoes and bring a friend!\n\nAll Angels on Deck!!!\n♥Angels of bAss♥\nTamo\nj9\nViaJay\nJess Stockton\nHaute Mess\nNurse Noise"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "Om Unit ", "ArtistImage": "https://photos.bandsintown.com/thumb/8118271.jpeg", "Coordinates": [-122.419248, 37.768875], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Electronic", "Time": "4:30 AM UTC", "Venue": "Public Works", "moreBioInfo": "As a producer and DJ, Jim Coles has been a significant and pioneering presence in various dance music circles for the past five years. Following a formative decade in the global hip-hop underground, Coles took the name Om Unit in the late 2000s and began to travel across genres and scenes in search of sonic tropes to cross-breed and re-imagine. Key to his approach is a desire to never settle for the destination and instead focus on what can be learned from the journey.\n\nWhat drives Coles is a desire to keep challenging himself, and in turn his audience. Over the past five years, this has led him to distill various influences — hip-hop, dubstep, ambient, jungle, footwork — into a fluid take on sound system culture that sidesteps the pitfalls of genres and pastiche and creates new potentials for exploration and inspiration, with many following in his footsteps. It’s how, in the early 2010s, he came to pioneer the stylistic and rhythmic links between jungle and footwork via a series of acclaimed edits that brought him to the attention of the drum & bass scene. This personal approach has earned Coles praise as a refreshing voice in dance music from both peers and the media.\n\nOn record, Coles’ explorations into the deeper end of the electronic music spectrum have come via releases for Civil Music, including a critically acclaimed debut album, 2013’s Threads, legendary drum & bass outfit Metalheadz, where he was given access to Goldie’s personal sample archive as the inspiration for 2014’s Inversion album, Planet Mu, for a collaboration with Machinedrum as Dream Continuum, All City Records, remixing Grammy-winning producer Om’Mas Keith, Plastician’s Terrorhythm, and Exit Records, where he first collaborated with Sam Binga (leading to their BUNIT series of white label releases). The same exploratory approach has made him an in-demand remixer and BBC Radio 1, Boiler Room, Resident Advisor, FACT, XLR8R, and Rinse FM have called on him to provide mixes and showcase his sound.\n\nIn 2011, Coles set up a label, Cosmic Bridge Records, through which he has exercised an A&R sensibility that has created an exciting independent home for likeminded artists. The label’s releases, pressed onto limited edition vinyl runs, regularly sell out within days of their street date. Through Cosmic Bridge, Coles has championed veterans such as Kromestar and Boxcutter alongside new voices from Europe and America, including Moresounds, Danny Scrilla, and Graphs. The label’s breadth is best seen in the celebrated, and award-nominated,Cosmolog compilation series Coles began overseeing in 2014. Cosmic Bridge represents a dual path of inspiration: that which Coles found in others’ music, and that which others have found in his.\n\nColes is also a sought after DJ, with over 300 appearances in clubs and festivals in more than 30 countries he has made the equivalent of over a dozen trips round the globe and counting. And in line with his desire to imagine new potentials for dance music has appeared on varied bills from the Montreux Jazz Festival to Bass Coast, Outlook to Mysteryland.\n\nAfter two decades in London, Coles relocated to Bristol in 2015. From his new studio on the English west coast he continues his search through production work (the Torchlight EP series on Cosmic Bridge) and aesthetic exercises (the Gates mix series). A keen scholar of all music, he draws from the past and present to imagine the future, never content to remain in the same place for too long.", "otherInfo": "Soundpieces and Public Works team up for a triple headliner night featuring The Librarian, Om Unit, & J:Kenzo!"}, {"Address": "161 Erie St, San Francisco, CA 94103", "Artist": "J:Kenzo ", "ArtistImage": "https://photos.bandsintown.com/thumb/8063413.jpeg", "Coordinates": [-122.419248, 37.768875], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Electronic, Underground, Dubstep", "Time": "4:30 AM UTC", "Venue": "Public Works", "moreBioInfo": "J:Kenzo is the leading member of a new wave of artists on pioneering Dubstep label Tempa, as well as the founder of the influential Artikal Music UK imprint. Since 2008 he has cemented himself knee deep in the underground music scene with his signature minimalistic sound of Dub, Jungle and Techno. Renowned for his DJ skills which have seen him tour all over the world, from Japan to Australia, to Dubai to North America and all over Europe, J:Kenzo also hosts a monthly show on London's Rinse FM showcasing his taste in everything underground. His self titled debut album was released in September 2012 on the Tempa label with great anticipation, some say providing the antidote to the then overly brash commercial Dubstep sound. Deep underground tones, stripped back beats, smoky atmospherics with haunting keys and melodies providing the flavour throughout. Kenzo's output has been consistent with releases and features on classic labels such as Metalheadz and Exit Records as well as a string of singles and EP's for foundational dubstep label Tempa. DJ & Producer from the UK UK, Europe, ROW: alex@bassic.co North / Central / South America: sam@rogueagency.us General: info@jkenzo.com www.jkenzo.com", "otherInfo": "Soundpieces and Public Works team up for a triple headliner night featuring The Librarian, Om Unit, & J:Kenzo!"}, {"Address": "2565 Mission St, San Francisco, CA 94110", "Artist": "BrandonTheFox ", "ArtistImage": "https://photos.bandsintown.com/thumb/8773473.jpeg", "Coordinates": [-122.418454, 37.756094], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Open Format, Edm, Funk, R&b, House, Hip Hop", "Time": "5:00 AM UTC", "Venue": "Arena Nightclub", "moreBioInfo": "An LA based DJ, Brandon Fox has performed on stage with celebrities and played alongside with some of the world’s greatest entertainers. A producer, event promoter, and marketing strategist, Brandon is just as likely to be seen behind the scenes as he is on stage. From rap to house and everything in between, Brandon Fox is a showman with the ability to tailor performances to any audience. Best ways to spot him is when he is playing for high-fashion Hollywood and at his own events in San Francisco.", "otherInfo": "No other event info available"}, {"Address": "314 11th St, San Francisco, CA 94103", "Artist": "SAMA' ", "ArtistImage": "https://photos.bandsintown.com/thumb/9102712.jpeg", "Coordinates": [-122.413904, 37.771448], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Techno", "Time": "5:00 AM UTC", "Venue": "Halcyon SF", "moreBioInfo": "Sama’s rise to becoming one of the first DJs to emerge internationally from Palestine can be traced back to Beirut, where she immersed herself in the burgeoning local techno scene. Her years in the Lebanese capital not only developed in her a singular musical aesthetic, but educated her as to the technicalities of mixing records and forming a narrative by doing so. Her sets, while rooted in high-octane, punchy techno, have a distinguished and defined ark, encompassing a broad range of sounds in their beginning and end. It’s a style that can be traced back to her teachers, two DJs who instilled in her the value of adaptation and track diversity. “The music is Berlin techno, but I perceive it in a Lebanese way,” Sama explains.\n\nSama’s story begins in Ramallah, Palestine’s de facto capital. Moving there from Jordan, her place of birth, she first connected with hip-hop and rap, the region’s foremost alternative genre. A penchant for music was evident at an early age, but it was the technical side that drew her in first, leading her to study in Beirut. She returned to Palestine with a new understanding of electronic music, and brought with her the techno genre, inspiring a local community of artists that continues to flourish in the face of the geo-political restrictions imposed upon it.\n\nIntent on pursuing a career in Music Production, Sama studied Audio Engineering at SAE Institute London, the basis for two albums as Skywalker, her former alias, and a job in Cairo, Egypt, where she began working with bands and designing sound for moving picture, including Egyptian films like “The Builders” and “Thread and Wall.” She also partnered with Arabic music incubator Eka3 to start her own publishing agency, Awyav.\n\nIt wasn’t until much later that DJing became her focus, sparked by a run of gigs that has continued ever since. Her education in music continues to inform her work: not only has it had a big impact on how she hears sound, but she sprinkles real-life samples throughout her sets, recorded on her travels and shaped back in her studio.\n\nIn 2018, she performed at Germany’s Fusion Festival and Hungary’s Sziget Festival, but it was her Boiler Room set, viewed nearly 3-million times, that identified her talents to the wider electronic music community. While touring every weekend, she bases herself in Paris, France, after completing a six-month residency at the International City of Arts having been selected as a Laureate by the French Institute. In July, she completed her first Essential Mix for BBC Radio 1, opening it with a binaural recording from London’s Kings Cross train station to Paris.\n\nMuch beyond the success she’s already enjoying, Sama’s goal has always been to put Palestine on the musical map. While she continues to excel on all fronts, she uses her status as a rising touring DJ to support the growing number of musicians at home. Besides advising them on the challenges they’ll face, she’s recently set up Union, an artistic community in Ramallah that also serves as a platform for DJs and producers to better their skills.", "otherInfo": "No other event info available"}, {"Address": "146 S Murphy Ave, Sunnyvale, CA 94086", "Artist": "MitiS ", "ArtistImage": "https://photos.bandsintown.com/thumb/8594497.jpeg", "Coordinates": [-122.029756, 37.376782], "Date": "Fri Apr 10 2020", "EventDate": "2020-04-10", "Genre": "Dubstep, Drum&bass, Chillwave, Electronic, Electro, Drumstep, House", "Time": "5:00 AM UTC", "Venue": "Pure Lounge & Nightclub", "moreBioInfo": "MitiS has been perfecting his special breed of piano-driven melodic bass since 2010. Brought up as a Classical pianist in Pennsylvania, MitiS, aka Joseph Torre performs a live set that combines his production chops and piano roots to get the absolute best of both worlds. He’s an artist in the purest sense, pouring his soul into every release. And as his vision of the world becomes more refined, so does his writing.\n\nTorre says, \"I just want to share good music, have it be through performance or a small, simple social setting. Music is what I do, I wouldn't change that for anything. Have it be a Chopin piece playing in a hall, or a bass kickin the club's ass, I'm down for either.\"\n\nHe may be down for either, but really excels at a strong combination of both. \"I find myself unable to stop making phat basses, heavy beats,and throwing melodies into the mix… I can't think of anything else more appetizing; It's the new age Classical.\" Many a fan has told Torre that they can recognize a MitiS song by its first note, the supreme compliment for any musician.", "otherInfo": "No other event info available"}]