var sf_events = [{"Address": "1984 Bonita Ave,, Berkeley, CA 94704", "Artist": "Letitia VanSant ", "ArtistImage": "https://photos.bandsintown.com/thumb/8131396.jpeg", "Coordinates": [-122.272093, 37.871966], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Folk, Indie Folk, Americana", "Time": "7:00 PM", "Venue": "The Back Room Music", "moreBioInfo": "Letitia VanSant’s lyrics are as personal as they are political, tracing questions of power into the human heart. With sparse indie folk arrangements fortifying a distinctly intimate vocal style, her down-to-earth stage presence has been described as “vibrant and approachable.”\n\nBBC Radio says she is “a fascinating new artist,” and PopMatters called her “a consummate reflection of a rising Americana star.” Her songwriting has earned several awards, including the Kerrville New Folk Songwriting Competition, an honor shared among the likes of Lucinda Williams and Lyle Lovett. VanSant’s debut album Gut It to the Studs established her as an emerging talent on the Americana scene and propelled her on her first UK/European tour. Its follow-up Circadian is due out February 21, 2020.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Ismay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8485905.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Indie-folk", "Time": "7:00 PM", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Coming from the coastal hills of Petaluma, California, Ismay is a band representing the work of singer, guitarist, and songwriter Avery Hellman. From a young age, Avery was brought up on legendary bluegrass, old time, and folk musicians such as Doc Watson, Hazel Dickens and Townes Van Zandt and learned to sing and play through performing this traditional American music. Throughout the years, the vastly different sounds of Captain Beefheart, Cat Power, Elliott Smith, and Phosphorescent combined to influence Ismay’s carefully constructed lyrics and melodies into what can be simply described as folk. The music of Ismay is also deeply influenced by the landscape of the American west, those who write about it — Terry Tempest Williams, Robert Bullard, John Steinbeck — and the social and environmental movements that work within it. From these stories came the name Ismay, titled after a railroad town in the badlands of Montana. Ethereal Folk from the California coastal hills", "otherInfo": "General Admission."}, {"Address": "1840 Haight St, San Francisco, CA 94117", "Artist": "F I N K E L ", "ArtistImage": "https://photos.bandsintown.com/thumb/8685875.jpeg", "Coordinates": [-122.452592, 37.769515], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Pop, Soul, Electronic, Indie", "Time": "7:00 PM", "Venue": "Milk Bar", "moreBioInfo": "Jane and Brian Spencer of F I N K E L seem to arrive from the near future, or perhaps somewhere out there, appearing with a slight shimmer of a dimension adjacent to our own. With an atmosphere treading the periphery of pop, the duo’s tangible vocal presence overlays hypnotic electro pulsations in a combination that teases out details of last night’s otherworldly dreams and tempts the waking state to return to its astral analog.\n\nNot quite definable by conventional genres, their avant-garde sensibilities will appeal to an audience seeking a respite from the pedestrian daily grind and typical expectations. There’s an enchanting quality that pervades the work of this singing and songwriting combo. Their lyrics explore themes of love and desire; understanding oneself and one another beyond surface qualities; and questioning the status quo. With every track, they’re suggesting we take another, closer look, because what we think we see and hear just might deserve inspection.\n\nWhile it remains unclear where these two have been, it’s evident enough that they’re here now. She triggering a MIDI mixing board, he on guitar, their vocals intertwine with a shadowy fluidity that invokes notions of another time; perhaps the middle of next week. They sense you wondering what you’re doing then, and invite you back to the present with a wink.\n\nA tale of two spirits unravels curiously from the seams of F I N K E L’s new singles. Their ethereal synthetic textures and rich vocal harmonies produce an aesthetic that grabs attention and gives it a nudge. The result somehow distills the mood of a strange day’s fleeting moments into a potent, lingering hex. Like the feeling of a passing glance with a mysterious stranger, we’re left assured we just encountered something ineffable, and wondering if someone else felt it too.", "otherInfo": "No other event info available"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Erisy Watt ", "ArtistImage": "https://photos.bandsintown.com/thumb/9101703.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Folk Soul", "Time": "7:00 PM", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Erisy Watt is a Nashville-raised folk artist based in Portland, Oregon. Consistently referred to as “the next-in-line to the likes of Joni Mitchell and Norah Jones, her music is an exercise in what contemporary folk today sounds like at its peak.” (No Depression)\n\nFollowing the release of the first single off her debut record, Watt, alongside guitarist Jeremy Ferrara, wrapped up 2018 with a six-week long tour all across Europe. The full album, produced by Bart Budwig and recorded live at The Ok Theatre in Enterprise, Oregon is set to be released on July 26, 2019.\n\nThe independently funded and managed artist has made impressive strides in her career, earning praise most notably from CBS This Morning, Jam in the Van, and No Depression. She has also shared the stage with acclaimed artists Hurray for the Riff Raff, L.A. Salami, Mr. Little Jeans, Shook Twins, Kuinka, Dustbowl Revival, Marty O’Reilly, Royal Jelly Jive, T Sisters and Rainbow Girls.\n\nInspired by both her time spent studying and working along the central coast of California and on remote islands in Thailand and Indonesia, Watt’s live performance bursts with charm as she invites listeners to revel in the joys and freedom of wilder places with every sound, song, and story.\n\nYou can hear her latest single \"Am I\" available now on all streaming platforms. You can also pre-order her album on Bandcamp now.", "otherInfo": "General Admission."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Harunemuri ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.412687, 37.771011], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Performing Live: HARU NEMURI ● Plus guests, TBA! ● Haru Nemuri fearlessly grinds the lines between J-pop, rap, electronica, and hard rock Imagine if Grimes was Japanese and performing with her finger in an electronic socket and it all took place inside a video game. Everything is blown-out to a widescreen post-rock scope yet feels jarringly immediate. Her tracks are grounded in rock but often incorporate elements of hiphop and electronic music, and her vocal delivery moves from delicate spoken word to primal screams. However, she is still definitely at the beginning of her \"rising artist\" narrative, in which critics are still trying to define her. She says many have come to see her as a \"poetry rapper.\" ● j-pop. ● doors @ 7pm; show @ 7:30pm. ● all ages. ● $13 advance; $15 day of show. ● RSVP: https://www.facebook.com/events/614500779350535 ● Buy tickets: https://www.dnalounge.com/calendar/2020/03-29d.html ● Watch and listen: Haru Nemuri: Yume Wo Miyou: http://youtu.be/12zrVL1llh4"}, {"Address": "2937 Mission, San Francisco, CA 94110", "Artist": "Danny Castro ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.417887, 37.750037], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Savanna Jazz Club", "moreBioInfo": "No artist bio available", "otherInfo": "Savanna Jazz Jam with Eric Tillman, Danny Castro, and Nick Fishman at Savanna Jazz Club: Savanna stands out in its neighborhood: it's almost as if a North Beach jazz club dropped a spore on Mission Street. Intimate and comfortable, with accents of fake plastic plants, Savanna presents live jazz most nights of the week, along with dinner and drinks at a reasonable price."}, {"Address": "62 S Second St, San Jose, CA 95113", "Artist": "Carlos Mencia ", "ArtistImage": "https://photos.bandsintown.com/thumb/8561611.jpeg", "Coordinates": [-121.88904, 37.33618], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "San Jose Improv", "moreBioInfo": "\"If you ain't laughing , you ain't living!\"\n\nwww.carlosmencia.com", "otherInfo": "ALL SALES ARE FINAL Two item minimum purchase required. This show will be a phone-free experience. Use of cellphones, smart watches, smart accessories, cameras and recording devices will not be permitted in the showroom. Upon arrival at the venue, all phones and smart watches will be secured in Yondr cases that will be opened at the end of the event. Guests maintain possession of their phones at all times, and can access their phones throughout the show at designated Phone Use Areas in the venue. All phones will be re-secured in Yondr cases before returning to the showroom. Guests are encouraged to print their tickets in advance to ensure a smooth entry process.Anyone seen using a cellphone during the performance will be escorted out of the venue. We appreciate your cooperation in creating a phone-free viewing experience. For Group Sales, CLICK HERE or call (408) 280-7475Got Questions? CLICK HERE"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Kelly McFarling ", "ArtistImage": "https://photos.bandsintown.com/thumb/7764096.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Old-timey, American Underground, Alt-country, Folk", "Time": "7:00 PM", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Kelly McFarling\n\nKelly McFarling is an Atlanta, GA born, San Francisco-based songwriter. Her work is reflective of transitions, the wilderness, and its navigation. Sometimes she plays banjo, other times acoustic guitar. Often, she plays a Telecaster fronting her band, The Home Team, featuring pedal steel (Tim Marcus), drums (Nick Cobbett), bass (Oscar Westesson), and various other Bay Area musicians.\nDuring her ten years in San Francisco, McFarling has released five independent recordings: studio albums, Distractible Child (2010) and Ridgeline (2013), an EP of cover songs, Others (2013), and two live albums, Live at Pirate Ship Laguna (2009) and Live at Eddie’s Attic (2011). She has toured behind her own projects as well as performing with bands like Y La Bamba and Goodnight Texas, and is one-third of the all-female folk trio Glittersnatch with Megan Keely and Wolf Larsen. Over the years, McFarling has shared the stage with artists such as Shovels and Rope, Sean Hayes, Chris Pureka, Jolie Holland, and has made a home for herself in the San Francisco music community.\nWater Dog, McFarling’s latest release, is her most intimate and folk-leaning record to date. She recorded the album in seasonal segments of 2016. The songs were first demoed with Allen Rothschild in his bedroom in Asheville, NC, where the creaks of his wood floor and the sounds of summer winding down made their way onto the recordings through open windows and live takes.The demos became the foundation of the record, and McFarling took them back to San Francisco, where Avi Vinocur of Goodnight Texas produced and engineered the majority of the record at his home in the Sunset District. “Recording at Avi’s house gave us the time to let the songs breathe and evolve.” McFarling said of the process. “It gave us space to make decisions at our own pace. I’ve never made a record like that, and it was a really special time. These songs were written in quiet spaces that were lived in. It made sense to record them in that way.”\nThe album is a reflection on inward motion; on the way that water and its movement dominates our lives and bodies. It’s about love, trust, and how we come to know the things we know. Above all, it’s about the cycles of nature that have the power to be both grounding and destructive. “While I was writing these songs, I was thinking a lot about family, stability, and love; and I was simultaneously starting to spend more time in and around the ocean. I was getting in the water a lot, and it opened a conversation about the nature of flow; learning to move with changes, instead of against them.”\nIn addition to producing, Vinocur also plays on most of Water Dog and his work is prominent on signature tracks, like “Both.” “That song was totally different when I brought it in. Avi simplified the groove, and made it more compelling.” says McFarling. Vinocur also helped complete the writing of “Caney Fork Overlook,” one of the record’s more classic country tunes. “That song had been half written for years. I wrote it in my van while on a road trip on the Blue Ridge Parkway, and it was one of those songs that I never had expectations for. I wasn’t sure it would be on the record. Avi helped get it to a place where it shines.” In other more stripped down songs, McFarling often played live in one take. “The Storms are Getting Stronger,” “Spring Clean”, and “Box” are songs that have been played in many different arrangements, mostly upbeat with a full band. For the recordings, I wanted them to go back to what they were when they were first written. Simple, quiet folk songs.”\nAlthough Vinocur and McFarling play the bulk of the instrumentation on the record, they also tapped several trusted Bay Area musicians to explore additional layers of sonic texture. Water Dog features Tim Marcus on pedal steel and dobro, Graham Patzner on fiddle, Andrew Laubacher on percussion, Andrew Brennan on guitars, Oscar Westesson on upright bass, and John Elliott on piano. Austin-based band Whiskey Shivers also makes an appearance singing backup vocals on “Caney Fork Overlook.”\nWater Dog is a first for McFarling in many ways. It is the first record she has made without a band, the first time she approached recording without a deadline, and the first time she has explored stripped down instrumentation. “From the beginning, the idea was always to let the songs speak for themselves and try not to get in the way.”", "otherInfo": "General Admission."}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Angie Stone ", "ArtistImage": "https://photos.bandsintown.com/thumb/8676911.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "R&b, Soul, R&b/soul, Rnb-soul", "Time": "7:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "Angie Stone (born Angela Laverne Brown in January 30, 1961, in Columbia, South Carolina) is a Grammy Award-nominated American R&B, hip-hop, and neo-soul singer and actress. Stone's music possesses a clear old school soul music influence, and her singing vocals recall those of Aretha Franklin.\n\n\nIn the early 1980s, Stone (as 'Angie B'), was a member of The Sequence, the first major female hip-hop group. They had a hit in 1980 with \"Funk You Up\". She then worked with Mantronix, before teaming up and performing vocals and saxophone for Lenny Kravitz.\n\n\nAngie Stone emerged during the 1990's as part of hip-hop/R&B trio Vertical Hold which released the popular single \"Seems You're Much Too Busy\" as well as two albums: A Matter of Time (June 1993) and Head First (1995).\n\nIn 1996, she teamed up with Gerry Devaux (Lenny Kravitz's brother) and together with Charlie Mole they formed Devox. One album received a Japanese-only release including Stone-penned or co-written material.\n\nAngie Stone shared song-writing credits on D'Angelo's first two studio album's (1995 - Brown Sugar and 2000 - Voodoo) as well as providing backing vocals on tour with him.\n\nShe released her first solo album, Black Diamond, released on 28 September 1999 via Arista Records. She has since also released, via Clive Davis' J Records, Mahogany Soul on October 16, 2001 and Stone Love on July 6, 2004.\n\nMuch of Angie Stone's solo material has a significant hip-hop influence and features notable samples. For example, her first solo single, 1999's \"No More Rain (In This Cloud)\" samples Gladys Knight & The Pips' 1972 \"Neither One Of Us (Want To Be The First To Say Goodbye)\", and 2002 \"Wish I Didn't Miss You\" samples The O'Jays' 1972 \"Back Stabbers\".\n\nAngie Stone sings the theme song for the UPN sitcom Girlfriends.\nShe has two children, a daughter and a son. The son is the child of neo-soul singer D'Angelo, whom she dated during the 1990's.\n\n\nOfficial Website: http://www.angiestoneonline.net", "otherInfo": "Yoshi's Oakland Presents Angie Stone"}, {"Address": "3223 Mission St, San Francisco, CA 94110", "Artist": "Pure Hex ", "ArtistImage": "https://photos.bandsintown.com/thumb/9495237.jpeg", "Coordinates": [-122.419787, 37.745082], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Indie Rock, Alternative, Rock, Shoegaze", "Time": "7:00 PM", "Venue": "Knockout", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "6780 Depot St, Sebastopol, CA 95472", "Artist": "The Musers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8182687.jpeg", "Coordinates": [-122.821304, 38.403181], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Sebastopol, California", "Time": "7:00 PM", "Venue": "Fern Bar", "moreBioInfo": "Free Range folk from Sonoma County\nThe Musers are Anita Bear Sandwina, and Megan McLaughlin both Multi-instrumentalists and award winning song-writers, accompanied by Tom Kuhn on stand up Bass. The Musers make joyful music where ever they go. Sometimes with a funky groove, sometimes with tender acoustic sensibility. Either way their hand crafted songs are delivered with a sister-like harmony blend and heart felt sass. Home grown in Sebastopol Ca.", "otherInfo": "No other event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Jaguar Jonze ", "ArtistImage": "https://photos.bandsintown.com/thumb/10262422.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Alternative, Indie Rock, Indie Pop", "Time": "7:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "“Straight away, the first time I listened to “Kill Me With Your Love,” it jumped out at me. And when I saw her at BIGSOUND, I couldn’t take my eyes off her; it was amazing. She is a passionate artist who puts herself wholeheartedly into everything, and she always smashes it”\n- Declan Byrne to Richard Kingsmill for the Triple J 2019\n\nLife-changing serendipity happens only to a chosen few, and that moment took musician-artist Deena Lynch by surprise while playing an Iggy Pop tribute night in her native Brisbane, Australia. After witnessing the unhinged performance of a guy emulating Iggy, she knew she had to up her game. “So, I cracked down two tequila shots,” she recalls, and then transformed into a bona-fide banshee. “Everything I ever suppressed came spilling out. My shame and inhibitions broke down. I wasn’t afraid.” After that primal performance, she earned the nickname-turned-stage name Jaguar Jonze.\n\nSigned to Nettwerk Records, Jaguar Jonze has released “You Got Left Behind,” “Beijing Baby,” and “Kill Me With Your Love” from her 2020 debut EP. At home in Australia, Jaguar Jonze has garnered the attention of The Music, Fashion Journal, Industry Observer and Tone Deaf, who writes \"to sum up the creative explosion that is Deena Lynch into a neat little elevator pitch would have even the most qualified of journalists in tears.\" Jaguar Jonze was named by Cool Accidents as an “Artist To Watch” for BIGSOUND 2019 and was also named in Richard Kingsmill’s (Triple J) “Top 5 Artists from BIGSOUND 2019.” Deena is also a Triple J “Unearthed Feature Artist,” and made her performance debut on “Like A Version” for a cover of Nirvana’s “Heart-Shaped Box,” alongside friends Hermitude. Jaguar Jonze also competed in Eurovision Australia Decides 2020 with her own original song “Rabbit Hole.” Abroad, after features on Spotify and Apple Music playlists, FLAUNT Magazine deemed her “nothing short of a manifold visionary.”\n\nJaguar Jonze’s music is multi-dimensional, representing her multicultural roots with her Taiwanese mom and her Australian Dad. Ultimately, Jaguar Jonze—and its adjacent projects, her narrative illustration project Spectator Jonze and her gender-subverting photography project Dusky Jonze—would become powerful ways in which Deena could process her most intimate vulnerabilities and traumas, while also using it to empower those around her to do the same. Her art in all facets, whether it be her music, visual art or photography is a logical extension of these vulnerabilities with each project mining depths of her personality.\n\n“I can’t do anything without meaning,” she says of her visual artwork via Spectator Jonze. Through bold pop art that dabbles in surrealism, she destigmatizes mental-health issues by interviewing her subjects before drawing them. Deena’s 50th portrait came after a year into the project confronted her own PTSD stemming from her unstable, unsafe childhood. “I realized when I stepped out of hiding, I could actually move forward, feel less isolated. I want other people to unburden themselves from the wasted extra energy spent pretending and hiding.” Sometimes she finds her subjects; other times, they find her. “There’s a girl in the States; she’s still one of my favorite drawings. She reached out to me, having come to terms with her psychosis, depression and anxiety. The level of awareness and openness she had really moved me because I was oblivious to the stigma I still held over the mental illnesses I hadn’t yet been exposed to,” Deena says. “We still have this pen pal relationship with each other. We’ve never met in person, but I think she’s one of the biggest supports in my everyday life.”\n\nDusky Jonze, Deena’s most recent endeavor uses photography to subvert gender roles and highlight toxic masculinity through intimate portraits. “We don’t talk about toxic masculinity enough. So, I thought it’d be funny to just shoot male photographers,” she says of the evocative nude portraits. “And they were open to it. They’d say, ’You know what? This makes me a better photographer.’” Consequently, the photo project has grown and become a more fluid effort to undo insecurities and taboos of both the male and female body, within the engendered eye of the photographer. As dramatic as the photos can be, they can also be quite funny. For example, when Deena obscures male genitalia with a banana. “I wanted it to be crass and crude. I like testing boundaries and making people question why they’re uncomfortable,” she says, laughing.\n\nEvery project Deena creates has its unique identities, but each weaves a common thread throughout, tying them right back to Deena Lynch as just herself, the person, each one confronts shame, vulnerability, trauma and taboos in an authentic honest way. “Everything I do stems from the need for dialogue - Jaguar being an internal dialogue with my subconscious, Spectator being an external dialogue with others on mental health and the mind, and Dusky being a dialogue with the body” she explains. In their own way, each is a collaboration, be it literal or metaphoric. Her mission is simple: “I want people to feel. And I want them to think,” she says, “and obviously, I want them to enjoy themselves too.”", "otherInfo": "No other event info available"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Tre Burt ", "ArtistImage": "https://photos.bandsintown.com/thumb/9661963.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Indie, Folk, Americana", "Time": "7:00 PM", "Venue": "Cafe Du Nord", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Half Stack ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421188, 37.760565], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "JEFF The Brotherhood at The Chapel"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Rotciv ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433417, 37.784563], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Boom Boom Room", "moreBioInfo": "No artist bio available", "otherInfo": "Return of the Cypher - Freee Live Hip Hop Party"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "LaDy-SN3AK ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.269962, 37.871601], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "Raise the Bay will highlight female-identifying singer/songwriters and spoken word artists in the Bay Area."}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "LaDy-SN3AK ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.269962, 37.871601], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "Raise the Bay will highlight female-identifying singer/songwriters and spoken word artists in the Bay Area."}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "Winona Forever ", "ArtistImage": "https://photos.bandsintown.com/thumb/9123798.jpeg", "Coordinates": [-122.463777, 37.783225], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Neck Of the Woods", "moreBioInfo": "Winona Forever is a pop band currently residing in Montreal, QC. Since forming in 2014, the band has strived to create the best possible self-produced content. Easygoing at first listen, Winona Forever crafts tight, groovy indie pop that takes as much influence from 70’s feel-good music as bedroom pop. Prioritizing punchy rhythms and fun melodies, they create a sound that is wholly contemporary.\n\nWinona Forever will be touring new album “FeelGood” in Canada following it's June 7th release and continue spreading their love of music, with an independent spirit.", "otherInfo": "Super City, Winona Forever, The Moondrops, Lunar Hand at Neck of the Woods"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Ryse ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.269962, 37.871601], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "No artist bio available", "otherInfo": "Raise the Bay will highlight female-identifying singer/songwriters and spoken word artists in the Bay Area."}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "SUPER CITY ", "ArtistImage": "https://photos.bandsintown.com/thumb/7867440.jpeg", "Coordinates": [-122.463777, 37.783225], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Alternative", "Time": "8:00 PM", "Venue": "Neck Of the Woods", "moreBioInfo": "Listen to us on Spotify! https://open.spotify.com/artist/2I3Pl8SPFNNQMRTEYCLVwZ?si=YaTYjIPwQS6LrHnob47Piw\n\nBaltimore-based Super City was formed in 2014 by song writers Dan Ryan and Greg Wellham. Since releasing their debut self titled EP and their full length Again Weekend, Super City has performed and toured extensively, bringing their infectious choreographed dance rock to the stage with acts such as White Denim, Bent Knee, Rubblebucket, Tera Melos and Vetiver. They recently finished recording their sophomore record, which is slated for release in Spring 2018. Super City is driving pop that brings Tears for Fears, Prince and Queens of the Stone Age to mind.", "otherInfo": "Super City, Winona Forever, The Moondrops, Lunar Hand at Neck of the Woods"}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "Rap Battles ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433417, 37.784563], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Boom Boom Room", "moreBioInfo": "No artist bio available", "otherInfo": "Return of the Cypher - Freee Live Hip Hop Party"}, {"Address": "406 Clement St, San Francisco, CA 94118", "Artist": "The Moondrops ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.463777, 37.783225], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Neck Of the Woods", "moreBioInfo": "No artist bio available", "otherInfo": "Super City, Winona Forever, The Moondrops, Lunar Hand at Neck of the Woods"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "JEFF the brotherhood ", "ArtistImage": "https://photos.bandsintown.com/thumb/6739659.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Psych, Grunge, Alternative, Indie, Rock", "Time": "8:00 PM", "Venue": "The Chapel", "moreBioInfo": "The best rock ’n’ roll, the kind that gets under your skin and makes all your senses heighten, is simple and comprised of hard work and unrelenting passion—all of which JEFF The Brotherhood. JEFF The Brotherhood embody and exemplify on their Warner Bros. Records debut LP, Hypnotic Nights. Brothers Jake and Jamin Orrall have been playing together since they were little kids and formed the group when they were in high school. The boys grew up with a voracious appetite for any music they could get their hands on. The band incorporates a DIY ethos in everything they do, including their raucous live shows. JEFF have been touring tirelessly for the past 10 years, playing any and all conceivable venues—from basements and backyard sheds to Bonnaroo and The Bowery Ballroom. The duo clocked in over 400 shows in the past two years alone and have shared bills with Best Coast, Fucked Up, Pentagram, The Kills, The Greenhornes and more. When it comes to creating their desired sound, JEFF believes that less is more. This idea is reflected in Jake’s decision to play a guitar with only three strings. Jake explains, “When we started the band, I didn’t know how to play guitar,\" he remembers, “I thought, in order to teach myself, it would be easier to play if I simplified it. I started with two strings, but you can’t really play any chords that way, so I added a third string [which added] this interesting limitation that forced me to create my own style and approach to the instrument.” These musical intricacies all come together on Hypnotic Nights, which was co-produced by Jake, Jamin and musician/producer Dan Auerbach (Dr. John, The Ettes). The album was recorded in Nashville at Dan’s Easy Eye Sound Studio in early 2012. JEFF entered the studio focused and prepared with a clear vision for the album they wanted to make, completing Hypnotic Nights in only one week. For any other band, completing an album in seven days would seem like a challenging feat, but for JEFF those seven days felt like a luxury when compared to the amount of time spent on making 2009’s Heavy Days and 2011’s We are The Champions, which were released on the band’s own label Infinity Cat Recordings. Each took only three days to make. “We’ve never worked with a producer before, so this was the first time we’d ever had any outside input,” says Jamin. “It was Dan’s first co-production, too, and it really worked. He just hung out, let us do our thing and helped when we needed it.” Adds Jake, “We write songs without anyone else in mind, so Dan brought in this idea of, ‘Well, you guys do what you do and I’ll present it so everyone else will understand.’” The result is Hypnotic Nights, an album that uniquely blends elements of indie, punk, garage, and psychedelic rock. The first single, “Sixpack,” is a fuzzed-out rocker driven by reverb-heavy riffs and propulsive drumbeats. Songs like “Leave Me Out” and “Dark Energy” venture into new musical territory for JEFF, but the band isn’t afraid of experimentation. After all, it’s this imagination and ingenuity that makes Dan Auerbach plainly say, “JEFF The Brotherhood are the next big name in showbiz.” In the end, Jake and Jamin just want to write great songs, play great shows and inspire fans to rock along with them. For JEFF The Brotherhood, blood is thicker than water—and music runs through the band’s veins. JTB's new album 'Wasted On The Dream' NOW available.", "otherInfo": "JEFF The Brotherhood at The Chapel"}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "Esha K ", "ArtistImage": "https://photos.bandsintown.com/thumb/8975156.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Pop, Classic Rock, Alternative, Indie Pop, Acoustic, Pop Singer-songwriter", "Time": "8:00 PM", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "An upcoming singer-songwriter from the San Francisco Bay Area, Esha K. creates a unique blend of heartfelt lyrics, powerful vocals, and catchy guitar riffs. With the perfect balance, she combines these musical elements to deliver songs that appeal to people from all walks of life.\n\nEsha's style of music is a blend of characteristics from the alternative, pop/rock, classic rock, and singer-songwriter genres. Some of her major musical influences include Kodaline, Journey, Adele, and Fleetwood Mac. As far as favorite music goes, her music taste ranges from rock/alternative groups like Nothing But Thieves to singer-songwriters like James Bay and Ed Sheeran.\n\nShe has proven that she has the stamina required to be a touring musician, playing sets up to four hours long. Through her music, Esha has formed connections with people of all ages and has developed a dedicated fanbase.\n\nMusic defines her and has been her escape, her love, and her passion for as long as she can remember. She has been writing songs since the age of 14 and has found a great solace and love for expressing emotions through such a form.\n\nEsha K. has been recognized for her music since the age of 13, winning various talent competitions, scholarships, and international accolades for her craft. Most notably, she placed in an international contemporary vocal competition and was invited to perform at the Isaac Stern Auditorium in Carnegie Hall in early June of 2018. While in New York for her Carnegie Hall performance, Esha embarked on a self-organized mini-tour of New York City - to promote her debut EP, \"Wolf River\" - and played 6 shows in 6 nights in the various different boroughs of the city. Esha K. worked GRAMMY-winning producer, Brian Gibbs, on the production of her EP and two singles. Listeners can expect her full-length debut album by the end of the year.", "otherInfo": "Raise the Bay will highlight female-identifying singer/songwriters and spoken word artists in the Bay Area."}, {"Address": "2036 University Ave, Berkeley, CA 94704", "Artist": "The Breeze ", "ArtistImage": "https://photos.bandsintown.com/thumb/6059164.jpeg", "Coordinates": [-122.269962, 37.871601], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Le Château dans le Ciel", "Time": "8:00 PM", "Venue": "The UC Theatre Taube Family Music Hall", "moreBioInfo": "╫ RIVIERA ╫ ► \"On écoute les kids les plus prometteurs et avant-gardistes de Bordeaux : The Breeze. A peine 20 ans et ils ont déjà le culot de produire un shoegaze chanté en français, il fallait y penser !\" - Newcomers - LE MOUV' ► \"RIVIERA propose une esthétique très forte et très cohérente qui fait plaisir à entendre de la part d’un groupe si jeune. A peine majeurs, les membres impressionnent par leur maturité et le spectre de leurs influences. Aucun doute, une musique si sombre ne peut déboucher que sur des lendemains radieux.\" - RICARD S.A LIVE ► \"Entre rythmes entêtants, mélodies mélancoliques et textes sombres, les Bordelais réussissent un coup de maître en prouvant que la nouvelle scène française peut faire danser un public sans forcément parler amour et coquillages.\" - ACROSS THE DAYS ► \"C’est nourri de nombreuses influences que The Breeze crée un univers bien à lui. Avec leur EP RIVIERA qui paraît le 14 avril, les quatre garçons abattent une barrière entre pop sombre et cold wave à coup de nappes de guitares, de basses et de synthés. Ils s’aventurent même en contrée shoegaze avec l’insouciance de leurs 20 ans.\" - HAPPEN ► \"Having heard the upcoming EP in full, I can safely say you’re in for a special treat. It’s eargasms at every keynote… The Breeze is a band with immense potential, against all odds. A force of nature, that won’t leave your senses untouched. Their dark-pop is growing on me like an obsessive addiction.\" - SODWEE ► \"Un vent nouveau souffle sur Bordeaux, THE BREEZE est un groupe hors-normes, à contre-courant. Leur pop noire est addictive. [...] C'est un ovni tombé d'une planète pas si lointaine. Le quatuor Bordelais sort un nouvel EP, VAPEURS MECANIQUES, à couper le souffle d'ingéniosité.\" // Les Inrocks Lab ► \"Un vent nouveau souffle sur Bordeaux, il s'appelle THE BREEZE et façonne une pop noire addictive.\" // Les Inrockuptibles ► \"Averses de tubes sur le dernier EP de The Breeze, du Jourdain à Montréal en passant par la Côte Sauvage, préparez-vous à un voyage vaporeux et mécanique. Décollage immédiat.\" // Artist Up ► \"Ca prend aux tripes dans une danse lancinante quasi funèbre. Une fois sorti de leur emprise sonore, comme si on avait frôlé la mort dans un virage de montagne, on se sent encore plus vivant. Le voyage est dangereux, excitant, intense mais éminemment régénérant. A vivre. Leur EP « Vapeurs Mécaniques » vient de sortir. \" // Upstair Downstair ► \"THE BREEZE, c’est un peu l’ovni musical du printemps 2013. Vous pensiez connaitre tous les alchimistes ? Détrompez vous. En voilà des nouveaux !\" // Some Are On The Way ► \"Tamponnées sur un immeuble, atmosphère de banlieue asphyxiée, les vapeurs mécaniques longent les murs. Elles frôlent nos poumons au détour d’une inspiration, comme une bouffée d’oxygène vaporisée d’une dose toxique de dépendance.\" // Désimposture HOLOGRAMMES EP I Out on the 16th of April", "otherInfo": "Raise the Bay will highlight female-identifying singer/songwriters and spoken word artists in the Bay Area."}, {"Address": "201 Franklin St, San Francisco, CA 94102", "Artist": "Terri Lyne Carrington ", "ArtistImage": "https://photos.bandsintown.com/thumb/9576275.jpeg", "Coordinates": [-122.42155, 37.77637], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "R&b, Hip Hop, Jazz", "Time": "8:00 PM", "Venue": "SFJazz Center", "moreBioInfo": "GRAMMY® award-winning drummer, composer and bandleader Terri Lyne Carrington was born in 1965 in Medford, Massachusetts. After an extensive touring career of over 20 years with luminaries like Herbie Hancock, Wayne Shorter, Al Jarreau, Stan Getz, David Sanborn, Joe Sample, Cassandra Wilson, Clark Terry, Dianne Reeves and more, she returned to her hometown where she was appointed professor at her alma mater, Berklee College of Music. Terri Lyne also received an honorary doctorate from Berklee College of Music in 2003.\n\nAfter studying under full scholarship at Berklee, with the encouragement of her mentor, Jack DeJohnette, Carrington moved to New York in 1983. For 5 years she was a much in-demand musician, working with James Moody, Lester Bowie, Pharoah Sanders, and others. In the late ‘80s she relocated to Los Angeles, where she gained recognition on late night TV as the house drummer for the Arsenio Hall Show, then again in the late ‘90s as the drummer on the Quincy Jones late night TV show, VIBE, hosted by Sinbad.\n\nIn 1989, Carrington released a GRAMMY®-nominated debut CD on Verve entitled Real Life Story, which featured Carlos Santana, Grover Washington Jr., Wayne Shorter, Patrice Rushen, Gerald Albright, John Scofield, Greg Osby, and Hiram Bullock. Other solo CDs include 2002’s Jazz is a Spirit, which features Herbie Hancock, Gary Thomas, Wallace Roney, Terence Blanchard, Kevin Eubanks, and Bob Hurst, and 2004’s Structure, a cooperative group which features Adam Rogers, Jimmy Haslip and Greg Osby. Both CDs were released on the Europe-based ACT Music label and enjoyed considerable media attention and critical acclaim in the European and Japanese markets.\n\nCarrington’s production and songwriting collaborations with artists such as Gino Vannelli, Peabo Bryson, Dianne Reeves, Siedah Garrett, Marilyn Scott have produced notable works as well, including her production of the Dianne Reeves GRAMMY®-nominated CD, That Day, as well as Dianne Reeves GRAMMY® Award-winning CD, Beautiful Life, in 2014.\n\nCarrington has performed on many recordings throughout the ‘80s and ‘90s thru today. Notable examples of her work include Herbie Hancock’s GRAMMY® Award-winning CD Gershwin’s World, where she played alongside Joni Mitchell and Stevie Wonder. She has toured in many of Hancock’s musical configurations (from electric to acoustic) and is featured on his Future2Future DVD.\n\nAfter a hiatus from the U.S. recording scene as a solo recording artist, Carrington returned in 2008 with More To Say... (Real Life Story: NextGen). Joining her was an impressive all-star cast of jazz and contemporary jazz instrumentalists, including George Duke, Everette Harp, Kirk Whalum, Jimmy Haslip, Greg Phillinganes, Gregoire Maret, Christian McBride, Danilo Perez, Patrice Rushen, Robert Irving III (who also serves as co-producer), Chuck Loeb, Dwight Sills, and legendary vocalists Les McCann and Nancy Wilson.\n\nCarrington released The Mosaic Project in 2011, her fifth recording overall and first on Concord Jazz. The critically acclaimed CD, which won a GRAMMY® Award for Best Jazz Vocal Album, gathered a myriad of voices and crystallized them into a multi-faceted whole that far outweighed the sum of its parts. She produced the 14-song set which included some of the most prominent female jazz artists of the last few decades: Esperanza Spalding, Dianne Reeves, Dee Dee Bridgewater, Sheila E., Nona Hendryx, Cassandra Wilson, Geri Allen and several others. Carrington said the emergence of so many great female jazz instrumentalists over the last couple of decades is what made an album like The Mosaic Project possible.\n\nIn 2013, Carrington released Money Jungle: Provocative in Blue, her much anticipated homage to Duke Ellington, Charles Mingus and Max Roach, to coincide with the 50th anniversary of the release of their iconic 1963 Money Jungle album. The recording featured Gerald Clayton and Christian McBride, with guests Clark Terry, Lizz Wright, Herbie Hancock and others. Carrington made history when she became the first woman to win a GRAMMY® Award for Best Jazz Instrumental Album.\n\nOn August 7, 2015, Carrington releases The Mosaic Project: LOVE and SOUL. Like its predecessor, the album presents Carrington leading a rotating cast of superb female instrumentalists and vocalists that includes Oleta Adams, Natalie Cole, Paula Cole, Lalah Hathaway, Chaka Khan, Chanté Moore, Valerie Simpson, Nancy Wilson, Jaguar Wright and Lizz Wright, as well as saxophonist Tia Fuller, trumpeter Ingrid Jensen; bassists Meshell Ndegoecello and Linda Oh; and keyboardists Geri Allen, Patrice Rushen and Rachel Z.\n\nOn The Mosaic Project: LOVE and SOUL, Carrington juxtaposes her salute to female artists by paying homage to various male artists who have either influenced her professionally and/or informed her musicality, such as Nick Ashford, George Duke, Duke Ellington, Frank Sinatra, Luther Vandross and Bill Withers. “Whenever I do something that celebrates women, I never want it to feel like it’s something that excludes men,” she explains. “On this record, I consciously wanted to celebrate the various relationships women have with men either through original songs of mine or cover songs by male composers and song writers.” The male presence and perspective on The Mosaic Project: LOVE and SOUL is even more realized by Billy Dee Williams, who contributes insightful spoken-word interludes through the disc.", "otherInfo": "This evening celebrates the centenary of one of the most innovative and influential artists in modern musical history, but rather than imitating the original, it explores new perspectives on Parker's signature style.\n\nCo-directed by Terri Lyne Carrington and Rudresh Mahanthappa."}, {"Address": "201 Franklin St, San Francisco, CA 94102", "Artist": "Rudresh Mahanthappa ", "ArtistImage": "https://photos.bandsintown.com/thumb/8170528.jpeg", "Coordinates": [-122.42155, 37.77637], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Jazz", "Time": "8:00 PM", "Venue": "SFJazz Center", "moreBioInfo": "Few musicians share the ability of Rudresh Mahanthappa to embody the expansive possibilities of his music with his culture. The saxophonist/composer hybridizes progressive jazz and South Indian classical music in a fluid and forward-looking form reflecting his own experience growing up a second-generation Indian-American. Just as his personal experience is never wholly lived on one side of the hyphenate or the other, his music speaks in a voice dedicated to forging a new path forward.\n\nThe current manifestations of that trajectory include his latest project Bird Calls (2015), which was named #1 album of the year by both Downbeat and NPR Music’s Jazz Critics Poll. This 21st Century tribute to Charlie Parker, which Downbeat Magazine recently named Best Album of 2015, includes a stellar band of pianist Matt Mitchell, bassist François Moutin, drummer Rudy Royston, and 20-year old trumpet prodigy Adam O’Farrill. The 2013 album Gamak featured guitarist David “Fuze” Fiuczynski, whose own microtonal vocabulary opened new possibilities for Mahanthappa’s compositional imagination, alongside bassist Francois Moutin and drummer Dan Weiss. The 2010 release of Samdhi (ACT Music + Vision), a multi-cultural ensemble that advances Mahanthappa’s blend of jazz and Indian music with modernist electronic music, was described by JazzTimes as “a landmark convergence of styles that didn't lend itself to easy analysis... new music of this caliber hasn't been attempted before.” Other recent projects run the gamut from the cross-generational alto summit Apex featuring Bunky Green; trios MSG and Mauger; the quintet Dual Identity co-led with fellow altoist Steve Lehman; and Raw Materials, his long-running duo project with pianist Vijay Iyer. Mahanthappa also continues to partner with Pakistani-American guitarist Rez Abbasi and innovative percussionist Dan Weiss in the Indo-Pak Coalition, while giants in both jazz and South Indian music have recognized his success: he was enlisted by Jack DeJohnette for the legendary drummer’s new working group, while a collaboration with the renowned Carnatic saxophonist Kadri Gopalnath resulted in Mahanthappa’s critically- acclaimed 2008 CD Kinsmen (Pi).\n\nHailed by the New York Times as possessing “a roving intellect and a bladelike articulation,” Mahanthappa has been awarded a Guggenheim Fellowship, two New York Foundation for the Arts Fellowships, and numerous commissions. He has been named alto saxophonist of the year four of the past five years in Downbeat Magazine’s International Critics Polls and for five years running by the Jazz Journalists’ Association. In April 2013, he received a Doris Duke Performing Artist Award, one of the most prominent arts awards in the world. In 2015, he was named a United States Artists Fellow.\n\nMahanthappa is a Yamaha artist and uses Vandoren reeds exclusively.", "otherInfo": "Acclaimed co-musical directors Rudresh Mahanthappa (alto saxophone) and Terri Lyne Carrington (drums) celebrate jazz master Charlie Parker, one of the most innovative and influential artists in modern musical history and examine his impact in pop, hip-hop, rap, rock, and jazz.\nJoined by a superb lineup including Charenée Wade (vocals), Adam O’Farrill (trumpet), Kris Davis (piano), Larry Grenadier (bass) and Kassa Overall (DJ), Mahanthappa and Carrington will honor Charlie Parker’s centennial year by showcasing “Bird’s” uncompromising musical joy, humor, and beauty by mining his deep repertoire and showcasing new, modern compositions."}, {"Address": "1601 Fillmore St, San Francisco, CA 94115", "Artist": "The Gemstone Band ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433417, 37.784563], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Boom Boom Room", "moreBioInfo": "No artist bio available", "otherInfo": "Return of the Cypher - Freee Live Hip Hop Party"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "The Aquadolls ", "ArtistImage": "https://photos.bandsintown.com/thumb/9302069.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Psychedelic Surf Punk", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "♡ the-aquadolls.com ♡\n♡ MERCH ♡\nhttp://theaquadolls.storenvy.com\n♡ DIGITAL ALBUMS ♡\nhttp://theaquadolls.bandcamp.com", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $17 Adv & $21 Day of Show"}, {"Address": "3223 Mission St, San Francisco, CA 94110", "Artist": "Darksoft ", "ArtistImage": "https://photos.bandsintown.com/thumb/9853807.jpeg", "Coordinates": [-122.419787, 37.745082], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Dream Pop, Indie Rock, Shoegaze, Alternative Rock, Sadcore", "Time": "8:30 PM", "Venue": "Knockout", "moreBioInfo": "With guitar-driven hooks, crystalline vocal melodies, and powerful songwriting, Darksoft will haunt your very digital mainframe.", "otherInfo": "PURE HEX (san francisco shoegaze)\nhttps://purehex.bandcamp.com\n\nDARKSOFT [on tour!] (seattle alt gazey rock)\nhttps://darks0ft.bandcamp.com\n\nBILLIE GALE (oakland atmospheric dream pop)\nhttps://billiegale.bandcamp.com\n\nPANCHAEANS (oakland psych-pop)\nhttps://panchaeans.bandcamp.com\n\nCome join us at The Knockout Sunday March 29th for an evening of music and revelry ~~\n\n\n21+ // $7 // 8:30pm"}, {"Address": "1419 Fillmore St, San Francisco, CA 94115", "Artist": "Bohemian Knuckle Boogie ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433317, 37.782618], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Sheba Piano Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Bohemian Knuckleboogie at Sheba Piano Lounge: Don't let the hokey exterior fool you, this place offers a comfortable, even classy setting in the heart of the Fillmore. Perhaps Meatless Mondays will draw you in, as all Ethiopian restaurants seem to have great vegetarian menus. This one costs more, but delivers the goods (they've even made the injera upscale), as does the cocktail list. Half the house cocktails are made with Ethiopian spiced bitters - and even the others are suitably named, such as the Abyssinian Storm (which is essentially a Dark and Stormy, but a really good one) - or you can order Tej, traditional honey wine. Note: This is not for the budget drinker. As for the piano lounge, expect a soloist early in the week, but midweek to weekend nights is when a trio completes the ambiance."}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Japan Nite ", "ArtistImage": "https://photos.bandsintown.com/thumb/7517449.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "J-rock, Punk", "Time": "8:30 PM", "Venue": "Bottom Of the Hill", "moreBioInfo": "A South By Southwest staple, the coolest Japanese indie rock, punk and obscure culture extravaganza with another killer line-up.\nSince 1996, Japan Nite has been showcasing both big-name Japanese artists and acts rising up in the country’s music scene at SXSW, followed by a tour across the United States. After celebrating two decades of shows in Austin last year, the 2017 edition of Japan Nite picks up right where it last left off, introducing fresh-faced Japanese performers to North America.\n\nJapan Nite facebook\nhttps://www.facebook.com/JapanNite\n\nJapan Nite Twitter\nhttps://twitter.com/japannite\n\nJapan Nite instagram\nhttps://www.instagram.com/japannite", "otherInfo": "SXSW staple, the coolest Japanese indie rock, punk and obscure culture showcase is coming back to NY, Chicago, Las Vegas, LA and SF.Don't miss the best and latest Japanese bands.\n\n3/29 Sun San Francisco CA\nDoors 8:30 pm Show: 9:00 pm\nThe ticket $10 in advance / $12 at the door\n*All Age\n@ Bottom of the Hill\n1233 17th St, San Francisco, CA 94107\nhttp://www.bottomofthehill.com/calendar.html\nWith\nKyusonekokami\nUCHIKUBIGOKUMON-DOUKOUKAI\nTHE TOMBOYS\nSupport Act: Electric Machine Gun Tits (SF)\n\n【Japan Nite US tour 2020 】\n3/16-3/21 TBA @SXSW Austin TX\n3/22 Sun @Knitting Factory – Brooklyn NY\n3/24 Tue @Chop Shop Chicago IL\n3/26 Thu @B Side House of Blues Las Vegas NV\n3/28 Sat @ The Hi Hat Los Angeles CA\n3/29 Sun @Bottom of the Hill San Francisco CA"}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Electric Machine Gun Tits ", "ArtistImage": "https://photos.bandsintown.com/thumb/8332316.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Garage, Surf, Punk", "Time": "8:30 PM", "Venue": "Bottom Of the Hill", "moreBioInfo": "LECTRIC MACHINE GUN TITS are a two piece Rock n Roll - Punk duo, based out of the San Francisco Bay area since the winter of 2015.\n\nNaoko Nozawa on lead vocals and synth.\nTora Fujimoto on guitar and vocals.\n\nThey have toured New York, Spain and have done four summer tours through Japan in 2016, 2017, 2018 and 2019.\n\nThey released their 1st album- \"LOVE AND PUKE,\" in June 2017, 2nd album- \"PINK GUTS,\" in June 2018 and 3rd album \"SUNGLASSES SAMURAI\" in May 2019.", "otherInfo": "SXSW staple, the coolest Japanese indie rock, punk and obscure culture showcase is coming back to NY, Chicago, Las Vegas, LA and SF. Don't miss the best and latest Japanese bands.\n\n3/29 Sun San Francisco CA\nDoors 8:30 pm Show: 9:00 pm\nThe ticket $10 in advance / $12 at the door\n*All Age\n@ Bottom of the Hill\n1233 17th St, San Francisco, CA 94107\nhttp://www.bottomofthehill.com/calendar.html\nWith\nKyusonekokami\nUCHIKUBIGOKUMON-DOUKOUKAI\nTHE TOMBOYS\nSupport Act: Electric Machine Gun Tits (SF)\nand “Tokyo Beatniks’ DJ Marty Hard”\n\n【Japan Nite US tour 2020 】\n3/16-3/21 TBA @SXSW Austin TX\n3/22 Sun @Knitting Factory – Brooklyn NY\n3/24 Tue @Chop Shop Chicago IL\n3/26 Thu @B Side House of Blues Las Vegas NV\n3/28 Sat @ The Hi Hat Los Angeles CA\n3/29 Sun @Bottom of the Hill San Francisco CA\n\nKYUSO NEKOKAMI-\nare Japanese 5-piece Rock band.\nThe band name means “a cornered rat will bite the cat” in English.\nThey started from 2010 in Nishinomiya, Japan.\nThe genre of their music is “Rock / Punk rock / Alternative/ Post Hard-Core / Pop Punk / Experimental”. They play about 100 shows and more than 20 music festivals in Japan every year. They are hugely popular with Japanese youth.\nhttp://kyusonekokami.com\nhttps://www.instagram.com/kyuso_official\nhttps://twitter.com/KYUSO_NEKOKAMI\nhttps://youtu.be/JDsYwLsOXwk\n\n\nTHE TOMBOYS\nThe Tomboys are a 4-piece girl band from Kobe, Japan that take classic rock sensibilities and style and mash them up with modern-day pop music in a delightfully-sweet powerpop s’more that is taking Japan by storm!\nIn 2017 they went to London for the recording with producer Glen Matlock (former member of the Sex Pistols!!) While in London, The Tomboys played their first show abroad, sharing a bill with Glen Matlock himself!\nIn 2018 The Tomboys fly to Europe to perform. France, Italy, Germany and UK. They played 14 shows in 17days.\nhttp://thetomboys.net\nhttps://www.instagram.com/_the_tomboys_\nhttps://twitter.com/the_tomboys\nhttps://www.youtube.com/watch?v=rSK3ULAQuFk&feature=youtu.be\nhttps://open.spotify.com/album/0iO6zBzBmEyS4bpSlikwef\n\n\nUchikubi Gokumon Dokoukai\nFormed in 2004. Gt / Vo. Three-piece band by Atsushi Osawa, Dr / Vo. Asuka Kawamoto, Ba / Vo.junko. An unusual genre of female vocalists and male rhythm corps. Established a new genre of “life-adherent loud rock” with a unique style with a strange sound full of life in the roaring sound of 7-string Gt and 5-string Ba. . Gradually grabbing the hearts of a wide range of people, young and old, in March 2018, the band's first “Nippon Budokan One-Man Live” was a great success. In 2019, celebrating the 15th anniversary of the formation, we are actively working on a tour for the release of a year from March to February the following year, centered on September of the formation month.\nhttps://twitter.com/uchikubigokumon?s=17\nhttps://open.spotify.com/album/2oB35od7v4QSAn0OpnMCwH?si=JhBPsHkkQXaYpL-NX8djMA\nhttps://youtu.be/Yv6shy_9KVM\nhttps://music.apple.com/jp/album/獄至十五/1479174947\n\n\nELECTRIC MACHINE GUN TITS\ntwo piece Rock n Roll - Punk duo, based out of the San Francisco Bay area since the winter of 2015.\nNaoko Nozawa on lead vocals and synth.\nTora Fujimoto on guitar and vocals.\nThey have toured New York, Spain and have done four summer tours through Japan in 2016, 2017, 2018 and 2019.\nELECTRIC MACHINE GUN TITS have shared the stage with GUITAR WOLF, PUFFY AMI YUMI, SHONEN KNIFE, THE 5.6.7.8's, LOLITA No18, REVEREND BEAT-MAN,\nBOB LOG III and many others.\nThey released their 1st album- \"LOVE AND PUKE,\" in June 2017, 2nd album- \"PINK GUTS,\" in June 2018 and 3rd album \"SUNGLASSES SAMURAI\" in May 2019.\nhttps://www.electricmachineguntits.com/emgt\nhttps://www.facebook.com/ElectricMachineGunTits\nhttps://twitter.com/EMGT_official\n\nmore info:\nhttp://www.bottomofthehill.com/20200329.html"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Social Animals ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $17 Adv & $21 Day of Show"}, {"Address": "San Jose, CA", "Artist": "Fashawn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8009184.jpeg", "Coordinates": [-121.8261, 37.2751], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Hip Hop", "Time": "9:00 PM", "Venue": "Back Bar Sofa", "moreBioInfo": "Fashawn \"The Ecology\" Album (featuring Nas, Aloe Blacc, Dom Kennedy, BJ the Chicago Kid, and more)\nPurchase Link: found.ee/theecology\n\nWhat did you do the year you turned 21? Hip-hop prodigy Fashawn earned a spot on the cover of XXL magazine, toured the world and built a rep as one of rap's new rising stars.\n\nFashawn's debut album, \"Boys Meets World,\" was heralded by critics and fans alike as one of the best albums of 2009 for its gritty, street-wise and intelligent rhymes. Some even compared his introductory opus to Nas' brilliant \"Illmatic.\" It was enough for XXL to name Fashawn to its list of hip-hop's best freshman.\n\nIn 2010 he toured domestically with Wiz Khalifa, then followed that up with a Talib Kweli tour. Fashawn is also no stranger to the International Hip Hop scene touring with Dilated Peoples in 2009 and most recently Rakim in 2011. From coast to coast, and from continent to continent, everyone agreed -- they weren't seeing some fly-by-night novelty act, they were seeing one of hip-hop's freshest new voices.\n\nMany took notice: He worked with Grammy-winning producers Dr. Dre, DJ Khalil and Alchemist, featured on songs with J. Cole, Aloe Blacc and a handful of tomorrow's future stars. Skateboard apparel company Etnies and urban clothing line Orisue both turned to him for endorsements. Camp Woodward, the biggest extreme sports camp in the world, recruited him to create a song/tv commercial and his hometown Fresno Grizzlies (AAA baseball) have made custom Fashawn merchandise to sell at their events. So that's legendary hip-hop producers, international clothing lines and a pro sports franchise all wanting to be part of Team Fashawn\n\nWith a strong hip-hop pedigree (think Rakim's merciless rhymes plus 2pac's outlaw spirit plus Nas' effortless flow) and a loyal fan base of young listeners, Fashawn seems poised for the long haul.", "otherInfo": "Doors: 9:00 pm / Show: 10:00 pm, 21+"}, {"Address": "2395 Monument Blvd, Concord, CA 94520", "Artist": "Fulanito ", "ArtistImage": "https://photos.bandsintown.com/thumb/6839279.jpeg", "Coordinates": [-122.035618, 37.959908], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Merengue, Latin", "Time": "9:00 PM", "Venue": "El Billar de Concord", "moreBioInfo": "With nearly 2 million albums sold worldwide, performances at the world's top Latin music festivals, and a recent Grammy nomination, Fulanito is one of the most popular and innovative acts ever born of the fertile uptown New York Latin hip-hop scene.\n\nThe brainchild of the group's founder, lead writer and rapper Rafael Vargas, Fulanito is the first group known to combine \"perico ripiao\" - traditional accordion-based merengue sounds from the hills of the Dominican Republic - with modern hip-hop and rap.\nWhile industry leaders initially questioned the commercial potential of such an unusual mix of sounds, Fulanito proved them wrong, becoming a party favorite in the U.S., the top-selling act in Colombia, and one of the most recognizable and adored Latin acts from Chile to Switzerland to Japan.\n\nWith their 1997 debut album, \"El Hombre Mas Famoso de la Tierra\" \"(The Most Famous Man in the Land,)\" Fulanito fast gained international fame with the hit singles \"Guallando\" (\"Grinding\") and \"La Novela\" (\"The Soap Opera.\") The album sold 500,000 copies, shocking even Vargas, who says he expected it to sell no more than 10,000, and hoped it would simply \"help us get gigs\".\n\n\"Guallando\" featured 61-year-old accordionist Arsenio de la Rosa's lightening chops, and was a surprise hit, co-opted for jingles spun endlessly in nightclubs across the hemisphere. According to Miami-based music writer Karl Ross, \"Guallando\" marked the first time U.S.-born Dominican performers began to mine their musical roots for inspiration. The addictive, resulting sound appeals as readily to rap fans and world music aficionados - and to many in between. Boston Globe music writer Elijah Wald called Fulanito's sound \"fresh and hip, completely different from the mechanical beat of most house fusions\". The word \"Fulanito\" means, roughly, \"Little John Doe\" in Spanish slang. The roots of the word lie in West Africa, where Spaniards kidnapped men and women to be brought to Spanish colonies in the New World. Among the people brought to the Spanish Caribbean were those of the Fulani nation, known in Africa as great merchants. They brought their skills of commerce with them, and eventually it was known in the Caribbean that if you wanted something done, you went to the Fulani, or business guy.\n\nVargas, who is proud of his African lineage, was born in the Washington Heights neighborhood of Manhattan, one year after his parents immigrated from the Dominican Republic, and grew up in a home saturated with tradition Latin sounds, including his mother's favorites: merengue and bolero.\nIn the early 1990s Vargas scored an international dance/house music hit in English with \"Wiggle It\", recorded by his first organized group, 2 in a Room. The single sold more than 2 million copies worldwide. Vargas formed a follow-up group, the 740 Boyz, with Winston de la Rosa - Arsenio de la Rosa's son.\nWhile hanging out at the de la Rosa household, Vargas was treated to many impromptu concerts by the elder de la Rosa, and was reminded of how excited Dominicans got when they heard the traditional old merengue sounds. Having shunned his parents' music for most of his life, Vargas suddenly became intrigued by the idea of combining rap, hip-hop and perico ripiao. He asked the elder de la Rosa if he would mind experimenting a bit. Soon, the accordionist and the rappers were recording \"Guallando\".\nThe song was completed in 1996, and Vargas played it for friends and family to test the waters. \"They loved it\", he says. \"They went nuts\". He approached several large Latin labels, and was rejected by all. \"They said they didn't think it would sell anywhere outside of New York and the D.R.\"\nFinally, Vargas convinced his house/dance label, Cutting Records, to press a Fulanito CD in 1997. The resulting half million in sales astounded everyone in the Latin music industry, where a mere 50,000 sold represents a gold album.\n\nFulanito's second album, \"El Padrino\" \"(The Godfather)\", was released in 1999. On it, the group experimented even more, incorporating the sounds of samba and other Latin rhythms. Vargas raps about his life, about people he has known, and about having a good time. He was sorry to see the title cut from \"El Padrino\" misinterpreted by some as glorifying gangster life, saying his intention was just the opposite. \"The gangster dies at the end\", he says. \"Sure, he had a lot of money, cars, women, but none of it mattered because he was dead\". Vargas says he wrote it with some of the young men he'd grown up with in mind. Another song on the album, \"Mother's Day,\" shows a softer side of Vargas, as he pays tribute to his mom.\n\nThe group's third album, The Remixes, was released in March of 2001, and contains three new songs. Their fourth album is expected in the fall of 2001. With a solid tour schedule that takes the group from North Carolina to Japan in the span of a month, Fulanito shows no signs of slowing down. In the coming months, Vargas and others hope to more people on the West Coast and in the mainstream U.S. market to their music.", "otherInfo": "No other event info available"}, {"Address": "San Jose, CA", "Artist": "J. Stone ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-121.8261, 37.2751], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Back Bar Sofa", "moreBioInfo": "No artist bio available", "otherInfo": "Doors: 9:00 pm / Show: 10:00 pm, 21+"}, {"Address": "2344 Market St, San Francisco, CA 94114", "Artist": "Bigtop ", "ArtistImage": "https://photos.bandsintown.com/thumb/286448.jpeg", "Coordinates": [-122.434294, 37.763629], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Beaux", "moreBioInfo": "No artist bio available", "otherInfo": "\"Big Top\" at Beaux:"}, {"Address": "418 S Market St, San Jose, CA 95113", "Artist": "Mac Mall ", "ArtistImage": "https://photos.bandsintown.com/thumb/287613.jpeg", "Coordinates": [-121.886584, 37.329363], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Back Bar", "moreBioInfo": "Mac Mall, (born Jamal Rocker in Vallejo, California) is a West Coast rapper who became known in the mid/late 90's, as one of the local artists bringing the Bay Area on the hip hop map.\n\nHe collaborated with many other rappers from the West Coast such as Ray Luv, Mac Dre, E-40, Dubee, Young Lay, Big Syke, Killa Tay, Yukmouth, and the late 2Pac. He also did collaborations with some of the finest San Francisco Bay Area producers such as Rick Rock, Ant Banks, Mike Mosley and Khayree.", "otherInfo": "The Thizz Pioneer Mac Mall presents: This is My Opinion. A live display of the Bay's Next Wave Back Bar SoFA."}, {"Address": "116 Clement St, San Francisco, CA 94118", "Artist": "Seisiun ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.460518, 37.783375], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Plough & Stars", "moreBioInfo": "No artist bio available", "otherInfo": "Seisiún at Plough & Stars: Throwing back pints to a live soundtrack of traditional jigs and reels gives this Richmond watering hole a notably authentic Irish feel. Though P&S occasionally opens the stage to folk acts, the Emerald Isle crooners are the real treat -- whether offering tear-in-your-beer ballads or pint-swinging sing-alongs. Thursdays evenings offer set dancing to local ceili bands, while open sessions on Sundays and Tuesdays provide a chance for aspiring Celtic pickers to join in for a quick play-along."}, {"Address": "1151 Folsom St, San Francisco, CA 94103", "Artist": "Throwbacks ", "ArtistImage": "https://photos.bandsintown.com/thumb/6310751.jpeg", "Coordinates": [-122.408767, 37.775679], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Progressive Punk, Pop Punk, Pop", "Time": "9:00 PM", "Venue": "Raven Bar", "moreBioInfo": "We're Throwbacks out of Brick, NJ. We are just 5 good friends who really love to play music and share what we write with anyone who wants to hear it. South Jersey. We like to have fun here. Hit us up at throwbacksmusic@gmail.com!", "otherInfo": "Club Raven - Throwbacks & More Video DJ Mark Andrus spinning throwback music videos & more!"}, {"Address": "101 6th St, San Francisco, CA 94103", "Artist": "WERD ", "ArtistImage": "https://photos.bandsintown.com/thumb/8520003.jpeg", "Coordinates": [-122.408312, 37.780964], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Monarch", "moreBioInfo": "Born in OC, raised into LA’s DnB community. WERD aka Drew Massey was first influenced by electronic music in 1999 at a rave called Electronica at the Fox Theatre, in Pomona, California. Since then, he has become an avid Junglist and Drum & Bass enthusiast. Circa 2004 Drew started humming flows in his car alongside cassette mixtapes by R.A.W., Deacon, APX1, & CRS? and 2006 acquired his first residency as a Drum & Bass host Emcee in Orange County at weekly event called FreeBass Fridays put on by the world-famous Gone Jahmen Crew. Werd is the founder of Upgrade, an OC based crew collaborating on numerous projects to raise more DnB awareness in SoCaL. Other labels, crews, and affiliates are Nentech Records, Rough N Strong, Refuge, Church, I Love LA, Bell Ringer Records, Breakbeat BBQ, White Rabbit Group, Tower, Respect, and… Very recently, WERD was recruited into one of LA’s longest running Drum & Bass entities, Wreck-Ignition. Being a student of Junglist culture for over a decade and hosting events of all sizes, WERD has developed a versatile style of emceeing. Has had the honor of blessing the mic over live sets by… 6Blocc, A-Sides, AK1200, Aphrodite, APX1, Benny Page, Bizzy B, Black Sun Empire, Blang, Brookes Brothers, Capital J, Construct, CRS?, Cyantific, Danny The Wildchild, Dara, Deacon, Dieselboy, Dioptrics, Dip Vertigo, Direct Feed, Divine Elements, DLR, Dumbsteppaz, Esassin, Fury, Gridlok, Heretic, Infiltrata, Jakes, JO-S, Klute, Kronology, Machete, Mampi Swift, Metrik, Nightstalker, Nu:Logic, Odi, R.A.W., Rap, Rawtee, Reid Speed, Scooba, Sinistarr, Skitty, SPL, Spor, SS, Stunna, Sub Zero, Subsonik, Tabu, Taxman, Tech Itch, and Urban Assault. If you or anyone you know needs a proper DnB host MC, contact WERD. CONTACT: werdmc@gmail.com facebook.com/werdmc twitter.com/werdmc mixcloud.com/werdmc soundcloud.com/werdmc instagram = werdmc", "otherInfo": "WERD House - Techno - Disco every Sunday"}, {"Address": "3223 Mission St, San Francisco, CA 94110", "Artist": "Sweater Funk ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419787, 37.745082], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "R&b/soul, Rnb-soul, R&b, Soul, Funk", "Time": "10:00 PM", "Venue": "Knockout", "moreBioInfo": "No artist bio available", "otherInfo": "\"Sweater Funk\" at The Knockout: The Knockout has been called a clubhouse for big kids, and that's a pretty apt description. Started by brothers and longtime Mission District bartenders dX and John Segura, the place just bleeds their love for kitsch, rockabilly, monster movies, and low-brow culture. On any given night, there might be a touring mod band tearing up the stage, or a DJ spinning metal or old funk 45s, or a drunken, raucous game of bingo going down. There's a photo booth, a few tabletop videogames, and walls covered with dX's distinctive paintings and poster art. Look for the hip kids out front, plenty of tattoos inside, and John serving up an overflowing shot glass of Jim Beam on the planks."}, {"Address": "1192 Folsom St, San Francisco, CA 94103", "Artist": "Stamina ", "ArtistImage": "https://photos.bandsintown.com/thumb/6587277.jpeg", "Coordinates": [-122.410074, 37.775296], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Progressive Metal, Metal, International, Rock, Progressive, Finnish", "Time": "10:00 PM", "Venue": "f8", "moreBioInfo": "1. Progressive Metal from Italy\nhttp://www.staminaband.com\n2. Progressive Metal from France\nhttp://www.stamina-metal.com\n3. Finnish metal band Stam1na was called Stamina from 1996 to 2002.", "otherInfo": "\"Stamina\" w/ DJs Lukeino, Jamal, and guests"}, {"Address": "999 Trancas St, Napa, CA 94558", "Artist": "DJ WILLIE ", "ArtistImage": "https://photos.bandsintown.com/thumb/9163942.jpeg", "Coordinates": [-122.295598, 38.323327], "Date": "Sun Mar 29 2020", "EventDate": "2020-03-29", "Genre": "Open Format Dj, Napa Resident Dj", "Time": "10:00 PM", "Venue": "Trancas Steakhouse", "moreBioInfo": "Born and raised in Guatemala City, DJ Willie has been calling the Napa Valley home for the past 12 years. It is in this very valley that DJ Willie began his career in the music industry. Over the recent years, DJ Willie has become a local favorite, winning his crowd over with not only his talent, but also the apparent passion he portrays in each and every one of his gigs. Although he is highly influenced by his Latin roots, DJ Willie best identifies as an Open-Format DJ. He is not restricted by genre, music release date, or audience, as he thrives in finding music that appeals to a variety of audiences. You can find him pleasing crowds anywhere from local Napa Valley venues, to anywhere else in the bay area.", "otherInfo": "The Best \"NOCHES LATINAS\" in Napa Valley."}, {"Address": "San Francisco, CA", "Artist": "DJ Jamy ", "ArtistImage": "https://photos.bandsintown.com/thumb/10055883.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "10:00 AM", "Venue": "Second Life - StarkStrom - Electric Monday", "moreBioInfo": "SecondLife and Real World DJ", "otherInfo": "http://maps.secondlife.com/secondlife/Berthould Pass/131/130/2399"}, {"Address": "San Francisco, CA", "Artist": "John Elliott ", "ArtistImage": "https://photos.bandsintown.com/thumb/8687595.jpeg", "Coordinates": [-122.463, 37.7648], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "11:00 AM", "Venue": "The Sea Fort", "moreBioInfo": "http://www.thehereafterishere.com", "otherInfo": "No other event info available"}, {"Address": "1280 N McDowell Blvd, Petaluma, CA 94954", "Artist": "Bronze Medal Hopefuls ", "ArtistImage": "https://photos.bandsintown.com/thumb/9132617.jpeg", "Coordinates": [-122.661783, 38.272428], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Funk, Groove", "Time": "4:30 PM", "Venue": "Lagunitas Brewing Company", "moreBioInfo": "We play funky grooves for funky groovers.", "otherInfo": "No other event info available"}, {"Address": "2800 California St #101, San Francisco, CA 94115", "Artist": "Jefferson Bergey Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/8503270.jpeg", "Coordinates": [-122.440788, 37.788294], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Adult Contemporary, Music Comedy, Comedy, Acoustic", "Time": "7:00 PM", "Venue": "Scopo Divino", "moreBioInfo": "You've reached the home page for Jefferson Bergey's creative endeavors. Please \"LIKE\" and leave a message and I'll be sure to return your post.", "otherInfo": "For over a hundred and forty almost-consecutive Monday nights, Jefferson Bergey performs a barrage of sex-positive, irreverent songs written for San Francisco's Bawdy Storytelling show to the unsuspecting patrons of this Wine Spectator Award-of-Excellence-winning wine bar in Pac Heights. Come for fantastic food and wine and stay for a round of 'Let's Negotiate a Cover'! Risqué Monday nights are why they say Scopo Divino is a classy place, six nights out of the week! (Not for kids or the overly conservative!)"}, {"Address": "400 S 1st St, San Jose, CA 95113", "Artist": "Aseptic ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-121.885544, 37.330047], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Ritz", "moreBioInfo": "No artist bio available", "otherInfo": "ASEPTIC + D.O.L. (Denial of Life) + TYL - The Ritz Front Bar"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "CYN ", "ArtistImage": "https://photos.bandsintown.com/thumb/8819130.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Fillmore", "moreBioInfo": "It's not every day that the girl-next-door winds up being signed by one of the world's biggest pop stars, but that once-in-a-lifetime scenario is exactly what happened to Cynthia Nabozny when Katy Perry fell head over heels in love with her voice after a chance encounter. Nabozny – who has since adopted the artist name CYN – grew up in Michigan, outside Detroit. After her parents' divorce, CYN, her younger sister and her mom moved to a small house near the lake, a few miles from her dad. CYN's suburban life encouraged her to be a good student, embarking on a path to getting a decent steady job that pays the bills. Certainly something a career in songwriting could not guarantee. “I wanted the typical American life,” she says today. “I didn't know I'd have certain opportunities back then.”\n\nBorn into a humble and hardworking middle class background, CYN is the classic Midwestern gal; her electrician father works midnight shifts at Ford Motor Company six days a week, and neither of her parents' travels have led them far beyond the North America shores. Manifesting her dreams of travel, CYN has undertaken many \"first's\" for her family. Most recently, she can cross visiting Paris, Rome, and Milan off her to-do list. “I'm obsessed with The Louvre,” she laughs. “Obsessed.” Despite her small town, conservative upbringing, her dreams have no limit. CYN packed her bags and headed to Hollywood in pursuit of her ultimate aspirations.\n\nGrowing up, CYN pored over the American Songbook. CYN spent a lot of time with her grandmother listening to Dean Martin, Frank Sinatra, Doris Day, and Carole King. The voices she grew up on were far subtler than some of the belting pop vocals of today. They didn't overpower, and could often be light-hearted in their message.\n\nDuring her teenage years, CYN performed in talent contests, uploaded covers on YouTube, and auditioned for lead roles—all of which failed to produce ideal outcomes. She was rejected by a music school in Chicago, placing her face to face with an unfavorable reality. Opting for a degree in Management Information Systems at the city's DePaul University, she kept making music but never shouted about it and quietly took inspiration from her new city’s surroundings. “I have a big imagination,” she says, wide-eyed. “Whenever I leave my house I want to be able to feel like I'm going on an adventure. I love moving through people, I like to romanticize my life and be a character. I often refer to cities as adult playgrounds – that's what it feels like hopping on and off the subway, looking at giant buildings, wondering what they are.”\n\nThe name CYN itself is tongue-in-cheek, an evolved Lolita playing on the word 'sin'. She cuts a cute figure, radiating timeless youth like a grown Shirley Temple. Yet she holds herself with a self-assured poise, like something's bubbling under her porcelain surface. “Some men act shocked when they hear that I'm called CYN,” she laughs. “I have a lot of fun challenging people's perceptions.” This girl-next-door would rather run with the boys than be their pin-up. Growing up she was picked on by local kids. She sought recognition from bullies for too long. At last, no more. Hoping that one day she can inspire other small town girls through her music, she contemplates what she wishes she would have known as an adolescent…\n\n“That I would turn into a girl that I like,” she laughs. “I didn't like my hair, I felt insecure about my body, I had depressive thoughts. Then one day I had a dream that there was this girl on a beach. She had beautiful golden hair wrapping around her and the sun was setting. I woke up feeling so whole because I felt like I knew that girl, and that if I wanted to be that girl I could be.”", "otherInfo": "Doors open at 7pm All methods of delivery will be delayed until Tuesday, March 16, 2020"}, {"Address": "400 S 1st St, San Jose, CA 95113", "Artist": "Tyl ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-121.885544, 37.330047], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Ritz", "moreBioInfo": "No artist bio available", "otherInfo": "ASEPTIC + D.O.L. (Denial of Life) + TYL - The Ritz Front Bar"}, {"Address": "500 4th St, San Francisco, CA 94107", "Artist": "Brendan Getzell ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.398131, 37.779293], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Hotel Utah Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "Open Mic with Brendan Getzell at Hotel Utah: The Old West and indie music come together at the Hotel Utah Saloon, where a small stage, an antique bar, and a diversely stocked jukebox set the scene. A gigantic taxidermied elk head stares down upon drinkers in the main section, which is dominated by a beautiful old wooden bar on one side and a long row of picture windows on the other. The adjacent music area is split between a small balcony (shaped to look like the stern of a sailing ship) and an intimate downstairs section with a scattering of tables and corner booths. Meaty grub fills the menu during the day, while eclectic local bands and acoustic songwriters fill the calendar at night."}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Uncle Los Music ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.279289, 37.796471], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "No artist bio available", "otherInfo": "Yoshi's Oakland Presents Uncle Los Music"}, {"Address": "1807 Telegraph Ave, Oakland, CA 94612", "Artist": "Ilana Glazer ", "ArtistImage": "https://photos.bandsintown.com/thumb/9996336.jpeg", "Coordinates": [-122.27017, 37.80785], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Fox Theater", "moreBioInfo": "Ilana Glazer is an EMMY nominated actor and the co-creator, writer, director, executive producer and star of the critically-acclaimed show Broad City. The show, which ran for five seasons, was nominated by the Writers Guild of America for ‘Best Comedy Series’ and garnered multiple Critics Choice nominations.\n\nIlana can currently be seen in her debut comedy special THE PLANET IS BURNING which premiered on Amazon Prime the beginning of this year. Recently, llana voiced the character of EB, in Ellen DeGeneres’ Netflix Series GREEN EGGS AND HAM. The series is based on the classic Dr. Seuss book which also stars Adam Devine, Michael Douglas, and Keegan-Michael Key and released on November 8, 2019. Glazer just completed filming the A24 psychological horror film she also co-wrote and produced titled FALSE POSITIVE in which she stars alongside Justin Theroux and Pierce Brosnan.\n\nIlana is also now working on the Generator Collective series, which she co-founded with Glennis Meagher in 2016, with the mission to gather, talk, and learn more about politics and government ‘without feeling dumb.’ Ilana plans to host a number of Generator Live events this spring, including ‘Genny Social’ events in particular to get the public involved.\n\nIlana along with Abbi Jacobson signed a first look deal with Comedy Central and Viacom Television networks and currently have multiple projects already in development at Comedy Central under the new pact including: Mall Town USA.\n\nOn the big screen, Ilana starred opposite Scarlett Johansson in Sony Pictures’ comedy, Rough Night, directed by Lucia Aniello.  In addition, Glazer was previously seen in the film “The Night Before” opposite Seth Rogen and Joseph Gordon-Levitt. Glazer is executive producing the upcoming Warner Bros. and BuzzFeed motion picture Brother Orange along with Ellen DeGeneres and Jeff Kleeman and starring Jim Parsons.\n\nIn 2017, Glazer and 2 Dope Queens star Phoebe Robinson toured across North America with an 11-city stop for their ‘YQY’ (Yaaas Queen Yaaas) tour.\nGlazer trained at the Upright Citizens Brigade Theater where she and Abbi Jacobson met.  She currently resides in New York City.", "otherInfo": "No other event info available"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "M.O.M. ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.437364, 37.774222], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Madrone Art Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"M.O.M. (Motown on Mondays)\" w/ DJ Gordo Cabeza & Timoteo Gigante"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Ata Kak ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421188, 37.760565], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Chapel", "moreBioInfo": "No artist bio available", "otherInfo": "Ata Kak at The Chapel"}, {"Address": "1300 Van Ness Ave, San Francisco, CA 94109", "Artist": "Last Heroes ", "ArtistImage": "https://photos.bandsintown.com/thumb/10042617.jpeg", "Coordinates": [-122.421386, 37.787858], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Dubstep, Electronic", "Time": "8:00 PM", "Venue": "The Regency Ballroom", "moreBioInfo": "Last Heroes was formed in Colorado in 2016 with the hopes of creating a platform that would bring people together and remind everyone of their purpose in life. Big or small, visible or not, everyone has an impact that ripples. It’s about harnessing the good, embracing your powers and setting out to be the best person you can be.\n\nThe mission is soundtracked by emotional, melodic and cinematic music — inspired by the likes of Seven Lions, Hans Zimmer and more.\n\n2019 served as a pivotal point in our journey. It represented a new chapter for Last Heroes, filled with shows and original music including our debut EP ‘Moments’. The best is yet to come. Follow us on our journey ⛰\n\n-Garrett & Brian", "otherInfo": "Dabin"}, {"Address": "1300 Van Ness Ave, San Francisco, CA 94109", "Artist": "LIONE ", "ArtistImage": "https://photos.bandsintown.com/thumb/7124831.jpeg", "Coordinates": [-122.421386, 37.787858], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Electronic, Feels", "Time": "8:00 PM", "Venue": "The Regency Ballroom", "moreBioInfo": "Hi, I'm LIONE. I make electronic music and perform it for all my friends :). http://www.twitter.com/IAMLIONE http://www.instagram.com/IAMLIONE_ Snapchat: IAMLIONE Tumblr: IAMLIONE I just wanna make u feel ♥. Hangout with me :) Twitter.com/IAMLIONE Instagram.com/IAMLIONE_ Snapchat: IAMLIONE Tumblr: IAMLIONE", "otherInfo": "Dabin"}, {"Address": "1300 Van Ness Ave, San Francisco, CA 94109", "Artist": "Nurko ", "ArtistImage": "https://photos.bandsintown.com/thumb/8227904.jpeg", "Coordinates": [-122.421386, 37.787858], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Melodic Dubstep, Complextro, Drumstep, Trap, Chill Trap, Festival Trap, Electro House, Dubstep", "Time": "8:00 PM", "Venue": "The Regency Ballroom", "moreBioInfo": "Some music gives you goosebumps. That music usually isn’t played in the club. Nurko wants to change that.\n\nJack Leech always knew he would be making music, it just took a while for him to find the perfect fit. Growing up in New Jersey in a family with generations of artists, he was encouraged to be creative since birth. Picking up both drums and piano as a child and studying music in college, he applies his classical knowledge of music and music theory to buzzing genre blending sounds as Nurko.\n\nGrowing up on the internet, Nurko experimented by producing music within the trending sub genres of the time, starting with Moombahton, moving to Dubstep, and eventually playing around with Trap, Melodic Trap, and Future Bass. Inspired by both the mature sounds of Amon Tobin and Flume, the pop approved melodies of Jack U, and the fandom inducing energy of Bassnectar, Nurko makes songs that make you remember where you were when you first heard them.\n\nWanting to create a sound he hadn’t heard yet, Nurko decided to channel his emotions into a style of electronic music uniquely him, starting with his first big track, “Goodbye,” in 2015. Since then, his next release “Your Embrace,” continued to give his fans what he likes to call, “the feels.” They loved it, enough to listen over 2 million times. “Your Embrace” was featured on YouTube channels like MrSuicideSheep, Chill Nation, and was included in ‘Neptones,” JC Caylon’s compilation that reached number one on the iTunes dance chart. His next track, “Let Me Go,” ft. Alina Renae set to be released January 2017 features his signature style of emotional chord progressions mixed with just hard enough drops, complimented with beautiful female vocals.\n\nFor Nurko, the melody is everything. Whether it’s in a low key trap track, or the perfect soundtrack to a your pre-game, do not mistake his music for another soon to be forgotten future bass track. Nurko makes music you can listen to on loop, discovering new layers with each play.", "otherInfo": "Dabin"}, {"Address": "500 4th St, San Francisco, CA 94107", "Artist": "Open Mic ", "ArtistImage": "https://photos.bandsintown.com/thumb/6169637.jpeg", "Coordinates": [-122.398131, 37.779293], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Hip-hop, Hip Hop, Jam, Folk, Metal, Hiphop, Jazz, Acoustic, Country, Blues, Rock", "Time": "8:00 PM", "Venue": "Hotel Utah Saloon", "moreBioInfo": "In 1990, the Connecticut MC then known as \"Jedi\", got his start rhyming with partner in crime - P-Air, as a member of the Native Tongue-influenced duo, \"The Nobility\". Several demos, a few years, a new group name, and additional members later, the direction of the crew took its turn towards blending science fiction and conspiracy theories into rap songs, which at the time, was a rare take on hip hop music in the early 90s. In 1994, the early \"Demigodz\" group split up due to the ever-so-popular break up reason: \"musical differences\". However, it was through this transition that the Demigodfather met another fellow CT lyricist, Apathy. As the musical partnership between Open Mic and Apathy progressed, the two decided to rebuild the Demigodz name and take their aspirations to an entirely different level. After years of recording songs, mastering the ASR-10, co-hosting a radio show, and gaining ties with the likes of Alien Nation, Mothership aka Eternia, and Al T of Newcleus, Mic's dues were slowly but surely being paid. Along with Apathy, he also headed up a Connecticut based chapter of the Universal Zulu Nation and recorded the cassette-only \"Sureshot Affair\" EP, which was self-released in 1997 and sold throughout the underground circles of the North East. Shortly thereafter, Mic took a step back from the scene after getting married and becoming a father for the first time in his life... In 2000, the Demigodz became resurrected by Apathy and expanded into a military-like squadron of MCs and DJs. With that movement in motion, it couldn't have existed without the inclusion of its original creator, Open Mic, and once again he became immersed into the hip hop world. Since then, Mic has kept himself afloat by making appearances on wax, including \"Science of the Bumrush\" on UK-based Stonegroove Recordings and the Demigodz EP released on Ill Boogie Records in mid-2002, all of which received critical acclaim in such publications as XXL and The Source. Outside of the microphone realm, he has made quite a name for himself over the years as a professional graphic designer, in which his lengthy resume extends widely with the creation of many 12\" single, vinyl album, and CD covers for an extensive list of labels - beginning with Bronx Science Records (Apathy's first label), Raptivism Records, Domination Recordings and most recently Babygrande. In early 2006, after being reunited with early 'Nobility' member and co-founder of the first generation of the Demigodz, P-Air, Open Mic has begun work on a new duo project. Returning to his original group base from 1989-1990, and bringing back that boom-bap early 90's sound that hip-hop has lacked since it took a commercial nosedive, Open Mic is ready to deliver what many Demigodz fans have been asking for.... the real raw shit. Keep your eyes open for the debut of his new group the \"Megadonz\" in late 2007.\n\nFor more info on MEGADONZ check out their MySpace page at:\nwww.myspace.com/megadonzmusic", "otherInfo": "Open Mic with Brendan Getzell at Hotel Utah: The Old West and indie music come together at the Hotel Utah Saloon, where a small stage, an antique bar, and a diversely stocked jukebox set the scene. A gigantic taxidermied elk head stares down upon drinkers in the main section, which is dominated by a beautiful old wooden bar on one side and a long row of picture windows on the other. The adjacent music area is split between a small balcony (shaped to look like the stern of a sailing ship) and an intimate downstairs section with a scattering of tables and corner booths. Meaty grub fills the menu during the day, while eclectic local bands and acoustic songwriters fill the calendar at night."}, {"Address": "1710 Mission St, San Francisco, CA 94103", "Artist": "National Park Radio ", "ArtistImage": "https://photos.bandsintown.com/thumb/9888848.jpeg", "Coordinates": [-122.420383, 37.769717], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Americana, Bluegrass, Folk", "Time": "8:30 PM", "Venue": "Brick & Mortar Music Hall", "moreBioInfo": "National Park Radio is a new modern folk band born and based in the natural beauty of the Ozark Mountains in Arkansas. An all-acoustic band featuring well-written original songs and beautiful vocals, NPR has a unique sound that is easy to love. This self-titled EP debut contains five songs inspired by the beauty of their native landscape as well as the joys and trials of life and love. The lyrical poetry of lead singer and songwriter Stefan Szabo is a treasure not to be missed. The melodies and vocal harmonies complete the package. National Park Radio is a band on the rise...catch them at a show near you soon!", "otherInfo": "National Park Radio - Canceled w/ Hayden Joseph"}, {"Address": "3223 Mission St, San Francisco, CA 94110", "Artist": "Krazy For Karaoke ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419787, 37.745082], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Knockout", "moreBioInfo": "No artist bio available", "otherInfo": "Krazy for Karaoke With Omar Rockriguez."}, {"Address": "1300 Van Ness Ave, San Francisco, CA 94109-5519", "Artist": "Dabin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9962386.jpeg", "Coordinates": [-122.421386, 37.787858], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Feels Good Music", "Time": "9:00 PM", "Venue": "The Regency Ballroom", "moreBioInfo": "Twitter: @iamdabinlee Instagram: dabinmusic Snapchat: dabinmusic", "otherInfo": "No other event info available"}, {"Address": "2344 Market St, San Francisco, CA 94114", "Artist": "Opulence ", "ArtistImage": "https://photos.bandsintown.com/thumb/9628973.jpeg", "Coordinates": [-122.434294, 37.763629], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Doom Metal, Punk Metal, Stoner Metal, Black Metal", "Time": "9:00 PM", "Venue": "Beaux", "moreBioInfo": "THE SOUND OF SAVAGE MEN WHO LEAD OPULENT LIVES.\nOpulence comprises New York City underground veterans who have a shared 20-year history perfecting the arts of chaos and excess—both on stage and off—while serving in the ranks of subterranean legends Toilet Boys, Voluptuous Horror of Karen Black, Grounded, and VILE to name but a few.\n\nOpulence’s debut album, Black Magic, is a sonic continuum of ferocious riffs and foreboding incantations that form a peculiar yet beguiling anthology fully immersed in the dark arts. The genre-bending sound is steeped in traditional extreme influences from Fiend Club to Faust, thrash metal to street punk, psychedelic space to Mercyful Fate. The product is an organic compound of black magic doom played by stoney, seasoned Punx from the streets of New York.\n\nThe aural alchemy is refined by frontman Adam Cardone, an official liaison/reverend of Anton LaVey’s Church of Satan and an inducted member of the Order of Merlin by the International Brotherhood of Magicians. The enigmatic visuals are the spawn of guitar player Sean Pierce, whose journey from drug-dealing sex worker to Emmy-nominated designer/animator has forged an uncompromising context that frames the Opulence experience.\n\nThe lush, rhythmic foundation of drummer Eric Opulence and Bass God Bull is steeped in decades of dedication in various bands with members of Cro-Mags, D Generation, Black Anvil, Sebastian Bach, and Hanoi Rocks, cultivating a confidence and swagger injected lethally throughout the Opulence sound.\n\nFeaturing an opening proclamation by Poison Idea’s Jerry A., and a lavish vocal cameo by Lunachicks’ Theo Kogan, Black Magic delivers a surge of malevolent excess that will strike down anyone who might stand in its way.", "otherInfo": "\"Opulence\" at Beaux:"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Sage ", "ArtistImage": "https://photos.bandsintown.com/thumb/6252908.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Electronic, Polish, International, Hip-hop, Rap, Deep House, Tech House, Hip Hop, House", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "########################## Musik", "otherInfo": "DEATH GUILD: PARTY-IN-PLACE WEBCAST\nWebcast Only:\nDecay\nDJ Bit\nJoe Radio\nMelting Girl\nSage\nTo keep you sane during the COVID-19 lockdown, we are doing webcast-only DJ sets! Spooky-dance along from the safety of your own home!\n• Watch: dnalounge.com/webcast\n• Donate to DNA: dnalounge.com/donate\n• Donate to DG: Indiegogo\nDeath Guild is the oldest weekly goth/industrial dance night in the country, and the second oldest in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nFollow Death Guild on Facebook: https://www.facebook.com/groups/deathguild\ngothic. industrial. synthpop.\n9:30pm - 2:30am.\nall ages.\nfree webcast!\nhttp://www.deathguild.com"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "BIT ", "ArtistImage": "https://photos.bandsintown.com/thumb/6373397.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Goa Trance, Electronic, Psy Trance", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "DEATH GUILD\nMain Room:\nDecay\nJoe Radio\nMelting Girl\nLounge:\nSage\nBit\nDeath Guild is the oldest weekly goth/industrial dance night in the country, and the second oldest in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nFollow Death Guild on Facebook: https://www.facebook.com/groups/deathguild\nBuy tickets: https://www.dnalounge.com/calendar/2020/03-30.html\ngothic. industrial. synthpop.\n9:30pm - after hours.\n18+ with ID.\n$3 < 10pm;\n$5 after.\nhttp://www.deathguild.com"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Decay ", "ArtistImage": "https://photos.bandsintown.com/thumb/8951712.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "Hard-rock And Metal", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "Decay is an energetic metal inspired hard rock band from the Netherlands. Who, with their own sound, rock every stage they play.", "otherInfo": "DEATH GUILD: PARTY-IN-PLACE WEBCAST\nWebcast Only:\nDecay\nDJ Bit\nJoe Radio\nMelting Girl\nSage\nTo keep you sane during the COVID-19 lockdown, we are doing webcast-only DJ sets! Spooky-dance along from the safety of your own home!\n• Watch: dnalounge.com/webcast\n• Donate to DNA: dnalounge.com/donate\n• Donate to DG: Indiegogo\nDeath Guild is the oldest weekly goth/industrial dance night in the country, and the second oldest in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nFollow Death Guild on Facebook: https://www.facebook.com/groups/deathguild\ngothic. industrial. synthpop.\n9:30pm - 2:30am.\nall ages.\nfree webcast!\nhttp://www.deathguild.com"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "The Bachelors ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.406986, 37.798566], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "60s, Decades", "Time": "9:30 PM", "Venue": "The Saloon", "moreBioInfo": "No artist bio available", "otherInfo": "The Bachelors at The Saloon: Revered for its daily live blues performances, the Saloon also has the rugged distinction of having survived the 1906 earthquake and standing as the oldest bar in San Francisco (opened in 1861). With its rough aged-wood interior and hardy clientele, the Saloon definitely stands apart from the shiny new neighbors along this nightlife-rich stretch of North Beach."}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "DJ BIT ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.412687, 37.771011], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "9:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "DEATH GUILD: PARTY-IN-PLACE WEBCAST\nWebcast Only:\nDecay\nDJ Bit\nJoe Radio\nMelting Girl\nSage\nTo keep you sane during the COVID-19 lockdown, we are doing webcast-only DJ sets! Spooky-dance along from the safety of your own home!\n• Watch: dnalounge.com/webcast\n• Donate to DNA: dnalounge.com/donate\n• Donate to DG: Indiegogo\nDeath Guild is the oldest weekly goth/industrial dance night in the country, and the second oldest in the world! Every Monday, six DJs in two rooms play a mix of gothic, industrial, synthpop, noise, ambient, and weird stuff for those who love the darker side of things.\nFollow Death Guild on Facebook: https://www.facebook.com/groups/deathguild\ngothic. industrial. synthpop.\n9:30pm - 2:30am.\nall ages.\nfree webcast!\nhttp://www.deathguild.com"}, {"Address": "243 O'Farrell St, San Francisco, CA 94102", "Artist": "Damir ", "ArtistImage": "https://photos.bandsintown.com/thumb/167640.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Johnny Foley's Irish House", "moreBioInfo": "No artist bio available", "otherInfo": "Damir at Johnny Foley's Irish House: Music lovers cherish the intimate cellar underneath Johnny Foley's Irish Pub, where songsmiths like Ron Sexsmith, Josh Rouse, and Lisa Loeb have all performed. A venue so intimate that musicians must use the audience bathroom."}, {"Address": "3089 16th St., San Francisco, CA 94103", "Artist": "Skylarking ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.421602, 37.764714], "Date": "Mon Mar 30 2020", "EventDate": "2020-03-30", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Skylark Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Skylarking\" w/ I&I Vibration"}, {"Address": "1232 Grant ave, San Francisco, CA 94133", "Artist": "GG Amos ", "ArtistImage": "https://photos.bandsintown.com/thumb/9361550.jpeg", "Coordinates": [-122.406986, 37.798566], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Blues, West Coast Blues, R&b, Soul Jazz", "Time": "4:30 PM", "Venue": "The Saloon", "moreBioInfo": "Guitarist / Vocalist GG Amos is an artist in the West Coast Blues tradition. Based in San Francisco, she's honed her craft as a songwriter and entertainer utilizing the soul, jazz, funk and latin elements that make west coast blues what it is.\n\nFor the past 26 years GG's earned a reputation as a riveting performer with a distinctive, molten guitar style and an emotionally charged fluid voice...always emphasizing soulful communication with her audience.\n\nIn addition to her own songs and those of Johnny \"Guitar\" Watson, T-Bone Walker, Johnny Heartsman and others; r&b by Aretha Franklin and Gnarls Barkley; you’re just as likely to hear her pull out tasty soul jazz gems by Kenny Burrell, Horace Silver, and Jack McDuff.\n\nGG’s recent single “Side By Side”, dedicated to all US Veterans, is a funky, swinging reworking of that classic 1920’s tune. Her own song, “West Coast” is a grooving tribute to the late bluesman Johnny Heartsman and the west coast style.\n\nShe is currently working on her own all-original album \"Content Under Pressure\".\n\nGG has been nominated for both a West Coast Blues Award and a Sacramento Area Music Award.\n\nShe's performed at the San Jose Jazz Summer Fest, Monterey Bay Blues Festival, Sacramento Arts Festival, Point Richmond Festival, Pleasant Hill Festival, Tracy Blues & Brews, Tahoe Music Festival ..numerous other festivals, fairs and nightclubs all over the Bay Area, the Southwest, the Midwest and even toured the whole country of Poland in 2011.\n\nGG Amos has also played with or opened for many noted artists including Chris Cain, John Lee Hooker, Guitar Shorty, Jimmie McCracklin, Lowell Fulson and Koko Taylor.\n\nGG Amos Website - www.twogees.com\n\nQuotable quotes>\n\n“Must say, nothing is as good as sex but this is close!\" writes Kjell Andreassen of Radio Holstebro in Denmark.\n\n“Girl, you can boogie!” - John Lee Hooker\n\n“You’re a hell of a guitar player and singer too!” - Guitar Shorty\n\n“You… You!” - Chris Cain", "otherInfo": "GG Amos and her organ trio The GG3 play their weekly After-Work Blues Party. Featuring Parris Bertolucci on keyboards/bass & Randy Lee Odell on drums.\nOccasional special guests.\n\n4:30pm-8:30pm - 1232 Grant Ave, SF, CA 94133"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "Anthony Presti Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/7913872.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Alt-country, Folk Rock", "Time": "6:00 PM", "Venue": "The Fillmore", "moreBioInfo": "Alt-rock singer/songwriter Anthony Presti grew up in Seattle during the 1990’s where an explosive alternative and grunge rock scene was thriving. He moved continuously until his teenage years, where he settled in Sonoma County. Presti played in a hardcore band, releasing several albums and touring extensively until they broke up. His identity shifted as he rediscovered his love for acoustic guitar and eventually moved to San Francisco. He’s gone on several west coast tours, and played shows at the Lagunitas Brewery, Napa City Winery, HopMonk Tavern and Brick and Mortar Music Hall and has shared the stage with national artists like Grammy Nominated Gretchen Peters, Little Tybee, The Deer and Elliott Peck.\n\nPresti’s latest record, Existentialism, is his strongest effort to date. The opening track, “Next of Kin,” resembles the stylings of Johnny Cash, while “Dreamland,” Presti’s first music video single, shows a strong influence of Roy Orbison. “One Step Closer” features Presti and Van Dyke trading versus like a new age Fleetwood Mac, “Reach for the Stars” is a catchy contemporary folk laden tune and “Family Tree” is a testament to Presti’s hard rock upbringing.\n\nPresti has released several albums, including, Clarity in Hindsight, recorded at Prairie Sun Studios (Tom Waits, Primus) and, Existentialism, at Tiny Telephone Studios with engineer James Riotto (Sean Hayes, The Mountain Goats) accompanied by an impressive cast of musicians including Leah Van Dyke (Brothers of Siren), Shaun David (The Lost), Burt Lewis (Stu Allen) and Jason Slota (Thao and the Getdown Staydown).", "otherInfo": "Inside the Fillmore at the Poster Room for the Wilco show."}, {"Address": "1111 Solano Ave, Albany, CA 94706", "Artist": "George Cole ", "ArtistImage": "https://photos.bandsintown.com/thumb/8682442.jpeg", "Coordinates": [-122.298349, 37.890478], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Acoustic Guitar, Consumate Entertainer, Guitar Virtuoso, Acoustic, Composer Songbook, Gypsy Jazz, Performer, American Song", "Time": "6:30 PM", "Venue": "Rendez-Vous Café Bistro", "moreBioInfo": "GEORGE COLE: Singer and breakneck acoustic guitarist George Cole inhabits a musical world all his own.... a world in which Django Reinhardt, The Ramones, Nat King Cole and Doc Watson get equal billing with Irving Berlin, George Gershwin, Willie Nelson and the Great American Songbook. Cole currently occupies the guitar chair for the David Grisman Quintet and has 2 releases on Grisman’s highly regarded Acoustic Disc Label. George was guitar teacher and mentor to Rock and Roll Hall of Fame Inductees Billie Joe Armstrong and Mike Dirnt of Green Day for 10 years in the East Bay. Cole, a San Francisco native and BAMMIE award winner brings an expertise to his guitar playing and singing that is filtered through Rock and Roll, Gypsy Jazz and All things American. The music he makes brings to mind the old adage “Everything Old Is New Again”. David Grisman tapped Cole to play on his most recent Sextet record and Cole in turn featured Grisman on his release “George Cole Live”. Jazz legend Keely Smith handpicked Cole to play guitar and sing duets with her on her last tour. Chris Isaak also had Cole lay down guitar tracks on his platinum selling Forever Blue release. Cole is currently performing at festivals, performing arts centers, top nightclubs, and vintage theaters. www.GEORGECOLE.net\nwww.georgecole.net", "otherInfo": "AS OF MARCH 17 POSTPONED UNTIL FURTHER NOTICE\n(\"and they were singing, bye-bye miss American pie, drove my chevy to the levy but the levy was dry...\")\nBy popular demand, the anticipated return of George Cole's San Francisco Guitar Trio with George Cole, Tony Darren, and Nick Koutsoukis.\nHands down, best thing to do on a Tuesday night in the EastBay, join those 'in the know' to enjoy George Cole’s amazing, world class music, and superb french cuisine at Rendez-Vous Café Bistro Tuesday 6:30-8:30"}, {"Address": "522 Second Street, Oakland, CA 94607", "Artist": "Seven Spires ", "ArtistImage": "https://photos.bandsintown.com/thumb/9598022.jpeg", "Coordinates": [-122.277791, 37.797058], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Metal", "Time": "7:00 PM", "Venue": "Oakland Metro Operahouse", "moreBioInfo": "Metal Hammer (Germany) -- “Tougher tracks such as ‘Paradox’ or ‘Burn’ compliment the symphonic metal elements, so you sometimes feel like you already have the new Dimmu Borgir...”\n\n\n\nRock Hard (Germany) review of Solveig 7.5/10 -- “Spires are one of the most untypical symphonic metal bands I’ve ever seen.”\n\n\n\nPowerPlay Magazine (UK) review of Solveig 10/10 -- “Captivating from start to finish, Solveig captures every nuance that the subject matter deserves and will appeal to anyone who loves their metal symphonically and emotionally charged, with the only downside being Seven Spires have set the bar so high for themselves that even Robert Wadlow would struggle to reach his pint.”\n\n\n\nRockGarage (Italy) -- \"Surely the best symphonic metal expression from America we've ever heard.\"", "otherInfo": "No other event info available"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Dan Luke ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.42046, 37.775985], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "The Dan Luke and The Raid show has been cancelled."}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Mad Dogs & Englishmen ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Films at The Freight: Mad Dogs & Englishmen"}, {"Address": "50 Oak St, San Francisco, CA 94102", "Artist": "Chad Lefkowitz-Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/8384191.jpeg", "Coordinates": [-122.420253, 37.775481], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "San Francisco Conservatory of Music", "moreBioInfo": "Chad Lefkowitz-Brown is an American saxophonist and international recording artist known for his work in jazz and popular music. He is currently a member of the multi Grammy award-winning Afro Latin Jazz Orchestra, and he has made internationally televised appearances with pop icons like Taylor Swift, Don Henley and Phillip Phillips. Chad has toured across the globe as a soloist and with many esteemed jazz artists, including Arturo O’Farrill and Clarence Penn.\n\nA native of Elmira, New York, Chad established himself as a jazz prodigy at age 11, performing throughout New York State under the mentorship of local jazz hero, George Reed, who was known for backing legends like Teddy Wilson, Buddy Tate, and Marian McPartland.\n\nChad went on to pursue a formal education in the arts at the Brubeck Institute, a prestigious fellowship program created by jazz legend Dave Brubeck. While studying at the institute, he performed regularly with Brubeck and was a member of the Brubeck Institute Jazz Quintet.\n\nChad received many accolades during his scholastic career, including 15 DownBeat Magazine Student Music Awards for categories such as \"Best Jazz Soloist\" and \"Best Original Song.\"\n\nSince graduating from the Brubeck Institute, Chad has performed throughout four continents, and has appeared at venues including Carnegie Hall, the Super Bowl, and Madison Square Garden. His debut album, Imagery Manifesto, was named “Debut Album of the Year” by jazz critic and author, Doug Ramsey, and his forthcoming album, “Onward,” features jazz legend, Randy Brecker.", "otherInfo": "No other event info available"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "The Crow Eaters ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.437364, 37.774222], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Madrone Art Bar", "moreBioInfo": "No artist bio available", "otherInfo": "The Crow Eaters at Madrone Art Bar: Unless you're dying to catch a show at the Independent, this is the place on Divisadero to go. Everything in here is created by local artists, from the design of the space right down to the menus, while DJs spin everything from hip-hop, funk, and soul to vintage jazz and retro rock 'n' roll."}, {"Address": "Berkeley, CA", "Artist": "George Kahumoku Jr ", "ArtistImage": "https://photos.bandsintown.com/thumb/10268244.jpeg", "Coordinates": [-122.2729, 37.8708], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Hawaiian, Acoustic, World Music, Folk", "Time": "7:00 PM", "Venue": "Mainland", "moreBioInfo": "George is a 4-time Grammy Award winning Hawaiian guitarist who currently owns and hosts a weekly show on Maui called George Kahumoku Jr's SLACK KEY SHOW - Masters of Hawaiian Music. He is also a farmer, taro grower, sculptor, author, and the former director of UH Maui College's Institute of Hawaiian Music.", "otherInfo": "We are sorry to say our next few weeks of tour have been postponed until July 2020, I will update you with new dates as soon as possible."}, {"Address": "476 Castro St, San Francisco, CA 94114", "Artist": "Kally Price ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.435403, 37.761304], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Blush! Wine Bar", "moreBioInfo": "No artist bio available", "otherInfo": "Kally Price & Rob Reich at Blush! Wine Bar: Across from the Castro Theatre, Blush! is a cozy pre-movie place to grab a drink. With jazz nights on Thursdays and subtle background music other nights, this bar is a low-key Castro option. A plush couch propped against the burgundy, art-adorned wall offers a cozy seat for intimate groups, while a long, wooden table towards the back accommodates a larger group of ten. Featuring a comprehensive list of nearly 100 wines stored in proper wooden racks, Blush! serves the amateur and oenophile alike, where $70-$80 can fetch you a bottle of a crisp and fruity white or an earthy six-year-old Bordeaux, or $6 can get a more temperate-flavored but generous pour. The food portion of the menu boasts rich and rustic European small plates, cheese and savory charcuterie platters, and nibbles such as Kalamata olives and tapenade."}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "The Raid ", "ArtistImage": "https://photos.bandsintown.com/thumb/126753.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "The Raid are a 5 piece Indie/Rock band formed in 2004. Recently back from recording at the world famous \"Sawmills Studio\" where they had the pleasure of working with world renowned producers John Cornfield & Greg Brimson, The Raid are looking forward to an exciting 2007.", "otherInfo": "The Dan Luke and The Raid show has been cancelled."}, {"Address": "476 Castro St, San Francisco, CA 94114", "Artist": "Rob Reich ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.435403, 37.761304], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Blush! Wine Bar", "moreBioInfo": "No artist bio available", "otherInfo": "Kally Price & Rob Reich at Blush! Wine Bar: Across from the Castro Theatre, Blush! is a cozy pre-movie place to grab a drink. With jazz nights on Thursdays and subtle background music other nights, this bar is a low-key Castro option. A plush couch propped against the burgundy, art-adorned wall offers a cozy seat for intimate groups, while a long, wooden table towards the back accommodates a larger group of ten. Featuring a comprehensive list of nearly 100 wines stored in proper wooden racks, Blush! serves the amateur and oenophile alike, where $70-$80 can fetch you a bottle of a crisp and fruity white or an earthy six-year-old Bordeaux, or $6 can get a more temperate-flavored but generous pour. The food portion of the menu boasts rich and rustic European small plates, cheese and savory charcuterie platters, and nibbles such as Kalamata olives and tapenade."}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Goth Babe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8891900.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Portland, Oregon", "Time": "8:00 PM", "Venue": "The New Parish", "moreBioInfo": "Goth Babe is Griff Washburn enjoying himself. Originally from Tennessee, Griff currently lives off the grid in his 1996 Ford F-250 with his pup Sadie, surfing up and down the coast of California and Oregon. After writing songs in his dorm room at age 18, he right off the bat knew that he wanted to make this goofy band name more than a side hustle. After touring in 2016 and living in NYC for part of 2017, Griff packed up his things and made way for the West Coast. He's recently picked up on the brighter parts of life. Parting ways with social status and relevance, he's discovered how wonderful living day by day is. Making music to Griff is less a climb to the top, as it is a form of free thinking and enjoyment.", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Lightning Bolt ", "ArtistImage": "https://photos.bandsintown.com/thumb/6151470.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Alternative, Noise, Awesome, Rock, Noise Rock", "Time": "8:00 PM", "Venue": "The Chapel", "moreBioInfo": "Lightning Bolt emerged from Providence, Rhode Island in 1995 as a three-piece art school project. Initially there was Brian Chippendale's explosive, non-stop drumming, Brian Gibson's James Chance & The Contortions-like bass lines, and Hisham Bharoocha's vocals propelling them in a fury of volatile noise and orgiastic tribalism. The group helped found Fort Thunder, a music and art collective, and recorded Lightning Bolt which was issued through Load in 1999. By 2001's Ride the Skies, Bharoocha had departed (he eventually formed Black Dice). This left the vocal duties to Chippendale, who put the microphone into a sock and stuffed it under a mask he wears while performing. Lightning Bolt did a series of tours with bands like The Locust, Arab on Radar, Orchid, and Melt-Banana before returning in 2003 with the studio album Wonderful Rainbow. The album did very well in underground music circles, and set up the release of 2005's Hypermagic Mountain.\n\nLightning Bolt is well known for their live performances, in which they turn up the volume as loud as it can possibly go and forgo a traditional stage, preferring to perform amidst the audience.", "otherInfo": "Lightning Bolt at The Chapel"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Limbs Akimbo ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.412687, 37.771011], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Kara Nova presents\nPARACOSM PARADE\nA night of Spectacular Spectacles with some of the Bay Area's top-notch, world-renowned live talent!\nFeaturing performances by:\nHypnotizing Hairialist Rebekah Cavinder\nplate-Spinner Chrissy Lux\nAcro Alien Fleeky Flanco\nSongstress Supreme Diva Marisa\nDave Haaz-Baroque & Shadow Circus Creature Theatre\nDream Dancer Krysta Cook\nVampy Pole Vixen Katie Sin\nSultry Pole Siren Pandora\nAerial Fairy Cola Claret\nPerformance Artist Sierra Camille\nArt projection screening by:\nPatricio Guillamón\nWith DJ:\nLimbs Akimbo\nHosted by:\nKara Nova (P.S.: it's Kara's birthday too.)\nCostumes encouraged:\nTwilight Zone Dystopia vs. Etheric Dreams:\nWhich side will you choose?!\nWelcome to KARA NOVA'S PARACOSM PARADE! A CIRCUS-infused storytelling birthday bonanza! Join us on our quest for the lost soul of San Francisco, as we journey through Twilight Zone dystopias and sparkly shamanic realms. Live theatre! Aerial arts! Sexy pole dance sirens! Circus shenanigans! And quantum physics! Can we choose a new path from the Threads of Possibility?! Can we overcome the zombie techpocalypse?! Can we find the true power of our intent, and save the city?!\nYou have been summoned! Help us give rise to THE RAZZLE DAZZLE REVIVAL!\nLive Performances!\nMusic & Dancing!\nSurprises!\nFriends!\nLap Dances!\nPortals to Other Dimensions!\nThe Hope that Was Formerly Lost!\nShenanigans^10!\nCreated and produced from the mind of Kara Nova, circus artist, contortionist, and sparkly shaman showgirl, here to save the world by spreading the rhinestone radiance of joy. Any PATRON-OF-THE-ARTS tickets will help to elevate the unicorns, allowing us to amplify the magic. If you believe in art, consider a PATRON donation, because the Earth without ART is just EH, and that's boring af.\nBuy tickets: https://www.dnalounge.com/calendar/2020/03-31.html\ncircus.\ndoors @ 8pm;\nshow @ 9pm.\n18+ with ID.\nGen. Adm.: $20 advance;\n$25 door;\nPatron Of The Arts: $40.\nRSVP: https://www.facebook.com/events/497657777563163"}, {"Address": "155 Fell St, San Francisco, CA 94102", "Artist": "Dan Luke and The Raid ", "ArtistImage": "https://photos.bandsintown.com/thumb/9833277.jpeg", "Coordinates": [-122.42046, 37.775985], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Bowling Green, Kentucky", "Time": "8:00 PM", "Venue": "Rickshaw Stop", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Runnner ", "ArtistImage": "https://photos.bandsintown.com/thumb/9014261.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Electronic Rock, Folk, Indie Rock", "Time": "8:00 PM", "Venue": "The New Parish", "moreBioInfo": "bandcamp songs for soundcloud kids", "otherInfo": "Doors 7:30 // Show 8 // ALL SALES ARE FINAL"}, {"Address": "420 Mason St, San Francisco, CA 94102", "Artist": "Glove (US) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9801444.jpeg", "Coordinates": [-122.409593, 37.787565], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "New Wave", "Time": "8:00 PM", "Venue": "August Hall", "moreBioInfo": "Based in Tampa, Florida - Through their short-spanning career, Glove has managed to establish themselves as one of the most integral bands within the American music subculture due to their infectious and outrageously profound live performances. Inspired by the sounds of Devo, The Cars, New Order, and Gary Numan, members of Glove began writing music with a heavy emphasis on 70s synth and dance music that could be performed by a live band. \"They once asked me to describe their sound, and I came up with 'New age tone zone of chrome.'\" - Shaun Williams (The Nude Party). Now, after releasing their first two singles, Glove is currently in the studio recording their debut LP titled 'Boom Nights' with Producer, Brad Shultz (Cage the Elephant) due out in 2020.\n\nThrough self-booking and minimal online musical content, Glove secured opening slots with acts such as The Growlers, The Nude Party, L.A. Witch, Omni, Cosmonauts, The Coathangers, Surfbort, Mattiel, Broncho, and many more.", "otherInfo": "No other event info available"}, {"Address": "1151 Folsom St, San Francisco, CA 94103", "Artist": "Phat Tuesday ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408767, 37.775679], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Raven Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Phat Tuesday\" w/ DJs Scotty Fox & Clinton Lee"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "grex ", "ArtistImage": "https://photos.bandsintown.com/thumb/8392084.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "Psychedelic, Free Jazz, Art Rock", "Time": "8:00 PM", "Venue": "Ivy Room", "moreBioInfo": "Grex is an art rock band based out of Oakland, California. In biological terms, “grex” refers to the aggregation of a multitude of tiny, amoeba-like creatures combining to create a superorganism. Grex (the band) works the same way: two musicians who can function as one, the whole greater than the sum of its parts.\n\nGrex has been called \"essential current-and-future listening\" (Tiny Mix Tapes), exploring the meeting point between psychedelic pop/rock and the dark outer reaches of noise and free jazz. The band recalls the explosive power of late John Coltrane, the dark energy of Suicide, and the whimsical weirdness of Skeleton Crew and Deerhoof.", "otherInfo": "An evening of explosive art rock/experimental music, featuring Oakland duo Grex, improv/metal band VOCO, and jazz-cum-heavy prog trio PG13."}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Phillip Greenlief ", "ArtistImage": "https://photos.bandsintown.com/thumb/8914956.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "phillip greenlief - tenor and alto saxophones Bb clarinet", "Time": "8:30 PM", "Venue": "Ivy Room", "moreBioInfo": "Since his emergence on the west coast in the late 1970s, Evander Music founder and saxophonist Phillip Greenlief has achieved international critical acclaim for his recordings and performances with musicians and composers in the post-jazz continuum as well as new music innovators and virtuosic improvisers. He has performed and recorded with Wadada Leo Smith, Meredith Monk, Nels Cline, Rashaun Mitchell and They Might Be Giants; albums include THAT OVERT DESIRE OF OBJECT with Joelle Leandre, and ALL AT ONCE with FPR (Frank Gratkowski, Jon Raskin, Phillip Greenlief). Upcoming releases include a trio date with Fred Frith and Evelyn Davis (Clean Feed). Recent residencies have included Headlands Center for the Arts and from 2012 to 2014 he was the curator at Berkeley Arts, a home for progressive music. He is the recipient of a San Francisco Bay Guardian Goldie Award. His critical writing has been published in Artforum and Signal to Noise.", "otherInfo": "The Ivy Room Presents: PG13, VOCO, GREX"}, {"Address": "116 Clement St, San Francisco, CA 94118", "Artist": "Seisiun ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.460518, 37.783375], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Plough & Stars", "moreBioInfo": "No artist bio available", "otherInfo": "Seisiún at Plough & Stars: Throwing back pints to a live soundtrack of traditional jigs and reels gives this Richmond watering hole a notably authentic Irish feel. Though P&S occasionally opens the stage to folk acts, the Emerald Isle crooners are the real treat -- whether offering tear-in-your-beer ballads or pint-swinging sing-alongs. Thursdays evenings offer set dancing to local ceili bands, while open sessions on Sundays and Tuesdays provide a chance for aspiring Celtic pickers to join in for a quick play-along."}, {"Address": "1192 Folsom St, San Francisco, CA 94103", "Artist": "Underground Nomads ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.410074, 37.775296], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "f8", "moreBioInfo": "No artist bio available", "otherInfo": "\"Underground Nomads\" w/ rotating resident DJs Amar, Sep, and Dulce Vita, plus guests"}, {"Address": "2800 24th St, San Francisco, CA 94110", "Artist": "MUSIC THERAPY ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408398, 37.752973], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Pop's Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Music Therapy\" w/ DJ Clave"}, {"Address": "500 Divisadero St, San Francisco, CA 94117", "Artist": "Brass Magic ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.437364, 37.774222], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "9:30 PM", "Venue": "Madrone Art Bar", "moreBioInfo": "No artist bio available", "otherInfo": "Brass Magic at Madrone Art Bar: Unless you're dying to catch a show at the Independent, this is the place on Divisadero to go. Everything in here is created by local artists, from the design of the space right down to the menus, while DJs spin everything from hip-hop, funk, and soul to vintage jazz and retro rock 'n' roll."}, {"Address": "3225 22nd St, San Francisco, CA 94110", "Artist": "Slow Jams ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.419521, 37.755192], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "9:30 PM", "Venue": "Make-Out Room", "moreBioInfo": "No artist bio available", "otherInfo": "\"Slow Jams\" While most '60s soul parties are dedicated to uptempo bangers, Slow Jams takes a different tack. Thrown Tuesday nights at the Make-Out Room, it's an evening dedicated to the slower side of soul with a playlist that sounds tailor-made for some hip '60s prom. Veteran DJs Lucky and Primo preside over the event with their extensive (and expensive) collections of rare vinyl. Grab a partner and sway to songs like Joe Bataan's \"Under the Streetlamp,\" Malo's \"Suavecito,\" and Wendy Rene's \"After Laughter.\" Lose yourself enough, and the club's nostalgic decorations might give you the impression of being in a lost era. Snap out of it, and you'll soon realize you can have this much fun every week."}, {"Address": "133 Turk St, San Francisco, CA 94102", "Artist": "High Fantasy ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.411384, 37.782849], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Aunt Charlie's Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "\"High Fantasy\" Weekends are for amateurs — the really good stuff happens during the week. Well, that might be a little hyperbolic, but it's certainly true in the case of High Fantasy. Going on for several years now, the weekly Tuesday night party at Aunt Charlie's is your midweek destination for a dose of high-concept gender-bending insanity. Madcap promoters Myles Cooper and Vivian Baron host an evening of cheap drinking, dancing, and drag to an impeccably selected soundtrack of underground house and disco classics. Its Facebook page declares, \"It's everything you want....\" And, for the low price of $5 (or less), it probably is."}, {"Address": "243 O'Farrell St, San Francisco, CA 94102", "Artist": "Stan Erhart Band ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408656, 37.786085], "Date": "Tue Mar 31 2020", "EventDate": "2020-03-31", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "Johnny Foley's Irish House", "moreBioInfo": "No artist bio available", "otherInfo": "The Stan Erhart Band at Johnny Foley's Irish House: Music lovers cherish the intimate cellar underneath Johnny Foley's Irish Pub, where songsmiths like Ron Sexsmith, Josh Rouse, and Lisa Loeb have all performed. A venue so intimate that musicians must use the audience bathroom."}, {"Address": "2369 Market St, San Francisco, CA 94114", "Artist": "Latin Lounge ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.434352, 37.762839], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "5:00 PM", "Venue": "The Cafe", "moreBioInfo": "No artist bio available", "otherInfo": "\"Latin Lounge\" at The Cafe: This long-running gay dance hotspot recently reopened after major renovations. Old event faves like Boy Bar, ¡Pan Dulce!, and Delicious are back as well."}, {"Address": "1511 Haight St, San Francisco, CA 94117-2912", "Artist": "The High Water Line ", "ArtistImage": "https://photos.bandsintown.com/thumb/8826196.jpeg", "Coordinates": [-122.44759, 37.76983], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Americana, Bluegrass, Alternative Folk, Acoustic", "Time": "6:00 PM", "Venue": "Club Deluxe", "moreBioInfo": "The High Water Line is a 5 piece group of Bay Area musicians who blend their diverse musical tastes and experiences to create a modern bluegrass sound all their own.\n\nWe can be found playing around the Bay Area a few times a month, and the members of HWL have performed all over the world, from New York to Shanghai and even in our own backyard at the CBA’s Father’s Day Festival.\n\nWhile all the members of HWL come from outside CA, we call it home now and feel lucky that the amazing bluegrass community here has allowed us to come together and share our musical passions. We met in 2017 thanks to the amazing local jam and performance scene. Our shared values around working together to elevate our music to levels we couldn’t reach on our own resulted in our name, The High Water Line.\n\nHailing from upstate New York, holding down the Banjo spot, and singing with his powerful baritone voice, is Tyler Stegall. Tyler's driving banjo style propels the band along no matter the tempo. Clare Armenante comes from The Garden State. A classical violin player, she is both at home playing for symphonies and taking amazing breaks over traditional bluegrass music. Not only is Clare amazing on the fiddle, but she can sing all the parts better than the rest of the band put together. Also from New Jersey, the man responsible for keeping the band in time and bringing the funk, is bass player and singer Jim Toggweiler. Helping to keep the band moving is mandolin player Tj Carskadon, from WI. Tj’s harmony singing and driving backbeat help to define The High Water Line’s unique rhythmic feel. Last, but certainly not least, is our amazing guitar player all the way from Monroe, Georgia, Joel Cofield. The way Joel seamlessly blends blues with both traditional and modern bluegrass guitar styles, combined with his fantastic harmony and lead singing, round out HWL’s sound and help bring it a flavor all its own.\n\nYou can find our demo recording included in this packet and on soundcloud at https://soundcloud.com/the-high-water-line. We are planning to make a longer record in 2018 and are working on some new original material for that project now.", "otherInfo": "The High Water Line returns to Club Deluxe for a first-Wednesday of the month residency. Every first Wednesday they bring you three sets of hard-driving West Coast bluegrass music, and it just so happens that the first set from 6PM-7PM takes place during happy hour!\n\nYou can check out their latest release \"Introducing The High Water Line\" here: https://open.spotify.com/album/5CBWvNuuuOcYOUjQRwIn1j?si=9hc_BFoJRSyck_mbGxH3xg"}, {"Address": "1677 N Main St,, Walnut Creek, CA 94596", "Artist": "Nick Tyrrel ", "ArtistImage": "https://photos.bandsintown.com/thumb/9116756.jpeg", "Coordinates": [-122.062265, 37.901849], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Bourbon Highway Country Bar & Kitchen", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "1 Hacker Way, Menlo Park, CA 94025", "Artist": "Mike Block ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440485.jpeg", "Coordinates": [-122.14462, 37.4762], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "6:00 PM", "Venue": "Facebook", "moreBioInfo": "MIKE BLOCK is a pioneering multi-style cellist, singer, composer, and educator, hailed by Yo-Yo Ma as the \"ideal musician of the 21st-Century\", and acclaimed by the NY Times for his \"vital rich-hued solo playing\". While still studying at the Juilliard School, Mike joined Yo-Yo Ma’s Silk Road Ensemble, with which he has toured extensively throughout the world, and won a 2017 Grammy Award for Best World Music Album. Mike is also an active recording artist of original material, folk music, cross-cultural collaborations, and he has an ongoing project to record all of the Bach cello suites in acoustically glorious bathrooms of famous concert halls, via BachInTheBathroom.com. As one of the first wave of cellists to adopt a strap in order to stand and move while playing, Mike was the first standing cellist to perform at Carnegie Hall, using a cello strap of his own design, called the Block Strap, a performance which the NY Times called \"Breathless ... Half dance, half dare.\"\n\nAs a music educator, Mike is passionate about emphasizing creativity and collaboration, leading to the founding of the Mike Block String Camp in 2010. MBSC provides players of all backgrounds the opportunity to learn from a world-class faculty in a variety of styles, and supports the exploration and development of the artistic voice of each student. Mike is also the founding Director of the Silkroad Global Musician Workshop, bringing together musicians from around the globe, and he created the online Multi-Style Cello School at ArtistWorks.com, with an extensive library of instructional videos. In 2012, Mike was appointed Associate Professor at the Berklee College of Music. Mike lives in Boston with his wife, fiddler Hanneke Cassel.\n\nMike has collaborated with a variety of diverse musicians and groups, such as Mark OConnor, Bobby McFerrin, The New York Philharmonic, Will.i.am, Edgar Meyer, Stevie Wonder, Darol Anger, Allison Krauss, Mike Marshall, Zakir Hussain, The National, Bon Iver, My Brightest Diamond, The Illinois Symphony, Rachel Barton Pine, Marcel Khaliffe, Goran Bregovic, Simone Dinnerstein, Dawn Upshaw, Anthony McGill, Tony Trishcka, Lenny Kravitz, Shakira, Joe Zawinul, Alasdair Fraser, Shujaat Khan, and many others.\n\nMike’s television and radio credits include \"Late Night with Conan O’Brian\", \"Regis and Kelly\", NBC’s 30 Rock, NPR’s \"St. Paul Sunday Morning\", WNYC’s \"Soundcheck\", APM’s \"Performance Today\", WNBC 4’s Chuck Scarborough Show, VH1, The Disney Channel, and the CBS \"Early Show\". When still living in New York City, Mike regularly subbed on Broadway as on-stage cellist for the Pulitzer Prize winning musical, \"Next to Normal\", and he also worked as Music Consultant on the 2012 film, \"A Late Quartet\". Mike was the subject of a 2011 feature article in the Wall Street Journal for his Artistic Directorship of the GALA BROOKLYN Music Festival, featuring cross-cultural collaborations among locally-based musicians.\n\nMike attended college at the Cleveland Institute of Music, where he studied cello with Richard Aaron, and received the Jim Hall Prize for Undergraduate Achievement. Mike also earned a Master’s Degree from the Juilliard School, where he studied with Darrett Adkins and Joel Krosnick. These days, Mike plays on a modern cello made in 2014 by Fabienne Gauchet, D’Addario strings, a David Gage Realist pickup, and the patented cello strap of his own design, The Block Strap.\nwww.MikeBlockMusic.com\nwww.GlobalMusicianWorkshop.com\nwww.MikeBlockStringCamp.com\nwww.CelloStrap.com\nwww.BachInTheBathroom.com\nwww.ArtistWorks.com/Cello", "otherInfo": "Live Stream: https://www.facebook.com/silkroadproject"}, {"Address": "1120 Merrill St, Menlo Park, CA 94025", "Artist": "The Complements ", "ArtistImage": "https://photos.bandsintown.com/thumb/8140915.jpeg", "Coordinates": [-122.182453, 37.45455], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Positive Rock", "Time": "6:00 PM", "Venue": "Off the Grid: Menlo Park", "moreBioInfo": "Singer-songwriter acoustic duo from California.", "otherInfo": "No other event info available"}, {"Address": "999 California St, San Francisco, CA 94108", "Artist": "Ricardo Scales ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.410248, 37.791405], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "6:30 PM", "Venue": "Top of the Mark", "moreBioInfo": "No artist bio available", "otherInfo": "Ricardo Scales at Top of the Mark: This famed martini bar offers high-class wallpaper music on the weekends, including lounge piano, easy listening, classical, and some jazz combos. The best stuff comes late on Friday and Saturday nights, when the drinks pour with a heavy hand and the jazz bands blow with a little more gusto."}, {"Address": "50 Oak St, San Francisco, CA 94102", "Artist": "Chad Lefkowitz-Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/8384191.jpeg", "Coordinates": [-122.420253, 37.775481], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "San Francisco Conservatory of Music", "moreBioInfo": "Chad Lefkowitz-Brown is an American saxophonist and international recording artist known for his work in jazz and popular music. He is currently a member of the multi Grammy award-winning Afro Latin Jazz Orchestra, and he has made internationally televised appearances with pop icons like Taylor Swift, Don Henley and Phillip Phillips. Chad has toured across the globe as a soloist and with many esteemed jazz artists, including Arturo O’Farrill and Clarence Penn.\n\nA native of Elmira, New York, Chad established himself as a jazz prodigy at age 11, performing throughout New York State under the mentorship of local jazz hero, George Reed, who was known for backing legends like Teddy Wilson, Buddy Tate, and Marian McPartland.\n\nChad went on to pursue a formal education in the arts at the Brubeck Institute, a prestigious fellowship program created by jazz legend Dave Brubeck. While studying at the institute, he performed regularly with Brubeck and was a member of the Brubeck Institute Jazz Quintet.\n\nChad received many accolades during his scholastic career, including 15 DownBeat Magazine Student Music Awards for categories such as \"Best Jazz Soloist\" and \"Best Original Song.\"\n\nSince graduating from the Brubeck Institute, Chad has performed throughout four continents, and has appeared at venues including Carnegie Hall, the Super Bowl, and Madison Square Garden. His debut album, Imagery Manifesto, was named “Debut Album of the Year” by jazz critic and author, Doug Ramsey, and his forthcoming album, “Onward,” features jazz legend, Randy Brecker.", "otherInfo": "No other event info available"}, {"Address": "1 Castro St, Forest Knolls, CA 94933", "Artist": "Migrant Pickers ", "ArtistImage": "https://photos.bandsintown.com/thumb/8669475.jpeg", "Coordinates": [-122.689102, 38.014869], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Aggravated Folk", "Time": "7:00 PM", "Venue": "Papermill Creek Saloon", "moreBioInfo": "Migrant Pickers\nhttp://www.migrantpickers.com\n\nIf Joe Strummer had come up in Greenwich Village taking guitar lessons from Dave Van Ronk and crate digging for Rev. Gary Davis records, he might sound something like Migrant Pickers' frontman Gary Adler. Acoustic finger-picking guitar with a punk rock edge, Gary's music combines technical virtuosity with honest, soulful songwriting.\n\nDisciples of Woody Guthrie with a rock in their shoe, the Pickers are firmly rooted in the subversive tradition of American folk. Combined with Mark Lahti's driving electric bass Gary and Mark's performances are an unapologetic act of defiance-- of genre, expectation, and the very laws of physics.\n\nMigrant Pickers will take you on a freight train ride from the deepest roots of American music to outer space and back.", "otherInfo": "No other event info available"}, {"Address": "982 Market St, San Francisco, CA 94102", "Artist": "Allen Stone ", "ArtistImage": "https://photos.bandsintown.com/thumb/9393119.jpeg", "Coordinates": [-122.410073, 37.782687], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Allen Stone", "Time": "7:00 PM", "Venue": "The Warfield Theatre", "moreBioInfo": "On his third full-length album, singer/songwriter Allen Stone proves himself deeply devoted to making uncompromisingly soulful music that transcends all pop convention. Stone’s debut for Capitol Records, Radius marks the follow-up to the Chewelah, Washington-bred 28-year-old’s self-released and self-titled sophomore effort, a 2011 album that climbed to the top 10 on Billboard’s Heatseekers chart and gained acclaim from renowned rock critic Ann Powers (whose NPR review hailed Allen Stone as “meant for those of us who like our R&B slightly unkempt and exceedingly feelingful”). Made in collaboration with Swedish soul singer/songwriter/phenom Magnus Tingsek, Stone’s latest batch of songs capture the warm energy of that creative connection and transport the listener to a higher and more exalted plane.\n\nCulled from several dozen songs penned through a year and a half of constant writing and refining, Radius bears a title that reflects both its scope and intimacy. “The radius is that line extending from the center of the circle to its exterior,” says Stone, “and in a lot of ways this album is about getting out things deep inside—whether it’s love or insecurity or joy or frustration about things going on today.” Along with immersing himself in a songwriting approach that involved unflinching examination of “some very dark and negative moments in my life,” Stone shaped the sound and feel of Radius by pushing himself to “get past the boundaries of what I felt comfortable with, so that I could progress into a whole new level of creativity.” Despite that sometimes-daunting process, Radius wholly reveals Stone’s easy grace in blending everything from edgy soul-pop and earthy folk-rock to throwback R&B and Parliament-inspired funk.\n\nRadius first began to come to life back in the fall of 2013, when Stone headed to Sweden to join in a writing session with Tingsek. “His musicality is so outside-the-box, and it really stretched me as an artist,” says Stone, who’d tapped Tingsek as one of his opening acts for an 85-date headlining tour in 2012. “We just kept on throwing a wrench into the works and tried to create something that’s the complete antithesis of what you’d expect from pop music.” After recording the bulk of the album in Sweden, Stone rounded out Radius’s production at his own studio in the woods of northeast Washington and in L.A.-based sessions with producers like Benny Cassette (who’s previously worked with Kanye West) and Malay (a co-producer on Frank Ocean’s channel ORANGE).\n\nLike many of his own musical heroes—Stevie Wonder chief among them—Stone pulls off the near-magical feat of channeling a weight-of-the-world sensitivity into his songs while still radiating hope and promise. And though that depth of consciousness feels transmitted from a more golden era, Radius continually hones in on issues both timeless and of-the-moment, with Stone’s breezily poetic lyrics touching on topics ranging from rampant materialism (on the tenderly string-accented, harmony-soaked “American Privilege”) and the toxic takeover of technology in art (on the gutsy and groove-heavy “Fake Future”). “That song’s mainly about how technology’s infiltrating music in a way that’s making it less and less human and taking all the heart out of it,” Stone says of the latter track, a soul-pop powerhouse peppered with playfully cutting lines like “Rock stars pushing buttons/Few actually play/City wasn’t ever built on lights and Special K.” And as evidenced by Radius’s lush yet raw sonic landscape—wherein the only hint of synth comes from a Moog analog synthesizer—Stone stayed true to his pledge to “keep fakeness completely out of this record” and rely entirely on live instrumentation.\n\nEqually introspective and outwardly searching, Radius also finds Stone exploring intensely personal matters, such as depression on the stark and lovely, acoustic-guitar-woven ballad “Circle” (“That one was written at a pretty dark time for me,” Stone points out. “It’s about how depression can put you into a kind of circle, where you’re just trying to find a way out but it keeps on leading you back inside”). Showing his skill at crafting a killer love song as well, Stone looks at heartbreak and regret on the aching, electric-piano-infused “I Know That I Wasn’t Right,” slips into hopeless romanticism on the dreamy R&B pastiche “Barbwire,” and unleashes some starry-eyed affection on the dancefloor-ready “Symmetrical” (a sample lyric: “The angle of your spine/Is sending lightning bolts down mine/When those molecules combine/It’s astronomically divine”). And in tracks like the ultra-catchy album-opener “Perfect World” and the fiery, horn-laced “Freedom,” Radius unfolds into epically joyful anthems that show the full range and power of Stone’s vocals.\n\nStone started working those vocals as a kid, thanks largely to his parents’ influence. “My father was a minister so I spent about half my childhood in church, watching my mom and dad sing together and lead the congregation in song,” he recalls. By the time he was 11 he’d picked up a guitar and written his first song, and soon began self-recording demo tapes to pass along to classmates. Although Stone enrolled in bible college after high school, he quickly dropped out to move to Seattle and kickstart his music career. “I had an ’87 Buick and I’d drive up and down the west coast, playing any gig I could get just to try to put my music out there,” he says.\n\nAt age 22, Stone self-released his debut album, 2010’s Last To Speak. But it was his self-titled follow-up (on which he joined forces with former Miles Davis keyboardist Deron Johnson) that ended up earning him serious recognition. Along with entering the top five on iTunes’ R&B/Soul chart after its digital release, Allen Stone prompted him to score appearances on such late-night talk shows like Conan and grace the pages of publications like the New York Times (whose chief popular-music critic Jon Pareles praised Stone for possessing “a tenor voice with the eagerness and frisky syncopations of [Stevie] Wonder”). And upon partnering with ATO Records for a physical release of his self-titled album in 2012, Stone soon turned up on the likes of the Late Show with David Letterman and landed a gig as the opening act for soul legend Al Green. In the midst of all the buzz, he also took up a grueling touring schedule, tearing through nearly 600 shows in just two years.\n\nFor Stone, all that time onstage went a long way in preparing him for the many creative breakthroughs he’s made on Radius. “I think you really grow as a musician when you’re playing right in front of people, and for me constantly growing and progressing and getting better is really the most important thing,” he says. Ruminating on the emotional undertones of his new album’s title and noting that “the center of me is my heart,” Stone says he also hopes that Radius will ultimately help listeners shed new light on their own struggles. “There’ve been times in my life when records were my saving grace and really helped me to figure out who I am, and I’d love for my music to have that kind of impact on a kid who’s looking for his or her own place in this life,” he says. “Because I absolutely believe that if you’re going to stand at a microphone and say something, you need to recognize that as a privilege. You’ve got to be incredibly careful about it, and really put all your heart into the message that you’re sending out into the world.”", "otherInfo": "No other event info available"}, {"Address": "20 Cosmo Pl, San Francisco, CA 94109", "Artist": "David Byrd and Byrds of a feather ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.41236, 37.788395], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "LE COLONIAL", "moreBioInfo": "No artist bio available", "otherInfo": "David Byrd and Byrds of a Feather at Le Colonial: Recalling Vietnam during the time of French colonization, the upscale Le Colonial restaurant features a gorgeous, palm tree-lined interior. It's slowly but steadily attracting special events such as the Lotus party (every Saturday night)."}, {"Address": "2 Orinda Theatre Square #103, Orinda, CA 94563", "Artist": "Phil Griffiths ", "ArtistImage": "https://photos.bandsintown.com/thumb/9046383.jpeg", "Coordinates": [-122.1820494, 37.8787458], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Comedy", "Time": "7:00 PM", "Venue": "Cine Cuvee", "moreBioInfo": "Comedian", "otherInfo": "No other event info available"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "The Grant Farm ", "ArtistImage": "https://photos.bandsintown.com/thumb/6159898.jpeg", "Coordinates": [-122.516602, 37.968097], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Americana", "Time": "7:30 PM", "Venue": "Terrapin Crossroads", "moreBioInfo": "Boulder, Colorado-based Cosmic Americana band Grant Farm has entertained a growing fan base on the nation’s club and festival scene since its founding in 2009 by vocalist and National Flatpicking Guitar Champion Tyler Grant.\n\nBuilt on the fundamentals of love, family, and music, the band is a sure bet for fans of high-energy, authentic artists as diverse as Sturgill Simpson, Tedeschi Trucks Band and Phish. Comprised of zany, creative and highly musical comrades, Grant Farm members include Grant (aka “The Champ”), Adrian “Ace” Engfer (bass and vocals), Sean “Magic” Macaulay (drums) and Kevin “Money” McHugh (keyboards and vocals).\n\nDaniel Mescher of Colorado Public Radio dubbed Grant Farm “some of the ablest musicians not only in the state of Colorado, but in the nation.” Members’ prior experience includes playing with groups like The Emmitt-Nershi Band, Donovan Frankenreiter and Hot Soup. Collectively, they had also shared stages with notable artists Sam Bush, Jerry Douglas, Tim O’Brien, Tony Rice, Keller Williams, Jon Oates and the like and with notable groups The String Cheese Incident, Greensky Bluegrass, Yonder Mountain String Band and The Infamous Stringdusters.\n\nThe band’s latest release, Kiss the Ground (Summer 2016), represents its first full-length concept album and its third album of original music. Speaking to the struggles we all face as working people, Kiss the Ground sends a positive message while acknowledging real hardship in a society that expects far too much. “We think of this as our ode to the working people,” says Grant, whose song, “Get in Line,” discusses the high price we pay for things we want in life. Kiss the Ground explores real and mythological connections to the human struggle and pays homage to the \"Working Class Hero,\" an archetype famously described by John Lennon.\nPrevious Grant Farm albums include a 2012 self-titled debut and a 2014 follow up, Plowin' Time, which reached #2 on JamBand Radio Charts and charted on Americana Radio. In 2014, the band also released the Meeting on the Mountain EP, an inspired collaboration with the group Fruition.\n\nThe band has also created the acclaimed Meeting on the Mountain LIVE, a collaborative, live webcast concert experience featuring Grant Farm as the house band and Tyler Grant as host. To date, episodes have featured Dave Bruzza of Greensky Bluegrass, Bill Nershi of String Cheese Incident, Todd Sheaffer of Railroad Earth, The Dead Winter Carpenters and other guests.\n\nLike a “traveling Gypsy family,” Grant Farm enjoys their life of touring, writing and adventuring together as they share their music up and down the North American roots music line.", "otherInfo": "No other event info available"}, {"Address": "401 Mason St, San Francisco, CA 94102", "Artist": "Bay ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.410141, 37.787295], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Biscuits & Blues", "moreBioInfo": "No artist bio available", "otherInfo": "Bay City Blues w/ Chris Cain"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Baby Bushka ", "ArtistImage": "https://photos.bandsintown.com/thumb/8773062.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Kate Bush Tribute Band", "Time": "7:30 PM", "Venue": "Cafe Du Nord", "moreBioInfo": "THE MUSIC AND MAGIC OF KATE BUSH REACHES FAR AND WIDE ACROSS THE SEAS AND SKY TO SAN DIEGO WHERE EIGHT WOMAN GATHER TO CREATE AMERICA'S ONE AND ONLY KATE BUSH COVER BAND, BABY BUSHKA.\n\nTHE BAND CONSISTS OF SOME OF CITY'S MOST TALENTED MUSICIANS, NATASHA KOZAILY, NINA DEERING, LEAH BOWDEN, DANI BELL, SHELBI BENNET, LEXI PULIDO, NANCY ROSS AND BATYA MACADAM SOMER.\n\nFILLED WITH 4 PART VOCAL HARMONIES AND EPIC CHOREOGRAPHED DANCING THIS IS THE KATE BUSH COVER BAND YOU'VE ALL BEEN WAITING FOR.", "otherInfo": "POSTPONED: Baby Bushka LIVE at Cafe Du Nord!\nTickets will be honored for new date TBA. This show is 21+. Doors at 7:30."}, {"Address": "1984 Bonita Ave,, Berkeley, CA 94704", "Artist": "Swells OC ", "ArtistImage": "https://photos.bandsintown.com/thumb/9664084.jpeg", "Coordinates": [-122.272093, 37.871966], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "R&b, Reggae", "Time": "7:30 PM", "Venue": "The Back Room Music", "moreBioInfo": "No artist bio available", "otherInfo": "Coming from the Island of Orange County California and of Tongan heritage, Swells OC is a well seasoned and multi-talented musician. He has toured the world, playing for some of the largest current Island Reggae Artists & Bands as a keyboardist. Since becoming a highly sought out backing musician Swells OC has slowly stepped out to begin his journey as a Solo Artist. Swells OC has had the pleasures of sharing the stage with the likes of Katchafire, Fiji, Sammy Johnson, Common Kings, Anuhea and many more. Swells OC is here to stake his claim in the Island Reggae genre.\n\nBringing you hits like \"Still Wanna Be\" featuring Sammy Johnson, to his independent 2019 self titled EP, and now his latest single \"A Song For You\". As his music fills your ears, you're instantly hit with a soothing \"don't worry, be happy\" island vibe. Finding his voice through his church upbringing Swells OC has attractively blended the influences he's gained from Reggae, RnB and the Neo Soul genres. A night with Swells OC will have you positively energized, leaving you refreshed and wanting more. Please join us for an acoustic night of live music powered by Mackie.\n\n*Note: B.Y.O.B. Swells will be at the venue hanging out with everyone before his set, so early arrival is encouraged. Come hangout and connect with Swells. See what he's been up to from everything both on and off the stage and what he's been cooking up in the studio. Get there early!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Juan Escovedo ", "ArtistImage": "https://photos.bandsintown.com/thumb/10201935.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "No artist bio available", "otherInfo": "Yoshi's Oakland Presents Juan Escovedo All Stars"}, {"Address": "998 Valencia St, San Francisco, CA 94110", "Artist": "Taarka ", "ArtistImage": "https://photos.bandsintown.com/thumb/7566695.jpeg", "Coordinates": [-122.421431, 37.75704], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Country, Indie Folk, Bluegrass, Americana, Gypsyjazz, Folk", "Time": "8:00 PM", "Venue": "Amado's", "moreBioInfo": "Taarka, led by David Tiller and Enion Pelta-Tiller, is the natural next step in the evolution of music. The incarnation features high-energy performance and innovative compositions, expanding a musical canvas by drawing on the sounds of old and new from world folk, jazz, classical, and rock energy into a synergy of swirling gypsy world dervish for a truly unique and exciting brand of music performed master musicianship.\n\nDavid Tiller - mandolin, guitar, and vocals, and Enion Pelta-Tiller - violins and vocals began playing and writing together in the spring of 2001. They met through a Williamsburg, Brooklyn-based band called Brooklyn Browngrass. They moved to Oregon to continue to develop their unique sound, and most recently moved to Colorado to explore the heart of acoustic music with an electric energy.", "otherInfo": "No other event info available"}, {"Address": "777 Valencia St, San Francisco, CA 94110", "Artist": "Vundabar ", "ArtistImage": "https://photos.bandsintown.com/thumb/8012462.jpeg", "Coordinates": [-122.421188, 37.760565], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Sludgy Jangly Pop, Surf Rock, Rock", "Time": "8:00 PM", "Venue": "The Chapel", "moreBioInfo": "http://vundabar.bandcamp.com Twitter: https://twitter.com/Vundabar_band Insta: instagram.com/vundabores Merch: http://vundabar.bandcamp.com/merch", "otherInfo": "Vundabar at The Chapel"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "Lightning Bolt ", "ArtistImage": "https://photos.bandsintown.com/thumb/6151470.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Alternative, Noise, Awesome, Rock, Noise Rock", "Time": "8:00 PM", "Venue": "The New Parish", "moreBioInfo": "Lightning Bolt emerged from Providence, Rhode Island in 1995 as a three-piece art school project. Initially there was Brian Chippendale's explosive, non-stop drumming, Brian Gibson's James Chance & The Contortions-like bass lines, and Hisham Bharoocha's vocals propelling them in a fury of volatile noise and orgiastic tribalism. The group helped found Fort Thunder, a music and art collective, and recorded Lightning Bolt which was issued through Load in 1999. By 2001's Ride the Skies, Bharoocha had departed (he eventually formed Black Dice). This left the vocal duties to Chippendale, who put the microphone into a sock and stuffed it under a mask he wears while performing. Lightning Bolt did a series of tours with bands like The Locust, Arab on Radar, Orchid, and Melt-Banana before returning in 2003 with the studio album Wonderful Rainbow. The album did very well in underground music circles, and set up the release of 2005's Hypermagic Mountain.\n\nLightning Bolt is well known for their live performances, in which they turn up the volume as loud as it can possibly go and forgo a traditional stage, preferring to perform amidst the audience.", "otherInfo": "Doors 7:30 // Show 8 // ALL SALES ARE FINAL"}, {"Address": "2236 Martin Luther King Jr Way, Oakland, CA 94612", "Artist": "MH The Verb ", "ArtistImage": "https://photos.bandsintown.com/thumb/8037746.jpeg", "Coordinates": [-122.2727, 37.81239], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "MH the Verb, [Multi-Media Hip Hop Artist]", "Time": "8:00 PM", "Venue": "Starline Social Club", "moreBioInfo": "I am a whiskey drinking, boat shoe wearing, MC/DJ/Producer who currently resides on a Megabus between a pair of imitation BeatsbyDre Headphones. Still in a committed relationship with my first love, Hip Hop. However, I tend to have affairs with other genres. My iTunes playlist consist of everything from Oasis to Immortal Technique. But, I'd rather experience music live. Or, recreate it with my band. My rhymes are more often about student loans then \"ridin spinnaz\". I won't own a chain. But, I'd totally rock a grill. Baseball is my favorite sport. Olivia Munn is my celebrity crush. And, I can quote all of season 3 of \"The Wire\". I vote because its my responsibility. I walk between the lady and the street. I live my life with passion and love. Follow the golden rule. And, I believe in Good People, Good Vibes, and Good Art. #BalloonUP", "otherInfo": "8PM ~ Afronaut Lounge ~ Hip Hop, 90s R&B, Futuresoul ~ 21+ ~ Hosted by MH The Verb & Edy Blu!"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Rock ", "ArtistImage": "https://photos.bandsintown.com/thumb/6643774.jpeg", "Coordinates": [-122.416775, 37.739269], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Hip-hop, Rap, Hip Hop", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe", "moreBioInfo": "No artist bio available", "otherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "All Stars ", "ArtistImage": "https://photos.bandsintown.com/thumb/6129696.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Latin, Hip-hop, Reggae, Electronic, Reggaeton, Dancehall, Trap, House, Finnish, Edm, International, Hip Hop, Hiphop, Rap", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "A-Rok was a music producer since 2005, and since 2011 he started Djing with a high name Djs in Finland at one of the most known urban event held once a week. He got very known by hes own creativity and how he delivers the right music at the right time with any type of music genre. A-Rok within 2 years of DJ-ing, He competed in the Finland’s only NRJ national DJ championships, securing a 3rd place, which to say is quite huge given who he was up against. Why look any further or at any other CV when what you need for your establishment is right here in front of you! Rocking the decks and blending that beat with a touch of scratch. Talented DJ and music producer Booking address: arokmusic@gmail.com Phone: +971 55 15 99 281", "otherInfo": "Yoshi's Oakland Presents Juan Escovedo All Stars"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Blues Jam ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.416775, 37.739269], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe", "moreBioInfo": "No artist bio available", "otherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Rocky Rivera ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Hip-hop, Rap, Hip Hop", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "6551 Telegraph Ave, Oakland, CA 94609", "Artist": "Rebel Kings of Oakland ", "ArtistImage": "https://photos.bandsintown.com/thumb/9131376.jpeg", "Coordinates": [-122.26047, 37.85161], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Oakland, California", "Time": "8:30 PM", "Venue": "White Horse Inn", "moreBioInfo": "We are a drag king troupe based in Oakland, CA. We perform every first and third Wednesday at the White Horse in Oakland, CA.", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Zion-I ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Hip Hop", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Vocab Slick ", "ArtistImage": "https://photos.bandsintown.com/thumb/8876284.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Vocab Slick started rhyming as a teenager in the North Bay area in the late 90s, but like many young Americans, he fell into a life of hustling and drugs, invetiabely leading to some jail stints for the young emcee.\n\nFacing serious consequences, Vocab—then known as Vocabulary Slick—pulled it together, cleaned himself up and began putting that energy into his music, releasing the Lyrically Conscious LP in 2003.\n\nIn 2003, Vocab and childhood friend Emotionall formed the group Distant Relatives. Later joined by emcee Maynee, the group went on to release For The Passion in 2006. Not long after their inaugural release, Emotionall was detained and surprisingly deported to Mexico. Finding themselves at a crossroad, V.S. and Maynee decided to press forward with their vision for Distant Relatives, continuing on their path to create “truth music.” The two emcees teamed with the talented DJ Ricky Switch—an Irishman freshly calling SF home—and in 2007 released the LP The Ethx of Distant Relatives, produced entirely by Fremont-based producer Ethx.\n\nIn 2010, Vocab Slick released Dark Day, showcasing his ability to make powerful solo music.\n\nIn 2011, Distant Relatives returned with This Changes Everything, earning underground praise and coverage on blogs and college radio around the country and overseas. The LP—produced entirely by Rick Vargas—featured The Grouch & Eligh and Zumbi of Zion I.\n\nAfter taking some personal time following both the death of his mother and the birth of his daughter in the Summer of 2013, the sudden passing of his best friend and rap partner Maynee in January of 2014 galvanized Vocab to get back in the studio to create and record more and more music.\n\n“I took that pain and poured it into my music.”\n\nVocab has since released 3 projects the Somethin' Slick EP, The Issues and Episodes LP and The Day After Yesterday EP on 07/07/17", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "DJ True Justice ", "ArtistImage": "https://photos.bandsintown.com/thumb/8960373.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Adult Contemporary Hip Hop", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "True Justice, aka The Man of Steel, has been a pioneer in the Bay Area Hip Hop scene since 1989. In an era where real deejaying skills have become scare, True Justice holds the torch, and is known for tearing clubs down in every city and every town. No stranger to hustle and showmanship, he comes from the era of constantly packing the vinyl crates and being out on the road!\n\nTrue's ambition is to showcase the amount of talent that he has amassed in the last 25 years in Northern California, better known as The Yay Area. While still in high school, True Justice was a hip hop dancer for the Oakland, CA super-group A.P.G. (Action Packed Gangstas), and at the age of 16, he found himself doing concerts with the likes of Digital Underground, Capital Tax, Paris and K-Cloud -- while witnessing first hand the birth of the independent hip hop game in the culturally rich Bay Area.\n\nFrom 1989-91, True studied A.P.G.'s master DJ J-Cutt as he amazed crowds night after night with his show-stealing solo routines with two turntables, a mixer, and two copies of the same record. When he arrived in Berkeley in 1993, True Justice (then known as DJ Skillz), traded his patent leather shoes for two Technic turntables and a Gemini mixer. For years you could see True selling cassette tapes on Telegraph Avenue in Berkeley, CA alongside favorites of today: Living Legends, Saafir, and the Hobo Junction.\n\nIn 1997, True formed the All Purpose DJs with Lord Takim, DJ Styles, and DJ Lex. That same year he began a career of show deejaying, first with Dream Nefra, and then later with Mic T, AceyAlone & Abstract Rude, Aesop and Planet Asia. As a duo True Justice and DJ Lex released Volume 1 in 1997, Aural Sex Volume 2 in 1998, AP2K in 2000, and Pound Fa Pound in 2004. All releases quickly became local classics. The All Purpose DJs have excited crowds with icons such as Slick Rick, Biz Markie, Notorious B.I.G., Xzibit, Phife, Keak Da Sneak, Above The Law, and E-40.\n\nIn 2004, True and Lex toured in Osaka, Japan, garnering legions of fans of their dexterity on the wheels of steel. A bonafide student of showmanship, True continued to hone his craft, and in 2007, True Justice dropped his self-titled debut album and joined forces with The Bayliens -- \"Aliens from The Bay\" -- and dropped the CD Crop Circles in the same year.\n\nFrom 2007 to 2015, True Justice toured worldwide with The Bayliens, Living Legends, Cali Agents, Mistah F.A.B., Zion I, Paris, The Alkaholiks, Jeru The Damaja, Lords Of The Underground, The Beatnuts, Onyx, Redman and EPMD.\n\nIn 2014, True founded the popular annual Slap Frost Tour with Vocab Slick and Z-Man. In 2016, he dropped his sophomore effort, The Man Of Steel on Guerrilla Funk Recordings.\n\nPress Kit:\nhttp://www.guerrillafunk.com/truejustice/manofsteel_press_kit.html", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave, Berkeley, CA 94704", "Artist": "Mike Marshall ", "ArtistImage": "https://photos.bandsintown.com/thumb/9787778.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Country, Bluegrass", "Time": "8:30 PM", "Venue": "Cornerstone Craft Beer & Live Music", "moreBioInfo": "Michael Marshall is an R&B soul singer, from Berkeley California, with a love for hip-hop. He is a ‘gospel kid’ at heart, as he grew up singing in the Church. He started his career in the 80’s as the powerful lead singer for the Timex Social Club with billboard chart topping songs ‘RUMORS’ and ‘Thinking About You Girl’. Michael’s voice is known worldwide for hit songs as a featured artist in multiple genres. His vocals are featured in the 90’s certified platinum rap song ‘I Got 5 On It’ by the LUNIZ, as well as ‘Your Body’ by house/dance music DJ Tom Novy. In 2005 Michael produced his first solo album, ‘Soul of the Bay’ which contains the autobiographical song “Who Is He”. Michael continues to be featured in musical collaborations, most notably with San Francisco Bay Area rapper E40, as well as long time collaborator Equipto with the K.I.M. (Keep It Movin’) albums.\n\nMichael Marshall has many hits & memorable songs that will go down in history. These incredible songs have to make way for another dose of brilliance by Mr. Meezy. His NEW Project “Grown & Sexy” is here! You can also find Meezy’s voice and image as a contributing feature on the trailer for ‘The Last Black Man In San Francisco’ singing the classic “San Francisco (Be Sure To Wear Flowers In Your Hair)”.", "otherInfo": "No other event info available"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Gina Madrid ", "ArtistImage": "https://photos.bandsintown.com/thumb/8078533.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Latin, Hip Hop", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Gina Madrid formerly Raw-G, Born and raised in Guadalajara Mexico. She brings her own distinct cross-cultural, multi-lingual, politically charged Hip-Hop to the Bay Area music scene captivating audiences with her passionate and aggressive performances.\n\nGina Madrid left Mexico and moved to Oakland California in 1999, where she learned english by translating Hip-Hop lyrics from 2pac,\nThe Fugees, and KRS-1.\n\nGina Madrid developed an engaging, insightful, social conscious flow that challenges our musical and gender preconceptions of Hip-Hop culture. She has performed with artists such as Ghostface Killah, Mobb Deep, DJ Premier, KRS-One, Ozomatli, Mobb Deep, Ana Tijoux, La Mala, Natalia Lafourcade to name a few. She is definitely one the most exciting MC's to come out of Oakland California and an artist to keep an eye on. Her EP 'Esperanza' released July 14, 2015. This project contains collaborations with Gift Of Gab of Blackalicious, DJ Shadow, Lila Rose and other Bay Area artists.\n\n\"Her work as both an artist and promoter represents the social consciousness and raw heart of both Mexico and Oakland\"\nOakulture", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Richie Rich ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Set apart by his rapping style and influence on Snoop Doggy Dogg (by Snoop's own admission), Richie Rich first entered music in the late '80s with the Oakland-based group 415. With D-Loc, DJ Darryl, and JED, Rich crafted a Bay Area classic called 41Fivin', which sold well around the region and spawned a Richie Rich solo album, Don't Do It. As the group was ready to sign a major-label contract with Priority in 1990, however, Richie Rich was arrested for possession of cocaine. 415 released its next album and faded from the scene soon after, while Rich sat in jail; he was released a year later, and began appearing on tracks by the Luniz and 2Pac before forming his own label Oakland Hills 41510 and releasing 1/2 Thang. By 1995, Richie Rich had become the first Bay Area rapper to sign with New York's Def Jam Records, and his major-label solo debut, Seasoned Veteran, was released in late 1996. This CD had some of his most memorable classics; \"Lets Ride\" and the Tupac tribute \"Do G's Get To Go\". The two most famous songs he did with Tupac are; \"Rather be your Nigga\" & \"Aint Hard To Find\" which featured other Bay Area artists. His long-awaited sophomore effort, The Game, was issued four years later.\n\n- John Bush, All Music Guide", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Z-Man ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Goa Trance, Psy Trance, Electronic", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "For more information check out www.gurpcity.net", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Shagnasty ", "ArtistImage": "https://photos.bandsintown.com/thumb/8244008.jpeg", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Damon Titus - guitar, screaming;, Casey Allen - Bass;, Vic Sanchez - Drums", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Shagnasty Official is The Ken Trader Tribute Band. We play original 1970's rock n roll.", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Equipto & Mike Marshall ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $15 Adv & $19 Day of Show"}, {"Address": "2800 24th St, San Francisco, CA 94110", "Artist": "MUSIC THERAPY ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408398, 37.752973], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Pop's Bar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Music Therapy\" w/ DJ Clave"}, {"Address": "1822 San Pablo Ave, Berkeley, CA 94702", "Artist": "The Whiskey Brothers ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.293066, 37.870706], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Albatross Pub", "moreBioInfo": "No artist bio available", "otherInfo": "The Whiskey Brothers at Albatross Pub:"}, {"Address": "3600 16th St, San Francisco, CA 94114", "Artist": "Juicy ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433406, 37.764392], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "R&b/soul, Funk, Rnb-soul, Soul, R&b", "Time": "9:00 PM", "Venue": "Lookout", "moreBioInfo": "No artist bio available", "otherInfo": "\"Juicy\" at Lookout: The elevated location, long windows, and outdoor balcony give this Castro bar its name, where queers nosh on pizza and dance to DJed music while keeping an eye open for people to meet."}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "Canceled ", "ArtistImage": "https://photos.bandsintown.com/thumb/8004081.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "No genre available", "Time": "9:30 PM", "Venue": "The Fillmore", "moreBioInfo": "No artist bio available", "otherInfo": "múm - Canceled at The Fillmore: It's legendary and one of the best venues anywhere: great sightlines, killer sound system, and - most importantly - a continuous parade of top musical talent gracing the stage. Whether it's country legends, indie iconoclasts, crossover punks, or rhyme-slinging hip-hop crews, this venerable S.F. institution has got it. If you're bored between acts, scope the photo gallery that lines every hallway wall with pictures of the icons who've shared the same space in which you're currently standing."}, {"Address": "316 11th St, San Francisco, CA 94103", "Artist": "Jody Wisternoff ", "ArtistImage": "https://photos.bandsintown.com/thumb/9055217.jpeg", "Coordinates": [-122.413792, 37.771362], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Electronic, Progressive House", "Time": "9:30 PM", "Venue": "Audio Nightclub", "moreBioInfo": "“Am I a legend?”, asks Jody Wisternoff, questioning the question. “The thing is, legend tends to suggest you’ve had your time, got the pipe and slippers out and only work occasionally as the mood takes you, and nothing could be further from the truth in my case; I continue to push forward and evolve, plus I’m busier now than I’ve ever been!” Seriously? Clearly Jody Wisternoff is a man whose personal dictionary doesn’t contain the term ‘tread water’.\nJody has indeed been pushing the envelope his entire career, which started at the very early age of 13 years when he and brother Sam prodigiously reached the finals of the DMC HipHop Championships. This success was compounded two years later when they found national fame as Tru Funk, landing themselves on the pages of cult magazine The Face and Tim Westwood’s Radio 1 playlist. “Obviously it was a different genre to what I’m known for now,” explains Jody, “Bristol’s always been renowned for the calibre of its dub scene and the artists that have come out of it. In the late 80‘s and early 90‘s I was very much a part of that movement, which provided me with an invaluable foothold in the world of dance. I soon found myself DJing to thousands at fondly remembered festivals such as Universe and Fantazia. It was a crazy time.”\nThese formative years were influential too, for it was this background that underpinned the ethos of Way Out West, which Jody founded with Nick Warren following a chance meeting in a local record shop. Fusing Bristol’s dub roots with club beats Way Out West captured a sound unlike any other at that time and burst onto the mid-nineties dance scene with\nseminal hits such as ‘Ajare’ and top ten smash ‘The Gift’, which they even performed on Top of the Pops (RIP). When not appearing on nationally treasured TV programmes they could be found remixing the likes of Roni Size, M-People, Orbital, Tiesto, Sasha, BT, UNKLE, James Holden and Fatboy Slim’s Freak Power alter ego; touring the world alongside dance titans Faithless and The Prodigy and collaborating with Trevor Horn, arguably one of Britain’s most successful and revered producers. How many can boast a CV like that?\nBut perhaps most remarkable of all is that, in this highly disposable world of dance, Way Out West continues to this day. Currently working on their fifth album, Jody explains the key to their longevity, “It’s because we don’t live in each others pockets and take long breaks between WOW projects. In other words, we keep it fresh. It’s a cycle of about 4 years focusing on solo stuff, followed by a year back together, which is great because we bring all our new experiences from this time apart time and feed it back into the band. It’s not something we planned, or rather, do plan, it’s a schedule and process that’s developed over time and works.”\nSo what of Jody’s solo endeavours? Well, if you think these are fallow periods living off the echo of past Way Out West achievements, you’d be very, very wrong indeed. Once again Jody’s incomparable ability to succeed with production and DJing has seen him climb to the highest heights of Beatport (and we’re talking THE overall, not genre chart here) and iTunes;\nremix Above & Beyond, Robert Babicz and more; tour the UK alongside 808 State legend Graham Massey; maintain a monthly show ‘Intensified ’ on Frisky radio, now in it’s eighth(!) year; take on an A&R development role for Anjunadeep signing acts such as Lane8 and Lancelot and, as if all of that weren’t enough, release his own solo album, ‘Trails We Blaze’. “It’s probably fitting to end this biog as I began,” concludes Jody, “I really am busier now than ever, which is a blessing. Whether I’m in the studio, playing to 5\nthousand alongside A&B at the Ally Pally or touring the world, I’m still as excited by what I do now as I was when I began. The music, style and opportunities may have evolved over the years, but my passion remains the same. No time for pipe and slippers yet!", "otherInfo": "Jody Wisternoff - Canceled w/ Luigi Sambuy"}, {"Address": "243 O’Farrel Street, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Broadway, Singer Songwriter, Cabaret, Cover Songs", "Time": "9:30 PM", "Venue": "Johnny Foley's Dueling Piano Show", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs.\n?\nHis theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City.\n?\nHe is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page.\n?", "otherInfo": "Dueling Piano Show (21+)"}, {"Address": "124 Ellis St, San Francisco, CA 94102", "Artist": "Industry ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408512, 37.785724], "Date": "Wed Apr 1 2020", "EventDate": "2020-04-01", "Genre": "Synth Pop, New Wave Alternative, Pop, Alternative", "Time": "10:00 PM", "Venue": "Infusion Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Industry Night at Infusion Lounge: A flashy new upscale lounge with multimillion-dollar Asian decor motifs, glowing glass columns, and even a hologram behind the bar. No, the hologram doesn't pour your drinks, silly."}, {"Address": "Oakville Cross Rd, Napa, CA 94558", "Artist": "Patrick Davis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9560412.jpeg", "Coordinates": [-122.3801442, 38.4492076], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Americana", "Time": "12:00 AM", "Venue": "Songwriters In Paradise Napa", "moreBioInfo": "Tennessee born South Carolina raised singer songwriter Patrick Davis has long been known for his abilities as an accomplished songwriter with over 70 of his songs recorded by artist ranging from Guy Clark & Robert Randolph to Jimmy Buffett & Imelda May, but it may very well be his latest creative endeavor that ends up being the music for which he is most fondly remembered. After a decade plus inside the too often homogenized Nashville Music Row Machine Patrick Davis & His Midnight Choir is Patrick’s rediscovering (and reaffirming) his faith in the sound, sincerity & soul of the timeless songs, artists & music that moved him to pick up the guitar (& pen) in the first place.\n\nBuilt on Davis’ love for classic sounds & songwriting Patrick Davis & His Midnight Choir, with it’s horns, backing vocalists and song structures, hark on the legendary recordings of Van Morrison, Joe Cocker, JJ Cale, Ray Charles & Bruce Springsteen while at the same time closely navigating the musical waters explored by today’s Tedeschi Trucks, Nathaniel Rateliff, Amos Lee, Jason Isbell & others. While Patrick’s songwriting, showmanship and band leading never change the members of PD’s Midnight Choir are an ever rotating line up of world class musicians and singers from PD’s extensive rolodex of musical friends & even family members.\n\nPatrick is spending most of 2019 writing and recording his very 1st “Patrick Davis & His Midnight Choir” album, but come early 2020 PD & His MC will be on the road and bringing his (& their) musical message to the masses.", "otherInfo": "2nd Annual Songwriters In Paradise Napa. For more information on tickets, hotel packages, etc. visit www.SongwritersInParadise.com"}, {"Address": "2160 Shattuck Ave, Berkeley, CA 94704", "Artist": "Broakley Boiz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9066291.jpeg", "Coordinates": [-122.268468, 37.869772], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, Hip Hop, Soul, Everything, Funk", "Time": "5:00 PM", "Venue": "Berkeley Live! On The Plaza", "moreBioInfo": "B.BOIZ/B.GRRLZ-MAKE ART\nWE’RE A FAMILY DJ CREW FROM OAKLAND CA. WE DJ, THROW PARTIES, MAKE PRINTS, SWAG AND MORE W/ INDY ARTISTS/MUSICIANS/WE/ARE/SCUMCON2019-AND BEYOND\nCURRENTLY HAVE A RESIDENCY AT THE NEWLY RENOVATED DOWNTOWN BERKELEY PLAZA - BROAKLEYBOIZ THURSDAY NITE ROLL-CALL IS EVERY 1ST & 3RD THURSDAY OF THE MONTH NO COVER ALL AGES SPONSORED BY THE SOURCE CHIROPRACTIC", "otherInfo": "BroakleyBoiz Thursday Roll-Call Live On the Plaza every 1st & 3rd Thursday of the month! DJ Miggy Biggz & DJ Shaky Paws with special guests & live bands performing in the newly renovated outdoor venue featuring a state of the art Meyer Sound System. No cover, all ages\nSponsored by The Source Chiropractic"}, {"Address": "1 Main St, St. Helena, CA 94574", "Artist": "Yesterday’s Wine ", "ArtistImage": "https://photos.bandsintown.com/thumb/8781031.jpeg", "Coordinates": [-122.45631, 38.49392], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Folk, Country", "Time": "5:00 PM", "Venue": "Harvest Inn", "moreBioInfo": "Wyatt Durrette and Levi Lowrey are acclaimed singer-songwriters in their own right, brought together by their craft and love for sharing music.\n\nYesterday’s Wine captivate and charm their audience in any venue. Music festivals and songwriter rounds across the country have been buzzing about the brilliant shows delivered by the duo. Wyatt Durrette and Levi Lowrey are acclaimed singer-songwriters in their own right, brought together by their craft and love for sharing music. Wyatt and Levi collaborated in the past, lending their talents in co-writing on the Zac Brown Band song “Colder Weather” which spent two weeks at #1. Levi and Wyatt also contributed in writing on the GRAMMY award winning ZBB song “The Wind”. Individually, Wyatt has 7 more GRAMMY Awards and Levi has performed extensively with acts including Mumford and Sons, Kid Rock and Alabama. Now performing together as Yesterday’s Wine, the pair epitomize the magic in story-telling through song.", "otherInfo": "No other event info available"}, {"Address": "55 Music Concourse Dr, San Francisco, CA 94188", "Artist": "Nightlife ", "ArtistImage": "https://photos.bandsintown.com/thumb/8598142.jpeg", "Coordinates": [-122.466863, 37.769883], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Dance", "Time": "6:00 PM", "Venue": "California Academy of Sciences", "moreBioInfo": "Nightlife is a professional tribute band that plays fresh new arrangements in the form of complete shows by different artists.", "otherInfo": "NightLife It doesn't get more sophisticated than a cocktail in one hand and no children in sight. Add some jellyfish, dim lights, and a second cocktail in the other hand and you've got NightLife at the Academy of Sciences held every Thursday night from 6-10 p.m. The evening caters specifically to the 21+ crowd and offers a new theme each week. The night is perfect for those in the mood to mingle and explore the wonders of our world. Don't forget your IDs!"}, {"Address": "5927 California St, San Francisco, CA 94121", "Artist": "Acoustic Open MIc ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.481196, 37.783825], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Bazaar Cafe", "moreBioInfo": "No artist bio available", "otherInfo": "Acoustic Open Mic at Bazaar Cafe: No cover, tasty food, a beer and wine bar, and a hearty appreciation for the arts make Bazaar a cafe for those with taste. On warm, sunny days, be sure to head out to the verdant back patio for a seat in their lovely garden."}, {"Address": "999 California St, San Francisco, CA 94108", "Artist": "Pure Ecstasy ", "ArtistImage": "https://photos.bandsintown.com/thumb/261171.jpeg", "Coordinates": [-122.410248, 37.791405], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "7:00 PM", "Venue": "Top of the Mark", "moreBioInfo": "No artist bio available", "otherInfo": "Pure Ecstasy at Top of the Mark: This famed martini bar offers high-class wallpaper music on the weekends, including lounge piano, easy listening, classical, and some jazz combos. The best stuff comes late on Friday and Saturday nights, when the drinks pour with a heavy hand and the jazz bands blow with a little more gusto."}, {"Address": "13160 CA-9, Boulder Creek, CA 95006", "Artist": "Garrett Pierce ", "ArtistImage": "https://photos.bandsintown.com/thumb/6788013.jpeg", "Coordinates": [-122.121327, 37.124938], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Music, Lyrics", "Time": "7:00 PM", "Venue": "lille æske", "moreBioInfo": "Garrett Pierce pens songs that are literary in style with well worked lyrics and a voice that soars over dark, ethereal melodies. Garrett released 'Dusk', his fourth record, on Crossbill Records in the Spring of 2017.\n\nThe artist’s ability to connect with his audience – to introduce us to feelings we didn’t know we could feel – is truly superb, an indicator of Garrett Pierce’s talent as a writer. – Atwood Magazine\n\nChampioning storytelling with a clean, methodical acoustic presentation, the intentionality in each inflection carries the weight of the sadness and reflection. 4/5. – Impose", "otherInfo": "No other event info available"}, {"Address": "1805 Geary Blvd, San Francisco, CA 94115", "Artist": "Ripe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8586978.jpeg", "Coordinates": [-122.43312, 37.783918], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Funk, Dance, Rock", "Time": "7:00 PM", "Venue": "The Fillmore", "moreBioInfo": "Ripe is seven musical soulmates who refuse to believe in a single definition of dance music. They are an unstoppable groove, an extended moment of ecstatic release, the catalyst for taking “just another night” and elevating it into something else entirely. They are the swagger of funk filtered through a rock anthem, a musical journey that somehow gets as stuck in your head as your favorite pop banger. They are the anchors of a rapidly growing community, a series of new friends becoming good friends becoming part of the extended family as their sound spreads and their world deepens. They are here to look at joy with the same depth as most people look at sadness, to find a happiness that is heavier and more meaningful than simply a distraction from the negative. Born all over, formed in Boston, Ripe is ready to bring the whole world to its feet.", "otherInfo": "No other event info available"}, {"Address": "201 Franklin St, San Francisco, CA 94102", "Artist": "Sullivan Fortner ", "ArtistImage": "https://photos.bandsintown.com/thumb/8343312.jpeg", "Coordinates": [-122.42155, 37.77637], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "SFJazz Center", "moreBioInfo": "Sullivan Joseph Fortner Jr. is a native New Orleanian who has already made a significant foray into the jazz world that belies his young age. While touring with Stefon Harris & Blackout, Christian Scott Quintet, and the Roy Hargrove Quintet, Sullivan completed his Master’s degree in Jazz Performance at Manhattan School of Music under the tutorage of Jason Moran, and Phil Markowitz. He holds a Bachelor’s degree in Jazz Performance from Oberlin Conservatory of Music. Sullivan began playing music by ear at the age of seven. Two years later, he was playing for church choirs throughout New Orleans. By the time he was 11 years old, Sullivan had won a Cox Cable “Amazing Kids Award”. At the age of 13, Sullivan furthered his formal education in piano by attending the New Orleans Center for Creative Arts (NOCCA) and earned scholarships to several prestigious summer jazz programs, including the Vail Jazz Institute and the Skidmore Jazz Studies Summer Program. A standout on the stage and in the classroom, Sullivan was Valedictorian of his high school class while simultaneously graduating from NOCCA. He has studied and performed with many great musicians, including The Marsalis Family, Donald Harrison, Nicholas Payton, Billy Hart, Gary Bartz, Marcus Belgrave, The Jordan Family, Irvin Mayfield, Peter Martin, Dave Liebman, and a host of others. Official Facebook Fan Page of Pianist and Composer, Sullivan Fortner www.sullivanfortnermusic.com", "otherInfo": "No other event info available"}, {"Address": "50 Oak St, San Francisco, CA 94102", "Artist": "Chad Lefkowitz-Brown ", "ArtistImage": "https://photos.bandsintown.com/thumb/8384191.jpeg", "Coordinates": [-122.420253, 37.775481], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Jazz", "Time": "7:00 PM", "Venue": "San Francisco Conservatory of Music", "moreBioInfo": "Chad Lefkowitz-Brown is an American saxophonist and international recording artist known for his work in jazz and popular music. He is currently a member of the multi Grammy award-winning Afro Latin Jazz Orchestra, and he has made internationally televised appearances with pop icons like Taylor Swift, Don Henley and Phillip Phillips. Chad has toured across the globe as a soloist and with many esteemed jazz artists, including Arturo O’Farrill and Clarence Penn.\n\nA native of Elmira, New York, Chad established himself as a jazz prodigy at age 11, performing throughout New York State under the mentorship of local jazz hero, George Reed, who was known for backing legends like Teddy Wilson, Buddy Tate, and Marian McPartland.\n\nChad went on to pursue a formal education in the arts at the Brubeck Institute, a prestigious fellowship program created by jazz legend Dave Brubeck. While studying at the institute, he performed regularly with Brubeck and was a member of the Brubeck Institute Jazz Quintet.\n\nChad received many accolades during his scholastic career, including 15 DownBeat Magazine Student Music Awards for categories such as \"Best Jazz Soloist\" and \"Best Original Song.\"\n\nSince graduating from the Brubeck Institute, Chad has performed throughout four continents, and has appeared at venues including Carnegie Hall, the Super Bowl, and Madison Square Garden. His debut album, Imagery Manifesto, was named “Debut Album of the Year” by jazz critic and author, Doug Ramsey, and his forthcoming album, “Onward,” features jazz legend, Randy Brecker.", "otherInfo": "No other event info available"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Not Ur Girlfrenz ", "ArtistImage": "https://photos.bandsintown.com/thumb/9380368.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Pop, Pop Punk, Pop Rock, Punk-pop, Rock", "Time": "7:30 PM", "Venue": "DNA Lounge", "moreBioInfo": "\"Everywhere I go the kids wanna rock\"\n\nA call to arms from rock legend Bryan Adams back in 1984 which high-energy, power pop trio, NOT UR GIRLFRENZ is making sure is still 100% true to this day! Barely in their teens, this all-girl, Texan rock outfit are here to prove they mean business - busting out show-stealing performances with their high-energy songs, which cleverly combine instant Pop Punk hooks with timeless old school songwriting.\n\nInheriting a love of classic rock bands (the likes of Joan Jett, U2 and Heart) from their parents and combining it with a love of current pop and rock, such as Paramore and Fall Out Boy, NOT UR GIRLFRENZ - Liv Haynes (14) Guitar & Vocals, Gigi Haynes (13) Bass, and Maren Alford (15) Drums - quickly forged their own distinct identity. This soon caught the attention of Grammy-Nominated Songwriter Jaret Reddick of Bowling For Soup, who saw an opportunity to work with a promising and exciting new band - something vocalist Liv describes as a \"pinch me moment\" working alongside one of her musical heroes.\n\nThe superstar collaboration opened up exciting new doors - a SOLD OUT Tour with Bowling For Soup, followed by a slot on the final Cross Country Vans Warped Tour which saw its founder Kevin Lyman declaring them 'The future of women in rock or just rock in general' and earned NOT UR GIRLFRENZ the title of ‘the Youngest Touring Band in Warped's 24 year history'! \"You look into the crowd before a show and see some of your biggest influences staring back at you!\" reveals Maren about the Warped experience. Effortlessly performing in front of such great, welcoming crowds has seen their fanbase rapidly grow. \"I learned that hard work pays off! We walked the line, handed out flyers and sold merch in the extreme heat and rain, and saw so many of the fans\" continues Gigi. The young band has an instant rapport with this fanbase, one which will serve them well as their exciting career progresses!\n\nThe band was featured in a recent 'Girl Power' advertising campaign for Reliant Energy (with fellow Texan and movie megastar, Matthew McConaughey) and received an amazing response to their re-workings and videos for classics such as U2's 'I Will Follow' and The Cure’s 'Friday (I’m in Love)'. NOT UR GIRLFRENZ effortlessly followed these with original slabs of pop punk ear candy. 'Never Stop' and new video 'Warped', filmed during their recent summer trek featuring appearances from their heroes and biggest bands on the tour, the likes of Mayday Parade, The Maine, Simple Plan and Reel Big Fish - prove that while these girls mean business, they're here to have a lot of FUN! That alone is infectious!\n\nRight now is an exciting time to jump on board and ride the wave alongside NOT UR GIRLFRENZ. Liv sums it up perfectly, \"I feel like EVERY DAY is a new adventure and we are literally living our dreams! I can write songs about how I feel and what’s going on in my life and see people relate to what I say! That’s the coolest thing ever!\" As they finish up work in the studio on their debut EP, NEW KIDS IN AMERICA, to be released early October the world sits at their feet. It's already been an exciting opening chapter... Get ready for the pop punk story of a lifetime!\n\n\"Kick down the barricades! Listen what the kids say!\"", "otherInfo": "Performing Live: THE DOLLYROTS ● NOT UR GIRLFRENZ ● YEAR OF THE FIST ● The Dollyrots are a powerful, female led punk band that took a chance nearly 20 years ago by moving across the country to kickstart their career in California. The Dollyrots have gone from young up-and-comers to basically the parents of the punk scene - literally, as lead singer/bassist Kelly and guitarist Luis have a duo of \"dollytots\" that happily tour with their punk rock parents. Many original fans have followed the same trajectory as the band (live, you'll see a refreshing mix of \"cool dads\" and young punks). Not a whole lot of good came out of the early 2000s, but the Dollyrots sprung forth as an in-your-face pop punk trio and haven't let the years soften their sound or force them into a more practical life of day jobs. Over the last two decades, The Dollyrots have perfected their craft: relatable lyrics, soaring guitars, tight songwriting that keeps songs punchy. Even with two kids, the band hits the road often and keeps the new tunes flowing. And their hard work has paid off: the band has played with Black Flag, put an album out on Joan Jett's Blackheart label as well as Little Steven Van Zandt's Wicked Cool label, and is besties with Bowling For Soup. Even though the band has finally returned to their home state of Florida, The Dollyrots are still the beloved flag bearers for the \"kiss or kill\" California sound of yore - and if their past touring schedule is a clue, they'll be visiting their adopted home pretty often. ● The kids truly are alright! Not Ur Girlfrenz are children, but that doesn't mean they don't know what they're doing. The Dallas trio consists of sisters Liv (guitar) and Gigi Haynes (bass) and drummer Maren Alford. As you may have guessed from the name, they're a female punk band. Their roots are classic rock, and their covers of songs from bands like the Cure and U2 bring ..."}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Sui Zhen ", "ArtistImage": "https://photos.bandsintown.com/thumb/9169348.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Bossa Nova, Improv, Punk, Esoteric, Ethereal, Dubby Pop, Electronic Pop, Lovers Rock, Electronic, Dance, Dance Pop", "Time": "7:30 PM", "Venue": "Cafe Du Nord", "moreBioInfo": "Throughout her discography and performances, experimental pop and performance artist Sui Zhen has zoomed in on the intersections between human life and technology — how to exist in the digital age, as well as the ways in which we risk losing true sight of ourselves in the process. Sui Zhen’s third album, Losing, Linda, pairs her signature inquisitiveness with a surreal electronic pop that possesses a dreamlike quality: vivid, uncanny, and upon close examination, revealing of deep emotional and personal truths. It’s an album that examines loss on multiple levels — from the death of our loved ones, to our widespread societal tendency to disappear within the ones and zeroes of modern life's tech-driven rush.\n\nLosing, Linda is the latest chapter in Melbourne artist Becky Sui Zhen's musical journey, which has, to date, included involvement in the Red Bull Music Academy, and spanned collaborations with dance and electronic artists like NO ZU, Retiree and Tornado Wallace (featuring on the producer’s standout “Today” from 2017’s Lonely Planet). She’s also been commissioned for scoring and composition work in the ambient sphere, such as creating a “spatially aware soundtrack” to an exhibition at the Art Gallery of NSW, and providing the live score for Chris Marker's 1983 documentary Sans Soleil. This year alone will include performances at Dark Mofo, Meredith Festival, and Inner Varnika, plus collaborations with Møzaika and a track on an upcoming compilation for Munich’s Public Possession label.\n\nSui Zhen released her debut album, Two Seas, in 2012. Beguiling and enchanting, the record proved to be an early indication of her fascinating melodic structures and compelling lyrical themes — but it was 2015's Secretly Susan that would be her breakthrough. Drawing on dub, lounge, and bossa nova influences, Secretly Susan presents as a synth-pop simulacrum, exploring digital life's myriad intersections with the real. “Brilliant and uncanny,” Pitchfork writes, the album “radiates humor and charm.”\n\nThe story of Sui Zhen’s latest album, Losing, Linda, began in August of 2016, when she took up an artistic residency in Sapporo, a Japanese city on the northern island of Hokkaido. Sui Zhen originally came to the residency equipped with demos conceived in the wake of Secretly Susan — but real-life tragedy intervened, as her mother was diagnosed with pancreatic cancer. Sui Zhen’s family insisted she continue with the residency as planned, but the experience proved indelible and she abandoned the demos to start anew.\n\nIn the process, a sense of overall mortality was unmistakably infused into the thematic structure of Losing, Linda. It’s apparent across the lyrical sentiments of the swingy, bossa nova-laden \"I Could Be There,” as Sui Zhen sings with straightforward zest, \"When you show me that you know all that's left to be/ That's the only way you knew to raise our family.\" It’s a powerful sentiment turned askew, delivered with lightness over pitter-patter drums and rubbery bass lines; a characteristic duality of Sui Zhen’s work. Elsewhere, “Mountain Song” describes a traumatic and potentially fatal hiking expedition on Mount Asahidake — a memento mori, subtly and stealthily rendered with a bossa nova lilt and soft orchestration.\n\nAfter the residency came to a close, Sui Zhen's band members — instrumentalists Ashley Bundang (Zone Out, Hot Palms, Ciggie Witch) and Alec Marshall (Hot Palms, Emma Russack) — joined her in the Tokyo-adjacent city of Matsudo to track full-band demos for the material she'd written back in Sapporo. The new locale also inspired the gentle oscillations of \"Matsudo City Life,\" a throbbing synth-pop slice of effervescence that practically sounds like steam rising off of a nocturnal city street.\n\nSui Zhen eventually returned to Australia to be with her family, with work on the album becoming more sporadic as her mother's health declined, leading up to her passing in February 2018. “Looking back it was pretty intense,” Sui Zhen says. “There’s moments that occurred that haunt me still. And some of those moments have been recreated in my video project – turned into art, memories of memories.”\n\nAfter some time away from the album, Losing, Linda was completed near the end of 2018. \"I finally felt ready to return to the album,\" Sui Zhen explains. The resulting record pushes the fascinating sounds and ideas of Secretly Susan further and deeper, drawing equally from the plush realms of Sade, Japanese city pop, the early electronic music of the 1980s, and the mournful swing of Tracey Thorn's early work. Sui Zhen cites a range of forward-thinking artists from past and present as inspiration, from Lizzy Mercier and Laurie Anderson to Holly Herndon and Suzanne Ciani. The lush body-moving pop of \"Being a Woman,\" for example, finds Sui Zhen's personal experience colliding with her own self-investigation, as she sings about her relationship and struggles with femininity: \"When I grew up/ I thought I had to be/ Somebody's mother/ Or somebody's daughter.\" It's a striking example of the personal, political, and societal themes at the center of Losing, Linda, packaged as an infinitely listenable pop song.\n\nMuch as Secretly Susan was constructed around a titular character, on Losing, Linda Sui Zhen takes the theoretical form of \"Linda,\" a digital doppelgänger and avatar invoking the e-learning channel Lynda and its founder Lynda Weinman, as well as the humanoid robot BINA48. The character of Linda is personified on the album's cover by choreographer and colleague Megan Payne, whose literal embodiment of Linda interrogates the disembodiment of online life, and calls into question the possibility of death in the digital age. \"It’s an album about missing people after they are gone and trying to pre-empt loss — not only loss of life, but memory and information,\" Sui Zhen explains. \"I see it mirrored in our increasing need for data storage. Why are we collecting and documenting so much, anyway?”\n\n“It’s also a simple ghost story about being haunted by our other versions and our past selves,” she continues. “Our mothers, fathers, ancestors — that possibility that another may exist, intangible in the physical realm, but ever present in memory, so long as memory functions.\"\n\nThe album will also be accompanied by a digital ecosystem, aiming to create an online world for listeners where they can interact in real time with Linda. “It’s somewhere between a ghost, a memory, and a digital assistant\" Sui Zhen explains. In other words, a perfect evocation of what Losing, Linda represents thematically and musically: a trip through the real and the uncanny. Losing, Linda is a lovingly personal and humanistic document of our ever-changing world, the things we lose along the way, and the insights we gain from loss itself.", "otherInfo": "Banoffee & Sui Zhen LIVE at Cafe Du Nord on Thursday, April 2nd, 2020!\nThis show is 18+ with a valid ID. All sales are final."}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Briana Marela ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.430418, 37.766622], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Indie, Alternative", "Time": "7:30 PM", "Venue": "Cafe Du Nord", "moreBioInfo": "No artist bio available", "otherInfo": "Banoffee & Sui Zhen LIVE at Cafe Du Nord on Thursday, April 2nd, 2020!\nThis show is 18+ with a valid ID. All sales are final."}, {"Address": "6008 Center Street, Clayton, CA 94517", "Artist": "John Bishop ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-121.93659, 37.940259], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "7:30 PM", "Venue": "Endeavor Hall", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Laurie Lewis And The Right Hands ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Eric ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Electronic", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Hasee Ciaccio ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Alice Gerrard ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Folk", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Rock ", "ArtistImage": "https://photos.bandsintown.com/thumb/6643774.jpeg", "Coordinates": [-122.416775, 37.739269], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Hip-hop, Rap, Hip Hop", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe", "moreBioInfo": "No artist bio available", "otherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Dave Nelson ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Peter Rowan ", "ArtistImage": "https://photos.bandsintown.com/thumb/7799426.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "SOLO:, Keith Little - banjo vocals, Peter Rowan - guitar vocals, PETER ROWAN & THE FREE MEXICAN AIRFORCE, * rotating lineup, PETER ROWAN BLUEGRASS BAND, --, Jody Stecher - mandolin vocals, David Phillips // Cindy Cashdollar* - pedal steel guitar, Patrick Corte // Larry Attamanuik* - drums, Chris Kee // Viktor Krauss* - bass, Paul Knight - bass vocals", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "Grammy-award winner and six-time Grammy nominee, Peter Rowan is a bluegrass singer-songwriter with a career spanning over five decades. From his early years playing under the tutelage of bluegrass patriarch Bill Monroe, and following his stint in Old & In the Way with Jerry Garcia and subsequent breakout as both a solo performer and bandleader, Rowan has built a devoted, international fan base through his continuous stream of original recordings, collaborative projects, and constant touring.\n\nBorn in Wayland, Massachusetts to a musical family, Rowan first learned to play guitar from his uncle. He spent his teenage years absorbing the sights and sounds of the Boston music scene, playing bluegrass at the Hillbilly Ranch and discovering folk and blues across the Charles River at the legendary Club 47 on Mt. Auburn Street in Cambridge. \"I could sit in with the Lilly Brothers at the Hillbilly Ranch and then catch the MTA and be in time for Joan Baez's last set at the Club 47. Bluegrass appealed to me. It was callin' me—the harmonies, that high and lonesome calling-sound. Don Stover had played banjo with Bill Monroe, fiddler Tex Logan too, before they joined the Lillys. Mandolinist Joe Val taught me all the Blue Sky Boys and the Louvin Brothers songs. I would play a \"sock-hop\" with my rockin' group, The Cupids, and then make a beeline for the clubs. Sonny Terry and Brownie Magee, Josh White, Muddy Waters- they all came to town! \"\n\nFollowing three years in college, Rowan left academia to pursue a life in music. Rowan began his professional career in 1964 as the lead singer and rhythm guitarist for Bill Monroe and The Bluegrass Boys, living in Nashville and playing with Monroe on the Grand Ol' Opry every week. \"One thing I liked about the Monroe style was that there was a lot more blues in it than other styles of bluegrass,\" reflects Rowan. \"It was darker. It had more of an edge to it. And yet it still had the ballad tradition in it, and I loved that.\" Rowan stayed with Monroe and his Bluegrass Boys, touring constantly both in the United States and in England, for two and a half years. \" We went from old-timey places way down south to the colleges up north, we played to all ages, long-time fans of Bluegrass and the college kids my own age.\"\n\nThe late '60s and early 70's saw Rowan collaborating with musical compatriots in a number of rock, folk and bluegrass combinations: Earth Opera with David Grisman, Sea Train with fiddler Richard Greene (himself a graduate of Monroe's band) Muleskinner with both Grisman and Greene, former Bluegrass Boy banjoist Bill Keith and the great Clarence White. From the ashes of Muleskinner, Rowan and Grisman went on to join Jerry Garcia, Vassar Clements, and John Kahn, forming the legendary bluegrass band Old & In the Way. It was during this time that Rowan penned the song \"Panama Red,\" a subsequent hit for the New Riders of the Purple Sage and a classic ever since. Other time-honored compositions by Rowan include \" Moonlight Midnight\", \" In The Land of the Navajo\" and \"Lonesome L.A. Cowboy”. Jerry Garcia himself recorded Rowan's \"Moonlight Midnight\" and the haunting \"Mississippi Moon\". The 1970’s also saw Peter Rowan playing and recording alongside brothers Chris and Lorin Rowan as the The Rowan Brothers. Their three albums for Elektra-Asylum featured original songs highlighted by the three siblings soaring harmonies.\n\nRowan subsequently embarked on a well-received solo career in 1978, releasing such critically acclaimed records as Dustbowl Children (a Woody Guthrie style song cycle about humanity's spirituality in relationship to the earth), Yonder (a record of old-time country songs and Rowan originals in collaboration with ace dobro player, Jerry Douglas) and two extraordinarily fine bluegrass albums, The First Whippoorwill and Bluegrass Boy, as well as High Lonesome Cowboy, a recording of traditional old-time cowboy songs with Don Edwards and guitarist Norman Blake. Rowan's recent releases- Reggaebilly, a wonderful blend of reggae and bluegrass and Quartet, a recording with the phenomenal Tony Rice, coupled with a relentless touring schedule have further endeared Peter Rowan to audiences around the world.\n\nOn the road, Rowan performs internationally as a solo singer-songwriter, while stateside he plays in three bands: the Peter Rowan Bluegrass Band, a quartet featuring Jody Stecher, Keith Little, and Paul Knight; The Peter Rowan & Tony Rice Quartet; and his rocking band, The Free Mexican Air Force.", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "1030 Main St, Napa, CA 94559", "Artist": "3 on a Match ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.285583, 38.29958], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Blue Note Napa", "moreBioInfo": "No artist bio available", "otherInfo": "Full Food and Bar Menu Available in all sections3 on a Match is an authentic Dylan-to-Delta blues and folk vintage American music group that debuted in the Wine Country in 2006. Originally with Singer and harmonica player Smokin Joe Herrschaft and guitar guru Paul Steelhead Christopulos on guitar, the group added local virtuoso, Isaac IsaacleCarter to the lineup when when Paul left in 2018.Often playing as a duo, the team has been known to beef up the roster by platooning the exceptional drumming talents of Mikey Loose Cannon or JB Duff. The evening of music evokes the lively tradition of juke joints and coffee houses. Expect tunes that will transport you from Mississippi to New York-VOTED BEST LOCAL BAND in Sonoma, California, by readers of the Sonoma Sun Newspaper, 2015Ages 8+BLUE NOTE NAPA is located on the 1st floor of the Historic Napa Valley Opera House at 1030 Main St. We are an intimate 144-seat Live Music club and Restaurant, where you can enjoy performances of world renowned and local Bay Area artists alike. We offer a full menu with an elegant wine and cocktail list. Enjoy fantastic main courses, sharing plates, and desserts while you take in a show.All ticket prices are per person.Dinner is served in all sections.Your ticket is also your dining reservation.Every Ticket does get a seat in area purchased.Our Seating Policy is First Come, First Seated in area purchased.We recommend arriving 30 min before door time to get best choice of seating. We do not have a standing room only sectionPairs are sat across from each other, not next to each other.No Refunds, Professional cameras or outside food and drink.Ear Plugs are available for free at the Box OfficeAny special needs or accommodation requests, please call our Box Office.A portion of all ticket fees goes to the historic preservation of the Napa Valley Opera House.Tickets are the same price whether purchased in person, over the phone or onlineSapphire Booth Seating: Booth seating for parties of 4, 5- 6 personsPremier level of seating! Sold only in units of 4 or 5/6, and are not available as singles or pairs. You will be seated when you arrive. (Dark Blue on map)Royal Blue Center Table Seating: Center table area in front of stage: Pairs are seated across from each other. (Light Blue on map)Standard Side Table Seating: Side table areas left and right of center section: Pairs are seated across from each other. (Yellow on map)Bar Area Seating (only 21+ may sit at bar): Great View! Bar Chairs are tall with backs and comfy padded seats. Purse hooks too. (Pink on map). 1030 Main Street, Napa CA 94559Box Office: 707.880.2300 (Wed - Sat, 2:30-9:00 pm, Sun, 1 hr. before doors & 30 min after show begins)"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Laurie Lewis ", "ArtistImage": "https://photos.bandsintown.com/thumb/9851700.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Bluegrass, Country", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "Legend is not always loud. Particularly in the beneath-the-radar substreams of American folk music and bluegrass, it is bestowed more by whispered word-of-mouth, over years and decades, than by the hurried hype and ballyhoo of the pop mainstream. You can't measure Laurie Lewis's 30-year career with the usual commercial yardsticks. She has won a Grammy (\"True Life Blues: The Songs of Bill Monroe,\" 1997), and twice been named Female Vocalist of the Year by the IBMA (International Bluegrass Music Association).\n\nIf you listen down the backroads of acoustic Americana, however, you'll soon realize this soft-spoken, sweet-singing California fiddler, singer and songwriter is something very special. \"Judging by the respect she has among fans and peers in the industry,\" says IBMA executive director Dan Hays, \"Laurie is one of the pre-eminent bluegrass and Americana artists of our time. She spreads her talent over several genres - bluegrass, folk, country - and with the recognition she has within all those fields, I would certainly say she's one of the top five female artists of the last 30 years. And she continues to make great music.\" This measure of respect is all the more remarkable given what a groundbreaking revolutionary Lewis has been, the first bona fide bluegrass star who was a woman born outside the music's native southland. It is hard to tell whether her being a woman or a Californian impacted the music more, but what is clear is that she is a pivotal figure in transforming the music from a regional genre into a truly international musical language. \"She's opened a lot of doors for our music,\" says Hays. \"There were certainly female artists in bluegrass before her, but to do what she's done with her own unique style, as opposed to mimicking her male counterparts, she's been a real pioneer in that regard. It goes beyond her just being a woman, though she's set a wonderful example for female artists. Her whole approach to music has had a positive influence throughout the country.\"\n\nSam Bush is such a pivotal figure in the modern bluegrass revival that the subgenre of progressive bluegrass was nicknamed after the band he founded in the 1970s, the Newgrass Revival. He warns against making too much fuss about Lewis being influential simply because of her gender or where she hails from. \"She is newgrass in the truest sense of the word, in that she uses bluegrass instruments to create new original music: it's music for now,\" he says. \"Laurie is very genderless to me. I know that's not the right way to put it, but I just think of her as an artist: a great singer, terrific fiddle player, fine songwriter, and one very good band leader. As a fiddler, she could be from the 1940s or from 2010; it's timeless,\" he says. \"As a singer, she knows the rules of bluegrass and how to sing in her own voice. She's probably one of the few female singers who really knows the nuances of the Ralph Stanley vocal style.\"\n\nThe Sacramento News called her \"as fine a singer as anyone on the acoustic music circuit, anywhere in the world.\" Billboard praised her ability to \"successfully walk the high wire above esoteric country, combining elements of bluegrass and pure country to form her own seamless mix.\" Or as American folk icon Utah Phillips put it, \"Whatever country music is supposed to be, she's at the center of it.\" Her songs have traveled as widely as she has, but it is revealing to see who has recorded them: Kathy Mattea, Patsy Montana, Jeannie Kendall, Prudence Johnson - all revered as supreme stylists and song-finders.\n\nLaurie fell in love with American folk music as a teenager, at the sunset of the '60s folk revival. It was the vastness, the realness, the melodicism, and welcoming accessibility that drew her. \"Oh, it was so exciting,\" she says of the Berkeley Folk Festivals where she first caught the folk bug. \"Every night there were concerts, and during the day you'd be in a eucalyptus grove listening to someone making music with nothing between you and them. Every day I'd hear something new, Doc Watson or the Greenbrier Boys. Something about it just invited me to start playing it.\" She began plunking out simple songs on the guitar, then the fiddle. After high school, she drifted away from the music, but always kept her fiddle under her bed, though she didn't know why. In her early 20s, she discovered the Bay Area bluegrass scene. To her, it was \"like opening that door all over again. Here were all these people making music together, and I could immediately see myself as part of it. It woke up all that excitement I felt as a teenager, and I knew this was what I wanted to do with my life.\"\n\nThe bluegrass scene of Northern California was a powerful mix of the region's historic progressivism and ardent devotion to musical tradition. Nobody minded that young Lewis was a woman, a non-southerner, or a novice. They did mind if she didn't want to learn, chapter and verse, the gospels of Bill Monroe and Ralph Stanley. It gave her a rock-ribbed foundation in the rudiments of American roots music. \"It really was a different deal coming to bluegrass in the San Francisco Bay area,\" she says. \"There weren't a lot of cutting contests; it was all about making music together, a focus on interdependency rather than individual prowess.\"\n\nLewis never intended to kick in any doors, but she detested anything that excluded anyone from the music she loved. In the mid-70s, she helped found the Good Ol' Persons, an all-female ensemble that was soon headlining major folk and bluegrass festivals around the country, cheerfully breaking gender barriers that had kept women serving primarily as vocalists in male-dominated bands. She began writing her own songs then, inspired by bandmate Kathy Kallick, with whom she has collaborated many times over the years. It was in Lewis's next band, Grant Street, which she fronted, that her writing came to the fore. Her songs reflect everything she loves about folk music. No matter how quick-tempo, they never seem crowded, either melodically or lyrically. She does not sing inscrutably about her own life, but looks outward from an intimate perspective, in ways that let us see our own lives reflected back at us.\n\nHer songs helped shape the template for the modern bluegrass-pop style. She loves to play off the rhythm, helping to free the genre from its barnburning tick-tock cadence, and giving her songs a sweet sense of space that makes them at once inventive and warmly familiar.\n\nLewis's performing companion is ace mandolinist-singer Tom Rozum. Their 1996 CD, \"The Oak and the Laurel,\" was nominated for a Grammy. \"I love to have a partner to sing with, crave it deep down inside,\" Lewis says. \"And Tom's the same way. He's a very conversational mandolin player, always responding to what's going on at the moment.\"\n\nLewis's stage shows are renowned for their musical virtuosity and front-porch friendliness. Coming of age in such a convivial music scene, she has a keen gift for inviting audiences into her music. As with everything she plays, the point is sharing, not strutting.\n\nThat may not be the recipe for big-time stardom in this myopic, hype-happy age, but it remains the recipe for timeless music, and for careers like hers that are built not to dazzle but to last. And it remains the real stuff of legend, at least in the quiet corners of our culture where American roots music still thrives.", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "1799 Mission St, San Francisco, CA 94103", "Artist": "Joey Avery ", "ArtistImage": "https://photos.bandsintown.com/thumb/9508261.jpeg", "Coordinates": [-122.419723, 37.768401], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "San Francisco, California", "Time": "8:00 PM", "Venue": "SUBMISSION: Cocktails & Comedy", "moreBioInfo": "After starting his career in Cape Town, South Africa Joey Avery brought his positive and energetic brand of comedy to San Francisco and received the Jimmy Gunn award for Best Newcomer to the Bay Area comedy scene. He was recently honored by the SF Chronicle as one of the Bay Area's Comics to catch and his 2019 album, Pier 69: Junior Varsity debuted at #1 on iTunes and was featured on the Late Late show with James Corden. Joey has appeared on Fox and AJ+ as well as comedy festivals across the country. He hosts the Chubbies Podcast, is a regular on Uproxx's Filmdrunk podcast, and creates content for Chubbies Entertainment.", "otherInfo": "No other event info available"}, {"Address": "453 Cortland ave, San Francisco, CA 94110", "Artist": "Blues Jam ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.416775, 37.739269], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "The Lucky Horseshoe", "moreBioInfo": "No artist bio available", "otherInfo": "Rock and Blues Jam with Ed Ivey This classic blues & funk jam session is a popular mid-week event featuring great local blues players. No cover ever!"}, {"Address": "510 Embarcadero W, Oakland, CA 94607", "Artist": "Juan Escovedo ", "ArtistImage": "https://photos.bandsintown.com/thumb/10201935.jpeg", "Coordinates": [-122.279289, 37.796471], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Yoshi's Oakland", "moreBioInfo": "No artist bio available", "otherInfo": "Yoshi's Oakland Presents Juan Escovedo All Stars"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Suzy Thompson ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "8240 Old Redwood Hwy, Cotati, CA 94931", "Artist": "FeatPrints - a tribute to Little Feat ", "ArtistImage": "https://photos.bandsintown.com/thumb/9260739.jpeg", "Coordinates": [-122.705214, 38.325608], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, R&b, Cajun, Classic Rock, Jazz Fusion, American Rock, Funk, Jam Bands", "Time": "8:00 PM", "Venue": "Redwood Cafe", "moreBioInfo": "\"The nation’s most recognized all-star collaboration celebrating 50 years of Little Feat music\"\n\nCome join FeatPrints as we pay tribute to 50 years of American music history with the music of Little Feat.\n\nThroughout the 70’s and into the 80’s, 90’s and into the new millennium, Little Feat pushed the envelope of accepted styles blending rocks, blues, cajun, country and fusion into a tasty gumbo. Their hits like “Dixie Chicken”, “Willin”, “Oh Atlanta” and “Let It Roll” just begin to scratch the surface on what they could do live. The legions of grassroots loyal fans that still follow them to this day are a testimony to their legacy.\n\nFeatPrints take on the prodigious task of playing the songlist of this iconic band with seven of the Bay Area's most in-demand talents whose credits include work with Mazzy Star, Little Richard, Elvin Bishop, Zigaboo Modeliste, Ivan Neville, Tommy Castro, Percy Sledge, the Drifters, Maria Muldaur, Bob Weir, Henry Kaiser, Jules Broussard, Huey Lewis, Shanna Morrison, Betty Lavette, Clarence Clemons, Mickey Thomas, Chris Cain, and Gregg Allman.\n\nSo for covers that pay homage to the bands original work, mixed with jams sizzling with inspired improvisation, grab your sailin' shoes and catch FeatPrints live!", "otherInfo": "What's better than an evening of Little Feat? An evening of Little Feat with amazing food, drinks and desserts at the Redwood Cafe. Big old dance floor too so your feats won't fail 'ya here. Try the Tripe Face Boogie!"}, {"Address": "860 San Pablo Ave, Albany, CA 94706", "Artist": "Matt Jaffe ", "ArtistImage": "https://photos.bandsintown.com/thumb/8945081.jpeg", "Coordinates": [-122.299266, 37.890398], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, Indie Rock", "Time": "8:00 PM", "Venue": "Ivy Room", "moreBioInfo": "Matt Jaffe is a 24 year old rock & roll singer/songwriter from San Francisco. Cutting his teeth on countless open mics around the Bay Area, Matt started taking music (a little bit) more seriously when Jerry Harrison of Talking Heads offered to produce his first record. Since then, Matt has continued to churn out more songs than he can remember the words to, oversaturate the market with gigs (opening and/or touring with the likes of Mavis Staples, Wilco, Jackie Greene, Melissa Etheridge, and Blues Traveler), and collaborate with Chuck Prophet and Tom Higgenson of the Plain White T's. Fresh off the release of his third LP, The Spirit Catches You, Matt Jaffe & Band are street-teaming with the best of them to bring rock & roll back to the masses.", "otherInfo": "No other event info available"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Mission Blue ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival Kickoff Party with The Town Howlers, Mission Blue, and Anna Daisy"}, {"Address": "1743 San Pablo Ave, Oakland, CA 94612", "Artist": "The Warning ", "ArtistImage": "https://photos.bandsintown.com/thumb/8812909.jpeg", "Coordinates": [-122.272365, 37.807482], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock", "Time": "8:00 PM", "Venue": "The New Parish", "moreBioInfo": "“We’re three sisters from Monterrey, México. We love music.”\n\nIt all started back in 2005 when Daniela was five and Paulina was three years old and had their first experience with music when attending a summer camp with music and theatre activities. They liked it very much and started attending regularly to music and drama classes and about a year later they both enrolled in piano lessons. They listened from children’s songs and lullabies to straight up rock and roll AC/DC and new stuff like Muse.\n\nFast forward a couple years later in 2007 when Daniela turned 8 and Paulina 6 and the most popular video game in the world was ROCK BAND. This was a huge influence on which instruments the girls would start playing next. Daniela, since she always grabbed the toy guitar used on the video game, thought it would be a great idea to take on the strings without quitting her piano lessons. Paulina felt it was a total injustice that her older sister could start playing another instrument and she wasn’t. Again, thanks to ROCK BAND, her parents noticed she had a great sense of rhythm and coordination, so they enrolled her in drum lessons where she could play on a real drum set.\n\nAlejandra, being the youngest, had a whole different approach to music. She had to wait until she was five years old to enroll in piano and music lessons. Being raised in a house full of music and the role models that her older sisters came to be for her always kept her motivated to take a leap into music properly. It took her a lot of music-video-binging for her to realize she wanted to try out bass guitar, because she really loved the sound it made.\n\n“Many people assume our parents are musicians, but they are not. They just share with us our love and passion for music.”\n\nThe girls never planned to form a band, especially since Alejandra was really small (in age and size, still plays a smaller scale bass). The girls just liked playing music. It was a Christmas Holiday’s school festival where Daniela and Paulina decided to play together a song that they had been working on separately. Of course, they needed a bass guitar to complete the power trio and thought it would be a great idea to have Alejandra play with them regardless of her being smaller. The girls played even better than they expected and Alejandra could handle the bass lines as if she had been playing for years.\n\nThey satisfaction and enjoyment of that first musical experience on stage was so big that they started practicing more songs together, setting higher goals for each on their instrument, goals that they saw and heard in music from the rock and roll bands they loved listening to.\n\nThey started videotaping those rehearsals and uploading them to their YouTube channel, where they had a few followers and with time started gaining more. But it wasn’t until they uploaded a cover for the song “Enter Sandman” by the band Metallica. This one broke the internet.\n\nIn just a few days it went viral and millions of people from all around the world became hardcore fans of THE WARNING, setting of a series of events that would kick the girls into the musical scene in a way nobody expected.\n\nIn January 2015 they recorded their first EP with songs written and performed by them. Playing and experimenting through different styles and genres they found that hard rock and metal was the kind of music they loved playing.\n\nBy this time, the sisters had a dream: attending a five-week summer course at Berklee College of Music. They created a GoFundMe campaign to raise the money they needed to go attend the summer course. The Ellen DeGeneres Show found the girl’s viral video online and invited them to appear in the show for an interview and performance. Thanks to the huge support that Ellen showed to the girls and the significant fan base they had gained in their social media, they raised the money to attend to Berklee, where the talk show also followed and documented the girl’s experience during their summer course for EllenTube.\n\nInspired by THE WARNING’s achievements by this time, the American video game developers Harmonix Music Systems were aware that their Rock Band video game had been the catalyst for this online phenomena, so they reached out to the girls, invited them to visit their facilities and included their single Free Falling in the latest version of the game, Rock Band 4.\n\nFUN FACT: During their visit at Harmonix they were asked by the developers to play their own song on the new Rock Band 4 console.\n\nBy this time they started receiving offers to play in different venues around the U.S.A. and México. These are a few of their shows up to 2017:\n\n• Musak Festival (California, USA)\n• Pal Norte Festival (Monterrey, MX)\n• Gibson Guitars Showcase (Beverly Hills, USA)\n• House Of Blues (Anaheim, USA)\n• SXSW Music Fest 2015 (Austin, USA)\n• TEDx Talks 2016 (Reno, USA)\n• Hard Rock Café (Boston, USA)\n• Sunshine Festival (Texas, USA)\n• SXSW Music Fest 2016 (Austin, USA)\n• Café Iguana (Monterrey, MX)\n• Nirvana Rock Joint (Monterrey, MX)\n• TEDx Talks 2017 (Reno, USA)\n\nDuring the time of these shows and different stages they started the songwriting process for their first LP. During 2016 they worked in the recordings, editing and mixing of 13 songs written by them and included in their first studio LP: XXI CENTURY BLOOD.\n\nXXI CENTURY BLOOD is to be released on March 27th, 2017 along with a music video for their first single also titled “XXI Century Blood”. The band will be rehearsing and working on a series of concerts soon to be announced around the U.S.A. and México.\n\n\nYOU’VE BEEN WARNED.", "otherInfo": "Doors 7:30 // Show 8 // ALL SALES ARE FINAL"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Tony Trischka ", "ArtistImage": "https://photos.bandsintown.com/thumb/7054778.jpeg", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Country, Bluegrass", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "The avant-garde banjo sylings of Tony Trischka inspired a whole generation of progressive bluegrass musicians; he was not only considered among the very best pickers, he was also one of the instrument's top teachers, and created numerous instructional books, teaching video tapes and cassettes.\n\nA native of Syracuse, New York, Trischka's interest in banjo was sparked by the Kingston Trio's \"Charlie and the MTA\" in 1963. Two years later, he joined the Down City Ramblers, where he remained through 1971. That year, Trischka made his recording debut on 15 Bluegrass Instrumentals with the band Country Cooking; at the same time, he was also a member of Country Granola. In 1973, he began a two-year stint with Breakfast Special. Between 1974 and 1975, he recorded two solo albums, Bluegrass Light and Heartlands. After one more solo album in 1976, Banjoland, he went on to become musical leader for the Broadway show The Robber Bridegroom. Trischka toured with the show in 1978, the year he also played with the Monroe Doctrine.\n\nBeginning in 1978, he also played with artists such as Peter Rowan, Richard Greene, and Stacy Phillips. In the early 1980s, he began recording with his new group Skyline, which recorded its first album in 1983. Subsequent albums included Robot Plane Flies over Arkansas (solo, 1983), Stranded in the Moonlight (with Skyline, 1984) and Hill Country (solo, 1985). In 1984, he performed in his first feature film, Foxfire. Three years later, he worked on the soundtrack for Driving Miss Daisy. Trischka produced the Belgian group Gold Rush's No More Angels in 1988. The following year, Skyline recorded its final album, Fire of Grace. He also recorded the theme song for Books on the Air, a popular National Public Radio Show, and continued his affiliation with the network by appearing on Garrison Keillor's Prairie Home Companion, Mountain Stage, From Our Front Porch, and other radio shows. Trischka's solo recordings include 1993's World Turning, 1995's Glory Shone Around: A Christmas Collection and 1999's Bend. New Deal followed in 2003. The new studio album was a bluesy adaptation of bluegrass standards that featured, among other things, a vocal cameo by Loudon Wainwright. Double Banjo Bluegrass Spectacular, featuring an appearance by comedian Steve Martin, came out four years later.\n\nBiography by: by Sandra Brennan\n\nTONY TRISCHKA HAS PLAYED WITH:\n\nThe Boston Pops Orchestra\nBarry Bostwick*\nSam Bush*\nDavid Bromberg\nWilliam S. Burroughs*\nBuddy Cage*\nLarry Campbell*\nKeith Carradine\nVassar Clements*\nOrnette Coleman\nJohn Denver*\nHazel Dickens*\nJerry Douglas*\nBill Evans (saxophonist with Miles Davis)*\nBela Fleck*\nThe Flecktones\nJohn Goodman\nRichard Greene*\nMerv Griffin Orchestra\nNancy Griffith\nDavid Grisman*\nThomas Hampson*\nJohn Hartford\nLevon Helm\nChris Hillman\nGarth Hudson\nFerlin Huskey\nDavid Johansen (aka Buster Poindexter)*\nJorma Kaukonen\nJeannie Kendall\nAlison Krauss*\nMalachy McCourt\nRoger McGuinn\nSteve Martin*\nJohn Medeski\nNatalie Merchant*\nEdgar Meyer\nJane Monheit\nBill Monroe\nNational Radio Orchestra of Korea\nMark O’Connor*\nOdetta\nCharles Osgood*\nVan Dyke Parks*\nTom Paxton\nRobert Randolph\nThe Roche Sisters*\nPeter Rowan*\nEarl Scruggs*\nMike Seeger*\nPete Seeger*\nRicky Skaggs\nPhoebe Snow\nBruce Springsteen\nRalph Stanley*\nTanya Tucker\nJay Ungar and Molly Mason*\nViolent Femmes*\nLoudon Wainwright*\nDoc Watson\nWaverly Consort*\nThe Whites*\nWichita Percussion Ensemble\nTom Wopat\n*denotes recordings\n\nTelevision Appearances\n• Live at the Quick, with Bela Fleck, 2004-2006\n• ABC “Views”, with Bela Fleck - Summer 1997\n• “ABC World News Tonight” with Peter Jennings - Summer1996\n• “CBS Sunday Morning” with Charles Osgood - feature story (including Bela Fleck), 1995\n• “Where in the World is Carmen Sandiego?” (PBS), 1992\n• British Television Production of “Voice of America: History of the Banjo” , 1989\n• CBS “Hallmark Hall of Fame” production of “Foxfire” with Jessica Tandy, Hume Cronyn and John Denver, 1987\n• Ralph Emory’s “Frets” Awards Show, The Nashville Network, 1987\n• Nashville Network’s “Fire on the Mountain,” 1986, 1984\n• Merv Griffin Show, 1976\n\nPerformances\n• Double Banjo Bluegrass Spectacular Tour - Currently touring with guitarist/vocalist michael daves, fiddler brittany haas, bassist skip ward & double banjo seat filled by noam pikelny, gordon stone, and others.\n• Tony Trischka Band – Kennedy Center (2000), Seaside Jazz Festival (2002), plus tours throughout the United States, Canada, and Germany, 1997-present\n• Solo tours throughout the United States and Korea, Japan, Finland, Germany, Czechoslovakia, Italy, Croatia, 1986-present\n• World Turning - Metropolitan Museum of Art (NYC) 1997, Telluride Bluegrass Festival, Winterhawk Bluegrass Festival, Black Mountain Folk Festival, and countless concerts and club dates, 1993-2002\n• National Public Radio – “Next Big Thing”, 2005, “World Café”, 2004, 2001, “Morning Edition”, “Fresh Air”, Mountain Stage”, 2001, 1995 and 1994; The Connection (2001), “Prairie Home Companion”, 1996, 1982\n• With Skyline - appearances in 40 states, five tours throughout Europe; two tours of Japan, 1981-Present\n\nPerformances With Others\n• Duo performances with Bela Fleck - tours of U.S., and New Zealand, 1992-2006\n• With John Modeskey and Robert Randolph, 2001\n• Leftover Salmon, Flecktones, Vassar Clements, and Violent Femmes, 1999-2001\n• Old and in the Way reunion at Rocky Grass Festival (CO), 1997\n• Waverly Consort - 1998 Spring tour, NPR’s Performance Today, Summer 1996; Metropolitan Museum of Art (NYC), 1995.\n• With Peter Rowan and Richard Greene - Telluride,CO, 1996, Japan and Hawaii, 1978\n• Guest soloist with National Radio Orchestra of Korea, in Seoul: “The Slavery Documents”, 1991\n• Guest soloist with Wichita Percussion Ensemble: “The Void Beneath the Coffee Table” a three movement banjo concerto composed by Paul Elwood for Tony Trischka, 1986\n• “Foxfire” with Jessica Tandy, Hume Cronyn, and Keith Carradine, Los Angeles and Denver, 1985-1986\n• “The Robber Bridegroom” - Ford’s Theater, Washington, D.C., 1978; bus and truck tour, 1978; musical leader of Broadway production, 1976-1977\n• With David Bromberg and Ferlin Husky - Avery Fisher Hall, NYC, 1973", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "19 Corte Madera Ave, Mill Valley, CA 94941", "Artist": "Spafford ", "ArtistImage": "https://photos.bandsintown.com/thumb/8432574.jpeg", "Coordinates": [-122.54802, 37.906982], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Electro Funk Therapy, Rock, Psychedelic Rock", "Time": "8:00 PM", "Venue": "Sweetwater Music Hall", "moreBioInfo": "Composed of Brian Moss (guitar), Jordan Fairless (bass), Andrew “Red” Johnson (keys), and Cameron Laforest (drums), Spafford’s patented “electrofunk therapy” has a little bit of something for everyone, offering tastes of rock, funk, electronic, bluegrass, gospel, and more. The Arizona-based four-piece is characterized by strong vocals, tight harmonies, catchy tunes, and captivating live shows. However, the group is best known for their immense improvisational abilities, which see the band regularly embark on spontaneous and unrehearsed hour-long musical odysseys featuring jams that are patient, meticulous, and sonically rich. In recent years, Spafford has witnessed a truly meteoric rise in the jam scene. Coming together serendipitously in 2009, the band gained a dedicated fan base in their home state of Arizona and quickly earned a reputation as the Southwest’s go-to jam act. Through word of mouth, buzz about the group spread, and due to unprecedented demand, their headlining tours consistently sold out venues across the country. Most recently, Spafford has been selected to play high-profile events like Bonnaroo, The Peach Music Festival, Summer Camp, Firefly Music Festival, and Suwanee Hulaween. \"We Jam\" instagram.com/spaffordmusic https://twitter.com/spaffordmusic", "otherInfo": "General Admission."}, {"Address": "1 Hacker Way, Menlo Park, CA 94025", "Artist": "Mike Block ", "ArtistImage": "https://photos.bandsintown.com/thumb/8440485.jpeg", "Coordinates": [-122.14462, 37.4762], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Facebook", "moreBioInfo": "MIKE BLOCK is a pioneering multi-style cellist, singer, composer, and educator, hailed by Yo-Yo Ma as the \"ideal musician of the 21st-Century\", and acclaimed by the NY Times for his \"vital rich-hued solo playing\". While still studying at the Juilliard School, Mike joined Yo-Yo Ma’s Silk Road Ensemble, with which he has toured extensively throughout the world, and won a 2017 Grammy Award for Best World Music Album. Mike is also an active recording artist of original material, folk music, cross-cultural collaborations, and he has an ongoing project to record all of the Bach cello suites in acoustically glorious bathrooms of famous concert halls, via BachInTheBathroom.com. As one of the first wave of cellists to adopt a strap in order to stand and move while playing, Mike was the first standing cellist to perform at Carnegie Hall, using a cello strap of his own design, called the Block Strap, a performance which the NY Times called \"Breathless ... Half dance, half dare.\"\n\nAs a music educator, Mike is passionate about emphasizing creativity and collaboration, leading to the founding of the Mike Block String Camp in 2010. MBSC provides players of all backgrounds the opportunity to learn from a world-class faculty in a variety of styles, and supports the exploration and development of the artistic voice of each student. Mike is also the founding Director of the Silkroad Global Musician Workshop, bringing together musicians from around the globe, and he created the online Multi-Style Cello School at ArtistWorks.com, with an extensive library of instructional videos. In 2012, Mike was appointed Associate Professor at the Berklee College of Music. Mike lives in Boston with his wife, fiddler Hanneke Cassel.\n\nMike has collaborated with a variety of diverse musicians and groups, such as Mark OConnor, Bobby McFerrin, The New York Philharmonic, Will.i.am, Edgar Meyer, Stevie Wonder, Darol Anger, Allison Krauss, Mike Marshall, Zakir Hussain, The National, Bon Iver, My Brightest Diamond, The Illinois Symphony, Rachel Barton Pine, Marcel Khaliffe, Goran Bregovic, Simone Dinnerstein, Dawn Upshaw, Anthony McGill, Tony Trishcka, Lenny Kravitz, Shakira, Joe Zawinul, Alasdair Fraser, Shujaat Khan, and many others.\n\nMike’s television and radio credits include \"Late Night with Conan O’Brian\", \"Regis and Kelly\", NBC’s 30 Rock, NPR’s \"St. Paul Sunday Morning\", WNYC’s \"Soundcheck\", APM’s \"Performance Today\", WNBC 4’s Chuck Scarborough Show, VH1, The Disney Channel, and the CBS \"Early Show\". When still living in New York City, Mike regularly subbed on Broadway as on-stage cellist for the Pulitzer Prize winning musical, \"Next to Normal\", and he also worked as Music Consultant on the 2012 film, \"A Late Quartet\". Mike was the subject of a 2011 feature article in the Wall Street Journal for his Artistic Directorship of the GALA BROOKLYN Music Festival, featuring cross-cultural collaborations among locally-based musicians.\n\nMike attended college at the Cleveland Institute of Music, where he studied cello with Richard Aaron, and received the Jim Hall Prize for Undergraduate Achievement. Mike also earned a Master’s Degree from the Juilliard School, where he studied with Darrett Adkins and Joel Krosnick. These days, Mike plays on a modern cello made in 2014 by Fabienne Gauchet, D’Addario strings, a David Gage Realist pickup, and the patented cello strap of his own design, The Block Strap.\nwww.MikeBlockMusic.com\nwww.GlobalMusicianWorkshop.com\nwww.MikeBlockStringCamp.com\nwww.CelloStrap.com\nwww.BachInTheBathroom.com\nwww.ArtistWorks.com/Cello", "otherInfo": "Live Stream: https://www.facebook.com/celebrityseries"}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Overcoats ", "ArtistImage": "https://photos.bandsintown.com/thumb/9461765.jpeg", "Coordinates": [-122.43751, 37.775533], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Indie Rock, Indie Electronic, Pop, Indie Pop, Indie", "Time": "8:00 PM", "Venue": "The Independent", "moreBioInfo": "Overcoats fight by bucking trends, overturning expectations, and cranking out sticky sweet pop subversion tightened up to Swedish standards under a Seattle grunge haze—all born out of a D.I.Y. Brooklyn “laboratory.” Since forming in a Wesleyan dorm room during 2015, Hana Elion and JJ Mitchell quietly molded provocative pop into power. Their full-length debut Young stood out as “one of the Top 5 bestselling albums from a debut artist on an independent label in 2017,” bowed at #4 on the Alternative New Albums Chart, and landed at #12 on the Heatseekers Chart. Not to mention, they generated 50 million-plus streams, sold 30K albums, and regularly averaged 1 million-plus listeners on Spotify. Billboard touted Young among “The Best Albums of 2017 – Critics Pick,” and NPR Music named it the “#4 Album of 2017” in addition to praise from New York Times, NPR, Entertainment Weekly, and more. Additionally, they toured alongside Mitski, Tennis, Rhye, Matt Corby, and Joseph.", "otherInfo": "In response to the recent recommendations of local, state and global health authorities and mandates by city and state government, Overcoats at The Independent originally scheduled for April 2 is postponed. Please hold on to your tickets as all tickets will be honored at the rescheduled date. Please check our website, theindependentsf.com, for the most recent updates on the status of this concert. Stay healthy and we look forward to bringing back the music soon."}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "The Town Howlers ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival Kickoff Party with The Town Howlers, Mission Blue, and Anna Daisy"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Tatiana Hargreaves ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Peter Rowan Bluegrass Band ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2020 Addison St, Berkeley, CA 94704", "Artist": "Blue Summit ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.26958, 37.870738], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:00 PM", "Venue": "Freight & Salvage Coffeehouse", "moreBioInfo": "No artist bio available", "otherInfo": "Berkeley Bluegrass Festival - 4-Day Pass"}, {"Address": "2174 Market St, San Francisco, CA 94114", "Artist": "Banoffee ", "ArtistImage": "https://photos.bandsintown.com/thumb/7929186.jpeg", "Coordinates": [-122.430418, 37.766622], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "International, Indie, Alternative, Australian", "Time": "8:00 PM", "Venue": "Cafe Du Nord", "moreBioInfo": "Banoffee's 'Do I Make You Nervous?' EP - Out Now via Remote Control Records/Dot Dash Spotify: http://spoti.fi/Banoffee Apple: http://apple.co/25CQUKn Soundcloud: http://bit.ly/2mPRtU5", "otherInfo": "No other event info available"}, {"Address": "2665 Mission St, San Francisco, CA 94110", "Artist": "Holly Herndon ", "ArtistImage": "https://photos.bandsintown.com/thumb/8938817.jpeg", "Coordinates": [-122.418292, 37.754404], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Electronic", "Time": "8:00 PM", "Venue": "Gray Area / Grand Theater", "moreBioInfo": "Holly Herndon is an artist currently based in San Francisco.\n\nShe was recently announced a candidate for doctoral study in Electronic Music at Stanford University, and received her MFA in Electronic Music and Recording Media at Mills College under the guidance of John Bischoff, James Fei, Maggi Payne, and Fred Frith. While at Mills she won the Elizabeth Mills Crothers award for Best Composer in 2010 for her vocal generated piece ’195′.\n\nHer musical work explores embodied experience in electronic media through experiments with the electronically processed voice, using extended vocal techniques, vocal processing and FM synthesis.", "otherInfo": "Holly Herndon Electronic musician Holly Herndon and her live ensemble presage a sonic future that connects human and machine to realize new definitions of beauty. Her dance-inflected experimental music investigates the nature of humanity in the digital age—including her 2019 album PROTO, made in part with artificial intelligence. Drawing from folk traditions of East Tennessee, Berlin’s radical club culture, and her Stanford graduate studies on machine learning and music, Herndon’s complex and riveting music promises a unique live performance."}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Sour Widows ", "ArtistImage": "https://photos.bandsintown.com/thumb/9936854.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Rock, Indie, Bedroom Rock, Alternative", "Time": "8:30 PM", "Venue": "Bottom Of the Hill", "moreBioInfo": "Sour Widows are a bedroom rock group from the Bay Area, formed in 2018 by longtime friends Maia Sinaiko, Susanna Thomson and Max Edelman. Songs marked by driving harmonies address themes of relationship and reflection; layers of warmth, grit, and depth surface and fade in their two guitar dynamic. The term ‘bedroom rock’ is a nod to this intimacy - it could mean sleepy, dreamy, or weepy - as it captures the emotion behind the music.\n\nCarried by Edelman’s inimitable drumming, the four draw from influences including Big Thief, Duster, Pile and Forth Wanderers to create heavy harmonic alternative rock. Post-Trash calls their debut single ‘Tommy’ “a perfect synthesis of slacker pop and punk’s tamer edges,” and asserts the band “is slated to blow up the indie scene.”\n\nThrough progressions that shift from subtle to biting, Sour Widows expose tender moments with an edge.", "otherInfo": "No other event info available"}, {"Address": "1233 17th St, San Francisco, CA 94107", "Artist": "Ratboys ", "ArtistImage": "https://photos.bandsintown.com/thumb/8478915.jpeg", "Coordinates": [-122.396415, 37.764922], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Indie Pop, Alternative, Indie, Rock", "Time": "8:30 PM", "Venue": "Bottom Of the Hill", "moreBioInfo": "julia sings and plays guitar dave does everything else kentucky sucks no it doesn't", "otherInfo": "No other event info available"}, {"Address": "1419 Fillmore St, San Francisco, CA 94115", "Artist": "Latin Breeze ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433317, 37.782618], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "Sheba Piano Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Latin Breeze at Sheba Piano Lounge: Don't let the hokey exterior fool you, this place offers a comfortable, even classy setting in the heart of the Fillmore. Perhaps Meatless Mondays will draw you in, as all Ethiopian restaurants seem to have great vegetarian menus. This one costs more, but delivers the goods (they've even made the injera upscale), as does the cocktail list. Half the house cocktails are made with Ethiopian spiced bitters - and even the others are suitably named, such as the Abyssinian Storm (which is essentially a Dark and Stormy, but a really good one) - or you can order Tej, traditional honey wine. Note: This is not for the budget drinker. As for the piano lounge, expect a soloist early in the week, but midweek to weekend nights is when a trio completes the ambiance."}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "The Grease Traps ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.267163, 37.866351], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "No artist bio available", "otherInfo": "Doors 7:30pm // Show 8:30pm // All Ages // $20 Adv & $24 Day of Show"}, {"Address": "998 Valencia St, San Francisco, CA 94110", "Artist": "The Grant Farm ", "ArtistImage": "https://photos.bandsintown.com/thumb/6159898.jpeg", "Coordinates": [-122.421431, 37.75704], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Americana", "Time": "8:30 PM", "Venue": "Amado's", "moreBioInfo": "Boulder, Colorado-based Cosmic Americana band Grant Farm has entertained a growing fan base on the nation’s club and festival scene since its founding in 2009 by vocalist and National Flatpicking Guitar Champion Tyler Grant.\n\nBuilt on the fundamentals of love, family, and music, the band is a sure bet for fans of high-energy, authentic artists as diverse as Sturgill Simpson, Tedeschi Trucks Band and Phish. Comprised of zany, creative and highly musical comrades, Grant Farm members include Grant (aka “The Champ”), Adrian “Ace” Engfer (bass and vocals), Sean “Magic” Macaulay (drums) and Kevin “Money” McHugh (keyboards and vocals).\n\nDaniel Mescher of Colorado Public Radio dubbed Grant Farm “some of the ablest musicians not only in the state of Colorado, but in the nation.” Members’ prior experience includes playing with groups like The Emmitt-Nershi Band, Donovan Frankenreiter and Hot Soup. Collectively, they had also shared stages with notable artists Sam Bush, Jerry Douglas, Tim O’Brien, Tony Rice, Keller Williams, Jon Oates and the like and with notable groups The String Cheese Incident, Greensky Bluegrass, Yonder Mountain String Band and The Infamous Stringdusters.\n\nThe band’s latest release, Kiss the Ground (Summer 2016), represents its first full-length concept album and its third album of original music. Speaking to the struggles we all face as working people, Kiss the Ground sends a positive message while acknowledging real hardship in a society that expects far too much. “We think of this as our ode to the working people,” says Grant, whose song, “Get in Line,” discusses the high price we pay for things we want in life. Kiss the Ground explores real and mythological connections to the human struggle and pays homage to the \"Working Class Hero,\" an archetype famously described by John Lennon.\nPrevious Grant Farm albums include a 2012 self-titled debut and a 2014 follow up, Plowin' Time, which reached #2 on JamBand Radio Charts and charted on Americana Radio. In 2014, the band also released the Meeting on the Mountain EP, an inspired collaboration with the group Fruition.\n\nThe band has also created the acclaimed Meeting on the Mountain LIVE, a collaborative, live webcast concert experience featuring Grant Farm as the house band and Tyler Grant as host. To date, episodes have featured Dave Bruzza of Greensky Bluegrass, Bill Nershi of String Cheese Incident, Todd Sheaffer of Railroad Earth, The Dead Winter Carpenters and other guests.\n\nLike a “traveling Gypsy family,” Grant Farm enjoys their life of touring, writing and adventuring together as they share their music up and down the North American roots music line.", "otherInfo": "No other event info available"}, {"Address": "2369 Market St, San Francisco, CA 94114", "Artist": "PICANTE ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.434352, 37.762839], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "The Cafe", "moreBioInfo": "No artist bio available", "otherInfo": "\"Picante\" w/ DJ Marco & guest DJs"}, {"Address": "456 Castro St, San Francisco, CA 94114", "Artist": "Throwback Thursdays ", "ArtistImage": "https://photos.bandsintown.com/thumb/6195517.jpeg", "Coordinates": [-122.435431, 37.761602], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "QBar", "moreBioInfo": "No artist bio available", "otherInfo": "\"Throwback Thursdays\" w/ DJ Jorge Terez"}, {"Address": "1190 Folsom St, San Francisco, CA 94103", "Artist": "Class of '84 ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.41005, 37.775472], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "9:00 PM", "Venue": "Cat Club", "moreBioInfo": "No artist bio available", "otherInfo": "\"Class of '84\" w/ DJs Damon, Steve Washington, Dangerous Dan, and guests"}, {"Address": "375 11th St, San Francisco, CA 94103", "Artist": "Sequence ", "ArtistImage": "https://photos.bandsintown.com/thumb/7704302.jpeg", "Coordinates": [-122.412687, 37.771011], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Progressive Metal, Metal", "Time": "9:00 PM", "Venue": "DNA Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Vital & Olympus present\nSEQUENCE\nWatch and listen:\nSequence: http://youtu.be/c8xbjeCyp7c\ndubstep.\n9pm - after hours.\n18+ with ID.\n$10 limited advance;\n$15 advance after;\n$20 door.\nhttps://www.sequence-sf.com"}, {"Address": "3600 16th St, San Francisco, CA 94114", "Artist": "Juicy ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.433406, 37.764392], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "R&b/soul, Funk, Rnb-soul, Soul, R&b", "Time": "9:00 PM", "Venue": "Lookout", "moreBioInfo": "No artist bio available", "otherInfo": "\"Juicy\" at Lookout: The elevated location, long windows, and outdoor balcony give this Castro bar its name, where queers nosh on pizza and dance to DJed music while keeping an eye open for people to meet."}, {"Address": "1337 Grant Ave, San Francisco, CA 94133", "Artist": "Whisky Pills Fiasco ", "ArtistImage": "https://photos.bandsintown.com/thumb/6288817.jpeg", "Coordinates": [-122.407503, 37.799258], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Americana Rockabilly Surf Country", "Time": "9:30 PM", "Venue": "Tupelo", "moreBioInfo": "Our new CD Losers, Boozers and Lonely Hearts is ready and available for your listening plesaure. Get your copy now!", "otherInfo": "Whisky Pills Fiasco at Tupelo: The old Mojito space has reimagined itself in Tupelo, a casually classy restaurant and bar with a menu featuring soul food, burgers, grits-augmented combo plates, and other Southern food staples."}, {"Address": "243 O’Farrel Street, San Francisco, CA 94102", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [-122.408656, 37.786085], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Broadway, Singer Songwriter, Cabaret, Cover Songs", "Time": "9:30 PM", "Venue": "Johnny Foley's Dueling Piano Show", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs.\n?\nHis theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City.\n?\nHe is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page.\n?", "otherInfo": "Dueling Piano Show (21+)"}, {"Address": "1015 Folsom St, San Francisco, CA 94103", "Artist": "Yves Tumor ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.405681, 37.778048], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "No genre available", "Time": "10:00 PM", "Venue": "1015 Folsom", "moreBioInfo": "No artist bio available", "otherInfo": "This Event Has Been Postponed To A Later Date. Rescheduled Dates Will Be Emailed To All Attendees"}, {"Address": "124 Ellis St, San Francisco, CA 94102", "Artist": "Industry ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.408512, 37.785724], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Synth Pop, New Wave Alternative, Pop, Alternative", "Time": "10:00 PM", "Venue": "Infusion Lounge", "moreBioInfo": "No artist bio available", "otherInfo": "Industry Night at Infusion Lounge: A flashy new upscale lounge with multimillion-dollar Asian decor motifs, glowing glass columns, and even a hologram behind the bar. No, the hologram doesn't pour your drinks, silly."}, {"Address": "138 Minna St, San Francisco, CA 94105", "Artist": "Groove Theory ", "ArtistImage": "https://photos.bandsintown.com/thumb/9962989.jpeg", "Coordinates": [-122.400427, 37.787042], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "R&b/soul, Rnb-soul, R&b, Soul", "Time": "10:00 PM", "Venue": "John Colins", "moreBioInfo": "Groove Theory is an American R&B duo, best known for their 1995 hits \"Tell Me\", \"Keep Tryin'\" and \"Baby Luv\", from their self-titled debut album. The original version of the group was made up of female singer Amel Larrieux and male song-writer, actor, and producer Bryce Wilson. Larrieux left the group for a solo career in 1999 and was replaced by Mekada Davis. The new line-up also signified a dramatic change in style for the group which took a more contemporary R&B approach for their second album, The Answer. Despite moderate success of the first single \"4 Sure\" and a remix featuring Mya and Jagged Edge, The Answer went unreleased and the group stopped recording. Since, Wilson has appeared in the movie 'Beauty Shop' starring Queen Latifah, and he and Davis continue to write together for other artists like Beyoncé and Amerie.", "otherInfo": "\"Groove Theory\" w/ DJ Natural"}, {"Address": "424 Haight St, San Francisco, CA 94117", "Artist": "Bubble ", "ArtistImage": "https://photos.bandsintown.com/thumb/8065051.jpeg", "Coordinates": [-122.429362, 37.772531], "Date": "Thu Apr 2 2020", "EventDate": "2020-04-02", "Genre": "Psytrance, Psy Trance, Goa Trance, Electronic", "Time": "10:00 PM", "Venue": "Underground SF", "moreBioInfo": "Follow Bubble www.soundcloud.com/bubble-music www.youtube.com/bubblexmusic", "otherInfo": "\"Bubble\" at Underground SF: This small, dark, and unpretentious Lower Haight spot attempts to inject a subversive element back into the nightclub scene - and, for the most part, it succeeds. The music runs the gamut (from vintage disco to drum 'n' bass to hip-hop to reggae), as does the crowd. A good place to escape from upscale and trendy nightclubbers."}]