var sf_events = [{"Address": [-122.23, 37.732], "Artist": "Scott Law LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8482473.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Fri May 15 2020", "EventDate": "2020-05-15", "Genre": "Portland, Oregon", "Time": "11:20 PM UTC", "Venue": "Live Stream", "moreBioInfo": "SCOTT LAW\nwww.scottlawmusic.com\nScott Law may have been born in Southern California but his music pulls together traditions from every corner of the country.\n\nMultifaceted artist Scott Law is an accomplished guitar master, singer-songwriter and recording artist operating at the very highest level of his craft. Hailed as an “esteemed flatpicker” by Acoustic Guitar, Law is equally reverent and inventive on steel strings whether in a lead or supporting role.\n\nLaw’s versatility on the guitar ranges from the flatpicking school of Doc Watson, to the hardcore country pickings of Clarence White, Albert Lee and Don Rich, to the electric blues of Mike Bloomfield, while also giving a feel and fluidity reminiscent of Jerry Garcia.\n\nA not-so-secret weapon sought after for his distinctive ability to elevate the potency of any collaboration, Law is a fearless improviser. His original songs and story-like solos come straight from the heart of rock, rhythm & blues, country and bluegrass, granting him the creative latitude to constantly push the envelope and deliver an unforgettable experience.\n\nLaw has performed with an array of bluegrass, American roots, rock and jam band luminaries including Phil Lesh & Friends, longtime musical accomplices The String Cheese Incident, Darol Anger, Tim & Nicki Bluhm, Tony Furtado, The Mother Hips, Crooked Still, Peter Rowan, The Travelin' McCourys, Leftover Salmon, Danny Barnes, Railroad Earth, Jerry Joseph, Melvin Seals, Brokedown in Bakersfield and many others.\n\nAdding to his collaborative repertoire, in 2014 Law joined Phil Lesh & Friends for summer concerts in Central Park as well as fall shows at the famed Capitol Theatre and Lesh’s Terrapin Crossroads in Marin County, California. In 2015, Law continues to perform as a featured player in Lesh’s rotating lineup as the legendary bass player and founding member of the Grateful Dead celebrates the band’s 50th anniversary and its legacy as one of the most groundbreaking acts in rock and roll history.\nLaw is also a dedicated and experienced music educator, teaching at various workshops, schools, camps, festivals and private sessions each year. When off the road, he lives in Portland, Oregon.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Sam Grisman LIVE", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Mon May 11 2020", "EventDate": "2020-05-11", "Genre": "No genre available", "Time": "11:20 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Paul Potts LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9616822.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Mon May 11 2020", "EventDate": "2020-05-11", "Genre": "Classical", "Time": "11:30 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "Recording a live operatic song each day"}, {"Address": [-122.23, 37.732], "Artist": "Andy Shaw Band LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10011591.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Mon May 11 2020", "EventDate": "2020-05-11", "Genre": "Rock, Reggae, American Roots", "Time": "11:30 PM UTC", "Venue": "Live Stream", "moreBioInfo": "The Andy Shaw Band is a reggae infused rock band with a strong blend of vocal harmonies, and family roots. The is band comprised of Andy Shaw (guitar/vocals), Chris Shaw (drums/vocals), Jim Shaw (keyboard/vocals), Ryan Sullivan (lead guitar, vocals), and Jeff Bass (bass/vocals). Performing since 2005, the band has evolved over their 11 years, integrating more roots reggae and fuller harmonies with the addition of Bass on bass. Utilizing Chris Shaw’s uniquely well crafted reggae drum skills, and Andy’s flare for great melody writing and vocal ability, the band crafts a sound that makes you dance, AND feel something in your soul. Think equal parts Bob Marley and Van Morrison. Or Al Green and the Police if you will.\n\nOver the past 9 years the band has done numerous tours to Texas, NYC, Nashville, Florida, and all points in between. They’ve performed at Hookahville Festival, the Werkout Music Festival, Musikfest 2013, Red Gorilla Showcase at SXSW, Midpoint Music Festival, and have risen to one of the regions PREMIER original acts.\n\nAndy Shaw Band have a reputation as one of the hardest working acts around, and they are currently putting that work to spreading the music beyond their home town of Columbus, Ohio. As they take the next step forward, the future is bright, and the music is the perfect soundtrack to take them there.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Downtown Brown LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8735728.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Mon May 11 2020", "EventDate": "2020-05-11", "Genre": "Punk, Funk, Metal, Rock", "Time": "11:30 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Downtown Brown has been captivating audiences since 2001 with a unique blend of punk, funk, metal, and ska coupled with an entertaining, high-energy live show. Sonically diverse, the band has shared the stage with an eclectic range of well known artists including Andrew W.K., Dead Kennedys, Slightly Stoopid, The Adicts, Insane Clown Posse, and most recently legendary Bad Brains frontman H.R.. DTB’s 7th full-length album 'CaliFlorida' (2018) features guest musicians from Parliament Funkadelic, Sublime, Fishbone, and Lynyrd Skynyrd. Since 2007, the band has been touring nationally, solidifying a loyal underground fanbase while supporting independent release after independent release.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Ghastly LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9027199.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Doesnt Matter", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "sup im the ghost kid.", "otherInfo": "Twitch Live Stream"}, {"Address": [-122.23, 37.732], "Artist": "Jack Barksdale LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8835503.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Americana, Folk, Country Blues", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Jack Barksdale has been called a “musical phenomenon” (Buddy Magazine) a “Texas force\" (Paper City Magazine) “a singer-songwriter well beyond his years” (Baton Rouge Advocate) an \"old soul” (Fort Worth Weekly) and “amazing to watch” (DFW.com). Texas Homegrown Radio said, “He might just be Townes Van Zandt reincarnated.”\n\nJack Barksdale is a 12-year-old singer/songwriter from Texas. Inspired by folk, rock, and blues legends, Jack started performing original music at the age of nine and has already shared the stage with Ray Wylie Hubbard, Bruce Robison, John Fullbright, and Hayes Carll.\n\nJune 2019 Jack released a live album recorded at famed Niles City Sound in Fort Worth, TX. September 2018, Jack released his debut EP, Revival.\n\nJack tours nationally and wows audiences with lyrics wise beyond his years. Jack plays guitar, slide guitar, harmonica, mandolin, piano, and ukulele, but identifies first and foremost as a songwriter", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "GARY SCHUTT MUSIC LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10280614.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hard Rock, Power Pop, Heavy Rock, Pop, Rock", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Hard Rock Rising 2012 global battle of the bands finalist!\n\nGary Schutt has basically been a one man solo artist since he was really young. Acquiring a cheap 4-track recorder and a slew of original tunes, he started recording & producing at age 15. Writing, arranging and performing all the parts himself in his parents basement.\n\nGary graduated and taught at the prestigious Berklee College Of Music and continued writing, recording, producing and performing there.\n\nAfter college, Gary moved to L.A. to team up with former Yngwie Malmsteen vocalist Jeff Scott Soto (also formerly with Journey). Gary toured the world as Jeff's bass player from 2001-2008, performing all over Europe, Australia and Brazil.\n\nGary is currently in Tampa, Florida and continues writing and recording and working on new studio material and touring with his cover band, Category Three which doubles as the Gary Schutt Band.\n\nSince 2010, Gary's has performed prior to Kiss, Motley Crue, Rick Springfield, Steel Panther, Grand Funk, Queensryche, Dream Theater, Rock Of Ages, Linkin Park, Pat Travers, Jeff Beck and Peter Frampton.\n\nfor a more detailed bio go to garyschutt.com", "otherInfo": "Monday night special is back with part 2 of Gary's 80s music video show. Gary's custom backing tracks synced to the classic music video. Steam live."}, {"Address": [-122.23, 37.732], "Artist": "Lily Detaeye Music LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9195887.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk Singer-songwriter, Alternative Folk, Indie Rock, Folk Rock, Blues-rock", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Des Moines raised.\n\nHarmonica wielding.\n\nSongstress.\n\nPeanut butter addict.", "otherInfo": "Lily DeTaeye streams live from Wells Fargo Arena Instagram and Facebook Pages."}, {"Address": [-122.23, 37.732], "Artist": "Matthew Fowler LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9269797.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Acoustic", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Florida-based artist, Matthew Fowler, is the perfect storm of all the essential singer-songwriter elements: a flawlessly raw yet organic voice, intricate melodies, compelling musicianship, and an overwhelmingly rich and rootsy sound. He released his homegrown debut album, “Beginning”, comprising of songs written between the ages 14 and 19 years old. The record, which was recorded live in his kitchen back home in Orlando, was first singled out by American Songwriter Magazine who hailed: “Fowler shows the same mastery of earnest, strummy, songcraft as established artists like Damien Rice and Ben Howard.”\n\nSince the album’s release, Fowler’s musicianship has been lauded by notable publications such as The Bluegrass Situation, CMT Edge, Acoustic Guitar Magazine, and Huffington Post.\n\nFowler's stage dynamic has formed into a capturing experience; he’s performed live on various NPR affiliates, has an Audiotree session under his belt, and has opened acts like Richard Thompson, Damien Jurado, The Weepies, Sea Wolf, Angel Olsen, and many more.\n\nPBS’ nationally syndicated \"Music City Roots” applauded Fowler’s songwriting stating, “He shows poise and command way beyond his years. He delivered his lines over muted, minimal acoustic guitar and then answered those words with explosive chordal bursts, like punctuation”.\n\nMatthew’s fervor for performing live will see him back out on the road, where he’s transitioned into a national touring artist. He continues honing new tunes and has a new record slated for a 2020 release.", "otherInfo": "Howdy folks!\n\nI'm live streaming a concert on both Facebook and Instagram (at the same time) on Monday, May 11th at 8pm est.\n\nI'll be doing renditions of some of my favorite tunes written by other songwriters and the show is entirely free to watch, listen, and enjoy!\n\nThat being said, I'm putting a (hopefully) strong emphasis on \"tipping-what-you-can\".\nLike many artists, all of my work and income streams have been severely diminished due to COVID-19. Anything you throw my way goes straight towards paying my bills and buying groceries.\n\n***HOW TO WATCH\nWatch on Facebook here: https://www.facebook.com/matthewfowlermusic\nWatch on Instagram via my page: @matthewkfowler\n\n****HOW TO TIP\nVenmo: @MatthewFowlerMusic\nPaypal: matthewkfowler@gmail.com\nCashapp: $MatthewKFowler"}, {"Address": [-122.23, 37.732], "Artist": "Fat Joe LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/7303966.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hip-hop, Hip Hop, Rap", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Fat Joe (born Joseph Cartagena on August 19, 1970) is an American rapper. Of Puerto Rican and Cuban heritage, and born and brought up in the Bronx, Joe was popular in the underground hip hop scene during the early and mid-1990s. During this period, Joe was affiliated with KRS-One — there are pictures online at KRS-One's Temple of Hiphop site showing them drawing graffiti (\"bombing\") together. He is also a member of the D.I.T.C. Crew (the \"Digging in the Crates Crew\"), along with well-respected hip-hoppers such as Diamond D, Lord Finesse, O.C., A.G., Buckwild, occasional member Big L (deceased), and Big Pun (deceased). The title of the group refers to DJs who \"dig in the crates\" of used record stores to find rare or novel records with \"breaks\" that they could use for production or in performances.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Robin Barnes LIVE", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "#SongbirdatHome Live Stream"}, {"Address": [-122.23, 37.732], "Artist": "Code Orange LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10370124.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hardcore", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "down we go... our new album ‘U N D E R N E A T H’ is out 3/13. pre-order/pre-save at https://codeorange.lnk.to/underneath. title track available to watch and stream everywhere now.", "otherInfo": "YOU AND YOU ALONE 004\nv i r t u a l p e r f o r m a n c e: joe + mudman in the\ncold.metal.place"}, {"Address": [-122.23, 37.732], "Artist": "Laine Hardy LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9391857.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "The Dryes LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9957553.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alt-country, Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The first time the public got a taste of country duo The Dryes was in May 2018. The EP “Vol. I” was recorded at the famed Blackbird Studios in Nashville, a town the North Carolina natives now call home. Their first single “Amen” garnered a Rolling Stone Country mention in the \"Top 10 Best Country Songs of the week\" during it's release, and CMT covered a spotlight on their music video for their single \"War.\" “War” is a song with a vulnerable backstory and was released alongside a breathtaking music video. CMT shared their thoughts on the single when they ran the video, saying “...this duo sings of a love worth fighting for in their latest single ‘War’.” Love finds a way...Sometimes in footage that has been asleep for thirty years. \"If it's love then it's War / it’s worth fighting for.”\n\nThen comes “Marley.\" Co-written with Shane Stevens (Lady Antebellum’s “American Honey”), Katelyn states: “We wrote this outside on the porch surrounded by palm trees, so you’ll hear a lot of fun references to the scenery of Palm Desert, California. The music video totally captured this vibe as well!”\n\n“Take You Dancin’” is their newest jam, which paints a picture of the ultimate dive bar. Highlighted by Billboard: “The Dryes kick things up a notch in its infectious new single ‘Take You Dancin’’…the feel-good tune has Derek and Katelyn Drye sharing harmonies on the foot-stomping number.”", "otherInfo": "Join us with your favorite quarantine drink and we'll bring the songs!\n\nDonations welcome:\nhttps://l.instagram.com/?u=http://linktr.ee/TheDryes&e=ATMENQsrTwdSxNysuPt2MlHUNccHGUupPfhDSaFEg0GdrWFQFhVwQwd53YaD1Pd2Dkn6RlfncuR3PKNXtzPinSjg2omU50q9&s=1"}, {"Address": [-122.23, 37.732], "Artist": "Song Suffragettes LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9288379.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "country music, female singer-songwriter night every Monday night at 6pm at The Listening Room Cafe", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Restless Road LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10185289.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country, Country Pop", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Talented. Charming. Unstoppable. America first became acquainted with the Country music trio Restless Road while watching Season 3 of The X Factor USA and these are just some of the words that immediately came to their minds. The breakout act didn’t just leave a lasting impression on audiences, but also mesmerized the show’s judges including Simon Cowell and Kelly Rowland. \"X Factor\" of course refers to that undefinable and innate \"something\" that a star simply embodies. And fans and tastemakers recognize that Restless Road has got it times three. Zach Beeken (22), Garrett Nichols (21) and Jared Keim (24) each bring their own “All- American” experience to a transformed Restless Road. Evident in their self-taught musical skills, these three guys do share one important thing in common above all else: determination. Zach’s very first job was pollinating corn on a farm in Iowa where he discovered his love for Country music and taught himself how to sing. Garrett on the other hand, grew up in Alabama and was involved in everything from school musicals to baseball. One day at age 12 though, he picked up an acoustic guitar and never looked back. Also at a young age, Jared’s community watched in awe as he performed on stage at his local church in Missouri; he found his calling before he could tie his own shoes. Into his teens, Jared trained himself on the guitar, piano and drums. “Getting together to write or record is great because we all grew up with the same hard- working attitude and approach our music in the same way together,” says Zach. It’s this dedication and positive outlook that’s responsible for so much of the group’s success. One of Restless Road’s biggest accomplishments to date is landing at #1 on the iTunes Country Chart. With a Country spin, the group covered one of the most popular songs of 2013, Avicii’s “Wake Me Up,” and quickly realized that they had a growing and passionate fan base to satisfy. One of these fans was legendary music manager Johnny Wright. Wright has helped launch Backstreet Boys, *NSYNC and Jonas Brothers (to name a few), so he thoroughly understands what it takes for a group of guys to be successful and began working with Restless Road in 2014. With Wright’s ear for talent and Restless Road’s capability, this Country “man band” (as they refer to themselves) was ready to show the world what they could do and took their live show on the road in 2015. The group has since toured nationwide, secured a coveted performance slot during NASCAR’s AAA Texas 500 Weekend at Texas Motor Speedway in Ft. Worth, brought down the house at Reese Witherspoon’s Draper James fashion line launch party, opened up for songstress Demi Lovato and contributed their talents to an annual Country Music Hall of Fame fundraiser event. Jared sums it up well by explaining, “We’re three guys who have something to prove. We love what we're doing, we're real and we're going to carve out a place in music history for ourselves.” 3 guys who love singing country music. Follow us on Instagram @restlessrdmusic!!", "otherInfo": "Live Stream: https://www.facebook.com/RestlessRoad"}, {"Address": [-122.23, 37.732], "Artist": "Della Mae LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9701893.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country, Bluegrass", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The follow-up to their Grammy-nominated 2013 album, ‘This World Oft Can Be,’ Della Mae’s self-titled second release for Rounder finds the all-female combo delivering eleven compelling new tunes that embody the musical and emotional qualities of the group’s prior output while venturing into uncharted creative territory. Produced by Jacquire King (Of Monsters and Men, Norah Jones, Dawes, Kings of Leon), ‘Della Mae’ showcases the band’s emotional intensity and musical invention on such originals as “Boston Town,” “Rude Awakening” and “For the Sake of My Heart,” as well as on vivid, insightful readings of the Rolling Stones’ “No Expectations” and the Low Anthem’s “To Ohio.” With an approach that’s steeped in tradition yet firmly rooted in the present, Della Mae draws from a well of influences to create vibrantly original music that conveys their expansive musical vision with timeless lyrical truths and a contemporary sensibility all their own, placing them alongside such young acts as the Avett Brothers, Punch Brothers, the Lumineers, and Hurray for the Riff Raff.", "otherInfo": "Join Kimber Ludiker (fiddle) and Avril Smith (guitar) for the weekly Monday evening Hoedown!"}, {"Address": [-122.23, 37.732], "Artist": "Cassidy-Rae Wilson LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9497281.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country Pop", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Cassidy-Rae - a name you’ll want to remember. Wandering songstress, Sydney-born and raised, Cassidy-Rae is stunning audiences globally with mesmerizing vocals, entertaining performances and heartfelt songs about love and life.\nInfluenced by country and pop artists including Taylor Swift and Carrie Underwood, this highly gifted vocalist has been creating her own delightful blend of country pop music for numerous years.\nHer upcoming single, More, is more than words put to music; more than angelic vocals and catchy lyrics you’ll have on repeat; this uplifting song connects with everyone reminding them that they’re more than the opinions of others.", "otherInfo": "LIVE STREAMING from Isolation!\nIn this time of disconnection, I'm connecting! Spreading some joy & music, not the virus!\nCome join me for a virtual piano bar feel - request songs, sing along & enjoy the show!"}, {"Address": [-122.23, 37.732], "Artist": "Jack Barksdale LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8835503.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Americana, Folk, Country Blues", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Jack Barksdale has been called a “musical phenomenon” (Buddy Magazine) a “Texas force\" (Paper City Magazine) “a singer-songwriter well beyond his years” (Baton Rouge Advocate) an \"old soul” (Fort Worth Weekly) and “amazing to watch” (DFW.com). Texas Homegrown Radio said, “He might just be Townes Van Zandt reincarnated.”\n\nJack Barksdale is a 12-year-old singer/songwriter from Texas. Inspired by folk, rock, and blues legends, Jack started performing original music at the age of nine and has already shared the stage with Ray Wylie Hubbard, Bruce Robison, John Fullbright, and Hayes Carll.\n\nJune 2019 Jack released a live album recorded at famed Niles City Sound in Fort Worth, TX. September 2018, Jack released his debut EP, Revival.\n\nJack tours nationally and wows audiences with lyrics wise beyond his years. Jack plays guitar, slide guitar, harmonica, mandolin, piano, and ukulele, but identifies first and foremost as a songwriter", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Restless Road LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10185289.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country, Country Pop", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Talented. Charming. Unstoppable. America first became acquainted with the Country music trio Restless Road while watching Season 3 of The X Factor USA and these are just some of the words that immediately came to their minds. The breakout act didn’t just leave a lasting impression on audiences, but also mesmerized the show’s judges including Simon Cowell and Kelly Rowland. \"X Factor\" of course refers to that undefinable and innate \"something\" that a star simply embodies. And fans and tastemakers recognize that Restless Road has got it times three. Zach Beeken (22), Garrett Nichols (21) and Jared Keim (24) each bring their own “All- American” experience to a transformed Restless Road. Evident in their self-taught musical skills, these three guys do share one important thing in common above all else: determination. Zach’s very first job was pollinating corn on a farm in Iowa where he discovered his love for Country music and taught himself how to sing. Garrett on the other hand, grew up in Alabama and was involved in everything from school musicals to baseball. One day at age 12 though, he picked up an acoustic guitar and never looked back. Also at a young age, Jared’s community watched in awe as he performed on stage at his local church in Missouri; he found his calling before he could tie his own shoes. Into his teens, Jared trained himself on the guitar, piano and drums. “Getting together to write or record is great because we all grew up with the same hard- working attitude and approach our music in the same way together,” says Zach. It’s this dedication and positive outlook that’s responsible for so much of the group’s success. One of Restless Road’s biggest accomplishments to date is landing at #1 on the iTunes Country Chart. With a Country spin, the group covered one of the most popular songs of 2013, Avicii’s “Wake Me Up,” and quickly realized that they had a growing and passionate fan base to satisfy. One of these fans was legendary music manager Johnny Wright. Wright has helped launch Backstreet Boys, *NSYNC and Jonas Brothers (to name a few), so he thoroughly understands what it takes for a group of guys to be successful and began working with Restless Road in 2014. With Wright’s ear for talent and Restless Road’s capability, this Country “man band” (as they refer to themselves) was ready to show the world what they could do and took their live show on the road in 2015. The group has since toured nationwide, secured a coveted performance slot during NASCAR’s AAA Texas 500 Weekend at Texas Motor Speedway in Ft. Worth, brought down the house at Reese Witherspoon’s Draper James fashion line launch party, opened up for songstress Demi Lovato and contributed their talents to an annual Country Music Hall of Fame fundraiser event. Jared sums it up well by explaining, “We’re three guys who have something to prove. We love what we're doing, we're real and we're going to carve out a place in music history for ourselves.” 3 guys who love singing country music. Follow us on Instagram @restlessrdmusic!!", "otherInfo": "Live Stream: https://www.facebook.com/RestlessRoad"}, {"Address": [-122.23, 37.732], "Artist": "GARY SCHUTT MUSIC LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10280614.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hard Rock, Power Pop, Heavy Rock, Pop, Rock", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Hard Rock Rising 2012 global battle of the bands finalist!\n\nGary Schutt has basically been a one man solo artist since he was really young. Acquiring a cheap 4-track recorder and a slew of original tunes, he started recording & producing at age 15. Writing, arranging and performing all the parts himself in his parents basement.\n\nGary graduated and taught at the prestigious Berklee College Of Music and continued writing, recording, producing and performing there.\n\nAfter college, Gary moved to L.A. to team up with former Yngwie Malmsteen vocalist Jeff Scott Soto (also formerly with Journey). Gary toured the world as Jeff's bass player from 2001-2008, performing all over Europe, Australia and Brazil.\n\nGary is currently in Tampa, Florida and continues writing and recording and working on new studio material and touring with his cover band, Category Three which doubles as the Gary Schutt Band.\n\nSince 2010, Gary's has performed prior to Kiss, Motley Crue, Rick Springfield, Steel Panther, Grand Funk, Queensryche, Dream Theater, Rock Of Ages, Linkin Park, Pat Travers, Jeff Beck and Peter Frampton.\n\nfor a more detailed bio go to garyschutt.com", "otherInfo": "Monday night special is back with part 2 of Gary's 80s music video show. Gary's custom backing tracks synced to the classic music video. Steam live."}, {"Address": [-122.23, 37.732], "Artist": "Matthew Fowler LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9269797.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Acoustic", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Florida-based artist, Matthew Fowler, is the perfect storm of all the essential singer-songwriter elements: a flawlessly raw yet organic voice, intricate melodies, compelling musicianship, and an overwhelmingly rich and rootsy sound. He released his homegrown debut album, “Beginning”, comprising of songs written between the ages 14 and 19 years old. The record, which was recorded live in his kitchen back home in Orlando, was first singled out by American Songwriter Magazine who hailed: “Fowler shows the same mastery of earnest, strummy, songcraft as established artists like Damien Rice and Ben Howard.”\n\nSince the album’s release, Fowler’s musicianship has been lauded by notable publications such as The Bluegrass Situation, CMT Edge, Acoustic Guitar Magazine, and Huffington Post.\n\nFowler's stage dynamic has formed into a capturing experience; he’s performed live on various NPR affiliates, has an Audiotree session under his belt, and has opened acts like Richard Thompson, Damien Jurado, The Weepies, Sea Wolf, Angel Olsen, and many more.\n\nPBS’ nationally syndicated \"Music City Roots” applauded Fowler’s songwriting stating, “He shows poise and command way beyond his years. He delivered his lines over muted, minimal acoustic guitar and then answered those words with explosive chordal bursts, like punctuation”.\n\nMatthew’s fervor for performing live will see him back out on the road, where he’s transitioned into a national touring artist. He continues honing new tunes and has a new record slated for a 2020 release.", "otherInfo": "Howdy folks!\n\nI'm live streaming a concert on both Facebook and Instagram (at the same time) on Monday, May 11th at 8pm est.\n\nI'll be doing renditions of some of my favorite tunes written by other songwriters and the show is entirely free to watch, listen, and enjoy!\n\nThat being said, I'm putting a (hopefully) strong emphasis on \"tipping-what-you-can\".\nLike many artists, all of my work and income streams have been severely diminished due to COVID-19. Anything you throw my way goes straight towards paying my bills and buying groceries.\n\n***HOW TO WATCH\nWatch on Facebook here: https://www.facebook.com/matthewfowlermusic\nWatch on Instagram via my page: @matthewkfowler\n\n****HOW TO TIP\nVenmo: @MatthewFowlerMusic\nPaypal: matthewkfowler@gmail.com\nCashapp: $MatthewKFowler"}, {"Address": [-122.23, 37.732], "Artist": "Fat Joe LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/7303966.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hip-hop, Hip Hop, Rap", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Fat Joe (born Joseph Cartagena on August 19, 1970) is an American rapper. Of Puerto Rican and Cuban heritage, and born and brought up in the Bronx, Joe was popular in the underground hip hop scene during the early and mid-1990s. During this period, Joe was affiliated with KRS-One — there are pictures online at KRS-One's Temple of Hiphop site showing them drawing graffiti (\"bombing\") together. He is also a member of the D.I.T.C. Crew (the \"Digging in the Crates Crew\"), along with well-respected hip-hoppers such as Diamond D, Lord Finesse, O.C., A.G., Buckwild, occasional member Big L (deceased), and Big Pun (deceased). The title of the group refers to DJs who \"dig in the crates\" of used record stores to find rare or novel records with \"breaks\" that they could use for production or in performances.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Robin Barnes LIVE", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "#SongbirdatHome Live Stream"}, {"Address": [-122.23, 37.732], "Artist": "The Orphan The Poet LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9191303.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alternative", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The Orphan The Poet want you to know they are here and not going anywhere. Based out of Columbus, OH, the threesome come bearing their own brand of take-it-or-leave-it alt rock and have been rabidly gaining fans thanks to their captivating live show, garnering the attention of SiriusXM's Alt Nation, KROQ, & BBC's Radio1. And with the release of the new Queen Cobra EP, The Orphan The Poet have found themselves over the country on festival bills alongside acts like Twenty One Pilots, X Ambassadors, YUNGBLUD, lovelytheband, & more.", "otherInfo": "gahh have you been following our live and online series?! join David for some stripped down versions of our songs, as well as a q&a & more!!"}, {"Address": [-122.23, 37.732], "Artist": "Ghastly LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9027199.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Doesnt Matter", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "sup im the ghost kid.", "otherInfo": "Twitch Live Stream"}, {"Address": [-122.23, 37.732], "Artist": "Jeff Plankenhorn LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8520370.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Dave Scher, Brannen Temple, Jeff Plankenhorn, Yoggie Musgrove", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "AUSTIN GUITARIST JEFF PLANKENHORN SHIFTS FROM SIDE (AND SLIDE) WORK INTO THE SOLO SPOTLIGHT WITH ASSERTIVE SINGER-SONGWRITER SHOWCASE, SLEEPING DOGS, OUT MAY 4\n\nRoots-rocking follow-up to 2016’s acclaimed SoulSlide finds the Ohio-born, Texas-based artist expanding his musical playing field with help from friends Ray Wylie Hubbard, Patty Griffin, and co-producer “Scrappy” Jud Newcomb.\n\nAUSTIN, Texas — When Jeff Plankenhorn, arguably one of the busiest and most highly regarded guitar players on the Austin music scene, tells you that he “hardly ever takes sideman gigs anymore,\" take it with a grain of salt.\n\nYes, it’s true he’s made a concerted effort to carve out more time for his own solo career ever since issuing his breakout second studio set, 2016's SoulSlide — and he aims to find even more of that “me time” come the May 4, 2018 release of his new album, Sleeping Dogs on Spike Steel Records.But as far as scaling back on the whole sideman thing goes ... bear in mind that there’s a big difference between “hardly ever” and never. Namely, the former still leaves the guy just enough wiggle room to happily say “yes” when legends (and friends) on the level of Ray Wylie Hubbard or the Flatlanders need a can-do guitar man for a sold-out theater engagement. Or, say, when fellow A-list Austin sideman “Scrappy” Jud Newcomb — the MVP co-producer of Sleeping Dogs — finds out he can’t make it to a very special Johnny Nicholas gig in Hawaii, and asks “Plank” if he’d be up for subbing for him. Who in their right mind is going to say no to that?\n\nPlankenhorn still selectively takes those kinds of calls not because he gets them, but because he’s earned them. For the better part of the last 17 years, ever since he first moved to Texas with nothing to his name but a Geo Prism, $100, seven guitars and the generous hospitality of Ray and Judy Hubbard, the gifted multi-instrumentalist from Columbus, Ohio has busted ass to prove himself not just able and willing, but above all worthy of playing with the best of the best. And the reason so many song poets like Hubbard and Joe Ely like having Plank at their side is not just because of his prodigious chops on all things stringed (especially those played with a slide), but because of his intuitive knack for knowing when to hold back, always allowing the singer room to land a lyric and go for the proverbial kill. “That’s just part of the skill set I learned very early on: ‘When in doubt, layout,’” Plankenhorn explains with a chuckle. “That joke about knowing when not to play? It's true.”\n\nNot surprisingly, that particular skill — along with myriad other lessons in the finer points of songcraft that he’s picked up from sharing stages with the masters — has come to greatly inform Plankenhorn’s own music over the years. But it’s never been more apparent than it is on Sleeping Dogs. Make no mistake: Plank plays a lot of guitar on the album, along with pedal steel, piano, upright bass and seemingly anything else he could lay his hands on during the sessions at the Zone recording studio just outside of Austin. But in stark contrast to SoulSlide, which by his own admission was by design a showcase for his custom-designed lap slide guitar, a patented “Frankenstein” beauty he calls “the Plank,” Sleeping Dogs is first and foremost all about the songs.\n\n“The Plank guitar came from me wanting to mix together the two worlds of bluegrass dobro and the sacred steel tradition, and my whole last album was dedicated to that one instrument — to get it out there,” he says. “SoulSlide also really helped put me on the map as a solo artist, which is why I’ve moved on to focusing more on doing my own thing and only doing a side gig once in a while when I really want to, with people that I really respect. But now, with Sleeping Dogs, I wanted to take a bigger look at how the whole world of music is available to me; it’s not about just one guitar or sound, but rather about using all of the instruments I play and bringing all of my influences together — and about really wanting to bring my songwriting to the forefront.”\n\nTo that end, there are no covers on the new album, but half of the songs were born out of co-writing sessions with a handful of his longtime friends including his co-producer (and bandmate in Austin’s the Resentments) Newcomb, Gabriel Rhodes, Miles Zuniga, Jon Dee Graham, and of course Hubbard — the “Wylie Llama” of Americana/Texas music, who Plankenhorn still credits as his personal gateway to the whole scene. “Pretty much everyone I’ve ever played with is like, one degree of separation away from Ray,” he marvels with a laugh. It was also Hubbard who set Plankenhorn straight years ago when he doubted his own merits as a songwriter.\n\n“I had just started out playing some of my own songs at these little acoustic gigs, but I remember telling him, ‘Ray, I don't think I should be doing this — I’m just a side guy.’ And he said, ‘Where’s your proof? Are people coming to your shows? Are people listening to your songs? Yes? Well, there’s your proof.’”\n\nNaturally, the song Plankenhorn and Hubbard cooked up together, a satisfyingly greasy howler called “Tooth and Nail,” just happens to be all about the not-for-the-timid troubadour path and the discipline of songwriting, without so much as a grain of sugar to sweeten the pot. “We had already written a good portion of the song when he came back to me and said, ‘It’s like an old cat having kittens / You just crawl under the porch and do it,’ which is a very Ray line,” Plankenhorn says. “But what’s cool is there were other lines where his wife, Judy, was like, ‘Ray must have written that,’ and I was like, ‘Ha, no, that was me!’”\n\nAnd the Hubbard-certified gnarled blues of “Tooth and Nail” is just one of a handful of different styles Plankenhorn makes his own on Sleeping Dogs. Both the hurricane Harvey-inspired “Further to Fall” (co-written with Rhodes) and the closing “Heaven on Earth,” Plankenhorn’s awestruck tribute to his wife’s transcendent love of nature, hit the same deep, soulful notes that defined his last album (with that trusty Plank guitar put to especially righteous use on the latter song). But there’s also “This Guitar,” a disarmingly folky, listening-room-ready paean to the workhorse acoustic Martin that’s been his go-to writing guitar ever since it was anonymously gifted to him not long after he first moved to Texas. And perhaps most surprising of all (even to Plankenhorn himself), there’s even a few free-spirited ventures into buoyantly catchy, unabashedly poppy rock ’n’ roll.\n\n“I had already recorded a few rhythm tracks before this, but the day that Scrappy first came to the studio was also the day that Tom Petty died — and somehow, everything just kind of shifted that day,” he says. “Not on the entire album, but for a good portion of it, there were discussions of like, ‘What would Mike Campbell do on this guitar part?’ And out of that, some of the songs like ‘Sleeping Dogs’ and ‘I Don't Know Anything’ really changed and moved into more of a roots-rock thing. Which wasn’t something I was expecting — I mean, it came out of nowhere — but I loved it.”\n\nThat wouldn’t be the last happy surprise, either. The stately, hymn-like “Holy Lightning,” an arresting co-write with Newcomb and Zuniga (of Fastball fame), actually almost didn’t make the final cut. “I had started that one myself but just really wasn’t digging it, so I took it to Miles and Scrappy in the studio, and between the three of us we completely reworked it from scratch over a couple of hours,” he recalls. “But even then I still wasn’t entirely about it. But then Scrappy sent the demo to Patty Griffin, and she goes, ‘I want to sing on this!’ As soon as she said that, I was like, ‘Well, I’m definitely putting it on the album now!’”\n\nNeedless to say, “Holy Lightning” is now one of his favorite songs on the record. Not that there’s a single track that he’s not proud of on Sleeping Dogs, which is a testament both to the positive experience he had recording it and the confidence he feels going forward into the next stage of his career. And should he even find himself second-guessing his conviction on that solo sojourn, well, he’s already written his own anthem to sing his way through the doubt.\n\n“When I wrote ‘Sleeping Dogs,’ I got this image of sleeping dogs lying, and how I need to let shit go,” he explains. “I literally took a lot of things that I’m really bad at or think I’m really bad at, and told myself, ‘If I sing this for a year or two on tour, it may make me better at these things; maybe I won’t take stuff personally, won’t let things get me down.’ And I thought, ‘Maybe somebody else will hear this song and maybe it will help them, too.’ And I really like that idea: I like the idea of writing songs that have a little moral imperative to them.”\n\nSome would call that a sense of purpose. Or, as Hubbard put it best to Plankenhorn way back at the start of his journey, “There’s your proof.”", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Code Orange LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10370124.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hardcore", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "down we go... our new album ‘U N D E R N E A T H’ is out 3/13. pre-order/pre-save at https://codeorange.lnk.to/underneath. title track available to watch and stream everywhere now.", "otherInfo": "YOU AND YOU ALONE 004\nv i r t u a l p e r f o r m a n c e: joe + mudman in the\ncold.metal.place"}, {"Address": [-122.23, 37.732], "Artist": "The Dryes LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9957553.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alt-country, Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The first time the public got a taste of country duo The Dryes was in May 2018. The EP “Vol. I” was recorded at the famed Blackbird Studios in Nashville, a town the North Carolina natives now call home. Their first single “Amen” garnered a Rolling Stone Country mention in the \"Top 10 Best Country Songs of the week\" during it's release, and CMT covered a spotlight on their music video for their single \"War.\" “War” is a song with a vulnerable backstory and was released alongside a breathtaking music video. CMT shared their thoughts on the single when they ran the video, saying “...this duo sings of a love worth fighting for in their latest single ‘War’.” Love finds a way...Sometimes in footage that has been asleep for thirty years. \"If it's love then it's War / it’s worth fighting for.”\n\nThen comes “Marley.\" Co-written with Shane Stevens (Lady Antebellum’s “American Honey”), Katelyn states: “We wrote this outside on the porch surrounded by palm trees, so you’ll hear a lot of fun references to the scenery of Palm Desert, California. The music video totally captured this vibe as well!”\n\n“Take You Dancin’” is their newest jam, which paints a picture of the ultimate dive bar. Highlighted by Billboard: “The Dryes kick things up a notch in its infectious new single ‘Take You Dancin’’…the feel-good tune has Derek and Katelyn Drye sharing harmonies on the foot-stomping number.”", "otherInfo": "Join us with your favorite quarantine drink and we'll bring the songs!\n\nDonations welcome:\nhttps://l.instagram.com/?u=http://linktr.ee/TheDryes&e=ATMENQsrTwdSxNysuPt2MlHUNccHGUupPfhDSaFEg0GdrWFQFhVwQwd53YaD1Pd2Dkn6RlfncuR3PKNXtzPinSjg2omU50q9&s=1"}, {"Address": [-122.23, 37.732], "Artist": "Laine Hardy LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9391857.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Lily Detaeye Music LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9195887.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk Singer-songwriter, Alternative Folk, Indie Rock, Folk Rock, Blues-rock", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Des Moines raised.\n\nHarmonica wielding.\n\nSongstress.\n\nPeanut butter addict.", "otherInfo": "Lily DeTaeye streams live from Wells Fargo Arena Instagram and Facebook Pages."}, {"Address": [-122.23, 37.732], "Artist": "Toronzo Cannon LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10370942.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Soul-blues, Blues-rock, Blues", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Chicago bluesman Toronzo Cannon defies all expectations. The blistering guitarist, soulful vocalist, singular songwriter and city bus driver fuses his muscular, rock-inspired blues guitar playing with his original, keenly detailed slice-of-life songs, blazing his own blues trail. With the 2016 release of his Alligator Records debut, The Chicago Way, Cannon burst onto the international stage as one the most electrifying bluesmen to emerge from Chicago in decades. His live performances unfailingly earn him heaps of critical praise and hordes of wildly enthusiastic fans. Cannon has played major cities all over the U.S., Canada, and Europe. He recently performed for the first time in Japan, delighting and surprising audiences with one unforgettable gig after another. Now, with the release of The Preacher, The Politician Or The Pimp, Cannon builds upon the foundation he’s laid, creating and defining his vision of contemporary blues.\n\nThe Preacher, The Politician Or The Pimp features twelve Cannon originals, ranging from the burning social commentary of the title track to the wryly told, up-to-the-minute truths of Insurance to the trademark Cannon humor of Stop Me When I’m Lying and Ordinary Woman. He gets serious on the haunting The First 24, the Martin Luther King-inspired The Silence Of My Friends and on the moving final track, I’m Not Scared. Cannon’s blazing guitar and soul-baring vocals are front and center. His songwriting is inspired by his deep Chicago roots, the wisdom of his grandparents and his years of observing the public while driving a bus. His songs tell timeless stories of common experiences in uncommon ways.\n\n“It’s not about the solos,” Cannon says, “It’s about the songs. People get used to everyday life, so it’s easy to miss the things around them. I write about those things. I know the problems of Chicago, the hardship, 'cause we’re always a scapegoat. But I choose to love and respect the city because of the Chicago blues giants that came here from down south. I’m proud to be standing on the shoulders of every great Chicago blues musician who came before me.”\n\nToronzo Cannon was born in the Windy City on February 14, 1968, and grew up in the shadows of the notoriously tough Robert Taylor Homes. Theresa’s Lounge, one of the city’s most famous South Side blues clubs, was nearby. As a child, Cannon would stand on the sidewalk outside the door, soaking up the live blues pouring out while trying to sneak a glance inside at larger-than-life bluesmen like Junior Wells and Buddy Guy. He also heard plenty of blues growing up in his grandfather’s home, and listened to soul, R&B and contemporary rock on the radio.\n\nCannon bought his first guitar at age 22, and his natural talent enabled him to quickly master the instrument. Although his initial focus was reggae, he found himself increasingly drawn to the blues. “It was dormant in me. But when I started playing the blues, I found my voice and the blues came pouring out.” He absorbed sounds, styles and licks from Buddy Guy, Albert Collins, Hound Dog Taylor, B.B. King, Albert King, Freddie King, Jimi Hendrix, J.B. Hutto, Lil’ Ed and others. Although influenced by many, Cannon’s biting, stinging guitar sound is all his own.\n\nCannon began his rise in the intensely competitive proving ground of the local club scene, where only the best musicians reach the top. Iconic blues artists from Muddy Waters to Howlin’ Wolf to Koko Taylor to Hound Dog Taylor to Luther Allison all paid their dues in the Chicago blues bars before making their mark on the world. The same holds true today, as newcomers look to living legends like Buddy Guy, Jimmy Johnson and Lil’ Ed Williams for inspiration in taking their music from Chicago to fans across the globe.\n\nFrom 1996 through 2002, Cannon played as a sideman for Tommy McCracken, Wayne Baker Brooks, L.V. Banks and Joanna Connor. But he was determined to prove himself. In 2001, while continuing to work as a hired-gun guitarist, he formed his own band, The Cannonball Express. By 2003, he was working exclusively as a band leader. Cannon’s first three albums—2007’s My Woman (self-released), 2011’s Leaving Mood (Delmark) and 2013’s Blues Music Award-nominated John The Conqueror Root (Delmark)—document his rise from promising up-and-comer to star-in-the-making.\n\nAlmost immediately upon the release of The Chicago Way, Chicago media helped launch Cannon toward blues stardom. He was the subject of multiple newspaper and magazine feature stories and appeared on every local television station. National and international media soon took notice. CNN filmed Cannon leading a tour of Chicago blues clubs and then broadcast the piece around the world. England’s MOJO magazine declared The Chicago Way the #1 Blues Album Of 2016, as did the readers of Living Blues magazine in their annual poll. The album and Cannon were also nominated for four Blues Music Awards (the Grammy of the blues) in 2017. And the world champion Chicago Cubs invited Cannon to throw out the ceremonial first pitch of the September 13, 2017 game. All the attention only makes Cannon more focused. “I feel like I’ve become an ambassador for Chicago blues. People expect a lot from me,” he says. “But it’s good, because I’m forced to keep upping my game.”\n\nCannon has played the Chicago Blues Festival on ten separate occasions, initially as a sideman, then as a special guest, a sidestage band leader and finally as a main stage headliner. When he’s home, he drives a Chicago Transit Authority bus by day and performs by night. Using every vacation day and day off and working four ten-hour shifts a week, Cannon arranges his schedule to gig out of town as much as possible. It isn’t easy, but, like all of the Chicago greats who have come before him, blues is his calling. Blues Music Magazine declares, “His guitar playing has all the fire and spontaneity of the Chicago legends he carries; his songwriting is a timely and original look at the world he sees by day on a bus and in blues clubs by night, and his assertive voice is the perfect vehicle to deliver the message.”\n\nNow, with The Preacher, The Politician Or The Pimp, Toronzo Cannon delivers his messages loud and clear. Between his searing chops, soul-satisfying vocals and vibrant and distinctive original songs, Cannon has grown from being a local attraction to become a world-renowned torch bearer for the blues. PBS Television’s Chicago Tonight sums it up like this: “Cannon is just your typical CTA bus driver who moonlights as a sought-after Chicago blues musician. As a guitarist, singer and songwriter, he drives the sound of Chicago blues from the city to blues clubs and festivals around the world.”", "otherInfo": "▪️ABOUT THE SERIES\n\"All Dressed Up & Nowhere to Show\" is a virtual concert series presented by SPACE. Since our listening room is closed for the foreseeable future, we’ve asked past SPACE performers to stream a few songs from their living rooms and share them LIVE to our Facebook page, Evanston SPACE.\n\n▪️TIP THE BAND AND OUR STAFF\nWhile streaming itself is free, a suggested donation of $5 is encouraged by visiting the following link: http://bit.ly/spacevirtualtip. Donations made during the stream are shared between SPACE and the featured artists. You can also donate at anytime to our employee fundraiser via our GoFundMe page: gofundme.com/f/evanston-space-staff-fundraiser\n\n▪️HOW TO TUNE IN (2 ways)\n(1) Visit https://facebook.com/evanstonspace/live or look for the red \"LIVE\" button on the lefthand navigation of our Facebook page.\n\n(2) RSVP on this event to be notified when artists go live our page. We'll post the live link in the discussion so you can easily tune in. Please note: this may be 1-2 minutes after the livestream starts\n\nWe miss you all and look forward to reopening our doors when the time is right. Until then, the show MUST go on!"}, {"Address": [-122.23, 37.732], "Artist": "Song Suffragettes LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9288379.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "country music, female singer-songwriter night every Monday night at 6pm at The Listening Room Cafe", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Ross Ellis LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8794749.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Ross Ellis was born and raised in the small town of Monterey, Louisiana (pop 439). At the age of 15 he started the band, “Wayside” with his cousin and some high school friends. The band gained a solid following and toured through Ross’ college years. After graduation, Ross solid a motorcycle that his father had given him to move to Nashville. After less than a year of working part time jobs and writing in the evenings, Ross caught the attention of BMI’s Bradley Collins. Shortly afterwards, Ross signed to Big Deal Music. While pursuing his own artistry, Ross has had songs recorded by others including Tim McGraw, Tyler Farr, Boy named Banjo, Jordan Rager, and others. When he’s not in the writing room, Ross will be on the road in 2018 opening for Brett Young, Scott McCreery, Chase Rice, Drew Baldridge, and more. Ross is booked by William Morris Endeavor Entertainment, managed by Triple 8 Management, is a Spotify New Boots alum, and a SiriusXM The Highway’s ‘Highways Finds”.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Edwin McCain LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/6798871.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Singer, Songwriter, Folk, Rock", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Edwin McCain (born January 20, 1970 in Greenville, South Carolina) is an alternative and indie rock guitar player. While his albums are released under his name, he does have a permanent band, referred to as the Edwin McCain Band. Members of the band as of 2007 include Larry Chaney, lead guitar; Pete Riley, rhythm guitar and background vocals; Craig Shields, saxophone and keyboards; Manny Yames, bass guitar; and Peter Alexander, drums.\n\nAfter signing a contract with the Atlantic Records label Lava Records in 1994, his first major-label album, Honor Among Thieves, was issued in 1995. His second album, Misguided Roses, spawned I'll Be, a major single in 1998. Two more albums (Messenger and Far From Over) followed, but at the end of 2001, he split from Lava. In 2003 he released a collection of acoustic versions of songs both old and new called The Austin Sessions via ATC Records, a Nashville-based independent record label (at which McCain was the first artist signed following its creation in 2001). Mid-2004 saw the arrival of his first studio album in three years, entitled Scream & Whisper, which was released on another indie label, DRT Entertainment.\n\nHe has released two DVDs to date. The first was through ATC records in late 2002, called Mile Marker: Songs and Stories from the Acoustic Highway, and it consisted of interviews, live performances, and other material. The other was in late 2004, Tinsel & Tap Shoes. It was his first live concert DVD, recorded at The House of Blues in Myrtle Beach, South Carolina.\n\nA new CD was released in April, 2006 titled, Lost in America. Edwin recently signed a contract with Vanguard Records. This album (#8) is said to be a true \"rock 'n roll\" collection.\n\nProfile photo by ASHLittle.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Laine Hardy LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9391857.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Islander LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10311423.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Punk, Alternative Metal, Experimental Punk, Metal, Trap", "Time": "12:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "It has been quite a journey for ISLANDER, who, in just over a year, have gone from obscurity to a band in constant radio rotation. Fueled with a combination of emotionally capturing songs and audience grabbing live shows, ISLANDER continue to lead at the forefront of their peers.\n\nISLANDER have stayed busy, constantly touring with artists such as Korn, Stone Sour, Papa Roach, P.O.D., Suicide Silence, Seether, Babymetal, Yelawolf, Nothing More and many others. Catch their energetic live show in a city near you!\n\n\"These guys just might be the new force in heavy rock\"\n- Alternative Press\n\n“New school band with old school soul and passion. Keep your eyes and ears open for these guys!” – Sonny Sandoval of P.O.D\n\n“Creativity gets an A+.” – H.R. of BAD BRAINS", "otherInfo": "Live Stream: https://www.instagram.com/islander"}, {"Address": [-122.23, 37.732], "Artist": "Sara Evans LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10276459.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "12:30 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Multi-platinum entertainer SARA EVANS is at the top of her game. As the fifth most-played female artist at country radio in nearly the last two decades with five No. 1 singles including “No Place That Far,” “Suds In The Bucket, “A Real Fine Place To Start,” “Born to Fly,” and “A Little Bit Stronger,” which spent 2 weeks in the top spot and was certified platinum by the R.I.A.A., Sara thrills audiences across the U.S. playing close to 100 shows each year and in 2018 headlined the “CMT Next Women of Country Tour.” Her “stunning, country voice” (Rolling Stone) has earned her the prestigious Academy of Country Music Top Female vocalist accolade as well as numerous American Music Awards, Billboard Music Awards, Country Music Association, CMT and Grammy Awards nominations. In addition, the CMA awarded Video of the Year honors for her hit chart-topping single, \"Born to Fly\" from her double-platinum album of the same name. Evans’ discography also includes the platinum-selling studio albums Real Fine Place and Restless as well as the gold-certified projects Stronger and No Place That Far.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "JD Eicher LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10081879.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Indie Pop, Acoustic, Pop, Indie Rock, Singer Songwriter, Folk Rock, Rock, Indie, Alternative", "Time": "12:30 AM UTC", "Venue": "Live Stream", "moreBioInfo": "JD Eicher is a Youngstown, OH-area born and bred musician known for soaring, cinematic vocals and meaningful, well-crafted lyrics. He possesses “an original voice, both literally and figuratively. With a lyrical talent culled from the great tradition of American singer/songwriters, Eicher also brings the melodic sensibility of great British songwriters such as Paul McCartney and Elvis Costello.\" (Wildy's World)\n\nWith four full-length albums to his credit, JD was enlisted in 2016 to create the soundtrack to author Nicholas Sparks’s (The Notebook, A Walk To Remember) 20th novel, Two By Two. The now stand-alone release consists of songs sourced from his previous albums, along with the title track, written specifically for the novel and its themes.\n\nAn artist who tours extensively in the US, Eicher also founded the Youngstown, OH-based JD’s Summer Songfest festival in 2014, which showcases national and local artists and raises money for a variety of community non-profits. He has shared billing with a wide range of well-known acts, including Coldplay, Maroon 5, Train, Dave Matthews Band, The Fray, Matt Nathanson, Sister Hazel, and more.", "otherInfo": "JDTV - Season Two\nJD Eicher livestream concert on Facebook Live"}, {"Address": [-122.23, 37.732], "Artist": "Spencer MacKenzie LIVE", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "DJ MADDØG LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10282312.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Electro House, Techno, Electronic, House", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "MADDØG has shared lineups with such artists as Ke$ha, Betty Who, Big Freedia, Matt & Kim, Girl Talk, and Big Dipper to name a few. She has also worked with many contestants from Ru Paul's Drag Race and the international drag circuit.\n\nMADDØG produces and performs music that she hopes inspires others while proving that women have a creative place in electronic music.", "otherInfo": "Records & Chill with DJ MADDØG 9-10PM ET\n\nNo Cover. No Dress Code. No Guest List. No VIP Rooms. No Club Politics. No Overblown Egos.\n\n>> twitch.tv/djmaddogtrue\n\n**you do not need a Twitch account to view the streams but you do if you wish to participate in the chat**"}, {"Address": [-122.23, 37.732], "Artist": "Sara Melson LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9887706.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Dream Pop, Country, Alt-country, Pop, Electronic Rock, Adult Alternative, Psychedelic Pop, Cosmic-country, Adult Contemporary, Folk, Americana", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "SARA MELSON // WILD & PRECIOUS LIFE\n\nL.A.-based indie/folk-pop artist Sara Melson captivates with a unique and singular voice that cracks with vulnerability and pierces with clarity on her forthcoming EP, Wild & Precious Life. Sara has previously been featured at Variety, Huffington Post, Yahoo! Music, PopMatters, Magnet Magazine, the homepage of Apple Music, and more. She’s appeared in numerous films and TV shows, including The Wonder Years and Frasier, while her songs have been featured in Grey’s Anatomy and in a national Chevy campaign. Sara has shared the stage with Ben Folds, Juliana Hatfield, Ben Lee, Inara George, Neil Halstead, and Lissie, and provided backing vocals for Moby on The Tonight Show and for The Dandy Warhols and Mojave 3 on KCRW’s Morning Becomes Eclectic.\n\nWild & Precious Life was co-produced by Melson, multi-instrumentalist/guitarist Danny Hechter (Badflower, Jordan McGraw) and Rick Parker (Lord Huron, Joseph Arthur, BRMC, Jeremy & The Harlequins). Hechter brought in bassists Sean Sobash (Dominic Fike) and Nick Diiorio (Jordan McGraw), drummer Jonas Streffer, second guitarist Jake Faun, and violinist Koi Anunta (Jules Galli). Violinist Kerenza Peacock (Adele) also added to the recordings, with additional production and remixing by Eric Breiner of PeachMusicLA.\n\nWritten and performed on piano and guitar, Sara’s songs reflect on hard-won lessons and her tireless journey toward self-acceptance. “It’s high time I learn to love myself before I’m dead,” she sings in the soulful and heartfelt “Coming Out” — a defiant, weary, and yet serene “I-don’t-give-a-f-ck” anthem for anyone who is ready to shed the mask and step fully into one’s authentic self. “State of Ease,\" written in deep meditation, is a prayer for transcendence — the quest to maintain a state of equanimity in the face of life’s challenges. “No one can escape pain, physical or emotional,” she explains. “It’s about how we choose to react.” Ethereal and swelling vocals, haunting piano, and swirling guitar lines evoke the bliss of flight, peace and surrender. “Same River”, inspired by the quote from Greek philosopher Heraclitus, No man ever steps in the same river twice, for it's not the same river, and he's not the same man, is a reminder that the only constant is change -- in the fleeting, morphing moment.\n\nWith classical training at the age of eight, Sara began to gravitate toward the melancholy darkness of Chopin and the fanciful romanticism of Debussy. The daughter of two professors, she grew up in an intellectual Jewish household in a small college town in Indiana. Surrounded by cows and cornfields, her parents’ home was an oasis of culture and worldliness, with books lining the shelves from floor to ceiling, and the best record collection in the neighborhood.\n\nShe graduated from Harvard with an English degree and initially moved out West to become an actor. However, after one too many traumatizing “#MeToo” encounters, Sara went “on strike,” as she puts it. “I just refused to go out on any more meetings or auditions. I lived on residuals for a while and spent all day playing guitar and piano, and writing songs. That was when I decided I was going to take that turn from the acting into music. It’s not like that stuff doesn’t exist in the music industry, because it does; but at least you have creative control. You can stand behind a finished product — your song — and not have to rely solely on what you look like, or your perceived value, or lack thereof, as a sexual object.”\n\nAfter a brief marriage to Justin Webb, son of famed songwriter Jimmy Webb, the loss of a pregnancy at five months, and an ensuing divorce, Sara struggled with depression, and turned to yoga for salvation, developing a serious daily practice that began to inform her songwriting with new revelations about surrender, acceptance, growth and change. It also slowed her anxious breath to a fluid wave. “Yoga is like peeling an onion, gradually removing layers that cover up your true essence. There may be some tears in the process, but it’s delicious, good for you, and worth it.”\n\nThe EP reflects Sara’s spiritual seeking, a deep understanding of her own mortality, and an urgency to make the most of life while she’s here. “Walk Softly” is a plaintive letter of life instructions, penned to herself, invoking the perspective of her older, wiser self advising its younger, more distracted and insecure counterpart: “Please be gentle, please be kind; you can’t read anybody’s mind. You don’t know what they’re going through. So don’t be quick to your defense, ‘cause we all hide behind pretense; and it’s got nothing to do with you.\" Title track “Wild & Precious Life” inspired by the line in the Mary Oliver poem, The Summer Day (“Tell me, What is it you plan to do with your one wild and precious life?”) is a rousing, anthemic call to fulfill one’s full potential, despite the naysayers.\n\nSara will tour in support of the new EP, both solo and with a stripped-down version of her beloved band. She muses that, just as one can never step into the same river twice, her shows take on different forms. “There is a power in connecting one-on-one with an audience that is its own special magic,” Sara says. “Hearing my songs come to life around me with a full band is euphoric. They’re two different experiences, both for me and for the audience, and I live for both.”", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Aaron Goodvin LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/2999240.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Aaron Goodvin’s new Warner Music Canada / Reviver Records release — V — is available now. The Canadian Country Music Association Award winner already has three Top 10 hits under his belt as an artist, along with his first #1 in Canada, “You Are.” Aaron Goodvin boasts an impressive songwriting track record, with songs recorded by country music stars like Luke Bryan, Jon Pardi, and Cole Swindell, and is currently touring the U.S. promoting the single “Bars & Churches.”\n\nAfter appearing as a writer on Luke Bryan’s multi-platinum selling album, Crash My Party, Aaron’s star power continued to rise. His self-titled Warner Music Canada debut featured three Top 10 singles including the smash hit “Lonely Drum.” The track has the honorable distinction of being the only Canadian country single released in the past two years to be certified Platinum. In both 2017 and 2018, Aaron was nominated for CCMA awards, winning the 2018 Songwriter of the Year award for “Lonely Drum.”", "otherInfo": "Facebook streaming link:\nhttps://www.facebook.com/thebootcountry\n\nInstagram streaming link:\nhttps://www.instagram.com/theboot_dotcom"}, {"Address": [-122.23, 37.732], "Artist": "Stoney LaRue LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8495832.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "“I like to connect with people at any age, whatever it might be sonically or to the depth of what they are willing to think. I like to think, and I like people to think and that often generates a connection that can be nurtured,” says Stoney LaRue. As he prepares the release of Us Time, LaRue reflects on this important connection he has fostered with his fans over his 15-plus years of touring. Together, LaRue and his fans have culled together a “favorite live song set” that is dedicated to his loyal and growing fan base. LaRue is known for his real life, thinking man’s music.\n\nUS TIME is a collection of songs from the native Texan who now resides in Oklahoma reflecting on his own dreams that openly shares with his longtime fans. “This project is a tribute to my fans. We have developed a strong relationship and I appreciate all of them,” says LaRue. “ Together, we have built a compilation of fan favorites from the live shows that reflect the complexion of our time together in music, it is simply our US Time, “ he continues. This sentiment rings even louderafter LaRue took a hiatus from touring this summer to re-center his life that seemed to be lost.\n\nLaRue says, “Being able to record such timeless songs as “Empty Glass,” “Into the Mystic” and “Wichita Lineman” aside some of original tunes, all selected by my fans make me feel validated as an artist and hopefully it gives the fans exactly what they are looking for.”\n\nBeing able to connect with fans the way we can today is mind blowing to LaRue. When this journey started over 15 years ago, communication was restricted mainly to the stage, written letters and before show meet and greets. Today’s instant social media connection is what helped generate this collection of songs. “I just kept a list of songs that fans would either request via Twitter and Facebook or yell to me on stage,” says LaRue. “Us Time is a very collaborative effort with them. Also, having RS Fields as the producer on this project was a good call. This is our first time working together and he totally nailed the production and we totally were in sync on how it should sound. I am very happy with the end result, it feels live and it feels real, and that is what music is all about,” he continued.\n\nIndependently charged, LaRue has sold over 300,000 records over his career and plays 200-plus shows a year. His songs have seen the top of the charts, most recently his hit “Golden Shackles” from his eOne Music debut, Aviator, in 2014.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Mark Wills LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10316169.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The Reader’s Digest version of Mark Wills’ story makes it clear he’s an award-winning singer’s singer. His matchless phrasing, passionate and meaningful delivery and right-on-the money vocals make each and every song he performs come alive. Like a picture perfect painting, Wills’ music is a vocal work of art that walks right off the canvas and into the hearts of country music lovers alike.\n\nBringing the Wills’ dimension to some of the greatest songs ever written, he’s not necessarily become known for being trendy, hip or even on the cutting edge, but rather and simply as a damn good singer!\n\n“I think I’m a good storyteller to make a son g meaningful. Whether romantic or ‘reality,’ my focus is on the music delivery to make it my own for the people who listen—so that they can make it their own.”\n\nAnd the people listen...\n\nHis list of accolades is his testament. Mark Wills is a multi-platinum selling country music star with eight top 10 hits to his name including “19 Something,” “Wish You Were Here” and “Don’t Laugh At Me;” all of which received nominations for Single, Song and Video of the Year by the Country Music Association. Wills won the Academy of Country\nMusic's award for Top New Male Vocalist in 1998. In 2002, his single “19 Something” spent six consecutive weeks at No. 1, was Billboard’s top country hit of the year and was the second most-played song of the decade in 2009.\n\n…and that’s just a chapter in Mark Wills’ life story.\n\nSince garnering his Top New Male Vocalist recognition in 1998, Wills has become a staple in country music, like salt and pepper on a table; the chapters may have changed, but the story continues. The father of two daughters, a husband and the head of household, Mark’s role in life and music are one in the same.\n\n“I think I’m at a point where I’ve seen all sides of me! I’ve become more aware of who I am not only as an artist, but as a father, a husband and a friend…and as a dad, I want to put out music my children can listen to; all in all, I take more ownership in it.”\n\nHis ownership is made evident in his newest collection of recordings on the CD entitled LOOKING FOR AMERICA; an assortment of tunes Mark describes as different, yet the same.\n\nLOOKING FOR AMERICA is a project with no ‘sacrifices.’ With titles like “Smoking Gun,” “Where Did I Lose You,” “A Whole World” and “Rocking The Country,” the tracks are not just about a rhyme and a hook, they’re a menagerie of people-stories--a musical exhibition of heart-heavy, romantic, comedic all-American existence with apple pie flavor. Describing the hue of the music, Wills colors his music “dark blue.”\n\n“I’m a man of many personalities with a lot that I want to say. There’s a fun, down-home side of me, and then there’s an emotional, serious side. I think LOOKING FOR AMERICA, topically, is a human interest story of love, tragedy and life’s unexpected.”\n\nAnyone who has ever seen him in concert, or has met with him personally, knows that inside this humble, good ol' boy, country singer dwells a soul who just wants to speak to and for all with his music. LOOKING FOR AMERICA delivers music with a no-holds-barred edge softened with a trademarked tenor vocal that will capture the attention of music lovers from every genre from first cut to last.\n\nLOOKING FOR AMERICA clearly raises the flag to demonstrate the responsibility he feels to Americans alike, and specifically our military, with the title cut and “Crazy Being Home.”\n\nWills has made more seven trips to entertain our troops; he is familiar with the places they’ve been. His trips have taken him to Iraq, Afghanistan and Kuwait. He has also performed at several events for the Champions for Champions Organization, the USO\nand a variety of Fallen Soldier Charities here in the U.S. Having become personally acquainted with the faces of our brothers and sisters of the military, LOOKING FOR AMERICA is dedicated in part to these brave individuals.\n\n\"First of all, it's a privilege to provide a little joy and entertainment for these people. The first time I went, it was a life-changing experience. The freedom that we have is not something that I take for granted--they're literally giving their lives for us. By playing a show for them or releasing a song that shares their emotional story, it’s my way, however minimal, to say ‘Thank You.’”\n\nSupporting our troops is just one of a number of philanthropic endeavors Mark Wills dedicates his time and effort to. He has aligned with USA Cares to launch a national awareness campaign surrounding the severity of Post Traumatic Stress Disorder (PTSD) and Traumatic Brain Injury (TBI). Since 2007, Mark has been the\nspokesperson for the Children’s Miracle Network and its annual celebrations.\n\nAs an active representative, he accompanies miracle children to Walt Disney World and then to Washington each year as part of a national awareness campaign; the children enjoy lunch with Congress and a trip to the White House to meet with the President.\n\nTurning the page from bringing all-American music to life to his own brush with death, Wills was caught by surprise by an unexpected, eye-opening crisis. In October 2010, Mark experienced what felt like a “poke” in his side that was followed by flu-like symptoms. A visit to the doctor took him straight to the emergency room. “The nurse said, ‘we have to admit you immediately,’ I said, ‘I need to go home to let the girls know,’ her response to me was, ‘You don’t have the time.” Mark suffered from an intestinal infection that could have taken his life, but he pulled through with a nine-inch long scar to remind him of its value.\n\n“It was a dire circumstance and it gave me a whole new perspective in all aspects of my life.”\n\nA man whose appetite for life surpasses what most people can only dream of – a dedicated parent, philanthropist, outdoorsman, jokester – but, more than anything, else Mark Wills is an artist and, behind the artist, is an even better singer.\n\n“When the story comes to ‘The End,’ I just want to be remembered as a great singer - who sang great songs – and used his talents to not only speak to people but was the voice for many.”", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "AHI LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/6472095.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alternative, Alt-folk, Indie Soul, R&b, Soul, R&b/soul, Indie, Rnb-soul", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "With a voice like “gravel on silk”, indie-soul/alt-folk songwriter AHI (pronounced “eye”) is a rare talent with the keen ability to deliver a story with the ease and familiarity of an old friend. Favouring passion over precision, it's easy to see why comparisons to Richie Havens, Ray LaMontagne and Tracy Chapman are common for this soulful troubadour. From humble beginnings in Brampton, Ontario, AHI independently toured over 100,000 miles, through the vast woodlands of Canada and the neon lights of Nashville, to the Guggenheim Museum in New York, and eventually beyond the Atlantic to the brick lanes of London. Along the way, he has recorded with leading acoustic sessions across the UK and Europe, but none has been more viewed than a simple home video of his stunning rendition of Bob Marley’s ‘No Woman No Cry’, filmed in a London alleyway and accompanied by the sweet harmonies of his three-year-old daughter. The video caught the attention of the Marley family who featured it on the official BobMarley.com website and sent AHI a personalized note from Mrs. Rita Marley herself – an unparalleled experience for an artist who cites Bob Marley as his greatest musical inspiration. Soon after, AHI returned to find his Indie Soul EP (2014) was chosen one of CBC Radio One’s top 10 records of the year, and he has since been recognized and awarded by Folk Alliance International, Nashville Songwriters Association International, the Songwriters Association of Canada, and the Canada Council for the Arts, among others. For his debut full-length We Made It Through The Wreckage (2017), AHI has collaborated with CMA winning producer Eric Masse (Miranda Lambert) to create what Masse has called an entirely \"new genre\", blending folk, soul and rock, and topping it off with a vocal performance to be expected from a seasoned powerhouse rather than an indie debut. The feel-good single Ol' Sweet Day broke the Billboard Spotify Viral 50 Chart and hit #34 on the U.S. Viral 50 without any promotion or marketing. The track took off on playlists worldwide and surpassed 1 million streams; a rare feat for an artist yet to make his mark. Now a 2017 finalist in the Allan Slaight JUNO Master Class, it’s not hard to see why AHI is one of Canada’s most promising emerging acts. Debut album We Made It Through The Wreckage out now! http://ahimusic.com/#!store", "otherInfo": "Live Stream: https://www.facebook.com/AHImusic"}, {"Address": [-122.23, 37.732], "Artist": "Jeremy Messersmith LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10323337.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Singer & Songwriter, Folk", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "The Pied Piper of Wuss Rock\nhttp://www.jeremymessersmith.com\n\nYoutube: http://www.youtube.com/user/jeremymessersmith\n\nBandcamp (Pay What You Want Downloads):\nhttp://jeremymessersmith.bandcamp.com\n\nTwitter: http://twitter.com/jmessersmith\n\nInstagram: http://instagram.com/jeremymessersmith\n\nFor All Business Inquiries: jeremymessersmithmusic@gmail.com", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Grace Potter LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9306175.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Rock", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Pre-order the new album Daylight: http://found.ee/GPDaylight", "otherInfo": "Monday Night Twilight Hour Livestream: https://www.facebook.com/events/243660763650717/?event_time_id=243660773650716"}, {"Address": [-122.23, 37.732], "Artist": "Keller Williams LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10375360.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Keller Williams Solo, Keller Williams with The Travelin' McCourys, Keller with More Than A Little, Keller The Keels, Grateful Grass, The KW KWahtro, WMD's, KIDS and more at www.KellerWilliams.net", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Keep moving! Slow music is for old people.", "otherInfo": "50 minutes of request taking and song slinging Live from Keller's Cellar!"}, {"Address": [-122.23, 37.732], "Artist": "The Land of Deborah LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/8483476.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Singer-songwriter Pop", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "WELCOME TO THE LAND!\n\nThe Land of Deborah is an award-winning singer-songwriter and composer with a unique take on life, love and the pursuit of fair trade chocolate.\n\nBorn and raised in England, Deborah is a trans-national artist who now calls Vancouver, BC home.\n\nShe has been described in the press as “...feel good folk-pop” and as having “...one of the smoothest voices in the city”.\n\nFor video: youtube.com/TheLandofDeborah\nFacebook: facebook.com/TheLandofDeborah\nInstagram: instagram.com/TheLandofDeborah\nFor more info please go to http://thelandofdeborah.com/bio", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Metallica LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/6874519.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Metal, Thrash Metal", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Metallica is a heavy metal band formed in Los Angeles, California, in 1981 by drummer and former tennis prodigy Lars Ulrich and guitarist and vocalist James Hetfield.\n\nThe band was part of the revolutionary \"Bay Area\" sound, similar to bands like Megadeth, Anthrax, Testament, and Slayer, forming the genre which is known as thrash metal. Their big commercial breakthrough came with their fifth album \"Metallica\", also known as the Black Album. They've been a huge influence for plenty of new metal bands.\n\nOn October 28th 1981, drummer Lars Ulrich made guitarist/vocalist James Hetfield an offer he couldn't refuse: \"I’ve got a track saved for my band on Brian Slagel's new Metal Blade label.\"\n\nIn fact, Lars didn't have a band at that time, but he did when James joined him. The two recorded their first track on a cheap recorder with James performing singing, rhythm guitar and bass guitar duties. Lars dutifully pounded the drums, helped with musical arrangements and acted as manager. Hetfield's friend and housemate Ron McGovney was eventually talked into taking up bass and Dave Mustaine took lead guitar.\n\nThe band adopted the name Metallica after a suggestion from Bay Area friend Ron Quintana, and they quickly began gigging in the Los Angeles area opening for bands like Saxon. Eventually recording a fully-fledged demo called No Life Til Leather, Metallica quickly saw the tape whistle around the metal tape-trading underground and become a hot commodity, with San Francisco and New York particularly receptive.\n\nMetallica performed two shows in San Francisco and found the crowds friendlier and more honest than LA's \"there to be seen\" mob. They also caught up-and-coming band Trauma, and most importantly their bass player, Cliff Burton. Cliff refused to move to Southern California: it was enough to convince Metallica to relocate to the Bay Area, and Cliff subsequently joined Metallica.\n\nIn New York, a copy of No Life Til Leather made its way to Jon Zazula's record shop, the aptly named Metal Heaven. Zazula quickly recruited Metallica to come out east to play some shows and record an album. The band made it to New York in a stolen U-Haul. Dave Mustaine, at that point the band's guitarist, was proving to be more problematic than even these loose young chaps could handle. Thus Mustaine was kicked out due to his drug and alcohol abuse (then going on to form the successful Megadeth), with roadie Mark Whitakker suggesting Kirk Hammett from Bay Area thrashers Exodus. Two phone calls and one flight later, on April 1, 1983 Kirk Hammett joined Metallica.\n\nMetallica's first album, Kill 'Em All, was released in late 1983 and some ferocious touring which saw the band's reputation soar both in the US and Europe. In 1984 they went to work with producer Flemming Rassmussen in Copenhagen at Sweet Silence Studios on their second album. 'Ride The Lightning' proved that Metallica were not some thrash-in-the-pan one trick pony, the writing and sound illustrating a growth, maturity and intensity which saw them immediately targeted by major management in QPrime, and a major label in Elektra. Both deals were done by the fall of '84 and their reputation continued to grow worldwide.\n\nReturning to the same studios in 1985, the group recorded 'Master Of Puppets', mixing in LA with Michael Wagner and releasing in early 1986. They quickly secured a tour with Ozzy Osbourne, and that stint (plus a top 30 album chart position) saw their fan base and name take a quantum leap. What had seemed so unlikely was nearer than ever to coming true; world domination.\n\nOn September 27th, 1986, that dream was given the most shattering of blows. Somewhere in Sweden on an overnight drive, the bands' tour bus skidded out of control and flipped, killing Cliff Burton. His influence on the musical growth of the band was enormous. Burton combined the DIY philosophies of jamming and experimenting with an acute knowledge of musical theory, and Hetfield in particular found a lot in his playing and personality. It was impossible to imagine Metallica without him. Yet Cliff would equally not have cared for people throwing in the towel because he wasn't around. And so it was that after a brief yet intense mourning period, Lars, James and Kirk decided to fight on. Jason Newsted was chosen from over 40 auditions to be the new bassist, the Michigan-born four-stringer leaving Arizona based Flotsam & Jetsam to take on the chance of a lifetime. The quartet immediately jumped into a tour, and then quickly recorded an EP of cover tunes titled Garage Days Re-Revisited (the band literally did the dirty work in Lars' garage!).\n\nWith Jason fully established, the band went back to record their fourth full-length album, ...And Justice For All, released in August 1988. The explosion that had been threatening for sometime finally happened. It reached #6 on the US charts, received a Grammy nomination for Best Metal/Hard Rock album, the band blew headliners Van Halen off-stage during the Monsters Of Rock tour and subsequently embarked upon an enormous worldwide tour. It was even the moment they finally delved into video territory, although the footage for 'One' was most certainly the most 'anti' video of it's era.\n\nThe band took the show back out on the road and toured extensively to all parts of the world. ...And Justice For All produced two US singles and the band's very first venture into music video for the song One.\n\nIn 1991 Metallica released the self-titled album, and saw their popularity soar to stratospheric heights. With new producer Bob Rock, this album was a subtle departure from the previous album with shorter songs, a fuller sound and simpler arrangements. It went straight to number one all over the world, stayed there for several weeks and ended up selling in excess of 15 million copies worldwide, spawned several legitimate singles as well as earning a Grammy and MTV/ American Music Awards. The band toured for close to three years, playing a solo arena tour in 'An Evening With Metallica', with Guns N' Roses on the duos' joint-headline stadium tour, and as headliner at many festivals. It meant that by the time the fall of 1993 rolled around, the four members were shattered both physically and mentally. Save for some Summer Shed action, there was little major activity as the band allowed their real lives to catch up with their rock lives.\n\nNearly four years would pass before the next Metallica album saw the light. Called Load, and recorded at The Plant in Sausalito California, it was the longest Metallica album to date with 14 songs, and signaled some significant changes for the band. Produced by Bob Rock, the material was loose, powerful and eclectic, the sound thick and punchy and the image one which screamed out change and freedom from enslavement to the Black album era. So many songs came from the sessions, that a second album titled ReLoad, followed in 1997. The Load tour was spectacular, encompassing cutting-edge technology, stuntmen, two-stages and an epic two-plus hours of performance. What ever doubts people might have had were swiftly blown away, and whilst Load could never match the heights of the Black album sales wise, it became a phenomenally successful album in it's own right.\n\nIn 1998, they re-packaged all the old B-sides, covers and the two previous Garage Days sessions and ran into The Plant to slam down 11 new covers. Electric, exciting and raw, the double-disc Garage Inc. was great reminder that for all the success, Metallica's heart still lay in the music. This point was further proven in 1999, when with conductor/composer Michael Kamen, Metallica embarked upon collaboration with the San Francisco Symphony to bring new dimension to classic material. Any potential skepticism of the project was blown away by two nights in April at the Berkeley Community Theater which proved to be epic milestones in the group's history. Far from their material being compromised, the arrangements of songs such as 'Master Of Puppets' gave symphonic instruments the chance to explode into the spaces and fill them with greater, heavier power than ever before. Having recorded and filmed the shows on the off-chance it might turn out alright on the night, Metallica released the S&M double-disc and DVD in late '99, marking yet another significant chapter in a Hall Of Fame - like history.\n\nIn the summer of 2000, Metallica took yet fresher steps towards establishing freedom from convention, proving that it was possible to assemble, and headline, your own stadium tour without promoting a record. Summer Sanitarium, Hetfield's back not withstanding, was a huge success, and anticipation grew as to when the band would hit the studio again.\n\nThe anticipation was replaced by fear at the turn of 2001 when, after several rumors, Jason Newsted departed the band. No one reason can be fairly the cause, more several long-standing issues that silently grew beyond their initial molehills. Of course many assumed that this would precipitate the break-up of the band, when of course it merely provided a conduit to newer levels of creativity and understanding.\n\nThe band realized there was much work to be done on both their personal and creative relationships, and spent the first part of 2001 investigating spontaneous avenues of discovery both in and out of the studio. They set up shop at an old ex-Army barracks called The Presidio, jammed together at length and made a decision not to rush the process of finding a new band member, opting instead to have producer Bob Rock do all bass parts.\n\nIn the middle of 2001, James Hetfield reached a place in his life where he felt rehabilitation, rest and re-focus were necessary for him to not only continue but also flourish. It meant that for many months, the members of Metallica embarked upon various levels of deeper discovery about themselves, the band and their lives both as a band and human beings. The results were to manifest themselves two-fold: when they came together again in the Spring of 2002 there was a deeper respect and appreciation for each other than ever before. And they were finally ready to make a new album, free of outside expectations, free of inner expectations and independent of anyone.\n\nSettling into their new HQ, the band set about making 'St Anger' with Bob Rock. Those early Presidio sessions had certainly helped shape the freeform thinking and expression that was to come, but no-one, least of all the guys themselves, could've known just how fierce, raw and passionate the 'St Anger' material would turn out to be. With Rock always offering prompt and support, lyrics were written by everyone, writing was shared and performance was off the cuff, spontaneous and a 180 degree turn from the months of cut-and-paste which had become a part of the Metallirecording process in the past.\n\nIt was in the Fall of 2002 that the band decided it was time to search for a new bassist, and after some closed auditions with personal invitees over a few months, ex-Suicidal Tendencies/Ozzy Osbourne bass player Robert Trujillo was chosen to be the new member of Metallica. Note, member. Not bassist or hired gun or replacement. But a band member. His whole demeanor, happy, relaxed, warm, enthusiastic blended with over 15 years of experience and a ferocious finger-picking style made Robert the only natural choice.\n\nThe “St.Anger” era kicked off on April 30th/May 1st with the small matter of a video shoot at San Quentin prison for the same-titled track, and continued in earnest with an MTV Icons tribute show a week later, where peers such as KoЯn and Limp Bizkit lined up to pay tribute to the chaps. The guys also performed live, marking the first ‘official’ live appearance of Robert Trujillo as well as James Hetfield’s first public performance since his stint in rehab.\n\nThen came the small matter of rehearsals which Metallica chose to do in front of their loyal fan club members over 4 nights at the historic Fillmore Theatre in San Francisco…and then it was off to Europe in June for the start of what would end up being 19 months of touring, with the festival circuit taking the early brunt, Metallica successfully playing to multiple 60,000-plus crowds. “St.Anger” saw it’s release on June 5th, a raw, feral, unrestrained slab of molten Metallica stuffed with abrasion, aggression and the overspill of four years excitement, anger, frustration and ultimate fruition. For those who thought it would signal a radio-hohned band, “St.Anger” was a big, fat slap in the face. Indeed, it was actually too heavy for some! Oh, and as if to prove that this ‘new’ Metallica were not a bunch of ginger-snap panty-waists, the boys played three shows in three different Parisian clubs in one day during mid-June, each venue harboring a temperature of not less than 100 degrees.\n\nIn the US, Summer Sanitarium followed, with Linkin Park and Limp Bizkit amongst the support acts on another series of stadium sell-outs. In the meanwhile, the fervor was slowly building for ‘Some Kind Of Monster’, the documentary film by Joe Berlinger and Bruce Sinofsky about the world of Metallica between 2001 and 2003. Ostensibly slated to be about the making of an album, the filmmakers found a whole new project developing when James went into rehab, and thus having been projected as a marketing tool, the end product ended up being an incredibly revealing 2 hour 20 minute documentary.\n\nAs the Mighty Metallica continued ploughing on through the world (going back to Europe, Japan and then onto Australia in January), SKOM was debuted to enormous critical acclaim at the 2004 Sundance Independent Film Festival in Utah during January.\n\nAnd the year continued in the way that you’d imagine a Metalli-year does, deciding to play (seemingly) every single town capable of hosting a major arena gig in North America (some 80-plus dates) with Godsmack in support. Result? Oh well, the usual sell-outs you’d expect for this ‘in-the-round’ two hour thirty minute set which saw no song off limits and many a fan favorite raised from retirement for a gleeful airing. (p.s….there was another Grammy in February for Best Metal Performance – ‘St.Anger’).\n\nJuly saw the theatrical debut of ‘Some Kind Of Monster’ which opened to enormous critical acclaim and went on to hold it’s own in North American theaters for three months before going through Europe. And August also saw the release of the first official Metallica book, “So What! The Good, the Mad, and the Ugly”, an edited compilation of the band’s fan club magazine spanning 10 years from 1994 to 2004.\n\nAnd still the ‘Madly In Anger With The World’ tour continued, selling out venues right through to it’s final date in San Jose, California on November 29, 2004.\n\nThey did publicly state that the majority of 2005 would be spent re-charging those creative and mental batteries, and true to their word it was a quiet year, except for two little hometown gigs with the Rolling Stones at SBC Park in November. We all knew an entire year would not pass without at least a sighting of the guys!\n\nWith batteries re-charged after the two shows with the Stones, the guys hit the studio in early 2006 to start writing a new album and were excited to announce that they would be working with a new producer, Rick Rubin. The spring and summer found them escaping from the studio once again with shows in South Africa (their first ever visit to the continent!), Europe, Japan and Korea. “The New Song” made its debut in Berlin, Germany on June 6 to give us all a little taste of things to come in 2007 with the remainder of the year scheduled for more writing and jamming.", "otherInfo": "#MetallicaMondays"}, {"Address": [-122.23, 37.732], "Artist": "Sarah Aili Music LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9796222.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Americana Folk Pop", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Singer and Songwriter, Mostly in Nashville, TN sometimes elsewhere.", "otherInfo": "Since we are homebound, I've been making the best of it and playing Facebook Live shows every Monday at 8pm CST! Just head to my Sarah Aili Music Facebook Page and you'll be there!\n\nSZLACHETKA will join me for a few songs as well!\n\nThis is a free show & due to all things public & creative being cancelled at the moment, I truly appreciate your contributions & donations!✌🏽❤️🎶\n\nVenmo: @SarahAili\nPayPal: sarahailimusic@gmail.com (*family & friends/personal payment option)"}, {"Address": [-122.23, 37.732], "Artist": "Aaron Goodvin LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/2999240.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Aaron Goodvin’s new Warner Music Canada / Reviver Records release — V — is available now. The Canadian Country Music Association Award winner already has three Top 10 hits under his belt as an artist, along with his first #1 in Canada, “You Are.” Aaron Goodvin boasts an impressive songwriting track record, with songs recorded by country music stars like Luke Bryan, Jon Pardi, and Cole Swindell, and is currently touring the U.S. promoting the single “Bars & Churches.”\n\nAfter appearing as a writer on Luke Bryan’s multi-platinum selling album, Crash My Party, Aaron’s star power continued to rise. His self-titled Warner Music Canada debut featured three Top 10 singles including the smash hit “Lonely Drum.” The track has the honorable distinction of being the only Canadian country single released in the past two years to be certified Platinum. In both 2017 and 2018, Aaron was nominated for CCMA awards, winning the 2018 Songwriter of the Year award for “Lonely Drum.”", "otherInfo": "Join Aaron Goodvin as he takes over the Facebook and Instgram channels of The Boot for a special 60-minute live stream event!\n\n- Faceook: http://facebook.com/thebootcountry\n- Instagram: http://instgram.com/theboot_dotcom"}, {"Address": [-122.23, 37.732], "Artist": "Ambar Lucid LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10118211.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Sariyah Idan LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10372146.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Hip Hop, World Fusion, Soul", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Jazz and folk trained, hip-hop educated, and influenced by her Jewish roots, Sariyah Idan embodies fiery sensuality rooted in cultural, social and verbal poetry. Following the release of her “Deeper Than Skin EP” and “Not Afraid Mixtape”, Sariyah released her debut LP “Breaking Shadows” in October 2019, recorded at studios in Los Angeles, Berlin, and Lisbon. The album is a 17 track alternative soul project receiving critical acclaim.\n\nA New York bred independent singer-songwriter and multi-instrumentalist, Sariyah grew up touring as a singer and dancer in the world folk ensemble The Vanaver Caravan. Working with the Vanavers and with an international network of experimental theater practitioners through La Mama ETC in NYC, Sariyah was opened to a global awareness. Her music weaves a sonic tapestry of both multicultural urban identity and cultural activism. Her vocals, often compared to Nai Palm and Sade, recently featured on first nations MC Artson’s top charting album “Brave Star”, Dumi RIGHT’s album “Doing It The Right Way”, and DJ Haj i Ji’s EP “Reports Of My Demise”.", "otherInfo": "Sariyah's set is 6pm.\n\nThis is an online festival of Jew-ish artists streaming FB live performances on their profiles which will be linked to the Shemspeed website as festival headquarters.\n\nYou can catch Sariyah's set through her IG and FB directly, and also check out other artists through Shemspeed site.\n\nFB\nhttp://facebook.com/sariyahworld\n\nIG\nhttp://instagram.com/sariyahidan\n\nAll artists are accepting donations in virtual tip jars. Sariyah uses Venmo @Sariyah-Idan & CashApp $SariyahIdan"}, {"Address": [-122.23, 37.732], "Artist": "Beth Bombara LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9052387.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk Rock, Rock, Americana, Blues", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Beth Bombara has a folk singer’s head and a rocker’s heart.\nDrawing inspiration from the melodies and lyrics of Neko Case and Aimee Mann, along with the hooks and harmonies George Harrison and Tom Petty, she has toured nationally as a headliner and supported shows for Pokey LaFarge, Waxahatchee, and Madisen Ward & the Mama Bear. Her most recent album, \"Map & No Direction\" spent 7 weeks in the top 40 AMA radio charts.\n\n“Beth had [the room] packed to standing room only with people waiting to get in as the text messages flew for others to join what their friends had just stumbled across. She has such a great vocal sound along with her road-hardened guitar skills that make me think you’re going to hear more of her in the future.”\n- Shawn Underwood, Twangville\n\n“From the opening snaps of the snare drum, you get nothing but passion and brilliant lyrics from Beth Bombara’s “Map and No Direction.” From radio friendly Americana to lonely, sit in the dark songs that absorb you into their being, there’s something for just about every emotion that makes us human. This is why we need art to exist. “\n- Chris Wienk, 97.7 WEXT (NY)", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Will Payne Harrison LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/9174333.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Americana, Blues, Roots & Folk", "Time": "1:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Everyone knows that Louisiana is a great melting pot of music, food and Southern culture. Will Payne Harrison simmered in that pot for most of his life, soaking in influences of Traditional Cajun, Louisiana Blues, Swamp Pop, New Orleans Brass Bands and Zydeco. Even after departing Louisiana for Nashville to start his own solo career, he has kept in touch with his Louisiana Roots making his own unique blend of Americana and Roots music. On East Nashville Blues, Will Payne Harrison dove deeper into Bluegrass, Country and Singer-Songwriter genres, using a cast of top-notch Nashville musicians. With his newest album, Living With Ghosts, Harrison went back to his roots, bringing in the Crème de la crème of Louisiana musicians featuring The Rayo Brothers members (Jesse Reaux, Lance Kelehan and Jordan Ardoin) along with lead guitarist Jim McGee. Fats Kaplin (John Prine) even joined in on pedal steel and fiddle. Slated to be out in late Summer/early Fall, Living With Ghosts will encompass the perfect blend of Will Payne Harrison’s Louisiana/Nashville sound.", "otherInfo": "Join Will Payne Harrison as he performs on Acme Radio Live for the Social Distancing Sessions"}, {"Address": [-122.23, 37.732], "Artist": "Aarón Mendoza LIVE", "ArtistImage": "https://photos.bandsintown.com/thumb/10319219.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Neoclassic, New Age, Instrumental", "Time": "1:30 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Aaron Mendoza is a Mexican pianist and composer. He began his career at a very young age when he was 6 years old. He was trained in the classical genre where he spent hours practicing music mainly from Chopin and Liszt. From the age of 15 he began to play the piano in places in Juárez, where he finally participated in a local TV program, where he spent 3 years. During that time he recorded some demos of covers on the piano, until later on he began to compose his own musical themes. At the age of 21, he moved to El Paso Tx, where he began to make his way with the American public participating in programs such as \"America’s Got Talent” in Austin, Texas and California. In 2017 he released his first album: “A New Beginning” of original themes from the New Age genre, including some Waltzes, most of the pieces are inspired by moments he personally experienced or reflections. Beside Mexico and the United States, he has played in different countries such as France, Colombia, Peru, Morocco and China. A couple of years later he presents his new album: \"Feelings\" which seeks to transmit the same energy from each place he visited, and his own experiences. Currently his main focus is creating melodies that create freedom, peace and hope, and transmit those emotions through music internationally.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "AG Weinberger ", "ArtistImage": "https://photos.bandsintown.com/thumb/6730898.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Crossover, Jazz, Rock, Blues, Soul, R&b/soul, Rnb-soul", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "https://www.agweinberger.trollnoodle.com/bio", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Adam Hawley ", "ArtistImage": "https://photos.bandsintown.com/thumb/8754498.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Jazz, Smooth Jazz", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Guitarist Adam Hawley is a gifted performer, sideman, and educator, known for his lithe, groove-oriented approach to contemporary jazz and R&B. After working steadily for over a decade with many marquee jazz and pop artists, Hawley launched his solo career with his breakthrough 2016 debut album, Just the Beginning, which featured three chart-topping smooth jazz singles including \"35th Street,\" \"Joy Ride,\" and \"I Don't Mind.\" He followed that up with the #1 single \"Can You Feel It\" off of his 2nd project Double Vision. Along with performing, the guitarist has a Doctorate of Musical Arts from the University of Southern California, and balances his time between playing live and teaching at places like Musician's Institute, Chaffey College, and Saddleback College.\n\nA native of Portland, Oregon, Hawley started playing music at age eight, first taking piano lessons per his mother's request, and then adding guitar lessons a year later. As a teenager, he played in church, toured with a bluegrass ensemble, and led his own blues band. Also during high school, a friend made him a mixtape which included George Benson's 1976 hit song \"Breezin',\" and ignited his enduring love of contemporary jazz. In 2002, he relocated to Los Angeles where he attended the University of Southern California, eventually earning his Bachelor's, Master's, and doctorate degrees in music. Since graduating, he has played in a variety of live and studio settings with a bevy of pop, jazz, and R&B artists including Natalie Cole, Jennifer Lopez, Dave Koz, Brian Culbertson, Rick Braun, Gerald Albright, Manhattan Transfer, Peabo Bryson, Euge Groove, and many more.\n\nAlthough he had originally planned to record a solo album in 2005, the abundance of live and session opportunities kept him busy. It also afforded him time to build a strong following, and in 2015 he signed with Kalimba Records. A year later, he released his full-length debut Just the Beginning, which featured guest appearances by Culberson, Albright, Groove, Eric Darius, and Michael Lington. The album performed well, producing three number one hits including \"35th St.,\" which spent five weeks on top of the Billboard Smooth Jazz Chart. Hawley spent much of the next year touring in support of the album before joining Koz on tour in 2018. That same year, he returned with his sophomore album, Double Vision. Included on the album were contributions by Jeff Lorber, Darren Rahn, Marcus Anderson, Julian Vaughan, and others. Also included was a cover of Adele's \"Hello.\"\n\nArtist Biography by Matt Collar", "otherInfo": "Adam misses you guys on the road so here is the next best thing, tune in for an intimate performance and conversation with the man himself this Monday, May 11 at 7pm PST/10pm EST. Adam will perform tunes off of his 3 critically acclaimed albums and feature special guest Paul Jackson, Jr.!"}, {"Address": [-122.23, 37.732], "Artist": "DJ Ghost ", "ArtistImage": "https://photos.bandsintown.com/thumb/7014443.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Hardstyle, Electronic", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "International DJ/Producer for over 18 years. Has been tour DJ for multiple platinum and gold selling artists. Currently hold DJ residences in Philadelphia, New Jersey, Las Vegas, Delaware, and Scottsdale.\n**********************************************************\nOfficial DJ for Philadelphia 76ers of the NBA.\n**********************************************************\nCo-owner: SPIN CITY DJz\n(Philadelphia #1 DJ Booking Agency)\n**********************************************************\nCo-owner: i12inch\n(Worlds Best mp3 Pool For Pro DJs)\n**********************************************************", "otherInfo": "Q102’s The 76 Mix with Eliot and DJ Ghost"}, {"Address": [-122.23, 37.732], "Artist": "Gianni Blu ", "ArtistImage": "https://photos.bandsintown.com/thumb/8855947.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Trap, Edm, Future House, Deep House, Pop Music", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Gianni Blu is the Chicago based EDM DJ/producer/songwriter who initially created a name for himself with his early original records featuring Chicago rap artists like Lil Bibby, King Louie, Frenchie of Bricksquad Monopoly, and Sasha Go Hard.\n\nAfter several popular house & trap remixes, Gianni veered his attention to making pop friendly EDM dance music. In 2016 Gianni’s single “Feeling It” received support from Martin Garrix in addition to charting on Spotify’s US & Global Viral Charts. Dancing Astronaut and Mixmag described Gianni Blu as a, “rising future house phenom” whose 2017 release “Thinking About You” featuring Kaskade collaborator Sansa, “embraces a future house production that results in an upbeat and powerfully smooth, enticing track”\n\nThe 24 year old Italian-Haitian artist began playing the violin and drums at a young age, and then transferred his interests toward DJing and producing when his creative desires expanded past the boundaries of traditional instruments. His multicultural background exposed him to music from all around the world that sculpted his eclectic style that’s so prevalent in his music today. His unique experiences give him the ability to provide exceptional assistance with music composition, and songwriting, which is what he finds most appealing.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Groovy Judy ", "ArtistImage": "https://photos.bandsintown.com/thumb/10322404.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Pop, Funk, Rock, R&b/soul, Rnb-soul", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Groovy Judy puts a new face on the late 60’s, early 70’s sound that made the Bay Area what it is. From the songwriting influences of Sly and The Family Stone, Jimi Hendrix, to touches of the melodic Beatles sound, San Francisco’s own brings forth her dominating style with the energy of some of today’s most known artists. Groovy Judy focuses on making people smile and raising vibrations by delivering her own blend of funk/rock. Her stellar guitar playing, original lyrics, colorful dress, and upbeat personality, speak to all ages.\n\nHer second CD “Life,” is about commonplace life experiences such as love, relationships and being happy. The title track, \"Be Who You've Got to Be,\" sparks an inspirational vibe of being true to yourself, \"Your Life\" encourages enjoying life to the fullest, and \"Get Along\" is Judy's peace anthem about living together harmony. It also contains Judy’s signature psychedelic rock song, “Jimi’s Sister,” her tongue-in-cheek tribute to her guitar mentor, Jimi Hendrix, as well as the haunting instrumental, “Sunrise,” inspired by Carlos Santana.\n\nBorn and raised in the San Francisco Bay Area, Groovy Judy picked up is committed to giving back. She teaches guitar to up and coming musicians and donates performances to non-profit organizations, such as Amnesty International, The Leukemia Society, Bread and Roses, Guitars Not Guns and The American Red Cross.\n\nA featured artist at She Rocks San Francisco Music Festival 2005, a finalist at the Emergenza Music Festival 2006, and a featured artist at the 2007 40th Anniversary of the Summer of Love Festival in Monterey, Groovy Judy is an artist who loves inspiring people to be the best they can be, love one another and spread peace and love through the universal language of music. She prefers to look on the lighter side of life and put out positive vibrations that make people smile, laugh, feel happy and enjoy life.", "otherInfo": "Groovesters!\n“7 O’clock Rocks!” Me & Pete are singing songs, rocking, groovin’, sharing love, & good vibes every night at 7:00pm PST. We play originals & covers Come join us! If you have a request, let us know.\nRock on,\nGroovy Judy\n😊✌🏻❤️🤟🏻🎸🎶\n\nVisit my website:\nhttp://groovyjudy.com\nGive Love ❤️ & you get love!\nGive a tip and get a free song down load! **Portion of the tips are donated to various charities and Covid-19 efforts. Thanks for your support! ❤️\n\nPayPal:\nhttps://tinyurl.com/rugwkmb\n\nVenmo: https://venmo.com/code?user_id=1943151065432064736\n@Judy-Gascoyne\n\nFollow me on Social Media at:\n\nSpotify:\nhttps://tinyurl.com/ubbdzdu\nInstagram:\n@_groovyjudy\nhttp://instagram.com/_groovyjudy\nYouTube:\nhttp://youtube.com/groovyjudy\nTwitter:\nhttp://twitter.com/groovyjudy\n\n❤️"}, {"Address": [-122.23, 37.732], "Artist": "Jason Charles Miller ", "ArtistImage": "https://photos.bandsintown.com/thumb/8868687.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Outlaw Country, Southern Rock, Dark Country, Alt Country Rock, Americana, Alt Country", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Jason Charles Miller is an accomplished and multi-faceted performer, with more than two decades of professional experience as a musician, songwriter, singer, and voice actor.\n\nOriginally from Clifton, VA, Jason now lives in Los Angeles, CA where he owns and runs the successful recording complex, Central Command Studios.\n\nJason has co-written songs with artists Billy Ray Cyrus, Rickey Medlocke [Lynyrd Skynyrd, Blackfoot], Charlie Starr [Blackberry Smoke], Marilyn Manson, Ben Moody [Evanescence], Driver Williams [Eric Church Band], Chuck Goff [Toby Keith Band], Otherwise, Rev Theory and living legend Paul Anka. Songs he’s written can be heard on HBO’s True Blood and Hung, WWE Smackdown, The Deadliest Catch, The NFL Today, Dateline NBC, and the wildly popular web series Critical Role (main theme), The Guild, Loremasters, Callisto 6, Co-Optitude, Signal Boost, Dick and Johnson, The New Adventures of Peter and Wendy, Deborah Ann Woll’s Relics and Rarities and the official theme song for International Tabletop Day in 2017 and 2018. Jason was the musical mastermind behind the critically acclaimed and Streamy award nominated series Muzzled the Musical, writing every piece of music for the show and co-authoring the lyrics to every song. Jason co-wrote the smash single “Cruisin’ for a Bruisin” for the Disney Channel hit movie soundtrack, Teen Beach Movie. The soundtrack was #1 on the Billboard charts and “Cruisin’ for a Bruisin” was nominated for a Radio Disney Award. Jason also penned the all star collaboration \"Forever In Our Hearts,\" a song to benefit the victims of the 2004 tsunami in South Asia which included Brian McKnight, Mya, Jacoby Shaddix [Papa Roach], Nate Dogg and many more. He’s produced songs for artists as varied as Billy Ray Cyrus, Tina Guo, James LaBrie of Dream Theater, Felicia Day, Godhead, Psyclon 9, and Bret Michaels.\n\nAs a solo artist, Jason has opened for country and rock greats Alan Jackson, Toby Keith, Eric Church, .38 Special, Night Ranger, Gary Allan, Justin Moore, Big Kenny of Big and Rich, and Jerrod Niemann.\nMiller is also widely recognized as the frontman and founder of the rock band Godhead, the only band ever signed to Marilyn Manson’s Posthuman Records. The band has sold more than 250,000 albums, and toured the world with the likes of Manson, Ozzy Osbourne, Disturbed, GWAR, Slipknot, Rammstein, Linkin Park and Korn frontman Jonathan Davis.\nJason has received three Gold Record Awards for sales. One for the Godhead song “Penetrate” on the Queen of the Damned movie soundtrack, one for the song “The End Has Come” which he wrote and performed with Evanescence founder Ben Moody for the movie The Punisher, and one for “Cruisin’ for a Bruisin” for the Disney Channel’s Teen Beach Movie soundtrack. Jason also recently sang two songs on the critically acclaimed soundtrack for the video game Metal Gear Rising: Revengeance, and has even sung backup for Robert Smith of The Cure on the Reeves Gabrels/Robert Smith song, “Yesterday’s Gone.”\n\nJason is the on-camera host of the Webby nominated “Starter Kit,” a show on Geek & Sundry that teaches celebrities how to play tabletop role playing games. Starter Kit is presented by Legendary Digital Networks, a division of Legendary Pictures.\n\nAs a voice actor, Jason has appeared in over 100 animated productions and video games. Some career highlights include Days Gone, Kingdom Hearts 3, Attack on Titan (Gelgar), Neverwinter: Underdark (Drizzt Do’Urden), Gundam: Iron Blooded Orphans (Aston), The Legend of Korra (The Sherriff), Hearthstone (Loot Hoarder Gnome), Star Trek Online (Kal Dano, General K’men), World of Warcraft (High Commander Goodchilde, Thaedris Feathersong, Prince Valanar, Commander Stoutbeard), Avatar: The Last Airbender, Final Fantasy 14: A Realm Reborn (Raubahn Aldynn), Batman: The Brave and the Bold (Dollman and Black Condor), Firefall (Captain Wallach, Sergeant Lewis), Moribito: Guardian of the Spirit (Shinji), The Wonder Woman Animated Movie (Thraxx), Code Geass (Urabe), Super Street Fighter 4, Street Fighter X Tekken, Ultra Street Fighter 4 (Guy), Resident Evil 5 (Robert Kendo), Dragon’s Dogma (Ser Wesley, Ser Jakys), Star Craft 2, Diablo III (Radek the Fence), Guild Wars 2 (Ben Tenstrikes, Big Nose Ted, Stefan Barush, Seneschal Elam) and has even narrated a film for NASA, “Bennu’s Journey” which appears in museums and planetariums around the country. You can see Jason on screen as Strike Leader Jackson in the SyFy original movie, Battle Planet, as the dastardly villain Kowboy Killa in Chatroom of Solitude on Stan Lee’s World of Heroes network, playing himself in season 5 of The Guild, and squabbling with Lewis Black and Andy Dick in various productions on Comedy Central.\n\nJason has been featured in magazines such as Rolling Stone, Billboard, Guitar World, Inside Kung Fu and many more. He’s also appeared on MTV, MTV2, Fuse and VH1. Touted by many critics as one of rock and country’s best and most consistent live singers, Jason continues to wow live audiences all over the world.\n\nNotable quotes:\n\"Jason Charles Miller is a cutting edge rock/country/blues artist of these times! Great vocalist/musician/writer. In other words, \"don't come a knockin' if you're not prepared for country rockin!\" - Rickey Medlocke (Lynyrd Skynyrd)\n\n“JCM is an amazing singer with a huge voice. His control is astounding. From my own personal experience, the only singer I have ever recorded that is anywhere near his equal would be everyone’s favorite rock icon, David Bowie” – Reeves Gabrels (The Cure, David Bowie Band)\n\"Jason takes the live show and then turns the crank up a notch or two. It's something to see!\" –\nTonya Campos (105.1 Go Country, Los Angeles)", "otherInfo": "Acoustic streaming show at www.caffeine.tv/jcm"}, {"Address": [-122.23, 37.732], "Artist": "Paxton Rutherford ", "ArtistImage": "https://photos.bandsintown.com/thumb/10353202.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "AG Weinberger ", "ArtistImage": "https://photos.bandsintown.com/thumb/6730898.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Crossover, Jazz, Rock, Blues, Soul, R&b/soul, Rnb-soul", "Time": "2:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "https://www.agweinberger.trollnoodle.com/bio", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Sultans of String ", "ArtistImage": "https://photos.bandsintown.com/thumb/8426601.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Arabic, Gypsy-jazz, Flamenco, World Music, Folk, Pakistani Music, Middle Eastern Music, Gypsy Jazz, Cuban Music, World Fusion, Middle Eastern, World Jazz Flamenco, Arabic Music", "Time": "6:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "Sultans of String are sharing the wealth. In more ways than one.\n\n\"We love to expose people to sounds they might not have heard before,\" explains violinist and bandleader Chris McKhool, summarizing the mission statement of the ground-breaking and acclaimed world music ensemble. \"And we love collaborating with other artists.\"\n\nOver the past dozen years and six albums, McKhool and his bandmates — co-founding guitarist Kevin Laliberté, bassist Drew Birston, Cuban percussionist Rosendo ‘Chendy’ Leon and second guitarist Eddie Paton — have excelled at both. Thrilling listeners around North America with their genre-hopping fusion of Celtic reels, flamenco, Gypsy jazz, Arabic, Cuban, and South Asian rhythms, Sultans of String celebrate diversity and creativity with warmth and virtuosity. And they often do it with artists such as Paddy Moloney and The Chieftains, Richard Bona, Benoit Bourque (Bottine Souriante), Nikki Yanofsky, Alex Cuba, Ruben Blades, Crystal Shawanda and Ken Whiteley.\n\nWith their historic and visionary seventh album Refuge (coming in 2020), McKhool and co. bring their unique brand of musical synergy and collaboration into the studio like never before. Their most ambitious, diverse, inclusive and passionately political album, Refuge puts the Toronto-based Sultans face-to-face with a VIP roster of artists from around the globe — including American banjo master Bela Fleck, Israeli vocalist Yasmin Levy and others, like Iraqi violinist Imah Al Taha and Iranian santur master Amir Amiri, who have fled the peril and persecution of their homelands for the safer shores of North America.\n\n\"This is a project that is centred around the positive contributions of refugees and new immigrants to U.S.A. and Canada,\" says McKhool, whose Lebanese grandfather stowed away on a ship bound for North America a century ago. \"We are bringing in special guests that are newcomers to this land, as well as global talents that have been ambassadors for peace. We wish to celebrate the successes of those who make the journey here, and bring their extraordinary talents with them. We hope that the kinds of conversations we can have as musicians can provide a model for peace that our politicians and citizens find inspiration from.\"\n\nThat inspiration could not be summed up more clearly than on Refuge's gorgeously evocative and powerful first single I Am a Refugee, co-starring Somali poet and multi-media artist Ifrah Mansour, who now makes her home in the Twin Cities. \"I wrote the poem for me, for my community, and for those that are yearning for change, those yearning to deepen their empathy,\" explains Mansour. \"Writing the poem was a way to unleash some pain that I could name finally – I wrote it because I was so frustrated with so many people sending me emails and asking me what I thought about the travel ban, the first time our American government here shared the first travel ban. And that an artist’s job is to draw that hope, especially in a time of deep hopelessness.\"\n\nLike most of the collaborations on Refuge, I Am a Refugee came to life in the studio, with Sultans of String and their guests composing and creating together. But no matter how they began, they all ended the same: with all the artists recording together at Jukasa, a world-class recording facility on the Six Nations reserve between Toronto and Buffalo.\n\n\"We knew we had to do it this way,\" McKhool stresses. \"We couldn't make an album honouring refugees and do it long-distance. But having everyone in the room at the same time made it extremely challenging, both from a logistical and technical standpoint. But the results certainly made it worthwhile.\"\n\nOf course, Sultans of String have never taken the easy road. Since releasing their debut album Luna in 2007, they have continually strived to make each chart-topping album more original and meaningful than the last. That includes working with an orchestra (2013's Symphony), teaming with Pakistani sitarist Anwar Khurshid (2015's Subcontinental Drift) and even crafting a world-music holiday album (2017's Christmas Caravan), which landed them on the Billboard charts and the New York Times. Their ambition and work ethic have garnered them multiple awards and accolades, including three Juno nominations, first place in the International Songwriting Competition (out of 15,000 entries), three Canadian Folk Music Awards, and countless other honours.\n\nTheir live resumé is similarly stellar. Equally at home in a concert hall, jazz club or festival setting, the Sultans have gigged at the legendary club Birdland in New York, the renowned Celtic Connections Festival in the U.K. and the San Jose Jazz Festival. They have performed with symphonies across Canada and the U.S., and played live on BBC TV, Irish National Radio, World Cafe and SiriusXM in Washington. No matter the venue, the goal is the same, McKhool says.\n\n\"I've always wanted our concerts to be a place where everyone feels welcome. I want to reach out to diverse communities to say, 'Come out and enjoy music with us — you're going to have a really good time.' And it's great to see people from, say, the South Asian community mixed in with the hipster crowd. Or to play some very small towns where they might not have heard a sitar played live before. It benefits society as a whole, to have people from around the world blending their ideas, mixing their cultures.\"\n\nAnd sharing the wealth.", "otherInfo": "https://www.facebook.com/cdnmusician\nChris McKhool live stream interview with Canadian Music Magazine’s Editor-in-Chief Andrew King, featuring slides, video clips from our new project, and stories about how this exceptional album came to be. “Refuge is a fantastic, moving, dreamlike, epic, timely album.” – Ken Micallef (Jazz Times, Stereophile, Downbeat)"}, {"Address": [-122.23, 37.732], "Artist": "Sam Buckingham ", "ArtistImage": "https://photos.bandsintown.com/thumb/8974078.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Pop, Folk", "Time": "10:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "“Winsome songs delivered with empathic delicacy” - Rolling Stone\n\n\"Gorgeous and moving... with an authenticity that is undeniable\" - The Au Review\n\nAfter an impressive 18 months since releasing her acclaimed album “The Water” singer-songwriter sweetheart Sam Buckingham hits the road, touring for the first time with her band, bringing the album to life and premiering a swag of gorgeous new songs.\n\nRecorded over just one week in a converted horse stable on the NSW south coast, “The Water” has seen Buckingham tour alongside Kasey Chambers, James Reyne, Jordie Lane and Diesel, showcase at Nashville’s renowned “Americanafest\" and embark on three national sellout tours of her own.\n\nAn audio journal of sorts, Buckingham penned the majority of the album while living in Latin America. An account of her time abroad - which included working on a permaculture farm in Costa Rica, volunteering with Sea Shepherd in Honduras and completing formal yoga teacher training in Mexico - “The Water” combines subtle rhythms and the emotive language of Latin America with fragile folk music, rousing Americana and pop inflected hooks.\n\nBringing her trademark intimate show to Brisbane, Bangalow, Sydney, Canberra, Melbourne, Adelaide & Perth, Buckingham and her band will perform “The Water” in its entirety and showcase a collection of stunning new works.\n\n“A breath of fresh air” - Music Love\n\n“Truly gorgeous... an album full of truth and strength\" Sydney Morning Herald\n\n\"Compelling, beautiful... she'll take you on a journey home\" - The Music", "otherInfo": "Every Tuesday, for the next little while, I'll be singing for you - straight from my home to yours.\n\nWhen: 8pm - 9pm (AEST) Tuesday nights\nWhere: Facebook Live\n\nI'll play a collection of my own songs (+ trying out new ones that I haven't played live before) and maybe a few covers.... each show will be different\n\nSo invite your friends and watch it live at www.facebook.com/sambuckinghammusic\n\nThese shows are Pay What You Can. Head to my website www.sambuckingham.com to pay me for the show, if the current situation hasn't got you in a complete bind.\n\nPlaying live is one of my favourite things in the world. I've really missed it, and I've really missed sharing it with you! Grab a drink, make some yummy food and come hang out with me on Tuesday nights, because Tiger King is actually really boring.\n\nxxSam"}, {"Address": [-122.23, 37.732], "Artist": "The Blaze ", "ArtistImage": "https://photos.bandsintown.com/thumb/7717923.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Electronic", "Time": "10:00 AM UTC", "Venue": "Live Stream", "moreBioInfo": "French producer/director tandem The Blaze.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "DJ Sigvaldason ", "ArtistImage": "https://photos.bandsintown.com/thumb/10369553.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "House, Trance, Psytrance", "Time": "12:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "DJ Sigvaldason was born 1984 in Copenhagen, Denmark with Icelandic roots to his name. He spent a lot of his childhood time listening to music, certain that he would continue his love for music well into his adult years. Just 15 years old, Sigvaldason started out an amateur DJ and has since then launched himself to become a professional DJ, playing at events big and small, private and public, in Scandinavia and abroad.\n\nHis professional career began in the summer of 2008 when he became an event DJ. In the summer of 2009, he became the resident club DJ at Kulturkajen Docken and spent all of his weekends playing Chill Out and Lounge music. Since then, his career has taken off. Today, he plays around 100 gigs annually along with combined radio gigs and club jobs. He has played at major Danish clubs such as Copenhagen Coyote Club, Krasnapolsky, K3, Tempo, The Globe, Sukkerbageren, Cosy Bar, and more. Regarding radio, DJ Sigvaldason has done mixes for PartyZone and Monstermix.dk and is the host of 'Trance To The People' every week, broadcasting internationally.\n\nBeside club gigs jobs, DJ Sigvaldason is also an independent party and event organizer. He has helped open such dance clubs and spots as Njalsgade 21, Club Nuclear and In2Dance. He was the founder of TranceCph, which was Copenhagen’s premier trance collective, responsible for organizing authentic trance events and parties.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Just Joe ", "ArtistImage": "https://photos.bandsintown.com/thumb/9802389.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Piano Rock", "Time": "1:30 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Joe Altier is JUST JOE.\n\nBorn and raised in Syracuse, Joe learned to play piano and started singing around the age of five. Taught to play and read music by his mother, Joe started taking formal piano lessons at the age of nine. RONNIE VAN ZANDT, OTIS REDDING, PHIL ANSELMO and ZAKK WYLDE are among his favorite singers. Discriminating against no style of music, classical, country, rock and heavy metal shaped who he would become. JUST JOE.\n\nCollege educated with degrees in History and Audio Engineering, and a minor in Secondary Education. But from that early age, he felt that music was his true calling. In September, 2001 he became the singer for BRAND NEW SIN. They released three albums and one EP with worldwide distribution and they toured extensively across North America, Great Britain and Ireland as both headliners and support. They toured with some of the most recognizable names in heavy metal, including MOTORHEAD, CORROSION OF CONFORMITY, BLACK LABEL SOCIETY, TYPE O NEGATIVE and SHADOWS FALL. Their rock n' roll music was featured in the movie \"School of Rock\" and on the MTV television shows \"Homewreckers\" and \"Viva La Bam.\" It was JUST JOE and then some.\n\nAn inside linebacker in college, Joe helped get their message cross over to the sporting world. BNS songs were featured on UFC and ESPN, and even the Worldwide Wrestling Entertainment giant, THE BIG SHOW tapped Joe's soaring vocals with his bandmates for Show's entrance song, \"Crank It Up.\" From college learning to worldwide touring to crossover media. It was JUST JOE.\n\nDuring downtimes with BNS, Joe took up his piano and played clubs under the monicker BRAND NEW JOE. When he split from BNS, Joe developed a repertoire of more than 2500+ cover songs, ranging from FRANK SINATRA to METALLICA and everything imaginable in-between and has played to sold out houses up and down the east coast as JUST JOE.\n\nIn 2009, he hooked up with former BNS guitarist BRIAN \"SLIDER\" AZZOTO and formed ELEPHANT MOUNTAIN. After plenty of writing and rehearsing, and after a few shows to debut the material, the band went into the studio and have completed the recording of the debut album, “The Last Days Of Planet Earth”, which was released in September of 2011. Elephant Mountain has just recorded their new album and will be releasing it Spring/Summer of 2013. He's lent his vocal expertise to many local releases, and appears on MUSHROOMHEAD’s album, “Beautiful Stories For Ugly Children”, singing on the track “Holes In The Void”\n\nAnd not to be outdone Joe has released three cd’s of original material, “JUST JOE SOLO EP” (December 2011), “My Demons, My Burden, My Life” (May of 2012) and “Got Joe?” (December of 2012). And now after a very successful Kickstarter campaign, Joe’s next album, “So The Story Goes…” will be released this Spring 2013!!\n\nUpstate New York born and bred. Southern rock influenced. College educated. Toured the world. Front man. Solo. JUST JOE.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "The Bristol Ensemble ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "2:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Henry Jamison ", "ArtistImage": "https://photos.bandsintown.com/thumb/10196503.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Acoustic, Folk", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "On May 15th, Vermont’s musical bard Henry Jamison will enlist a who’s-who of indie rock royalty to collaborate with him on his ‘Tourism' EP (Color Study). Each track on the five-song collection will boast a celebrated featured vocalist, including Darlingside, Ed Droste, Fenne Lily, Joseph, and Lady Lamb, delivering Jamison’s most diverse and forward-thinking collection to date.\n\nJamison has earned his place among modern music’s revered storytellers and folk performers, having performed toured across the US and Europe alongside the likes of Caroline Rose, Darlingside, and Adrianne Lenker (of Big Thief) who described Henry's music as \"songs that sing me through mazes of my own sensuality and sadness, help me to feel less alone in the journey to understand myself more deeply and to face gaping wounds,” while also being critically acclaimed by the likes of Billboard, American Songwriter, The Fader, Rolling Stone and Consequence of Sound.\n\nRaised by a classical composer father and an English professor mother, Jamison was drawn to music and lyrics from his earliest days, and began recording his own homemade cassette tapes while he was still in elementary school. Going further back in Jamison's lineage, you'll find George Frederick Root, the most popular songwriter of the Civil War era and the author of the iconic \"Battle Cry Of Freedom.\" Keep going even further to 14th Century England and you'll find poet John Gower, a favorite of Chaucer and King Richard II.", "otherInfo": "Live Stream: https://www.facebook.com/martinguitar"}, {"Address": [-122.23, 37.732], "Artist": "Jason Manns ", "ArtistImage": "https://photos.bandsintown.com/thumb/7260888.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Bowling Green, United States", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Singer/songwriter/producer from Bowling Green, VA", "otherInfo": "https://www.stageit.com/jason_manns/quarantune_tuesday_9_1/80881\n\nLet's hang out together, separately. Week 9 show 1 of Quarantunes!\n\nTop Tipper will get a special Quarantine Skype/stageit/zoom of their very own where I will play ALL of the new music I've been working on (5-8 new never before played tunes) and we can have a chat about it.\n*please do not record this Skype.\n\nall tippers over $200\nwill also get a quarantine care package with a book from my read pile (that I enjoyed!) t-shirt, and random other merch.\n\nall tippers over $100\nI'll schedule a Skype chat with ya so we can commiserate about the lockdown, trade quarantine cookie recipes, or gardening tips. (by trade I mean you can share them with me because I don't have either of those things.)"}, {"Address": [-122.23, 37.732], "Artist": "Alberto Gascón ", "ArtistImage": "https://photos.bandsintown.com/thumb/10374793.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Spain", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Eli Lev ", "ArtistImage": "https://photos.bandsintown.com/thumb/10275008.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Acoustic, Folk, Adult Alternative, Indie Folk", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Rising singer-songwriter and global citizen Eli Lev is making the world a smaller place, one song at a time. Eli pens lyrics and melodies for everyday enlightenment—songs that resonate because they’re heartfelt, earthy, and offer the wisdom he’s gained through lifelong travel and self-discovery.\n\nThe Silver-Spring, Maryland-based artist just released Deep South, the third album in a four-part directional series that was inspired by indigenous traditions he learned while teaching on the Navajo Nation in Northern Arizona. His releases have earned critical praise from Paste Magazine, Buzzfeed, CBS Radio, AXS, and The Bluegrass Situation, and have received national folk radio support and placement on prominent Spotify playlists.\n\nWhether it’s an in-person performance, or during a livestream show, Eli captivates the audience with a storyteller approach to stage banter through tales of his travel, witty asides, and engaging commentary. His infectious musicality, commitment to deep grooves, and playful charisma foster an immersive experience for the audience that moves bodies and opens hearts.\n\n“The most meaningful thing for me is being able to express through my music what I’ve always felt about humanity. I want to bring people in, make them feel special, and break down the walls that keep us apart.”\n\nMore on Eli at www.eli-lev.com", "otherInfo": "Join Eli for your daily dose of good vibes as he begins his daily live-streaming schedule on Tuesday afternoons at 12 PM on his Facebook personal page!\n\nhttps://facebook.com/elilevdc\n\nMore info on Eli Lev:\n\nGlobal citizen and neo-folk singer Eli Lev is making the world a smaller place, one song at a time. Eli pens hymns for everyday enlightenment—songs that resonate because they’re heartfelt, earthy, and offer wisdom culled from self-discovery.\n\nIn performance, his infectious musicality, commitment to deep grooves, and playful charisma foster an immersive experience for the audience that moves bodies and opens hearts.\n\n“The most meaningful thing for me is being able to express what I always felt about humanity through my music. I want to bring people in, make them feel special, and break down the walls that keep us apart.”\n\nhttps://eli-lev.com"}, {"Address": [-122.23, 37.732], "Artist": "Mad Dragon Music Group ", "ArtistImage": "https://photos.bandsintown.com/thumb/8704931.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Official MAD Dragon Music Group Facebook Page http://www.maddragonmusic.com", "otherInfo": "Mad Dragon Music Group presents: Quarantine Sessions! Today we have Danny and Jess for their \"Guilty\" Live stream performance on Mad Dragon's instagram page!"}, {"Address": [-122.23, 37.732], "Artist": "Nadia Rose ", "ArtistImage": "https://photos.bandsintown.com/thumb/9620875.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "4:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Chip Richter ", "ArtistImage": "https://photos.bandsintown.com/thumb/10355567.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Youngstown, Ohio", "Time": "4:05 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Chip Richter is an Award Winning singer-songwriter for kids & families performing in schools, libraries, churches, theaters and festivals. Named \"Best Family Music\" by Lake Erie Living Magazine, Awarded \"Best Children's Music\" by Ohio Music Awards last 3 years. Booking/Management contact Brittany@chiprichter.com", "otherInfo": "You're invited to Lunch with Mr Chip Streaming LIVE at 12:05 pm from Nutshell Studio in Columbiana, Ohio. Send your song request to Chip@chiprichter.com let us know where you're watching from and what's your favorite thing to eat for lunch!"}, {"Address": [-122.23, 37.732], "Artist": "Stan Simon ", "ArtistImage": "https://photos.bandsintown.com/thumb/10356581.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Country, Rock", "Time": "4:30 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Stan Simon began writing songs at an early age in Toronto, Ontario crafting poignant melodies on a broken classical guitar from his father.\n\nLargely influenced by vintage folk and country records, Simon delivers earnest lyrics, sung with a vocal prowess, sharp harmonica and a rustic roots sound that resonates through your body.", "otherInfo": "Folk Music Ontario Presents: Stan Simon on City Hall Live Online.\n\nMORE INFO HERE: https://www.facebook.com/events/301589970805038\n\nIn the three decades since it was incorporated as a not-for-profit organization, Folk Music Ontario has undergone many structural changes. These have happened with the careful oversight and leadership of the member-elected boards of directors that run Folk Music Ontario, and with the consent of the membership at each Annual General Meeting."}, {"Address": [-122.23, 37.732], "Artist": "Bill Harley ", "ArtistImage": "https://photos.bandsintown.com/thumb/6024588.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Folk, Stories, Spoken Word", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "A two-time Grammy award-winning artist and recipient of a Lifetime Achievement Award from the RI Council for the Humanities, Bill uses song and story to paint a vibrant and hilarious picture of growing up, schooling and family life. His work spans the generation gap, reminds us of our common humanity and challenges us to be our very best selves. A prolific author and recording artist, Bill tours nationwide as an author, performing artist and keynote speaker.", "otherInfo": "Every Tuesday and Thursday at 1pm ET Bill Harley is performing from home and broadcasting via Facebook Live."}, {"Address": [-122.23, 37.732], "Artist": "Arkells ", "ArtistImage": "https://photos.bandsintown.com/thumb/8887204.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alternative, Indie Rock, Rock", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Arkells fifth studio album Rally Cry is the band’s most pointedly powerful effort thus far. Long known for their exceptional songwriting and high-energy performances, the Hamilton, ON-based quintet – singer Max Kerman, guitarist Mike DeAngelis, bassist Nick Dika, keyboardist Anthony Carone, and drummer Tim Oxford – reveal on Rally Cry an unheard soulfulness that elevates their new songs to places that, while connected to a new approach, feel perfectly in tune with who the band is and always has been. Rally Cry has the size and scope to match Arkells’ ambition and ever-growing audience that love the band for the uniquely raw energy that is all their own.\n\nArkells have remained ever-present, relentlessly touring in support of their most recent album, Morning Report, which was extended by the surprise release of “Knocking At The Door” – the 14-week #1 smash, which became the most played alt-rock song of the year. The album yielded festival stops from Coachella to Lollapalooza, an unexpected viral trip to the Olympics in South Korea, and their show-stopping, stadium-filled hometown show \"The Rally,” in front of 24,000 fans this summer.\n\n“On our last album, we dipped our toes into the water, and learned that the boldest and most gratifying ideas were the ones where we took the biggest chances,” said Kerman. “That record emboldened us and gave us confidence to trust our instincts even more. On Rally Cry, we’ve risen to the challenge and we’re playing for keeps.”", "otherInfo": "Flatten The Curve Music Class #FTCMusicClass"}, {"Address": [-122.23, 37.732], "Artist": "Maria Moon ", "ArtistImage": "https://photos.bandsintown.com/thumb/9032628.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Rock Violinist, Video Game Music, Electric Violin, Film Music, Keyboardist, Classical, Covers, Violinist, Cover Band, Violin Live Music", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Hello! I like to play the ancient violin. I record covers of music for games and also I play live.", "otherInfo": "Start 5:00 PM (UTC) / Начало 20:00 (по Москве)\nOnline broadcasting: https://mixer.com/maria_moon\nhttps://www.periscope.tv/Maria_Moon2\nОнлайн выступление: https://goodgame.ru/channel/Maria_Moon\nhttps://wasd.tv/channel/141913"}, {"Address": [-122.23, 37.732], "Artist": "Chad Cooke Band ", "ArtistImage": "https://photos.bandsintown.com/thumb/8919274.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Chad Cooke - Lead Vocals Acoustic Guitar, Mike Neyra - Drums, Dallas McGillberry- Lead Guitar, Kevin Pool - Bass", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Four country crooners from Houston are paving their way in the Texas country music scene. In and out of honky-tonks from Oklahoma City to San Antone, the Chad Cooke Band brings their unfiltered version of Texas Country Music to whiskey-drinkin’, two-steppin’, rowdy fans, one night at a time.\nDrawing on influences Brooks and Dunn and the Eagles, the band utilizes three and four part harmonies with a 90s country rock-n-roll edge.\nSince the release of their debut album, Easy Way Home, in December of 2016, the Chad Cooke Band has produced two Top 50 singles on Texas Radio - 'Oil Man', 'Come and Take It'. The 'Oil Man' music video has amassed over 6 Million Views across social platforms!\nFollowing the success of ‘Oil Man’ the band set off to Nashville in March of 2018 to record their next CD. Their sophomore album, Risk It All, is honest Texas Country music with just enough Nashville shine to attract the attention of music industry executives. The first radio single 'Whatever It Takes' topped out at #3 and set the record for the longest charting single on Texas Radio!\nChad Cooke Band has shared the stage with the following acts: Aaron Watson, Whiskey Myers, Zane Williams, Aaron Lewis, Josh Abbott, Marshall Tucker Band, Kyle Park, Jon Wolfe and Andy Griggs.\n\nThe band consists of Chad Cooke on Acoustic/Vocals, Dallas McGilberry on Lead Guitar/Vocals, Kevin Pool on Bass Guitar/Vocals, and Mike Neyra on Drums/Vocals.", "otherInfo": "The Chad Cooke Band is taking over 95.9 The Ranch's FB page on Tuesday May 12th to bring you some country music and good times during your lunch hour! The band will perform as a full band acoustic(all four members)! Tune in at 12PM(CST) to ask questions, request songs and see what this country band from Houston, TX is all about."}, {"Address": [-122.23, 37.732], "Artist": "noartist ", "ArtistImage": "https://assets.bandsintown.com/images/fallbackImage.png", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Jono Grant ", "ArtistImage": "https://photos.bandsintown.com/thumb/164359.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "Above & Beyond’s Jono Grant spins the best in 2020 club, trance and progressive music as requested by you."}, {"Address": [-122.23, 37.732], "Artist": "Emily Jane White (official) ", "ArtistImage": "https://photos.bandsintown.com/thumb/9346877.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Sadcore, Neofolk, Folk Music", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Emily Jane White is a musician, songwriter, and poet from Oakland, CA. She began performing under her own name in 2003 and released her first album \"Dark Undercoat\" in 2007, with \"Victorian America\", \"Ode to Sentience\", and \"Blood/Lines\" following. White has cultivated a dedicated audience in Europe and North America.\n\n“They Moved in Shadow All Together” (2016), Emily’s fifth album, was recorded at Tiny Telephone studio in San Francisco, CA, and New and Improved studio in Oakland, CA, between December 2013 and September 2015.", "otherInfo": "Virtual Merch Table - Any physical (LP / CD) merch bought day of either show comes with a free gift! All you have to do is forward me an e-mail with your purchase confirmation and your mailing address to contact@emilyjanewhite.com and I will send you a personal thank you letter and signed portrait by Kristin Cofer.\n\n-Merch Links -\nhttp://emilyjanewhite.net/order-cd-and-vinyl"}, {"Address": [-122.23, 37.732], "Artist": "Metronomy ", "ArtistImage": "https://photos.bandsintown.com/thumb/9420672.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Electronic", "Time": "5:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Hey, did you ever notice how Metronomy, the Joe Mount-fronted electronic indie pop group releasing their sixth album Metronomy Forever this September, sounds a bit like time keeping tool ‘metronome’? You did? Boy oh boy.\n\nThe metronome reference was but a musical in-joke before: now it contains more meaning. The steady tick-tocking of the pendulum represents continuation, stability, endlessness, and consistent familiarity. It understands that while we all ultimately return to the goo from whence we came, time marches on furiously, like a bull aiming for a matador. Your last breath will be another click on the machine.\n\nMetronomy Forever in name represents a similar ethos: something looking backwards and forwards simultaneously, like Janus, something fated and eternal. You were made from dust and to dust you will return, that sort of thing.\n\n“What happens is when you’re making music and you enter a world where you have achieved some sort of celebrity no matter how large or small you start to think about yourself in terms of legacy and what you’re going to leave behind,” says Mount. “And then you realise that’s limited to the interest people have in you. In the end I feel completely comfortable with it. The less importance you place in any art the more interesting it can become in a way… I’m making music, I’m going to do some concerts, I need to feed my children.”\n\nMetronomy Forever is the follow-up to 2016’s Summer 08, and contains 17 tracks. Its length is born from a desire for breathing room, from not wanting to stuff the hits together like a bouquet of petrol station roses. In between the sauna-sweat-soaked funk of songs like It’s Automatic, and the beach funeral of Walking In The Dark, lie pretty, glistening ambient tracks. It evokes the feeling of being sat in a nursing home, Swiss-cheese-brained, recalling joyous flashes of a past life while the fugue states of comforting confusion wash over you.\n\nIt also comes from a desire to replicate the feeling of listening to the radio, with sumptuous songs of different types and styles helping lighten your mood, and stifle retches as you inhale scrambled egg steam from the saucepan you’re scrubbing. “The radio never stops,” as Joe puts it. “It doesn’t really matter how emotionally deep the music that comes on is, it’s entirely your situation that gives the music it’s emotional leaning.”\n\n“For so long I was concentrating on trying to make these snappy songs, and when they were all sat together it didn’t make for some impressive thing. It wasn’t until I started thinking about the past several years, realising that in that time there’ve been periods of drifting, and looking around for ideas. When I started including these bits of instrumental music and bits of sound, to which I genuinely felt some kind of connection, I put them in amongst these little flowers.”\n\nFlowers are apt metaphor. Mount has moved away from the bustle of his former Parisian home to take up residence atop a hill in the garden of England. It was a necessary change, he says, and one that has soldered a bond with him and nature.\n\n“I think it has everything to do with me at the moment, being in this environment – and I literally mean the environment. I feel properly more connected with nature. And I’m embracing myself getting into it, because I think it’s a really important part of being a person – and I haven’t even read that Sapiens book.”\n\nAnd a good thing he hasn’t, as it seems Sapiens has been widely discredited by academics the world over.\n\nMetronomy Forever is a record that exudes a green tranquillity. Mount was concerned that the relative happiness of his existence might stifle his creativity, having no great tragedy to draw from, but discovered the opposite was true.\n\n“To be jealous of having that stuff going on is a bit dangerous,” he says. “I look at successful musicians who, as they get older, struggle to remain relevant. I’m at this point where I feel like, my attitude towards what I do is healthy. With this record I wanted to make a very pure expression of what I’m about right now, and I think for me that makes for better music.”\n\nAnd while the music itself promotes a sense of calm joy, it’s in the lyrics that we remember that even idyllic circumstances require their own maintenance, an oiling of the cogs to keep them crunching along. Mount reminds us of this on Lately, desperately singing “That is love and it's hard to do, it's a job for two. What do I do if I don't get nothing from you?”\n\nIt’s not just the physical space and distance from stress and life on the Rue De Dogshit in the French capital that has had its effect on the creative process.  Mount spent much of the last four years working with Robyn on her acclaimed and deeply personal record Honey. 48 months of vicarious agony was exhausting, but ultimately extremely fulfilling.\n\n“In the space of time since the last Metronomy record I’ve had a very large part in writing an album based on a traumatic experience for her. I knew the whole experience was going to be this massive cathartic thing. When it got to the point of finishing, I remember telling her how good it was and how people are really going to respond to it in the way you want them to. Working with someone and being able to tell someone that is quite an enjoyable thing, being able to know that everything’s cool. It’s a nice feeling to have.”\n\nThose glimmers of emotional, intense, carnal mania seem to have rubbed off on Mount in their own way, too. On Sex Emoji, the subconscious throbbing purple of the erotic digitised aubergine comes to life, a refrain of ‘love, honey, sex, money’ sang in a coital squeal.\n\nSalted Caramel Ice Cream brings this to the fore too, but more in the vein of Lipps Inc’s Funkytown, and evokes the sapid pleasure and delights of love, but also the panics and anxieties (‘Oh god, she’s coming, don’t look up’).\n\nBut when the shagging is over you’re left only with the despair of your sweaty reflection. The moments of pain and sadness on Metronomy Forever are just as real, but also surmountable, much like most of the torture of existence ultimately is. It’s the scope of experience of someone who has decided that agony, while perhaps a good palette from which to scrape your paints, is just not really that much fun. We’re here for a good time, not a long time, and, as Homer Simpson once said, “You could wake up dead tomorrow.” Get on your hands and knees, plunge your fingers in the soil and scream thanks at the moon for making the waves crash warm foam at the feet of our children.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Tom Lumley ", "ArtistImage": "https://photos.bandsintown.com/thumb/8448224.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Tom Lumley is a Indie singer/songwriter originally from Cambridgeshire. He has been writing and gigging for the past three years with his band behind him. During this time he has played at popular venues in the UK supporting the likes of The Hunna, Coasts, The Sherlocks, Airways and playing festivals such as Dot To Dot, Green Meadows (BBC Introducing) etc. Whilst constantly being busy out on the road Tom has also spent a lot to of time in the studio releasing his music of which his debut EP 'Dream City' charted at No.2 in the UK iTunes Rock Chart and No.46 in the UK iTunes Album Chart. It has also gained radio airplay up and down the country, including constant support from his local BBC Introducing show and being tipped on Huw Stephens BBC Radio 1 show as 'an exciting Cambridge artist to look out for' by Fred Bambridge. Dream City EP - https://itunes.apple.com/gb/album/dream-city-ep/id1215845262 The official page for singer/songwriter Tom Lumley.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "BOYO ", "ArtistImage": "https://photos.bandsintown.com/thumb/10249868.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Indie Rock, Lo-fi, Bedroom Pop, Alternative, Pop, Psychedelic Pop", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "BOYO is the eclectic, lo-fi pop brainchild of 22 year-old multi-instrumentalist Robert Tilden. The project was born out of the gradual dissolution of Bobby T. and the Slackers, a cult-beloved garage-band that Tilden started at age 16. Since 2016, Tilden has feverishly released a series of albums, EP's, and singles, all varying stylistically and in mood but retaining the sentimental chord progressions, ghostly, childlike vocals, and warped production that makes them consistently and uniquely BOYO.", "otherInfo": "Live Stream\n\nhttps://bit.ly/2xXsINa"}, {"Address": [-122.23, 37.732], "Artist": "Jeff Plankenhorn ", "ArtistImage": "https://photos.bandsintown.com/thumb/8520370.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Dave Scher, Yoggie Musgrove, Brannen Temple, Jeff Plankenhorn", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "AUSTIN GUITARIST JEFF PLANKENHORN SHIFTS FROM SIDE (AND SLIDE) WORK INTO THE SOLO SPOTLIGHT WITH ASSERTIVE SINGER-SONGWRITER SHOWCASE, SLEEPING DOGS, OUT MAY 4\n\nRoots-rocking follow-up to 2016’s acclaimed SoulSlide finds the Ohio-born, Texas-based artist expanding his musical playing field with help from friends Ray Wylie Hubbard, Patty Griffin, and co-producer “Scrappy” Jud Newcomb.\n\nAUSTIN, Texas — When Jeff Plankenhorn, arguably one of the busiest and most highly regarded guitar players on the Austin music scene, tells you that he “hardly ever takes sideman gigs anymore,\" take it with a grain of salt.\n\nYes, it’s true he’s made a concerted effort to carve out more time for his own solo career ever since issuing his breakout second studio set, 2016's SoulSlide — and he aims to find even more of that “me time” come the May 4, 2018 release of his new album, Sleeping Dogs on Spike Steel Records.But as far as scaling back on the whole sideman thing goes ... bear in mind that there’s a big difference between “hardly ever” and never. Namely, the former still leaves the guy just enough wiggle room to happily say “yes” when legends (and friends) on the level of Ray Wylie Hubbard or the Flatlanders need a can-do guitar man for a sold-out theater engagement. Or, say, when fellow A-list Austin sideman “Scrappy” Jud Newcomb — the MVP co-producer of Sleeping Dogs — finds out he can’t make it to a very special Johnny Nicholas gig in Hawaii, and asks “Plank” if he’d be up for subbing for him. Who in their right mind is going to say no to that?\n\nPlankenhorn still selectively takes those kinds of calls not because he gets them, but because he’s earned them. For the better part of the last 17 years, ever since he first moved to Texas with nothing to his name but a Geo Prism, $100, seven guitars and the generous hospitality of Ray and Judy Hubbard, the gifted multi-instrumentalist from Columbus, Ohio has busted ass to prove himself not just able and willing, but above all worthy of playing with the best of the best. And the reason so many song poets like Hubbard and Joe Ely like having Plank at their side is not just because of his prodigious chops on all things stringed (especially those played with a slide), but because of his intuitive knack for knowing when to hold back, always allowing the singer room to land a lyric and go for the proverbial kill. “That’s just part of the skill set I learned very early on: ‘When in doubt, layout,’” Plankenhorn explains with a chuckle. “That joke about knowing when not to play? It's true.”\n\nNot surprisingly, that particular skill — along with myriad other lessons in the finer points of songcraft that he’s picked up from sharing stages with the masters — has come to greatly inform Plankenhorn’s own music over the years. But it’s never been more apparent than it is on Sleeping Dogs. Make no mistake: Plank plays a lot of guitar on the album, along with pedal steel, piano, upright bass and seemingly anything else he could lay his hands on during the sessions at the Zone recording studio just outside of Austin. But in stark contrast to SoulSlide, which by his own admission was by design a showcase for his custom-designed lap slide guitar, a patented “Frankenstein” beauty he calls “the Plank,” Sleeping Dogs is first and foremost all about the songs.\n\n“The Plank guitar came from me wanting to mix together the two worlds of bluegrass dobro and the sacred steel tradition, and my whole last album was dedicated to that one instrument — to get it out there,” he says. “SoulSlide also really helped put me on the map as a solo artist, which is why I’ve moved on to focusing more on doing my own thing and only doing a side gig once in a while when I really want to, with people that I really respect. But now, with Sleeping Dogs, I wanted to take a bigger look at how the whole world of music is available to me; it’s not about just one guitar or sound, but rather about using all of the instruments I play and bringing all of my influences together — and about really wanting to bring my songwriting to the forefront.”\n\nTo that end, there are no covers on the new album, but half of the songs were born out of co-writing sessions with a handful of his longtime friends including his co-producer (and bandmate in Austin’s the Resentments) Newcomb, Gabriel Rhodes, Miles Zuniga, Jon Dee Graham, and of course Hubbard — the “Wylie Llama” of Americana/Texas music, who Plankenhorn still credits as his personal gateway to the whole scene. “Pretty much everyone I’ve ever played with is like, one degree of separation away from Ray,” he marvels with a laugh. It was also Hubbard who set Plankenhorn straight years ago when he doubted his own merits as a songwriter.\n\n“I had just started out playing some of my own songs at these little acoustic gigs, but I remember telling him, ‘Ray, I don't think I should be doing this — I’m just a side guy.’ And he said, ‘Where’s your proof? Are people coming to your shows? Are people listening to your songs? Yes? Well, there’s your proof.’”\n\nNaturally, the song Plankenhorn and Hubbard cooked up together, a satisfyingly greasy howler called “Tooth and Nail,” just happens to be all about the not-for-the-timid troubadour path and the discipline of songwriting, without so much as a grain of sugar to sweeten the pot. “We had already written a good portion of the song when he came back to me and said, ‘It’s like an old cat having kittens / You just crawl under the porch and do it,’ which is a very Ray line,” Plankenhorn says. “But what’s cool is there were other lines where his wife, Judy, was like, ‘Ray must have written that,’ and I was like, ‘Ha, no, that was me!’”\n\nAnd the Hubbard-certified gnarled blues of “Tooth and Nail” is just one of a handful of different styles Plankenhorn makes his own on Sleeping Dogs. Both the hurricane Harvey-inspired “Further to Fall” (co-written with Rhodes) and the closing “Heaven on Earth,” Plankenhorn’s awestruck tribute to his wife’s transcendent love of nature, hit the same deep, soulful notes that defined his last album (with that trusty Plank guitar put to especially righteous use on the latter song). But there’s also “This Guitar,” a disarmingly folky, listening-room-ready paean to the workhorse acoustic Martin that’s been his go-to writing guitar ever since it was anonymously gifted to him not long after he first moved to Texas. And perhaps most surprising of all (even to Plankenhorn himself), there’s even a few free-spirited ventures into buoyantly catchy, unabashedly poppy rock ’n’ roll.\n\n“I had already recorded a few rhythm tracks before this, but the day that Scrappy first came to the studio was also the day that Tom Petty died — and somehow, everything just kind of shifted that day,” he says. “Not on the entire album, but for a good portion of it, there were discussions of like, ‘What would Mike Campbell do on this guitar part?’ And out of that, some of the songs like ‘Sleeping Dogs’ and ‘I Don't Know Anything’ really changed and moved into more of a roots-rock thing. Which wasn’t something I was expecting — I mean, it came out of nowhere — but I loved it.”\n\nThat wouldn’t be the last happy surprise, either. The stately, hymn-like “Holy Lightning,” an arresting co-write with Newcomb and Zuniga (of Fastball fame), actually almost didn’t make the final cut. “I had started that one myself but just really wasn’t digging it, so I took it to Miles and Scrappy in the studio, and between the three of us we completely reworked it from scratch over a couple of hours,” he recalls. “But even then I still wasn’t entirely about it. But then Scrappy sent the demo to Patty Griffin, and she goes, ‘I want to sing on this!’ As soon as she said that, I was like, ‘Well, I’m definitely putting it on the album now!’”\n\nNeedless to say, “Holy Lightning” is now one of his favorite songs on the record. Not that there’s a single track that he’s not proud of on Sleeping Dogs, which is a testament both to the positive experience he had recording it and the confidence he feels going forward into the next stage of his career. And should he even find himself second-guessing his conviction on that solo sojourn, well, he’s already written his own anthem to sing his way through the doubt.\n\n“When I wrote ‘Sleeping Dogs,’ I got this image of sleeping dogs lying, and how I need to let shit go,” he explains. “I literally took a lot of things that I’m really bad at or think I’m really bad at, and told myself, ‘If I sing this for a year or two on tour, it may make me better at these things; maybe I won’t take stuff personally, won’t let things get me down.’ And I thought, ‘Maybe somebody else will hear this song and maybe it will help them, too.’ And I really like that idea: I like the idea of writing songs that have a little moral imperative to them.”\n\nSome would call that a sense of purpose. Or, as Hubbard put it best to Plankenhorn way back at the start of his journey, “There’s your proof.”", "otherInfo": "Join me from Vancouver Island every Monday night! I will be playing live here on Facebook starting at 7pm Central.\n\nAnd My Guitar Workshop on Tuesdays (This Event)\n\n\nTune in at https://www.facebook.com/jeffplankenhorn\n\nTips will be accepted at\nVenmo - @jeff-plankenhorn\nPaypal - Paypal.me/planksta"}, {"Address": [-122.23, 37.732], "Artist": "Phil Good ", "ArtistImage": "https://photos.bandsintown.com/thumb/10375603.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "No genre available", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "With his sparse synth grooves and passionate vocals, indie electronic artist Phil Good built an online following thanks to singles like 2017's \"Growing Up\" and 2018's \"Be Somebody.\"\n\nA self-taught producer and songwriter, Good relocated from his native Portland, Oregon to Los Angeles in 2016, releasing his debut single, \"Sleeping In,\" that same year. A trio of singles followed in 2017, including the dark-toned \"Growing Up,\" which became his most-streamed track to date. Good's profile increased a year later with releases like \"Better,\" \"Be Somebody,\" and \"Put It All on Me.\" - Timothy Monger", "otherInfo": "Live stream at https://live.bandsintown.com"}, {"Address": [-122.23, 37.732], "Artist": "Black Violin ", "ArtistImage": "https://photos.bandsintown.com/thumb/9311893.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "All, Hip Hop", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Black Violin is led by classically trained string players Wil B. (viola) and Kev Marcus (violin). Joining them onstage are DJ SPS & drummer Nat Stokes. The band uses their unique blend of classical & hip-hop music, often described as “classical boom,\" to overcome stereotypes & encourage people of all ages, races, & economic backgrounds to join together to break down cultural barriers.\n\nBlack Violin is currently touring the US and their next studio album Take the Stairs is set to be released on November 1, 2019. Their last record, Stereotypes, debuted at #1 on the Billboard Classical Crossover Chart and #4 on the Billboard R&B Chart. NPR praised the album & band, saying “their music will keep classical music alive for the next generation.” Some of their creative collaborations include Kanye West, Wu-Tang Clan, Wyclef Jean, Lil Wayne, & Alicia Keys.\n\nBlack Violin’s Impossible Tour spreads the message that anything is possible & there are no limits to what one can achieve, regardless of circumstance.", "otherInfo": "No other event info available"}, {"Address": [-122.23, 37.732], "Artist": "Trinity Anderson Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/10375022.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Gospel, Christian, Christian/gospel, Christian-gospel", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "No artist bio available", "otherInfo": "Darnel Butler talks all things WORSHIP with Trinity Anderson!"}, {"Address": [-122.23, 37.732], "Artist": "Dash Berlin ", "ArtistImage": "https://photos.bandsintown.com/thumb/10338215.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Music", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Top 25' Dash Berlin including the new singles 'Home' and 'Love Out Loud'! Tune in here: https://open.spotify.com/user/officialdashberlin/playlist/1OZfbhjd93DmOOyIUDwt8W", "otherInfo": "FACEBOOK: https://fb.me/DashBerlinOfficial1 - INSTAGRAM: https://www.instagram.com/dashberlin - TWITCH: https://www.twitch.tv/dashberlin - YOUTUBE https://www.youtube.com/dashberlin - MIXCLOUD https://www.mixcloud.com/live/dashberlin"}, {"Address": [-122.23, 37.732], "Artist": "Jenny Shawhan ", "ArtistImage": "https://photos.bandsintown.com/thumb/8401863.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Mooresville, Indiana", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Just listen to the music and you'll know.", "otherInfo": "Lunchtime Live\n12-12:45pm\n\nPromo show for Friday's concert!! YouTube contest!!"}, {"Address": [-122.23, 37.732], "Artist": "SKIES ", "ArtistImage": "https://photos.bandsintown.com/thumb/10321061.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Alternative Rock, Synth Pop, Indie . Alternative . Electrónica, Synth Rock, Indie", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Handpicking elements of pop, rock & emo in equal measure, meet SKIES.\n\nwww.skies.band\nwww.twitter.com/skiesbanduk\nwww.instagram.com/skiesbanduk\nwww.soundcloud.com/skiesbanduk\nwww.youtube.com/skiesbanduk", "otherInfo": "SKIES were due to perform a set at Bootleg Social, Blackpool on 12th May. Instead, SKIES will perform a set via live stream from Kent in honour of the venue. The stream is free to watch - but if you would like to buy a (reduced price) ticket to help support the band & venue please feel free to do so... Enjoy the show!\n\nTickets: www.musicglue.com/skies/tour"}, {"Address": [-122.23, 37.732], "Artist": "Deven Green ", "ArtistImage": "https://photos.bandsintown.com/thumb/9427502.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Jazz, Modern Band, Cover Band, Comedy, Comedy Rock, Acoustic", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "This human jukebox is known for her Welcome to My Home videos, portraying Betty Bowers, and being on Drag Race. Deven is a charming comedic-chanteuse who has headlined for the troops overseas to playing with the top drag queens in the world to performing at an all male-nudist colony and every venue in between. She plays her rendition of songs from the 1920s to today, mash-ups, re-imagining of songs and originals all on electric ukulele.\n\"You've never heard your favourite songs sung like this before. It's absolutely funny and charming. Plus, this girl can SING!\" -Las Vegas Beat", "otherInfo": "Deven Green is the award-winning comedic chanteuse known her viral videos and performances with the top drag queens in the world. Ned Douglas is an award-winning music programmer with clients such as No Doubt, Mick Jagger, Stevie Nicks and more.\nIndividually they are brilliant. Together they are magic.\n\nComplimentary Show.\nDevenGreen.com"}, {"Address": [-122.23, 37.732], "Artist": "Michael Feinstein ", "ArtistImage": "https://photos.bandsintown.com/thumb/6079473.jpeg", "Coordinates": [-122.23, 37.732], "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Theater", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Michael Feinstein, the multi-platinum-selling, five-time Grammy-nominated entertainer dubbed “The Ambassador of the Great American Songbook,” is considered one of the premier interpreters of American standards. His 200-plus shows a year have included performances at Carnegie Hall, Sydney Opera House and the Hollywood Bowl as well as the White House and Buckingham Palace.\nMore than simply a performer, Feinstein has received national recognition for his commitment to celebrating America’s popular song and preserving its legacy for the next generation. In 2007, he founded the Michael Feinstein Great American Songbook Initiative, dedicated to celebrating the art form and preserving it through educational programs, Master Classes, and the annual High School Vocal Academy and Competition, which awards scholarships and prizes to students across the country.\nFeinstein earned his fifth Grammy Award nomination in 2009 for The Sinatra Project, his Concord Records CD celebrating the music of “Ol’ Blue Eyes.” A new PBS concert special, The Sinatra Legacy, is currently airing across the country; The Sinatra Project, Volume II: The Good Life, its companion CD, was released on October 25.\nThe award winning PBS series, Michael Feinstein’s American Songbook – in which he uncovers treasures of classic American music – is now available on DVD, with an additional disc of bonus features.\nFeinstein serves as Artistic Director of the Center for the Performing Arts, a $170 million, three-theatre venue in Carmel, Indiana, which opened in January 2011. The Center is home to an annual international arts festival, diverse live programming, and the Michael Feinstein Great American Songbook Initiative Archive and Museum displaying rare memorabilia and manuscripts. Starting in 2010, he serves as the director of the Jazz and Popular Song Series at New York’s Jazz at Lincoln Center.\nHis Manhattan nightclub, Feinstein’s at Loews Regency, has presented the top talents of pop and jazz, including Rosemary Clooney, Glen Campbell, Barbara Cook, Diahann Carroll, Jane Krakowski, Lea Michele, Cyndi Lauper, Jason Mraz and Alan Cumming. Feinstein appears there for a sold-out holiday engagement every year.\nThrough his live performances, recordings, film and television appearances, and his songwriting (in collaboration with Alan and Marilyn Bergman, Lindy Robbins and Carole Bayer Sager), Feinstein is an all-star force in American music.", "otherInfo": "Live Stream: https://www.facebook.com/carnegiehall"}, {"Address": [-122.23, 37.732], "Artist": "Jessa Campbell & the Saplings ", "ArtistImage": "https://photos.bandsintown.com/thumb/9059060.jpeg", "Coordinates": "", "Date": "Tue May 12 2020", "EventDate": "2020-05-12", "Genre": "Kindie, Folk", "Time": "6:00 PM UTC", "Venue": "Live Stream", "moreBioInfo": "Jessa Campbell is an Oregon-based performer who bridges the worlds of music and ecology by enchanting young audiences with the wonders of nature through her songs! With a background performing with the national touring production of hit television show, \"Dragon Tales Live,\" she's no stranger to child entertainment! She’s also experienced as a world cruise ship performer, vocalist for Wayne Newton, and member of some of Portland’s prominent bands. Weaving theatrical elements with her song and dance numbers, she encourages kiddos to groove along. Caregivers can expect a blend of familiar children's songs mixed with original tunes written about what it's like to grow up in the Pacific Northwest! Jessa starting writing ecology-based songs with her students for a \"Wonders of Nature\" class for 5-8 year olds through the local learning center, Village Home. With songs like \"The Waltz of Trillium & Ant\", children are educated about simple science concepts like seed dispersal through the living creatures in their neck of the woods! As a mama herself, she values throwing the better party by encouraging kiddos to step into their wilder selves, glimpsing the magic in the world around them.", "otherInfo": "Jessa Campbell & the Saplings: LIVE STREAM SHOW 🌱\nMUSIC & ECOLOGY for KIDS- New ecology/science topic every episode!\n\n#JessaCampbellSaplings LIVE STREAM - #Music #Ecology #Educational - Simple Science concepts explored through music, movement and activities from Parent's Choice award winning performer!\n\nTUESDAY - THURSDAY 11:00AM ( Pacific Standard Time)\nVideo is posted to Youtube following the episode!\n******************************\n******************************"}]