var sf_events = [{"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "DJ Fresh ", "ArtistImage": "https://photos.bandsintown.com/thumb/8367191.jpeg", "Coordinates": [37.866356550000006, -122.26720543808051], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Bass,Drum,Electronic,,,", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Just the name – DJ Fresh – presents a lifelong challenge. How can a producer live up to that name some two decades after he was first bowled over by the newness and innovation of rave music? How, in short, does DJ Fresh stay fresh? Dan first became interested in 'Rave' music after older kids played him tapes from raves they had sneaked out of school to go to. Hearing tales of the early Acid house scene, Dan was captivated by the fledgling sound of Jungle Hardcore. Meeting one of Kingston’s 'Scandal FM' DJs at university he was offered a regular set, and word got around of his production skills. Introduced to Vegas by MC moose and later Dbridge and Maldini, Bad Company was born. Their first track 'The Nine' (later voted the biggest drum and bass track of all time) began an onslaught of game changing beats that captivated the young imaginations of acts like Pendulum, Chase and Status, Sigma, Futurebound, Bassline Smith, Camo and Krooked and the Brookes Brothers. All of whom would soon sign records to Dan's new label venture 'Breakbeat Kaos' with Adam F. Dan's quest to spread the sound he loved finally started to break down doors at MTV and Radio 1. His website 'Dogs on Acid' (the biggest music forum in the world in 2003) spread the word of drum and bass worldwide, as some of the first ever playlisted drum and bass tracks tore their way onto the airwaves via the Breakbeat Kaos imprint. Pendulum became a sell-out Wembley arena act releasing the double platinum 'Hold your Colour' with Dan's guidance and a&r savvy. And the scene was set for the forthcoming invasion of the British mainstream charts. After Pendulum left Breakbeat Kaos to chase the major label dream, Dan changed focus back to working on his own music. His first collaboration with Ministry of Sound 'Gold Dust' graced the top forty for 18 weeks, becoming the highest selling track of the year not to make the top 10. Lucozade wanted a ‘Gold Dust’ of their own and commissioned Dan to attempt another collab with Video Director Ben Newman resulting in the award winning campaign, and the UK and worlds first Dubstep no.1 record with 'Louder'. The follow up to this, The first ever drum and bass no.1 'Hot Right Now' launched Rita Ora and paved the way for a string of top ten hits as Dan began a transition from producer to producer/writer. The support of Radio 1's Zane Lowe and Annie Mac placed his tracks at the heart of the new eclecticism, and he began to expand his tempo range. Inspired by newcomers like Flux Pavilion, Jack Beats and Dillon Francis, he took on jump-up dubstep, electro, Dutch house and even moombahton rhythms, which provided the foundations for his top 3 hit ‘Dibby Dibby Sound', and Top 5 smashes 'Earthquake' with Diplo, and 'The Power' with Dizzy Rascal “Now I can begin with the song and the vocal instead of the beat,” he said, “and let it take the tempo that suits it... but always keeping the energy of drum'n'bass underlying it.” 2015 saw Dan add another hit to his already burgeoning back catalogue, working with MOBO and Brit award singing songstress Ella Eyre. ‘Gravity’ stormed into the official singles charts in February, peaking at number 4 and has gone on to sell over 400k records to date, plus has stacked up over 14 million views on the official video. Following this we saw the release of single ‘Believer’ with acclaimed DJ/producer Adam F, and subsequently ‘How Love Begins’, his second collaboration with legendary MC Dizzee Rascal. With over 3 million record sales, two number 1 singles and a further two top 6 singles to his name, he is infectiously optimistic about the next phase of his career, seeing the current climate as being “as open-minded as those very first days of rave, back in 1990 or whenever, when I started to get what it was really about”. Refusing as ever to fit anyone's expectations, and always driven by that idea of diverse minds uniting under a musical banner, he's not resting on his reputation but still pushing forward – still Fresh after all these years.", "otherInfo": "Murs + The Grouch + Eligh with DJ Fresh"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Eligh ", "ArtistImage": "https://photos.bandsintown.com/thumb/11488610.jpeg", "Coordinates": [37.866356550000006, -122.26720543808051], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Genre Bending,Hip Hop,,", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Eligh, a self-described “genre-breaking, obsessive bass fiend” has continued to sustain himself as a salient figure for over fifteen years within the increasingly fickle and rapidly revolving world of hip-hop. The Los Angeles native has maintained his respected status by fearlessly veering from a the traditional trajectory which is often limited to beats and rhymes. Instead, Eligh has chosen to fabricate projects that incorporate the gritty sounds of the UK dub scene, the unorthodox styling of indie rock, the lush guitars and honesty of folk music, and the complexity of jazz, all without losing the listener in a musically esoteric composition. 2018 will mark the release of Eligh's 10th official solo album. His last self produced album, Grey Crow, was a testament to his resilience against a drug addiction that nearly took his life 12 years ago. Grey Crow was the first official solo release from Eligh since 2003’s Poltergeist. Even with the seven-year gap between solo projects Eligh continued to contribute to a plethora of projects within that time frame which, most notably include, Living Legends albums, “Classic” and “The Gathering”; The Grouch & Eligh, “No More Greener Grasses” and “Say G&E!”; Eligh & Jo Wilkinson, “On Sacred Ground: Mother & Son”, and many more. Eligh’s musical interest was piqued as middle schooler, and along with some friends formed the now defunct, yet legendary Log Cabin crew. That same crew would ultimately end up producing many of Los Angeles’s prominent hip-hop figures, including future crewmates, Murs and Scarub. After a stint in the Bay Area, which lead to a serendipitous gathering of minds, ideas and styles that formed the now world famous Living Legends crew, Eligh returned home to Los Angeles. Since returning home, Eligh has tirelessly produced classic material, being the main contributor to what many would dub the trademark, “Living Legends sound”. Outside of being a studio musician and rapper, Eligh has relentlessly toured and has performed on stages across North America, Europe, Asia, and Australia and continues to deliver a captivating live show with his trademark rapid fire delivery, whether as a solo act or with his Legendary brethren. As a producer, Eligh has provided music for notable acts such as Living Legends, Murs, Rass Kass, El-P, wrestler John Cena, and continues to be a sought after producer by his peers. In 2016, \"Grand Tapestry\" was released. A group formed by Eligh, Alam Khan, and Salar Nader, Grand Tapestry is a unique mix of classical Indian music, and hip hop, in line with Eligh's \"Genre breaker\" moniker. That journey is just beginning, and he see's the groups potential as limitless. His goal to score film had always been apart of his story, and Eligh hopes to speak it into existence in the coming months.", "otherInfo": "Murs + The Grouch + Eligh with DJ Fresh"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "The Grouch & Eligh ", "ArtistImage": "https://photos.bandsintown.com/thumb/6374551.jpeg", "Coordinates": [37.866356550000006, -122.26720543808051], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Hip-hop,Hip Hop,,", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "\"Eligh\" & \"The Grouch\" are both members of the underground hip hop group Living Legends. They both grew up in Los Angeles, hence the strong \"westside\" influences.", "otherInfo": "The Grouch & Eligh"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "Murs ", "ArtistImage": "https://photos.bandsintown.com/thumb/8735155.jpeg", "Coordinates": [37.866356550000006, -122.26720543808051], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Rap,Hip Hop,,", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "Murs formed 3 Melancholy Gypsys with fellow Alexander Hamilton High School classmates Scarub and Eligh. The group became friends with Mystik Journeymen, and joined them in the Living Legends collective in 1996. His solo debut album, F'Real, was released on Veritech in 1997. Alongside Slug, Murs has been part of the group Felt since 2002. The End of the Beginning, his debut album on Definitive Jux, was released in 2003. Murs released Murs 3:16: The 9th Edition, an album entirely produced by 9th Wonder, in 2004. Taking a more thoughtful approach than gangster rappers, it prompted Andy Gill of The Independent to say \"eschewing bogus glamour for emotional realism, Murs manages to say more about the corrosive cancer of hip-hop's gun culture than all the thousands of column inches lavished on 50 Cent's bullet wounds\". After another collaborative album with 9th Wonder, Murray's Revenge, in 2006, Murs signed a contract with Warner Bros., his debut album for the label being Murs for President. It was preceded by Sweet Lord which was given away free to fans. Murs released Varsity Blues 2, a follow-up to his Varsity Blues EP, with production duties handled by Aesop Rock, Terrace Martin and Droop-E in 2011. He released This Generation, a collaborative album with Fashawn, in 2012. Murs was invited by Sacha Jenkins, a hip hop journalist, to join the group The White Mandingos, a collaboration between Jenkins and Bad Brains bassist Daryl Jenifer. They released their first album, The Ghetto is Tryna Kill Me, on June 11, 2013 under the Fat Beats record label. Murs has stated that the recording is a loose concept album about a man from the hood who struggles to maintain his identity while recording as a rock artist. The band members have acknowledged that the album is partially based on their own experiences. On February 7, 2014, it was announced via Tech N9ne's Facebook page that Murs was signed to his record label Strange Music. Later that year, Murs teamed up with fellow Strange Music members Mayday! to drop the !Mursday¡ album as his first release on the label. He then released Have a Nice Life on May 18, 2015, Captain California on March 10, 2017 and A Strange Journey into the Unimaginable on his birthday in 2018 all through Strange Music. In between projects, Murs partnered once again with 9th Wonder to create Brighter Daze, which released on December 31, 2015.", "otherInfo": "The Grouch & Eligh"}, {"Address": "2367 Shattuck Ave,, Berkeley, CA 94704", "Artist": "The Grouch ", "ArtistImage": "https://photos.bandsintown.com/thumb/6276641.jpeg", "Coordinates": [37.866356550000006, -122.26720543808051], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Hip-hop,Hip Hop,,", "Time": "8:30 PM", "Venue": "The Cornerstone", "moreBioInfo": "The Grouch always wanted to make beats since he first heard about this music called hip-hop. His dad played keys and he felt music was inside him as well, but he didn't plan on being an MC. Being from Oakland, he grew up on local heroes like Digital Underground, Too $hort, Toni, Tony, Tone, and many others. Around '91/'92 Del tha Funkee Homosapien and the Hieroglyphics crew were first starting to make noise in the bay and it was then that he felt he could really make something out of this music thing. He had a friend who rapped who convinced The Grouch to start writing/rapping in '94. He met the Mystik Journeymen soon after and they schooled him on the independent hustle. It was on. The Grouch's first show as an MC was in 1995, it was at one the Journeymen's \"Broke Ass Summer Jam\" shows in East Oakland. At that time he performed under his real name and the crowd showed him much love, which he says is the main reason he stuck with making music. The Grouch's music influences include all the hip-hop greats from LL Cool J to the Beastie Boys along with the Bay Area classics and jazz, rock, and soul music. The Grouch has always taken the independent route and has done everything himself along the way, a fact he takes great pride in.", "otherInfo": "Murs + The Grouch + Eligh with DJ Fresh"}, {"Address": "765 Laurel St, San Carlos, CA 94070", "Artist": "Nathan Temby ", "ArtistImage": "https://photos.bandsintown.com/thumb/8880352.jpeg", "Coordinates": [37.504345067680404, -122.2584649513785], "Date": "2021-07-08", "EventDate": "Jul. 8th, 2021", "Genre": "Singer Songwriter,Cabaret,Broadway,Cover Songs,,,,", "Time": "9:00 PM", "Venue": "Faith & Spirits", "moreBioInfo": "Nathan has released five full-length studio albums. Pocket Change (2006) features all-original music, Late Night Piano Bar (2008) shows off his Broadway chops, Last Call (2012) is a collection of eclectic cover songs, and Younger Days (2016) features demos and unreleased material. He is also scoring a musical called A Simple Man, book by James Martin, which saw a workshop reading off-broadway in 2009. On November 18, 2016, he released his first double live album, The Pocket Change Anniversary Concert. His newest album, What I Am, was released on December 14, 2018, and features Broadway cover songs. ? His theater credits include James and the Giant Peach and The Wizard Of Oz at Berkeley Playhouse and Joseph and the Amazing Technicolor Dreamcoat at Broadway By The Bay in Redwood City. ? He is currently producing a YouTube series called Cover Song Fridays. The show features a new surprise cover song the first Friday of each month on his YouTube channel, with extra videos and early premieres happening on his Patreon page. ?", "otherInfo": "No other event info available"}, {"Address": "19670 8th St E, Sonoma, CA 95476", "Artist": "JonEmery & The Unconventionals ", "ArtistImage": "https://photos.bandsintown.com/thumb/10259033.jpeg", "Coordinates": [38.285335826632064, -122.43638874487104], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Alt-country,Country,Cowpunk,Americana,,,,", "Time": "10:00 AM", "Venue": "JonEmery (solo)", "moreBioInfo": "JonEmery & the Unconventionals are a Sacramento, Ca. area Alt-Country group blending Country, Folk, Blues & CowPunk to create a traditionally unconventional style of Interstellar American Roots Music. ", "otherInfo": "No other event info available"}, {"Address": "19670 8th St E, Sonoma, CA 95476", "Artist": "JonEmery Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/6507367.jpeg", "Coordinates": [38.285335826632064, -122.43638874487104], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Americana,American Roots Music,,", "Time": "10:00 AM", "Venue": "Breakfast with JonEmery", "moreBioInfo": "JonEmery, the \"Hard Working & Heart Worn Troubadour\" is one of Northern California's premiere independent song writers and performers.  This national touring act, blends Country, Folk, Blues, Honky-Tonk & Rock into his own upbeat & tongue-in-cheek \"JonEmery Style\" of Roots Americana Music with stories of Highways, Heartaches and Hangovers!  The Story Born by redneck hippies, JonEmery has spent his whole life as a music enthusiast. His passion for the Americana Roots Movement of Johnny Cash, Ryan Adams, Fred Eaglesmith, The Mother Hips and countless others paved the way of his inspiration but, it wasn't until he heard Two Dollar Pistol's \"Step Right Up\" did he find his voice, style and direction. Honky-Tonk! In it's most raw form. From there, JonEmery adopted the wordsmith stylings of Hank Thompson & Jerry Reed and blended it with the classic 70's sound of George Jones & Johnny Paycheck. For a decade, he charged forward, not just as a solid entertainer with a toothy smile but, as a prolific and clever song writer. JonEmery would perform 3 hour shows of nothing but fun, engaging, original material to roaring and appreciative crowds from 1 to 1000; opening for, and performing along with, some of the biggest national and regional names in the Independent Country Music Scene. Now, JonEmery has struck out on his own, re-branding and revisiting his Americana roots. He has found a new voice, created his own - up beat & tongue-in-cheek- \"JonEmery Style\" in the direction and tradition of Country/Folk&Blues, without abandoning his Honky-Tonk foundation. JonEmery is, without a shadow of a doubt, a maverick in the Independent Music Industry of epic proportions. The History JonEmery began his career in Sonoma County with the CowPunk Band \"JonEmery & The Heartbroken\" but after a near fatal gall stone surgery, he found himself back in Sacramento, Ca. The place he spent his high school years and young adult life. Hopped up on pain meds and broke, JonEmery found opportunity in the form of ex-Ghost Of Wyoming members J-Lee Lewis, Russell Ryan and Harley Lee Walker. Dry County Drinkers were born and taking the Sacramento Valley, Sonoma County and Seattle by storm. In its 5 year inception, \"The Drinkers\" found themselves opening up for Country Music Legends David Allan Coe, Reckless Kelly, Whitey Morgan and Chuck Mead and teaming up with Regional Icons Red Meat, The Pine Box Boys, Miss Lonely Hearts and The Ganges River Band . Earned respect from Outlaw Uprisers Outlaw Bob Wayne, Hellbound Glory and Joe Buck Yourself. They even found themselves on some unsuspecting and surprising bills with The Supersuckers, Moonshine Bandits,Josh Gracin and Alien Ant Farm. Dry County Drinkers had quite a revolving door of musicians and a few DEMO CDs after the original members, one by one, went back to their more respectable and responsible lives. The \"If You Aint Drunk...\" EP found some moderate success with the single \"If You Ain't Drunk (You're With The Terrorists) supported and played by Mojo Nixon on Sirius Outlaw Country. One Drink, One Smoke, One Song - The self produced sophomore effort with more heart than heat, spawned internet radio single\"Jukebox & A Drink\" and crowd-pleaser \"Britney Spears & Beers\". You Gotta Lotta Nerve found the original Drinker line-up in the studio with 8 tracks written by J-Lee that features \"Don't Call Me Up When You're Drunk\", \"Francine\" and \"Take My Wife (please)\" and the final release, From Wine To The Whiskey which is a collection of songs from the fore mentioned releases that also includes 5 tracks from the shelved \"Leavin' Whiskey In The Bottle\" CD \"Baby, I Aint Your Ticket\", \"From Wine To The Whiskey\", \"Bar Fight\", \"Leavin Whiskey In The Bottle\" and \"Shit Kickin Blues\". In the end, JonEmery was the \"Last Drinker Standing\" as he struck out performing more solo shows with the likes of Billy Don Burns and Duane Mark which led to the Dry County Drinker brand to its end. May 1st 1015 marked Dry County Drinkers 5 Year Anniversary and \"Drinker Nation\" came to a close with all 4 original members reuniting for one final show together in Sacramento, Ca. at The Hideaway with special guests and great friends The Ganges River Band and Duane Mark. JonEmery has since been touring the NorthWest scratching and scraping every penny to release \"Americana\"with up and coming country band Way Out West and Joe Carlson from The California Stars. \"Americana\" has a target release date of February 2016 with Mid-West, North West and East Coast tour legs to follow as well as homecoming full band shows. The deck is stacked and the cards are on the table for JonEmery but his perseverance, determination and unsettled will to succeed will surely see him through. Resume' Performance Resume' National Acts: David Allan Coe, Mark Chesnutt, Whitey Morgan & The 78's, Reckless Kelly, Billy Don Burns, The Supersuckers, Chuck Mead & His Grassy Knoll Boys, Moonshine Bandits, The Lacs, Josh Gracin, Brian Blush (The Refreshments), Frank Hannon, Wolf Hamlin & The Front Porch Drifters. Independent Acts: Hellbound Glory, Jonny Two Bags, Outlaw Bob Wayne, Cory Branan, Joe Buck Yourself, Hooten Hollers, Barnyard Stompers, The Urban Pioneers, Husky Burnette, Heathen Apostles, Doug C & The Blacklisted, The Punknecks, Duane Mark, James Hunnicutt, Hangdog Hearts, JB Beverly, McDougall, Sissy Brown, Crosby Tyler, Daphne Lee Martin, Francis Lombardi. Regional Acts: Red Meat, Pine Box Boys, Miss Lonely Hearts, Frankie Boots & The County Line, The Ganges River Band, Merle Jagger, The Crux, Timothy O'Neil Band, Buck Ford, Kay Marie, Laura Benitez & The Heartache, Misisipi Mike Wolf, Billy Cook. Local Acts: Nickel Slots, Infamous Swanks, Vintage Vandals, Way Out West, Col. Jimmy & The Blackfish, Colonels Of Truth, Them Slack Jawed SOBs, The Vivants, Country Trash, West Nile Ramblers, One-Eyed Reilly, Million Dollar Giveaway, Tell River, Kenny Rego & The Law of One Band, Billy Hood, Cash Prophets, Rancho Deluxe, Matt Gage Band.", "otherInfo": "JonEmery (solo) will be performing a Friday Breakfast show at Epicurean Connection"}, {"Address": "425 Mission St, San Francisco, CA 94105", "Artist": "Ren Geisick, Vocalist ", "ArtistImage": "https://photos.bandsintown.com/thumb/11473006.jpeg", "Coordinates": [37.78911945, -122.39686267625001], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Americana,", "Time": "12:00 PM", "Venue": "Salesforce Park", "moreBioInfo": "Bay Area-based vocalist Ren Geisick sings with radiant energy and a passion for storytelling. Deeply influenced by Americana and jazz, her music borrows elements of both while remaining distinctly personal. With the release of her latest album, Ren, Love Song, she continues to seamlessly traverse the boundaries of genre while intimately delivering a story to each listener.", "otherInfo": "A duo show at a cool public park that you might not know is public, Saleforce Park! It's a really cool spot and I'm looking forward to playing some original music for the..."}, {"Address": "Santa Rosa, CA", "Artist": "Idiomz ", "ArtistImage": "https://photos.bandsintown.com/thumb/11016010.jpeg", "Coordinates": [38.4404925, -122.7141049], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Hip Hop,Rap,Christian Hop,,,", "Time": "5:00 PM", "Venue": "Together, Together presented by The Extreme Tour", "moreBioInfo": "With the skill of a storyteller, an ear to the street, and the wisdom of life, Idiomz invites you to listen and learn. You found the needle in a haystack...and that needle is riding in the groove. It’s music, it’s a painting, it’s the construction of life. Join the Renaissance, experience Idiomz!", "otherInfo": "No other event info available"}, {"Address": "100 Yacht Club Dr, San Rafael, CA 94901", "Artist": "T Sisters ", "ArtistImage": "https://photos.bandsintown.com/thumb/11480049.jpeg", "Coordinates": [37.967009, -122.517042], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Pop,Indie Folk,Americana,,,", "Time": "5:00 PM", "Venue": "Full Moonalice at Terrapin Crossroads", "moreBioInfo": "Distinguished by close harmonies, catchy melodies and potent lyricism, the T Sisters have created a refreshing brew of indie-folk/Americana music. Blood sisters Erika, Rachel and Chloe Tietjen flow seamlessly between styles and moods, from roots to pop and sassy to sincere, captivating listeners with their eclectic sound and soaring harmonies.", "otherInfo": "Full Moonalice will play its first concert in 18 months on Friday, July 9, at Terrapin Crossroads in San Rafael. This will be an outside concert at the Beach Park. Late ..."}, {"Address": "2 W Richmond Ave, Richmond, CA 94801", "Artist": "Chris James and the Showdowns ", "ArtistImage": "https://photos.bandsintown.com/thumb/8652905.jpeg", "Coordinates": [37.9254661, -122.3849305], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Folk Rock,Acoustic,,", "Time": "5:00 PM", "Venue": "Up & Under Pub and Grill", "moreBioInfo": "After hearing Chris James at one of his tireless performances, you’re immediately – and intensely – drawn into his music, taken on a journey with his heartfelt songs. His warm vocals and authentic writing style combined with a bold grit give Chris James and the Showdowns that classic-infused deep-rooted Americana rock sound. Beginning as a local performer in Portland, Maine, James knew that he had to get his name heard in bigger cities. He left for San Francisco with nothing more than a guitar in hand to find work. Eventually, he joined forces with The Showdowns, a Bay Area-based group comprised of Matt Berg (drums), AJ Leighton (bass), John Paterson (keys), and Whitt Vicena (lead guitar). The unity amongst the band can be felt at every show through their synergized performances. Songs from their debut album, Lucky Breaks, and music from James’ solo work have been played generously on SiriusXM Radio, radio stations throughout California, and placed in TV commercial promos. Chris James and the Showdowns’ second album, Somewhere out in California, is authentic, dance-driven, heartfelt, and has been getting loads of attention from various media outlets. They have a packed tour schedule for the rest of the year, including full band and solo performances. Driving down the open road can get us lost in our thoughts when surrounded by the right views and accompanied by the right music. The title track off the album, “Somewhere out in California” begins with an acoustic guitar solo then joined by elegant piano keys. The intimate video is characterized by the natural beauty of California: the views, the ocean, and the forests. “Somewhere out in California” is the narration of a restless heart, reminiscing on all the possible “what ifs” of life. Every day we are forced to make hundreds of choices, big and small. After making a decision we sometimes have afterthoughts, imagining how life would be if different decisions were made and if different things were said. The lyric, “Did you ever feel like we missed the bus” is the metaphorical concern of making the wrong choices in the past and missing prime opportunities or possible new adventures. It is essential to remind ourselves to take risks: if not, we will regret all the possibilities that could’ve been. --\"James' style of writing is hard to deny as it rings of times and life situations we can all relate to. It's nice to see an artist and band like the Showdowns hold true to Americana roots while still giving you a rock and roll kick in the ass!\" -Starita (Producer - Trevor Hall, Tribe Called Quest) --\"Chris is a singer-songwriter with an honest approach and style that really speaks to everyday people...\" - J. Bowman (Lead Guitarist - Michael Franti & Spearhead)", "otherInfo": "FREE - 21+"}, {"Address": "5475 Old Redwood Hwy, Penngrove, CA 94951", "Artist": "Ellie James Music ", "ArtistImage": "https://photos.bandsintown.com/thumb/9109700.jpeg", "Coordinates": [37.9254661, -122.3849305], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Dream Pop,Indie Rock,Indie Folk,Indie Pop,,,,", "Time": "5:30 PM", "Venue": "Twin Oaks Roadhouse", "moreBioInfo": "Stylistically unique and captivating, Ellie James mixes the darker, dreamier side of her California roots with the edge and dynamics of her Boston background. Ellie's music is gritty, emotional, and raw, playing with vintage instruments and modern recording techniques. Ellie grew up in the heart of Sonoma Country wine country, infused with everything from roots and bluegrass to rock and roll. Currently based out of the Bay Area, she has recorded in studios in Boston and Los Angeles, and has performed at various venues across the country. The Afterparty EP coming August 2019.", "otherInfo": "No other event info available"}, {"Address": "1929 Menalto Ave, Menlo Park, CA 94025", "Artist": "The Baylands ", "ArtistImage": "https://photos.bandsintown.com/thumb/11367222.jpeg", "Coordinates": [37.4592332, -122.1527285], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Pop,Indie,Folk,,,", "Time": "5:30 PM", "Venue": "The Baylands @ CAFE ZOE", "moreBioInfo": "We started as roommates. Then we became friends. Living near the Baylands Nature Preserve in Palo Alto, California, we bonded over our love of music, our appreciation for California’s beauty, and our desire to indulge and capture the preciousness of youth. We strive to create music that is harmony driven, timeless, and true to the stories we’ve experienced. While each of us sites different musical influences ranging from Charli XCX to Ben Howard, we’ve settled on our genre: folk-indie-pop-singersongwriter-farmer’s-market-chiq.", "otherInfo": "This past year we played music six feet apart from each other in a backyard surrounded by redwood trees and flowers. While it was a challenging year, we were constantly i..."}, {"Address": "1160 Old County Rd, Belmont, CA 94002", "Artist": "Groovy Judy ", "ArtistImage": "https://photos.bandsintown.com/thumb/11456942.jpeg", "Coordinates": [37.5199878408232, -122.27420602413552], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Funk,Rock,Pop,Rnb-soul,R&b/soul,,,,,", "Time": "5:30 PM", "Venue": "Marvin Gardens", "moreBioInfo": "Groovy Judy puts a new face on the late 60’s, early 70’s sound that made the Bay Area what it is. From the songwriting influences of Sly and The Family Stone, Jimi Hendrix, to touches of the melodic Beatles sound, San Francisco’s own brings forth her dominating style with the energy of some of today’s most known artists. Groovy Judy focuses on making people smile and raising vibrations by delivering her own blend of funk/rock. Her stellar guitar playing, original lyrics, colorful dress, and upbeat personality, speak to all ages. Her second CD “Life,” is about commonplace life experiences such as love, relationships and being happy. The title track, \"Be Who You've Got to Be,\" sparks an inspirational vibe of being true to yourself, \"Your Life\" encourages enjoying life to the fullest, and \"Get Along\" is Judy's peace anthem about living together harmony. It also contains Judy’s signature psychedelic rock song, “Jimi’s Sister,” her tongue-in-cheek tribute to her guitar mentor, Jimi Hendrix, as well as the haunting instrumental, “Sunrise,” inspired by Carlos Santana. Born and raised in the San Francisco Bay Area, Groovy Judy picked up is committed to giving back. She teaches guitar to up and coming musicians and donates performances to non-profit organizations, such as Amnesty International, The Leukemia Society, Bread and Roses, Guitars Not Guns and The American Red Cross. A featured artist at She Rocks San Francisco Music Festival 2005, a finalist at the Emergenza Music Festival 2006, and a featured artist at the 2007 40th Anniversary of the Summer of Love Festival in Monterey, Groovy Judy is an artist who loves inspiring people to be the best they can be, love one another and spread peace and love through the universal language of music. She prefers to look on the lighter side of life and put out positive vibrations that make people smile, laugh, feel happy and enjoy life.", "otherInfo": "Groovesters!\nJoin us at a local hotspot \"Marvin Gardens Restaurant\" for cool grooves and family fun!\n\nFriday, July 9\nThe Groovy Judy Band Shakes!\nMarvin Gardens Restaura..."}, {"Address": "691 Broadway, Sonoma, CA 95476", "Artist": "Clay Bell Live ", "ArtistImage": "https://photos.bandsintown.com/thumb/11435124.jpeg", "Coordinates": [38.2886536, -122.45880889724677], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "", "Time": "6:00 PM", "Venue": "HopMonk Sonoma, Clay Bell", "moreBioInfo": "Keeping live music alive", "otherInfo": "Free show, reservations required."}, {"Address": "Veterens Memorial Park, Napa, CA", "Artist": "Joy and Madness ", "ArtistImage": "https://photos.bandsintown.com/thumb/11450941.jpeg", "Coordinates": [38.2886536, -122.45880889724677], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Funk And Soul,", "Time": "6:30 PM", "Venue": "Joy & Madness - Napa City Nights Summer Concerts 2021", "moreBioInfo": "An eight piece soul and funk explosion out of Sacramento that could be described as Jamiroquai meets Fits and the Tantrums, Joy & Madness has been rocking stages all over the West Coast since inception. Joy & Madness brings a modern classic pop sensibility to a new age of joyous funk and soul reaching audiences in a way that few live performers can. As true believers in music as a shared experience that can simultaneously allow escape and connection, Joy and Madness brings a live performance which leaves everybody inspired, sweaty, and full of joy. Joy & Madness began with 5 core members who met in a previous Sacramento project with roots in funk and soul music. With the addition of three more members, the band began experimenting with the beginnings of what would become the Joy & Madness sound; a raucous mix of raw stonesy energy, pulsing groove, and juicy horn lines coloring tightly crafted songs. Since then, they’ve shared the stage with performers as prolific as Tower of Power, Trombone Shorty, and Collective Soul. Front man and vocalist Hans Eberbach brings so much freewheeling energy to the stage, he has literally broken right through the floorboards. His raw, open connection with the audience breaks down barriers and pulls everyone together into the excitement of the experience. The band’s EP, Little Bright World was released to broad critical acclaim in 2015, winning an Independent Music Award among many others and receiving play-time on terrestrial and internet radio stations around the world. Joy & Madness’ new release will take audiences deeper into the musical journey of one of Northern California’s most exciting bands.", "otherInfo": "In the heart of downtown Napa is the renovated Veterans Memorial Park Amphitheater. Construction was completed in May 2008 as part of the Napa River Walk & flood control ..."}, {"Address": "628 Divisadero St, San Francisco, CA 94117", "Artist": "Con Brio ", "ArtistImage": "https://photos.bandsintown.com/thumb/11427948.jpeg", "Coordinates": [37.7755281, -122.43764100406057], "Date": "2021-07-09", "EventDate": "Jul. 9th, 2021", "Genre": "Rock & Funk,Soul,R & B,Soul & Funk.,Rock & Soul,Funk,,,,,,", "Time": "7:00 PM", "Venue": "The Independent", "moreBioInfo": "Con Brio, the San Francisco funk-soul septet known for their acrobatic, adrenaline-fueled live shows in clubs and festivals all over the world, have never been afraid of a little genre-bending. It’s with that spirit that they debut “Heart Shaped Box,” the first new music from the band since 2017, and the first single off their upcoming full-length, Explorer. The song began as a fun cover the band put together on a whim, on a rare day off on tour, according to bassist Jonathan Kirchner. But the track soon took on a life of its own “It’s hard to find time to write on the road, and we were fighting a bit of a lull creatively,” says Kirchner. “I figured arranging a cover would be a fun exercise and a nice reminder that, yes, we are good at this — we just needed to get out of our own way.” Choosing a Nirvana song was a no-brainer, says singer Ziek McCarter. The band had been experimenting with grunge for while, incorporating Soundgarden’s “Black Hole Sun” into their live shows, and loved the feeling of working with something out of their usual soul-funk-R&B wheelhouse. “We were reflecting on how many musicians we’d lost from that era, this scene that inspired so many of us,” says McCarter. “And we wanted to honor them.” As a playful yet potent tribute to Kurt Cobain, the song builds on a sexy, spacious bass and electric guitar rhythm, building to a blast of horns and a smart, slinky synth line, all topped by McCarter’s powerful falsetto. It only took a couple hours to arrange, but within weeks “Heart Shaped Box” had become one of the most exciting, crowd-pleasing moments in the band’s live show. Plus, it worked: “It really did kickstart things,” says Kirchner. “Within a month we had two more new songs, and we were on our way to a full-length.” Explorer, out July 6th, is Con Brio’s hotly anticipated sophomore LP, a follow-up to their critically acclaimed 2016 debut Paradise. Showcasing a newly layered, contemporary production style, the record represents an impressive leap for the group PopMatters calls “the best new live band in America.” Con Brio will tour the U.S. and Europe in support of Explorer throughout the remainder of 2018", "otherInfo": "No other event info available"}]